[
  {
    "text": "China Announces Probe Into Vice Military Chair Zhang Youxia - Bloomberg",
    "fullText": "China opened a probe into the country’s No. 1 general and Politburo member, Zhang Youxia, deepening an unprecedented purge of top military leaders.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-24/china-announces-probe-into-vice-military-chair-zhang-youxia"
  },
  {
    "text": "China no longer Pentagon's top security priority - BBC",
    "fullText": "The US will also offer “more limited” support to US allies, according to a new national defence strategy document.",
    "link": "https://www.bbc.com/news/articles/cj9r8ezym3ro"
  },
  {
    "text": "Danish troops who fought alongside US forces feel betrayed, as Trump threatens Greenland and denigrates NATO - CNN",
    "fullText": "“It’s very disrespectful.”",
    "link": "https://www.cnn.com/2026/01/24/europe/greenland-denmark-veterans-trump-disrespect-intl"
  },
  {
    "text": "Thousands march in Minnesota and hundreds of businesses close to protest ICE - The Washington Post",
    "fullText": "Some Minnesotans boycotted work, school and shopping Friday to signal their opposition to the Trump administration’s deployment of ICE agents.",
    "link": "https://www.washingtonpost.com/nation/2026/01/23/minnesota-general-strike-ice-protest/"
  },
  {
    "text": "Scoop: Mills flew to California fundraisers while ICE raided Maine - Axios",
    "fullText": "Mill's precise whereabouts from Tuesday to Thursday of this week were a source of speculation.",
    "link": "https://www.axios.com/2026/01/23/janet-mills-california-fundraisers-ice-maine"
  },
  {
    "text": "Adult with measles visited high school in Clark County while contagious, officials say - kptv.com",
    "fullText": "Clark County Public Health says an adult with a confirmed case of measles was at a local high school while they were contagious.",
    "link": "https://www.kptv.com/2026/01/24/adult-with-measles-visited-high-school-clark-county-while-contagious-county-officials-say/"
  },
  {
    "text": "Monster storm about to hit millions with catastrophic ice and heavy snow - CNN",
    "fullText": "One of the most extreme storms in years is about to bring travel and much of the country to a standstill.",
    "link": "https://www.cnn.com/weather/live-news/winter-storm-snow-ice-01-23-26-climate"
  },
  {
    "text": "State of Emergency Declared - DEMA Emergency Operations Center Activated For Winter Storm Response - news.delaware.gov",
    "fullText": "Governor Matthew Meyer has signed a State of Emergency at 5:00 p.m. today in anticipation of Winter Storm Fern. The State of Emergency will take effect at 12:01 a.m. on Sunday, January 25, 2026, and will allow for the mobilization of statewide resources neede…",
    "link": "https://news.delaware.gov/2026/01/23/soe-eoc-activated-winter-storm/"
  },
  {
    "text": "U.K., including Prince Harry, voices outrage at Trump’s Afghanistan remarks - The Washington Post",
    "fullText": "President Donald Trump’s inaccurate belittling of the British role in Afghanistan recalled previous occasions when he has insulted injured or fallen soldiers.",
    "link": "https://www.washingtonpost.com/world/2026/01/23/trump-britain-afghanistan-harry-insult/"
  },
  {
    "text": "Browns complete 2nd head coach interview with Jaguars offensive coordinator Grant Udinski - Cleveland Browns",
    "fullText": "Udinski first interviewed on Jan. 17",
    "link": "https://www.clevelandbrowns.com/news/browns-complete-2nd-head-coach-interview-with-jaguars-offensive-coordinator-grant-udinski"
  },
  {
    "text": "Chris Pine Tells Future ‘Star Trek’ Bosses to ‘Have Fun’ and ‘Good Luck’ With the Franchise: ‘Live Long and Prosper’ - Variety",
    "fullText": "Chris Pine was asked about Paramount's new leadership and what's in store for 'Star Trek' at a Variety Studio presented by Audible Sundance interview.",
    "link": "https://variety.com/2026/film/news/chris-pine-paramount-bosses-star-trek-1236639421/"
  },
  {
    "text": "Chagos Islands debate delayed as Tories call for halt to bill - BBC",
    "fullText": "The legislation was due to be debated in Lords on Monday.",
    "link": "https://www.bbc.com/news/articles/cp372wz0z2zo"
  },
  {
    "text": "Is China quietly winning the AI race? - BBC",
    "fullText": "The BBC's Lily Jamali looks into why big US firms and start-ups alike are turning to Chinese tech.",
    "link": "https://www.bbc.com/news/articles/c86v52gv726o"
  },
  {
    "text": "D4vd's Friend Neo Arrested for Failure to Appear as Witness - TMZ",
    "fullText": "3:02 PM PT -- A local journalist posted photographs online at the scene of Neo's arrest in Helena, Montana from Thursday. Helena Independent Record City Editor Thom Bridge posted the 3 snaps Friday afternoon.",
    "link": "https://www.tmz.com/2026/01/23/d4vd-friend-neo-langston-arrested/"
  },
  {
    "text": "How the Seahawks Learned Their Lesson and Re-Built a Super Bowl Contender - Sports Illustrated",
    "fullText": "The steps Seattle took to reach the NFC Championship. Plus, how the Rams, Patriots and Broncos put together their final four rosters.",
    "link": "https://www.si.com/nfl/playoffs/seahawks-rams-patriots-broncos-roster-construction"
  },
  {
    "text": "Vance addresses criticism that Trump admin has not done enough to move anti-abortion rights agenda forward - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/vance-addresses-criticism-trump-admin-move-anti-abortion/story?id\\\\u003d129497076"
  },
  {
    "text": "Charli xcx Says Original ‘Brat’ Movie Pitch Was Too Label-Focused and Calls Ariana Grande’s Oscar Snub a ‘Surprise’: ‘She Is Amazing and Goes Full Force’ - Variety",
    "fullText": "Charli xcx appeared at the Variety Studio presented by Audible at Sundance and was surprised to learn Ariana Grande was snubbed at the Oscars.",
    "link": "https://variety.com/2026/film/news/charli-xcx-the-moment-ariana-grande-oscar-snub-1236639296/"
  },
  {
    "text": "Health officials say no evidence of mystery brain illness in New Brunswick - BBC",
    "fullText": "The results of the investigation add to a growing body of research that suggests patients may have diagnosable illnesses.",
    "link": "https://www.bbc.com/news/articles/cy4qwyp3gpno"
  },
  {
    "text": "CISA confirms active exploitation of four enterprise software bugs - BleepingComputer",
    "fullText": "The Cybersecurity and Infrastructure Security Agency (CISA) in the U.S. warned of active exploitation of four vulnerabilities impacting enterprise software from Versa and Zimbra, the Vite frontend tooling framework, and the Prettier code formatter.",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-confirms-active-exploitation-of-four-enterprise-software-bugs/"
  }
]