[
  {
    "text": "2026 NBA All-Star Saturday live updates: Slam Dunk Contest results, highlights - CBS Sports",
    "fullText": "Johnson, who has played in just 37 career NBA games, won the 2026 NBA Dunk Contest",
    "link": "https://www.cbssports.com/nba/news/2026-nba-all-star-live-updates-results-dunk-contest-3-point-winner/live/"
  },
  {
    "text": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted - NPR",
    "fullText": "Unlike in Europe, officials in the U.S. with ties to Epstein have largely held their positions of power.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5714609/epstein-europe-fallout"
  },
  {
    "text": "Tempers flare, six players ejected in St. John's-Providence clash - ESPN",
    "fullText": "Six players were ejected from Saturday's Big East clash between No. 17 St. John's and Providence after a hard foul by Friars forward Duncan Powell on Red Storm star Bryce Hopkins.",
    "link": "https://www.espn.com/mens-college-basketball/story/_/id/47930376/tempers-flare-six-players-ejected-st-johns-providence-clash"
  },
  {
    "text": "FCC reportedly looked into Bad Bunny’s halftime show following Republican outrage and found... nothing - Awful Announcing",
    "fullText": "The Federal Communications Commission reportedly investigated Bad Bunny's lyrics during the Super Bowl and found no issues.",
    "link": "https://awfulannouncing.com/pop-culture/fcc-bad-bunny-halftime-show-republican-outrage-no-violations.html"
  },
  {
    "text": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts - Space",
    "fullText": "Saturday, Feb. 14, 2026: Updates on SpaceX and NASA's Crew-12 astronaut mission to the International Space Station.",
    "link": "https://www.space.com/news/live/spacex-nasa-crew-12-astronauts-launch-to-iss-feb-14-2026"
  },
  {
    "text": "Far right renews demand for Epstein answers after Bondi hearing - Axios",
    "fullText": "Influential right-wing figures say the Justice Department mishandled the case.",
    "link": "https://www.axios.com/2026/02/13/epstein-files-fracture-trump-coalition-bondi"
  },
  {
    "text": "Earth on Track to Become Uninhabitable, Scientists Say - Futurism",
    "fullText": "The planet is close to entering a death-spiral that could bring about a worst-case-scenario known as \"hothouse Earth.\"",
    "link": "http://futurism.com/science-energy/earth-uninhabitable-climate-change"
  },
  {
    "text": "Heavy rain will soon hit parts of California and Oregon. Here’s when and where. - The Washington Post",
    "fullText": "By Monday, widespread rain will blanket California. Here’s a look at where and when stormy conditions will reach the region.",
    "link": "https://www.washingtonpost.com/weather/2026/02/14/heavy-rain-california-oregon-forecast-storms/"
  },
  {
    "text": "Marie-Philip Poulin returns; Canada into Olympic semifinals - ESPN",
    "fullText": "Captain Marie-Philip Poulin returned from injury to score a goal in Canada's 5-1 quarterfinal win over Germany.",
    "link": "https://www.espn.com/olympics/hockey/story/_/id/47929289/marie-philip-poulin-returns-canada-olympic-semifinals"
  },
  {
    "text": "‘Rosebush Pruning’ Review: Karim Aïnouz’s Black Comedy Is A Bad-Taste Riot - Deadline",
    "fullText": "‘Rosebush Pruning’ review: Karim Aïnouz’s sexually perverse black comedy is a bad-taste riot – Berlin Film Festival",
    "link": "http://deadline.com/2026/02/rosebush-pruning-review-karim-ainouz-callum-turner-elle-fanning-1236724821/"
  },
  {
    "text": "Officials investigate second measles case in Dane Co. - Channel 3000",
    "fullText": "MADISON, Wis. — Health officials on Saturday confirmed they are investigating the second measles case in Dane County and the fourth in Wisconsin after an out-of-state traveler stayed at a",
    "link": "https://www.channel3000.com/news/officials-investigate-second-measles-case-in-dane-co/article_23ff9b73-143f-4d5d-bdf0-6c3c97dff3e8.html"
  },
  {
    "text": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’ - Variety",
    "fullText": "\"Harry Potter\" star Rupert Grint was asked to speak on the rise of fascism at Berlin Film Festival, saying: \"Obviously, I'm against it.\"",
    "link": "https://variety.com/2026/film/festivals/rupert-grint-rise-of-fascism-obviously-against-it-1236663266/"
  },
  {
    "text": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO - BBC",
    "fullText": "Giving some newborns in Guinea-Bissau an established hepatitis B treatment but not others is \"unethical\", it says.",
    "link": "https://www.bbc.com/news/articles/c78j5k2gk02o"
  },
  {
    "text": "2026 NFL Mock Draft 2.0: Jets pass on QB - New York Post",
    "fullText": "The Jets and Giants land stars from the same school in Steve Serby’s Mock 2.0.",
    "link": "https://nypost.com/2026/02/14/sports/2026-nfl-mock-draft-2-0-jets-pass-on-qb/"
  },
  {
    "text": "TSA agents are working without pay at US airports due to another shutdown - AP News",
    "fullText": "A shutdown of the Department of Homeland Security has gone into effect. That includes the Transportation Security Administration, whose officers are responsible for screening passengers and bags at airports. Experts say mass flight cancellations like those se…",
    "link": "https://apnews.com/article/dhs-shutdown-tsa-travel-airports-delays-ff8b225c6ff8d57172fd301a550057b3"
  },
  {
    "text": "The Goldilocks economy, if you don't look too close - Axios",
    "fullText": "The economy and the markets look stable, on the surface at least.",
    "link": "https://www.axios.com/2026/02/14/cpi-report-inflation-ai-jobs-market"
  },
  {
    "text": "5 ways heartbreak affects the body - CNN",
    "fullText": "Heartbreak isn’t just an emotional experience. It can physically hurt. Discover five ways love affects your body and what an expert says can help.",
    "link": "https://www.cnn.com/2026/02/14/health/love-heartbreak-effect-body-wellness"
  },
  {
    "text": "Meta Adding Facial Recognition to Its Smart Glasses That Identifies People in Real Time, Hoping the Public Is Too Distracted by Political Turmoil to Care - Futurism",
    "fullText": "Emboldened by the success of its smart glasses, Meta is working on a way to release a controversial facial recognition feature to the public.",
    "link": "http://futurism.com/artificial-intelligence/meta-facial-recognition-glasses"
  }
]