[
  {
    "text": "Meta names former Trump advisor Dina Powell McCormick as president, vice chair - CNBC",
    "fullText": "Powell McCormick will serve as a member of Meta's management team and will help guide its strategy and execution, the company said.",
    "link": "https://www.cnbc.com/2026/01/12/meta-dina-powell-mccormick-trump.html"
  },
  {
    "text": "Here are Monday's biggest analyst calls: Nvidia, Apple, Tesla, Palantir, Zoom, Microsoft, Roku, Netflix & more - CNBC",
    "fullText": "Here are Monday's biggest calls on Wall Street.",
    "link": "https://www.cnbc.com/2026/01/12/mondays-biggest-analyst-calls-on-wall-street.html"
  },
  {
    "text": "Albert Breer’s NFL Takeaways: Mike Vrabel’s Patriots Vision Takes Center Stage - Sports Illustrated",
    "fullText": "New England’s first-year coach got some ‘dogs’ to play his style. Plus, how San Francisco and Buffalo pulled off come-from-behind wins.",
    "link": "https://www.si.com/nfl/albert-breer-nfl-takeaways-mike-vrabel-patriots-vision-takes-center-stage"
  },
  {
    "text": "Former Rep. Mary Peltola jumps into Alaska Senate race - Politico",
    "fullText": "The former Alaska congressmember will likely face off against Sen. Dan Sullivan (R-Alaska), and is a recruitment coup for national Democrats.",
    "link": "https://www.politico.com/news/2026/01/12/peltola-alaska-senate-2026-midterms-00721596"
  },
  {
    "text": "Ho hum holiday: Retail's early results show modest growth in critical shopping season - CNBC",
    "fullText": "The 2025 holiday season was solid for some retailers as they posted modest growth, but results failed to blow away expectations.",
    "link": "https://www.cnbc.com/2026/01/12/retails-early-holiday-2025-results-show-modest-growth.html"
  },
  {
    "text": "Eagles head coach Nick Sirianni backs WR A.J. Brown after drops, sideline spat - NFL.com",
    "fullText": "Philadelphia Eagles head coach Nick Sirianni defended wide receiver A.J. Brown after multiple drops and a sideline interaction was caught on cameras.",
    "link": "https://www.nfl.com/news/eagles-head-coach-nick-sirianni-backs-wr-a-j-brown-after-drops-sideline-spat"
  },
  {
    "text": "Referee and student among hundreds killed in Iran protests - BBC",
    "fullText": "More than 500 people have been killed during anti-government protests, a US-based human rights group says.",
    "link": "https://www.bbc.com/news/articles/cd0yldn0n7eo"
  },
  {
    "text": "It Was the Craziest NFL Playoff Weekend Ever—and These Numbers Prove It - The Wall Street Journal",
    "fullText": "This was the year when the Wild Card round lived up to its name, with a record number of fourth-quarter lead changes and more late-game mayhem than any postseason we’ve seen before",
    "link": "https://www.wsj.com/sports/football/nfl-playoffs-wild-card-weekend-192fc1a5"
  },
  {
    "text": "Golden Globes' triumphs, snubs and surprise wins: The five most exciting head-to-head battles in the Oscars race - BBC",
    "fullText": "Success for Wagner Moura, Hamnet and Stellan Skarsgård at the Golden Globes has narrowed the Oscars race and set up a number of intriguing fights to watch.",
    "link": "https://www.bbc.com/culture/article/20260112-the-five-most-exciting-head-to-head-battles-in-the-oscars-race"
  },
  {
    "text": "Why the best way to understand the self is to build a robot one - Aeon",
    "fullText": "In order to better understand our human nature, we must attempt to build a robot capable of robust subjective experiences",
    "link": "https://aeon.co/essays/why-the-best-way-to-understand-the-self-is-to-build-a-robot-one"
  },
  {
    "text": "Hearings on whether Myanmar committed genocide against the Rohingya opens at top UN court - ABC News",
    "fullText": "Myanmar heard accusations that it is responsible for genocide against the Rohingya ethnic minority at the top court of the United Nations, as long-awaited hearings began on Monday",
    "link": "https://abcnews.go.com/International/wireStory/court-begin-hearings-myanmar-committed-genocide-rohingya-129122831"
  },
  {
    "text": "2026 NFL Mock Draft: Fernando Mendoza goes No. 1 overall, Jeremiyah Love to the Kansas City Chiefs - PFF",
    "fullText": "The Las Vegas Raiders invest in Fernando Mendoza with the first overall pick while the Kansas City Chiefs grab their bell-cow running back at No. 9 overall.",
    "link": "https://www.pff.com/news/draft-2026-nfl-mock-draft-fernando-mendoza-goes-no-1-overall-jeremiyah-love-to-the-kansas-city-chiefs"
  },
  {
    "text": "This Dead Star With a Glowing Shock Wave Shouldn’t Exist - Gizmodo",
    "fullText": "The recent discovery has left astronomers dumbfounded.",
    "link": "https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244"
  },
  {
    "text": "AI can now 'see' optical illusions. What does it tell us about our own brains? - BBC",
    "fullText": "Our eyes can frequently play tricks on us, but scientists have discovered that some artificial intelligence can fall for the same illusions.",
    "link": "https://www.bbc.com/future/article/20251218-how-ai-is-shedding-new-light-on-optical-illusions"
  },
  {
    "text": "Exercise is as effective as medication in treating depression, study finds - NPR",
    "fullText": "New research shows exercise is as effective as medication at reducing symptoms of depression. And you don't need to run a marathon to see benefits. So how much is enough?",
    "link": "https://www.npr.org/2026/01/12/nx-s1-5667599/exercise-is-as-effective-as-medication-in-treating-depression-study-finds"
  },
  {
    "text": "Around 1,000 more immigration officers headed to Minneapolis, sources say, as tensions flare after fatal ICE shooting - CNN",
    "fullText": "Around 1,000 additional US Customs and Border Protection agents are expected to deploy to Minneapolis, according to two federal law enforcement sources, as tensions between federal law enforcement and local counterparts flare after an ICE-involved shooting la…",
    "link": "https://www.cnn.com/2026/01/12/us/minneapolis-immigration-officers-mobilizing-protests"
  },
  {
    "text": "SEPTA Regional Rail's morning express service will resume Monday - 6abc Philadelphia",
    "fullText": "SEPTA resumed services Monday for thousands of riders who take regional rail morning express from the suburbs to Philadelphia and T-trolley routes through the Center City trolley tunnel.",
    "link": "https://6abc.com/post/septa-regional-rails-morning-express-service-will-resume-monday/18389196/"
  }
]