[
  {
    "text": "Former Prince Andrew moves out of Windsor’s Royal Lodge, CNN understands - CNN",
    "fullText": null,
    "link": "https://www.cnn.com/2026/02/04/europe/andrew-mountbatten-windsor-moves-royals-epstein-intl-hnk"
  },
  {
    "text": "UBS beats expectations with $1.2 billion fourth-quarter profit, plans $3 billion buyback - CNBC",
    "fullText": "UBS reported its fourth quarter earnings on Wednesday.",
    "link": "https://www.cnbc.com/2026/02/04/ubs-q4-earnings-swiss-bank.html"
  },
  {
    "text": "Judge restricts federal use of tear gas, munitions at Portland ICE protests - OregonLive.com",
    "fullText": "The temporary order lasts 14 days. A hearing is set for March 2 to extend the order.",
    "link": "https://www.oregonlive.com/crime/2026/02/judge-restricts-federal-officers-use-of-force-at-portland-ice-protests.html"
  },
  {
    "text": "Defense Dept. effort to punish Mark Kelly draws skepticism from judge - The Washington Post",
    "fullText": "A federal judge said Pete Hegseth appeared to be expanding restrictions on free speech that have applied only to active-duty service members.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/03/mark-kelly-hegseth-censure-court/"
  },
  {
    "text": "'Wuthering Heights' First Reactions Praise Margot Robbie, Jacob Elordi - Variety",
    "fullText": "First reactions are calling 'Wuthering Heights' a 'bodice-ripping crowd-pleaser' that is 'destined to be a massive hit.'",
    "link": "https://variety.com/2026/film/news/wuthering-heights-reactions-margot-robbie-jacob-elrodi-1236644150/"
  },
  {
    "text": "Trump, 79, Lets Cankles Slip in Photo With World Leader - The Daily Beast",
    "fullText": "The aging president’s swollen ankles bulged out of his shoes as he sat next to Colombian President Gustavo Petro.",
    "link": "https://www.thedailybeast.com/trump-79-lets-cankles-slip-in-photo-with-world-leader/"
  },
  {
    "text": "‘F1’ Sequel Teased By Racing Sport’s CEO At Apple TV Press Day - Deadline",
    "fullText": "The biggest question heading into Apple TV press day was whether there would be a sequel to the biggest grossing sports movie of all-time and 4x Oscar nominee, F1. Taking a question from the audience, Apple’s SVP of Services, Eddie Cue, read it to Formula 1 C…",
    "link": "http://deadline.com/2026/02/f1-sequel-teased-1236708166/"
  },
  {
    "text": "Saif al-Islam Gaddafi, son of ex-Libyan leader, reportedly shot dead - BBC",
    "fullText": "The 53-year-old, who was once widely seen as the second most powerful person in Libya, was killed on Tuesday according to Libyan media.",
    "link": "https://www.bbc.com/news/articles/cp37g4xgkxdo"
  },
  {
    "text": "Hall of Fame voter Tony Dungy declines to comment on whether he voted for Bill Belichick - NBC Sports",
    "fullText": "The Bill Belichick snub has sparked an effort to determine which of the 50 Hall of Fame voters failed to put him on their ballot.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/hall-of-fame-voter-tony-dungy-declines-to-comment-on-whether-he-voted-for-bill-belichick"
  },
  {
    "text": "Senate Banking Democrats demand delay on Warsh nomination until Powell and Cook investigations end - CNBC",
    "fullText": "Sen. Thom Tillis, R-N.C., has separately vowed to hold up the nomination until the DOJ resolves its criminal investigation of Fed Chair Jerome Powell.",
    "link": "https://www.cnbc.com/2026/02/03/senate-democrats-delay-warsh-nomination-fed.html"
  },
  {
    "text": "Lakers' Austin Reaves (calf) back in action against Nets - ESPN",
    "fullText": "Austin Reaves, sidelined the past five weeks with a strained left calf, returned in the Lakers' 125-109 win against the Nets on Tuesday night, scoring 15 points on 3-for-9 shooting with four rebounds and two steals.",
    "link": "https://www.espn.com/nba/story/_/id/47820371/lakers-austin-reaves-calf-back-action-nets"
  },
  {
    "text": "Republicans are freaking out about Hispanic voters after a Texas upset - Politico",
    "fullText": "Democrats flipped a deep-red state senate district over the weekend that has the party worried about November.",
    "link": "https://www.politico.com/news/2026/02/03/republicans-hispanic-voters-texas-special-00763560"
  },
  {
    "text": "Columbia Heights fourth-grader released after a month in ICE detention - Sahan Journal",
    "fullText": "Columbia Heights Public Schools says three of its students are still in federal immigration custody after the release of Liam Conejo Ramos and 10-year-old Elizabeth Zuna Caisaguano.",
    "link": "http://sahanjournal.com/education/columbia-heights-fourth-grader-held-by-ice/"
  },
  {
    "text": "China bans hidden car door handles, which can trap people after crashes - NPR",
    "fullText": "China has introduced new regulations, starting in 2027, requiring all car doors to open manually from both sides. Electric door handles can malfunction in a crash or battery failure.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5698224/china-electric-car-door-handles"
  },
  {
    "text": "Walz demands DHS stop detaining Minnesota children - Star Tribune",
    "fullText": "In a letter to Homeland Security Secretary Kristi Noem, Walz demanded details about how many Minnesota kids are in detention facilities.",
    "link": "https://www.startribune.com/walz-demands-dhs-stop-detaining-minnesota-children/601575923"
  },
  {
    "text": "Fourteen migrants dead after collision with Greek coastguard boat - BBC",
    "fullText": "The coastguard said a pursuit was under way at the time of the collision, near the island of Chios.",
    "link": "https://www.bbc.com/news/articles/cdre825p110o"
  },
  {
    "text": "The four best Super Bowl TV deals we found - The Verge",
    "fullText": "There are countless TV deals at any given moment, but if you’re serious about quality, these 4K TV deals stand out from the rest for the Super Bowl.",
    "link": "https://www.theverge.com/gadgets/873160/super-bowl-4k-oled-big-tv-deal-sale"
  },
  {
    "text": "Newborn dies after mother drinks raw milk during pregnancy - Ars Technica",
    "fullText": "Raw milk is promoted by anti-vaccine Health Secretary Kennedy.",
    "link": "https://arstechnica.com/health/2026/02/newborns-death-spurs-raw-milk-warning-in-new-mexico/"
  },
  {
    "text": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sun-releases-4-strong-solar-flares-expect/story?id\\\\u003d129814702"
  }
]