[
  {
    "text": "SpaceX launches advanced GPS satellite for US Space Force (photos) - Space",
    "fullText": "Liftoff of the GPS III-SV09 mission occurred at 11:53 p.m. ET on Tuesday (Jan. 27).",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/spacex-gps-iii-sv09-launch-space-force"
  },
  {
    "text": "South Korea’s former first lady sentenced to 20 months in prison for corruption - AP News",
    "fullText": "A South Korean court has sentenced former first lady Kim Keon Hee to 20 months in prison for corruption. The sentencing Wednesday in Seoul Central District Court came about three weeks ahead of a verdict on against Yoon for disgraced former President Yoon Suk…",
    "link": "https://apnews.com/article/south-korea-kim-keon-hee-daa044141adca1a59f21974ad2a08b72"
  },
  {
    "text": "‘A betrayal’: Southwest’s new plus size policy leaves some passengers unable to fly - oregonlive.com",
    "fullText": "Some loyal customers say the airline’s new requirement that they buy an extra seat means that they can no longer fly as often or at all.",
    "link": "https://www.oregonlive.com/travel/2026/01/a-betrayal-southwests-new-plus-size-policy-leaves-some-passengers-unable-to-fly.html"
  },
  {
    "text": "2026 NFL Draft: 8 prospects who stood out in East-West Shrine Bowl - NFL.com",
    "fullText": "Which 2026 NFL Draft prospects helped themselves in Tuesday's East-West Shrine Bowl? Chad Reuter highlights eight standouts from the all-star game.",
    "link": "https://www.nfl.com/news/2026-nfl-draft-8-prospects-who-stood-out-in-east-west-shrine-bowl"
  },
  {
    "text": "How should Chelsea line up against Napoli with Champions League bye on the line? - We Ain't Got No History",
    "fullText": "Napoli vs. Chelsea, Champions League: You choose the starting lineup",
    "link": "https://weaintgotnohistory.sbnation.com/european-tournaments/165559/how-should-chelsea-line-up-against-napoli-with-champions-league-bye-on-the-line"
  },
  {
    "text": "The DHS crisis is squeezing Susan Collins - Politico",
    "fullText": "The Maine Republican is under immense pressure as a huge funding package hangs by a thread and federal agents swarm her state.",
    "link": "https://www.politico.com/news/2026/01/27/susan-collins-dhs-ice-shutdown-00751545"
  },
  {
    "text": "CNBC Daily Open: The EU-India trade deal story is not over yet - CNBC",
    "fullText": "U.S. President Donald Trump has yet to air his views about the India-EU agreement.",
    "link": "https://www.cnbc.com/2026/01/28/cnbc-daily-open-the-eu-india-trade-deal-story-is-not-over-yet.html"
  },
  {
    "text": "4 takeaways from No. 3 Michigan Basketball’s win vs No. 5 Nebraska - Maize n Brew",
    "fullText": "It wasn’t always pretty, but No. 3 Michigan Basketball hung on to beat now-formerly undefeated Nebraska. Here are 4 takeaways from the Wolverines’ huge win:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/104862/michigan-basketball-takeaways-nebraska-dusty-may-trey-mckenney-morez-johnson-aday-mara"
  },
  {
    "text": "After Further Review: How the Patriots Defense Won the AFC Title Game, Maye Breakdown, and Quick-Hit Film Notes From Sunday's Win in Denver - New England Patriots",
    "fullText": "The Patriots are headed back to the Super Bowl thanks to a 10-7 win over the Broncos on Sunday, but they'll need more from the offense in Santa Clara.",
    "link": "https://www.patriots.com/news/after-further-review-how-the-patriots-defense-won-the-afc-title-game-maye-breakdown-and-quick-hit-film-notes-from-sunday-s-win-in-denver"
  },
  {
    "text": "Consumer Price Index climbs 3.6% YoY in December, as expected - FXStreet",
    "fullText": "Australia’s Consumer Price Index (CPI) climbed by 3.6% year-over-year (YoY) in December, following a 3.5% increase (revised from 3.4%) reported in the previous reading, the latest data published by the Australian Bureau of Statistics (ABS) showed on Wednesday.",
    "link": "https://www.fxstreet.com/news/australia-cpi-set-to-show-sticky-inflation-fueling-rba-hawkish-bets-202601272000"
  },
  {
    "text": "Trump to urge families to open Trump Accounts as tax season begins - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-urge-families-open-trump-accounts-tax-season/story?id\\\\u003d129611160"
  },
  {
    "text": "S.F. private high school has three cases of active tuberculosis - sfchronicle.com",
    "fullText": "San Francisco public health officials have identified three active TB cases at the private high school since November.",
    "link": "https://www.sfchronicle.com/sf/article/riordan-high-school-tuberculosis-cases-21318508.php"
  },
  {
    "text": "Diplomats Worry Xi’s Purge Will Curb Critical Contact With China - Bloomberg.com",
    "fullText": "Xi Jinping’s purge of top Chinese generals has cost Western governments a key contact and deepened fears that the People’s Liberation Army is becoming even more walled-off from contact.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-27/diplomats-worry-xi-s-purge-will-curb-critical-contact-with-china"
  },
  {
    "text": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington D.C. - NPR",
    "fullText": "After a yearlong investigation, the National Transportation Safety Board did not find a single cause for the deadly collision near Washington, D.C., but blamed the crash on multiple systemic failures.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5689091/ntsb-dca-midair-collision-black-hawk-helicopter"
  },
  {
    "text": "Asia markets open mostly higher after S&P 500 hits record, South Korea pushes fresh highs - CNBC",
    "fullText": "Markets across Asia extended gains Wednesday after a record close on Wall Street, with Australia’s inflation release in focus.",
    "link": "https://www.cnbc.com/2026/01/28/asia-markets-today-wednesday-hang-seng-index-nikkei-225-kospi-inflation-yen-australia-cpi.html"
  },
  {
    "text": "Samsung’s first Galaxy S26 teaser is for the ‘Privacy Display’ [Gallery] - 9to5Google",
    "fullText": "Samsung is teasing the Galaxy S26’s new “Privacy display” feature in a series of new videos that showcase how the...",
    "link": "http://9to5google.com/2026/01/27/samsung-galaxy-s26-privacy-display-teaser/"
  },
  {
    "text": "‘KPop Demon Hunters’ HUNTR/X conquer the charts and claim their destiny - NPR",
    "fullText": "The fictional band HUNTR/X from the hit Netflix film KPop Demon Hunters went from a group no one had ever heard of to one of the biggest pop acts of 2025. Now they have five Grammy nominations.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5608362/huntrx-k-pop-demon-hunters-film-grammy-awards"
  },
  {
    "text": "Citi seeks to move harassment claim against top executive to arbitration - Financial Times",
    "fullText": "Bank claims allegations made in lawsuit this week against wealth chief Andy Sieg were ‘fabricated’",
    "link": "https://www.ft.com/content/4e1b334a-688d-436e-b72b-49ad072843cb"
  }
]