[
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Toddler hospitalized with respiratory failure was returned to ICE detention and denied prescribed medication, lawsuit says - NBC News",
    "fullText": "A federal lawsuit says an 18-month-old baby became critically ill in a South Texas immigration detention center, was hospitalized with respiratory failure, then sent back to detention without needed medication.",
    "link": "https://www.nbcnews.com/news/us-news/toddler-hospitalized-dilley-ice-detention-rcna257912"
  },
  {
    "text": "Zelensky says U.S. is readying huge economic deals with Russia - The Washington Post",
    "fullText": "The Ukrainian president said the Trump administration was pushing for a June deadline to end Russia’s war.",
    "link": "https://www.washingtonpost.com/world/2026/02/07/ukraine-russia-us-economic-agreements-war/"
  },
  {
    "text": "Netanyahu to hold urgent meeting with Trump Wednesday amid Iran negotiations - Axios",
    "fullText": "Netanyahu \"believes that any negotiations must include limits on Iran's ballistic missiles,\" the prime minister's office said.",
    "link": "https://www.axios.com/2026/02/07/netanyahu-trump-iran-negotiations"
  },
  {
    "text": "Jim Schwartz, Browns \"game of chicken\" may not be over - NBC Sports",
    "fullText": "It's still possible Schwartz will surface elsewhere in 2026.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jim-schwartz-browns-game-of-chicken-may-not-be-over"
  },
  {
    "text": "Box Office: 'Stray Kids' Rocks Out at No. 1; 'Send Help' Takes Second - Variety",
    "fullText": "Friday was wide open for the K-pop concert film 'Stray Kids: The dominATE Experience' to take the top spot.",
    "link": "https://variety.com/2026/film/news/box-office-stray-kids-send-help-iron-lung-solo-mio-1236652723/"
  },
  {
    "text": "Apple will introduce these key Messages app upgrades very soon, here’s what they are - 9to5Mac",
    "fullText": "Last year, Apple confirmed that it’d be supporting end-to-end encryption with RCS in a future software update. At the time,...",
    "link": "https://9to5mac.com/2026/02/07/apple-messages-app-upgrades-coming-soon-ios-26-4-rcs-texting/"
  },
  {
    "text": "Trump and Mamdani find unlikely common ground on New York City zoning - Politico",
    "fullText": "The president’s long history in New York City real estate looms large over the ongoing conversation with Mamdani.",
    "link": "https://www.politico.com/news/2026/02/07/trump-mandani-meeting-new-york-zoning-00767521"
  },
  {
    "text": "Confusion at reopening of Rafah crossing leaves Palestinians stranded - cnn.com",
    "fullText": "The first week of the partial reopening of the Rafah crossing between Gaza and Egypt was marked by confusion, and logistical hurdles, according to Palestinians attempting to cross and multiple sources who spoke to CNN on condition of anonymity.",
    "link": "https://www.cnn.com/2026/02/07/middleeast/gaza-egypt-rafah-crossing-palestinians-stranded-intl"
  },
  {
    "text": "Mariah Carey's Olympic act prompts questions about possible lip-syncing and a curious teleprompter - Yahoo",
    "fullText": "The performance by pop star Mariah Carey at the Milan Cortina Winter Olympics opening ceremony was the talk of the town — but it also raised a few questions....",
    "link": "https://www.yahoo.com/entertainment/music/articles/mariah-careys-olympic-act-prompts-143412842.html"
  },
  {
    "text": "Judge grants continuance in the asylum case of Liam Conejo Ramos and his family - cnn.com",
    "fullText": "Five-year-old Liam Conejo Ramos and his family will have more time to make their case for asylum.",
    "link": "https://www.cnn.com/2026/02/07/us/liam-conejo-ramos-family-asylum-continuance"
  },
  {
    "text": "LIVE! PFL Dubai Results: Nurmagomedov vs. Davis - MMA Fighting",
    "fullText": "Get PFL Dubai results for the Nurmagomedov vs. Davis event Saturday morning.",
    "link": "https://www.mmafighting.com/pfl/470516/pfl-dubai-results-nurmagomedov-vs-davis"
  },
  {
    "text": "S Korean crypto firm accidentally pays out $40bn in bitcoin - BBC",
    "fullText": "The company quickly realised its mistake and managed to recover virtually all the missing tokens from customers.",
    "link": "https://www.bbc.com/news/articles/cz6y62nzjxxo"
  },
  {
    "text": "Pressure mounts on American Airlines CEO as carrier lags rivals - CNBC",
    "fullText": "American Airlines made $111 million last year, while rivals Delta Air Lines and United Airlines, brought in $5 billion and $3.3 billion, respectively.",
    "link": "https://www.cnbc.com/2026/02/07/american-airlines-ceo-robert-isom.html"
  },
  {
    "text": "Automakers largely sit out 2026 Super Bowl advertising amid industry uncertainty - CNBC",
    "fullText": "Automakers are largely sitting on the advertising sidelines during this year's Super Bowl amid broader uncertainty in the U.S. automotive industry.",
    "link": "https://www.cnbc.com/2026/02/07/super-bowl-ads-gm-toyota-volkswagen.html"
  },
  {
    "text": "US gave Ukraine and Russia a June deadline to reach agreement to end war, Zelenskyy says - AP News",
    "fullText": "The U.S. has given Ukraine and Russia a June deadline to reach a peace deal, according to President Volodymyr Zelenskyy. He said the U.S. plans to pressure both sides to meet this timeline. Zelenskyy spoke to reporters on Friday, with comments released on Sat…",
    "link": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001"
  },
  {
    "text": "A viral outbreak at the Winter Olympics, and Disney names Bob Iger's successor (again): The news quiz - NBC News",
    "fullText": "Lindsey Vonn reveals a major injury, a journalism institution announces sweeping layoffs, and a stuffed toy takes off in China.",
    "link": "https://www.nbcnews.com/news/news-quiz/winter-olympics-disney-ceo-rcna257610"
  },
  {
    "text": "Japan's ultraconservative PM Sanae Takaichi set for a big election victory - NBC News",
    "fullText": "Polls are predicting a landslide for Sanae Takaichi on Sunday, which would give her direct public backing as she seeks to boost Japan’s defense capabilities.",
    "link": "https://www.nbcnews.com/world/japan/japans-ultraconservative-pm-sanae-takaichi-set-big-election-victory-rcna257744"
  }
]