[
  {
    "text": "S&P 500 rises to record high, led by gains in tech: Live updates - CNBC",
    "fullText": "More than 90 S&P 500 companies are slated to report quarterly results this week.",
    "link": "https://www.cnbc.com/2026/01/26/stock-market-today-live-updates.html"
  },
  {
    "text": "One person in critical condition after being shot in incident involving Border Patrol in Arizona - NBC News",
    "fullText": "A person was shot in an incident involving U.S. Border Patrol in Arizona on Tuesday, according to a Pima County Sheriff spokeswoman.",
    "link": "https://www.nbcnews.com/news/us-news/person-shot-border-patrol-involved-arizona-rcna256137"
  },
  {
    "text": "US to send ICE agents to Winter Olympics, prompting Italian anger - BBC",
    "fullText": "The US federal agency says it will not play an immigration role at February's event in Milan-Cortina.",
    "link": "https://www.bbc.com/news/articles/c5y29xzjdzvo"
  },
  {
    "text": "Yankees Claim Dom Hamel; Designate Marco Luciano, Jayvien Sandridge For Assignment - MLB Trade Rumors",
    "fullText": "Yankees do some roster shuffling.",
    "link": "https://www.mlbtraderumors.com/2026/01/yankees-claim-dom-hamel-designate-marco-luciano-jayvien-sandridge-for-assignment.html"
  },
  {
    "text": "South Carolina measles outbreak is largest in US since measles was declared eliminated - CNN",
    "fullText": "The fast-growing measles outbreak in South Carolina is now the largest in the United States since the disease was declared eliminated in this country more than two decades ago.",
    "link": "https://www.cnn.com/2026/01/27/health/largest-us-measles-outbreak-south-carolina"
  },
  {
    "text": "Trump aides declared 16 DHS shootings since July justified before probes completed - The Washington Post",
    "fullText": "The Trump administration’s rush to defend the officers and accuse the victims of attacking them has sparked widespread outrage and demands for accountability.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/27/ice-border-patrol-shootings-immigration-trump/"
  },
  {
    "text": "Amazon to Shut Down All Amazon Go and Amazon Fresh Stores - The Wall Street Journal",
    "fullText": "Online retail giant will convert some locations into Whole Foods Market stores as it expands the brand’s footprint",
    "link": "https://www.wsj.com/business/retail/amazon-to-shut-down-all-amazon-go-and-amazon-fresh-stores-0301dfb7"
  },
  {
    "text": "Kylie Jenner and Timothée Chalamet Shop for Bikinis on Mexico Vacation - TMZ",
    "fullText": "Kylie Jenner and Timothée Chalamet must've packed light for their trip to Los Cabos, because they went shopping for some sexy swimwear ... and it's all on video.",
    "link": "https://www.tmz.com/2026/01/27/timothee-chalamet-kylie-jenner-buying-bikini-mexico/"
  },
  {
    "text": "Why There's Simply No Need For An iPad Anymore - bgr.com",
    "fullText": "Apple may finally be releasing the iPhone Fold this year, as well as a MacBook with touchscreen capabilities, eliminating the need for an iPad.",
    "link": "https://www.bgr.com/2081519/why-no-one-needs-ipads-anymore/"
  },
  {
    "text": "Carney denies walking back Davos speech in phone call with Trump - BBC",
    "fullText": "The Canadian prime minister confirmed that he and the US president spoke by phone after Trump threatened 100% tariffs on Canada.",
    "link": "https://www.bbc.com/news/articles/c9qp3x5x2jpo"
  },
  {
    "text": "Android adds ‘Failed Authentication Lock’ setting, boosts failed passcode lockout - 9to5Google",
    "fullText": "Google today detailed the latest device theft protection features for Android across stronger authentication and enhanced recovery tools.",
    "link": "http://9to5google.com/2026/01/27/android-failed-authentication-lock/"
  },
  {
    "text": "Sri Lanka vs England: Joe Root and Harry Brook centuries take tourists to ODI series win - BBC",
    "fullText": "Joe Root and Harry Brook both hit brilliant, unbeaten centuries as England beat Sri Lanka by 53 runs to clinch an ODI series win in Colombo.",
    "link": "https://www.bbc.com/sport/cricket/articles/cdrepyep6rpo"
  },
  {
    "text": "As Trump shuffles global order, U.K. prime minister heads to Beijing - The Washington Post",
    "fullText": "Keir Starmer’s visit is part of a flurry of diplomacy between Europe and China, but risks angering President Donald Trump.",
    "link": "https://www.washingtonpost.com/world/2026/01/27/britain-china-starmer-economic-relations/"
  },
  {
    "text": "What to know about the deadly Nipah virus, amid outbreak in India - The Washington Post",
    "fullText": "Some airports in Asia are on alert after confirmed cases in West Bengal of the  Nipah virus, which has no cure. South Asia sees outbreaks nearly every year.",
    "link": "https://www.washingtonpost.com/world/2026/01/27/nipah-virus-outbreak-india/"
  },
  {
    "text": "Philip Glass pulls world premiere from Kennedy Center - The Washington Post",
    "fullText": "The pioneering composer announced that “the values of the Kennedy Center today are in direct conflict with the message” of his Symphony No. 15: “Lincoln.”",
    "link": "https://www.washingtonpost.com/entertainment/music/2026/01/27/philip-glass-kennedy-center-lincoln-premiere/"
  },
  {
    "text": "Could another storm hit the East Coast this weekend? See the scenarios. - The Washington Post",
    "fullText": "More snow is probably on its way. Multiple weather models are simulating what could be another system that brings plowable snow to parts of the East.",
    "link": "https://www.washingtonpost.com/weather/2026/01/27/east-coast-winter-storm-possibilities-snow/"
  },
  {
    "text": "Consumer confidence collapses to lowest level since 2014 - CNN",
    "fullText": "America’s economic mood deteriorated in January to its lowest level in more than a decade as consumers fretted about geopolitical tensions, affordability and President Donald Trump’s unrelenting trade war.",
    "link": "https://www.cnn.com/2026/01/27/economy/us-consumer-confidence-january"
  },
  {
    "text": "First wrongful death lawsuit filed against Trump administration over drug boat strikes - NBC News",
    "fullText": "WASHINGTON — Family members of two Trinidadian men who were killed in a U.S. strike on an alleged drug-smuggling boat in October sued the U.S. government Tuesday, accusing it of wrongful death and extrajudicial killings",
    "link": "https://www.nbcnews.com/politics/white-house/first-wrongful-death-lawsuit-filed-trump-administration-drug-boat-stri-rcna256022"
  },
  {
    "text": "NBA mock draft 2026: Lottery simulation delivers young star to big winner - SB Nation",
    "fullText": "",
    "link": "https://www.sbnation.com/nba/1101047/nba-mock-draft-2026-one-spin-of-tankahon"
  },
  {
    "text": "After rocky start, Bari Weiss to cut staff, add commentators at CBS News - NPR",
    "fullText": "CBS News Editor-in-Chief Bari Weiss came in with a mandate to reshape coverage. She laid out her strategy in a staff meeting Tuesday.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5689849/after-rocky-start-bari-weiss-to-cut-staff-add-commentators-at-cbs-news"
  }
]