[
  {
    "text": "Border czar hails a ‘safer’ Minnesota as he says the state’s immigration crackdown is over - AP News",
    "fullText": "The Trump administration says it is ending its massive immigration crackdown in Minnesota after weeks of angry mass protests, thousands of arrests and two fatal shootings. Border czar Tom Homan said Thursday that the operation has been a success and that it h…",
    "link": "https://apnews.com/article/minnesota-metro-surge-ice-523d18d5d75c81cbf9f24c602f1884ff"
  },
  {
    "text": "Utah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post - Politico",
    "fullText": "Jeremy Carl was grilled at a Senate confirmation hearing.",
    "link": "https://www.politico.com/live-updates/2026/02/12/congress/carl-hearing-00778566"
  },
  {
    "text": "Colorectal cancer is rising in younger adults. Here's who is most at risk and symptoms to watch for - AP News",
    "fullText": "The death of “Dawson’s Creek” actor James Van Der Beek highlights a rising trend in colorectal cancer among young adults. While overall colorectal cancer rates have inched down in recent years, rates for those under 50 have risen. It is now the top cancer kil…",
    "link": "https://apnews.com/article/colon-cancer-young-adults-boseman-van-der-beek-7200285f2060145b8369de9ed8db9c17"
  },
  {
    "text": "ICE conducted 37 investigations into officer misconduct in last year - NPR",
    "fullText": "The disclosure from the agency's acting director came after immigration officers shot two U.S. citizens, intensifying questions about ICE officers' tactics, training and use of force.",
    "link": "https://www.npr.org/2026/02/12/g-s1-109841/immigration-enforcement-investigations-misconduct"
  },
  {
    "text": "Senate Republicans rally behind USMCA even as Trump’s support wavers - Politico",
    "fullText": "Senate Finance Chair Mike Crapo called for a \"timely conclusion to the review and extension of the agreement\" the U.S. inked with Canada and Mexico during Trump's first term.",
    "link": "https://www.politico.com/live-updates/2026/02/12/congress/finance-republicans-rally-behind-usmca-as-trumps-support-waivers-00778816"
  },
  {
    "text": "Report: Raiders interviewing Frisman Jackson for offensive coordinator - NBC Sports",
    "fullText": "New Raiders head coach Klint Kubiak is taking a look at bringing an offensive assistant with him from the Seahawks.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/report-raiders-interviewing-frisman-jackson-for-offensive-coordinator"
  },
  {
    "text": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act - NPR",
    "fullText": "In his Thursday order, U.S. District Court Judge James Boasberg ordered the government to allow any of the men deported last year to El Salvador to appear in a U.S. port of entry to be conditionally allowed in as they challenge their removal.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5712542/federal-judge-orders-return-of-venezuelan-migrants-deported-to-el-salvador-under-alien-enemies-act"
  },
  {
    "text": "Have astronomers witnessed the birth of a black hole? - NPR",
    "fullText": "A massive star in the nearby Andromeda galaxy has simply disappeared. Some astronomers believe that it's collapsed in on itself and formed a black hole.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5707552/have-astronomers-witnessed-the-birth-of-a-black-hole"
  },
  {
    "text": "Astronomers detect a solar system they say should not be possible - CNN",
    "fullText": "A planetary system 116 light-years from Earth has a peculiar pattern. It could flip the script on how planets form, scientists say.",
    "link": "https://www.cnn.com/2026/02/12/science/solar-system-inside-out-planets"
  },
  {
    "text": "Sinners, One Battle After Another Oscar Campaigns Collide at Warner Bros - Variety",
    "fullText": "Warner Bros faces an Oscar-season paradox with two major best picture contenders, one single studio strategy and no room to show favoritism.",
    "link": "https://variety.com/2026/film/awards/sinners-one-battle-after-another-oscar-campaigns-warner-bros-1236660361/"
  },
  {
    "text": "20 Years After a ‘Friends’ Harassment Suit Was Dismissed, Baldoni-Lively Case Revisits Limits of Creative Freedom - Variety",
    "fullText": "Justin Baldoni has invoked a case involving vulgar talk in the 'Friends' writers room to defend himself from Blake Lively's harassment suit.",
    "link": "https://variety.com/2026/film/news/baldoni-lively-lawsuit-sexual-harassment-friends-1236659039/"
  },
  {
    "text": "Trucking and logistics stocks drop on release of AI freight scaling tool - CNBC",
    "fullText": "A new tool from AI company Algorhythm Holdings has made trucking companies the latest victim of the market's AI jitters.",
    "link": "https://www.cnbc.com/2026/02/12/trucking-and-logistics-stocks-tumble-on-release-of-ai-freight-scaling-tool.html"
  },
  {
    "text": "Good Luck, Have Fun, Don’t Die is a rollicking parable about this moment in tech - The Verge",
    "fullText": "Good Luck, Have Fun, Don’t Die — in theaters February 13th —is a wild and mindbending rumination on the AI boom.",
    "link": "https://www.theverge.com/entertainment/877244/good-luck-have-fun-dont-die-review"
  },
  {
    "text": "Nancy Guthrie disappearance: Investigators find a set of gloves along road as search enters 12th day - Fox News",
    "fullText": "Investigators found a set of gloves amid the investigation into Nancy Guthrie's disappearance. The FBI conducted an \"extensive search\" Wednesday along multiple roadways in the Catalina Foothills area north of Tucson, Arizona, and continues to offer a $50,000 …",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-investigators-find-a-set-of-gloves-along-road-as-search-enters-12th-day"
  },
  {
    "text": "Dan Parr 2026 NFL mock draft 1.0: Jets trade back into Round 1 for QB; Commanders go RB - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Dan Parr projects the Commanders to provide a new weapon for Jayden Daniels while the Jets make a trade for a QB. Check out the full Round 1 forecast, 1-32.",
    "link": "https://www.nfl.com/news/dan-parr-2026-nfl-mock-draft-1-0-jets-trade-back-into-round-1-for-qb-commanders-go-rb"
  },
  {
    "text": "Atlético Madrid vs Barcelona, Copa del Rey: TV & Streaming, Live Thread - Barca Blaugranes",
    "fullText": "Join us for a huge Barcelona Spanish Cup adventure!",
    "link": "https://www.barcablaugranes.com/barcelona-copa-del-rey/112486/atletico-madrid-barcelona-live-stream-lineups-time-tv-channel-how-to-watch-copa-del-rey-online"
  },
  {
    "text": "YouTube launches native app for Apple Vision Pro - 9to5Mac",
    "fullText": "YouTube was one of the biggest apps missing from the Vision Pro platform at launch in February 2024. That changes...",
    "link": "https://9to5mac.com/2026/02/12/youtube-launches-native-app-for-apple-vision-pro/"
  },
  {
    "text": "Spirit Airlines sells more planes, calls back 500 flight attendants from furlough ahead of spring break - CNBC",
    "fullText": "Spirit Airlines said it sold another 20 planes and is calling back 500 flight attendants from furlough.",
    "link": "https://www.cnbc.com/2026/02/12/spirit-airlines-sells-planes-flight-attendants.html"
  },
  {
    "text": "America’s Obsession With Its Own Royal Family Hasn’t Abated. A Sexy New Show Captures Why. - Slate",
    "fullText": "Love Story charts the tragic romance between JFK Jr. and his fashion-industry bride Carolyn Bessette.",
    "link": "https://slate.com/culture/2026/02/jfk-john-f-kennedy-jr-carolyn-bessette-love-story-fx-hulu.html"
  },
  {
    "text": "‘I don’t think he’s funny’: Zion Clark, wrestler born without legs, fires back at UFC heavyweight Valter Walker before fight - MMA Fighting",
    "fullText": "Zion Clark, Valter Walker will compete at Karate Combat on Friday",
    "link": "https://www.mmafighting.com/latest-news/471238/i-dont-think-hes-funny-zion-clark-wrestler-born-without-legs-ready-for-war-against-ufc-heavyweight-valter-walker"
  }
]