[
  {
    "text": "Updated snow totals for southeastern Virginia: Forecast down - The Virginian-Pilot",
    "fullText": "The weather service says Norfolk, Portsmouth, Suffolk and most of Chesapeake and Virginia Beach is likely to see 3-4 inches of snow. Higher amounts are possible.",
    "link": "https://www.pilotonline.com/2026/01/31/updated-snow-forecast-virginia/"
  },
  {
    "text": "Ashes of Creation's Steven Sharif Resigned 'In Protest' As Intrepids Board Starts Mass Layoffs At MMO Studio - Update - MMORPG.com",
    "fullText": "The future of Ashes of Creation seems to be in limbo following the news earlier tonight that its creative director and studio co-founder, Steven Sharif, resigned in protest over the Board of Directors' decision-making.",
    "link": "https://www.mmorpg.com/news/ashes-of-creations-steven-sharif-resigned-in-protest-as-intrepids-board-starts-mass-layoffs-at-mmo-studio-update-2000137172"
  },
  {
    "text": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say - BBC",
    "fullText": "Israel's military confirmed the strikes, which come during a ceasefire that Israel and Hamas accuse each other of breaking.",
    "link": "https://www.bbc.com/news/articles/c701g1g00gdo"
  },
  {
    "text": "Orange County confirms second measles case in traveler who visited Disneyland, California Adventure - CBS News",
    "fullText": "Orange County health officials have confirmed their second measles case of 2026 in an international traveler who arrived in California at Los Angeles International Airport before visiting Disneyland and California Adventure last week.",
    "link": "https://www.cbsnews.com/losangeles/news/orange-county-measles-disneyland-california-adventure-lax-airport/"
  },
  {
    "text": "McKenna has hot day outdoors for Penn State at Beaver Stadium - NHL.com",
    "fullText": "Projected No. 1 pick in 2026 NHL Draft has goal, 2 assists in OT loss against Michigan State",
    "link": "https://www.nhl.com/news/gavin-mckenna-shows-off-skills-in-penn-state-game-at-beaver-stadium"
  },
  {
    "text": "USA Olympics Legend Airlifted From Course After Crash in Last Race Before 2026 Games - The Daily Beast",
    "fullText": "Babbel forgoes flashcards and memorization in favor of real-world conversations.",
    "link": "https://www.thedailybeast.com/save-up-to-50-on-a-lifetime-subscription-to-the-babbel-language-learning-app/"
  },
  {
    "text": "A chatbot entirely powered by humans, not artificial intelligence? This Chilean community shows why - AP News",
    "fullText": "About 50 members of a community outside Chile’s capital spent Saturday trying their best to power an entirely human-operated chatbot that could answer questions and make silly pictures on command, in a message to highlight the environmental toll and water usa…",
    "link": "https://apnews.com/article/ai-human-chatbot-chile-quiliai-data-centers-water-a798d7d1ae3b2fd7646ec5dbfc8a18dd"
  },
  {
    "text": "Shavkat Rakhmonov expected to miss several more months after another surgery - MMA Fighting",
    "fullText": "UFC welterweight Shavkat Rakhmonov’s octagon absense has been extended for several more months.",
    "link": "https://www.mmafighting.com/ufc/469096/shavkat-rakhmonov-expected-to-miss-several-more-months-after-another-surgery"
  },
  {
    "text": "This Wild Encounter Between A Boomer And A Millennial Has Gone Viral, And People Have LOTS To Say - BuzzFeed",
    "fullText": "\"Not all heroes wear capes; some wear AirPods.\"",
    "link": "https://www.buzzfeed.com/kristatorres/entitled-boomer-reddit"
  },
  {
    "text": "Justin Jefferson: I definitely feel like we would have done better with Sam Darnold - NBC Sports",
    "fullText": "“It’s definitely tough. It's tough to watch. I love that he’s in the Super Bowl. I’m happy for him, I want nothing but the best for him,\" Jefferson said of Darnold.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/justin-jefferson-i-definitely-feel-like-we-would-have-done-better-with-sam-darnold"
  },
  {
    "text": "12 states are hoping for early spots on Democrats' 2028 primary calendar - NBC News",
    "fullText": "The Democratic Party took a small step toward setting its 2028 presidential primary calendar, telling a dozen state parties they can formally present bids to hold nominating contests at the beginning of the process",
    "link": "https://www.nbcnews.com/politics/2028-election/democrats-2028-presidential-primary-calendar-dnc-early-voting-rcna256634"
  },
  {
    "text": "Lifespan may be 50% heritable, study suggests - Live Science",
    "fullText": "A new study suggests that lifespan might be 50% heritable — although for now, it's hard to know if the finding applies across diverse populations.",
    "link": "https://www.livescience.com/health/ageing/lifespan-may-be-50-percent-heritable-study-suggests"
  },
  {
    "text": "Another winter storm threatens to drop more snow as dangerous cold lingers - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/winter-storm-threatens-drop-snow-dangerous-cold-lingers/story?id\\\\u003d129734353"
  },
  {
    "text": "Saturday Pre-orders – Chaos Space Marines and Marauders running wild - Warhammer Community",
    "fullText": "Check out today’s latest pre-orders.",
    "link": "https://www.warhammer-community.com/articles/uapels1d/saturday-pre-orders-chaos-space-marines-and-marauders-running-wild"
  },
  {
    "text": "Box Office: ‘Iron Lung’ Sinks the Competition With $8.9 Million; ‘Send Help’ Survives in Second Place - Variety",
    "fullText": "Mark 'Markiplier' Fischbach's indie horror 'Iron Lung' opened at No.1 on Friday.",
    "link": "https://variety.com/2026/film/box-office/box-office-iron-lung-send-help-melania-1236644154/"
  },
  {
    "text": "Astronomers spot 'time-warped' supernovas whose light both has and hasn't reached Earth - Live Science",
    "fullText": "Will two rare supernovas finally tell us how fast the universe is expanding? Perhaps, but we'll have to wait for it for them to 'reappear'.",
    "link": "https://www.livescience.com/space/cosmology/astronomers-spot-2-warped-supernovas-whose-light-both-has-and-hasnt-reached-earth"
  },
  {
    "text": "What South Carolina’s soaring measles outbreak means for the rest of the U.S. - The Washington Post",
    "fullText": "More than 840 measles infections have been reported in South Carolina, surpassing the tally in Texas last year. Public health experts say it shows the risks when vaccination coverage falls.",
    "link": "https://www.washingtonpost.com/health/2026/01/31/south-carolina-measles/"
  },
  {
    "text": "My 5 Favorite Ultra-High-Yield Dividend Stocks to Buy for 2026 - The Motley Fool",
    "fullText": "These monster dividend stocks yielding up to 7.7% are solid buys to generate steady income in 2026.",
    "link": "https://www.fool.com/investing/2026/01/31/my-5-favorite-ultra-high-yield-dividend-stocks-to/"
  }
]