[
  {
    "text": "Illinois 30-28 Tennessee (Dec 30, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778326"
  },
  {
    "text": "Trains crash while carrying tourists to Peru’s Machu Picchu, killing 1 person and injuring dozens - CNN",
    "fullText": "Two trains taking tourists to Peru’s famed archaeological site of Machu Picchu crashed on Tuesday, killing at least one person and injuring around 30 passengers.",
    "link": "https://www.cnn.com/2025/12/30/americas/peru-machu-picchu-train-crash-latam-intl"
  },
  {
    "text": "Trump sends ‘wartime prime minister’ Netanyahu back to Israel with a boost - The Washington Post",
    "fullText": "While meetings between the U.S. and Israeli leaders focused on pressing Middle East issues, for Prime Minister Netanyahu, they were also a domestic power play.",
    "link": "https://www.washingtonpost.com/world/2025/12/30/trump-netanyahu-iran-gaza/"
  },
  {
    "text": "Body found during search for missing 19-year-old Camila Mendoza Olmos, Bexar County sheriff says - KSAT",
    "fullText": "A body was found during the search for missing 19-year-old Camila Mendoza Olmos, Bexar County Sheriff Javier Salazar said Tuesday.",
    "link": "https://www.ksat.com/news/local/2025/12/31/body-found-during-search-for-missing-19-year-old-camila-mendoza-olmos-bexar-county-sheriff-says/"
  },
  {
    "text": "Kennedy Center exodus: The 11 acts, creators pulling out amid Trump takeover - Axios",
    "fullText": "A jazz ensemble and a New York dance company this week joined those canceling their events at the Kennedy Center.",
    "link": "https://www.axios.com/2025/12/30/new-years-2026-trump-kennedy-center"
  },
  {
    "text": "U.S. measles cases reach highest level in over 30 years, CDC reports - Axios",
    "fullText": "The U.S. will likely lose its globally recognized measles \"elimination status\" by Jan. 2026.",
    "link": "https://www.axios.com/2025/12/30/us-texas-measles-cases-cdc-vaccine-rfk-jr"
  },
  {
    "text": "Tatiana Schlossberg, journalist and granddaughter of JFK, dies at 35 - The Washington Post",
    "fullText": "In November, she announced her terminal cancer diagnosis in a New Yorker essay that took aim at one of her cousins, Health Secretary Robert F. Kennedy Jr.",
    "link": "https://www.washingtonpost.com/obituaries/2025/12/30/tatiana-schlossberg-dead/"
  },
  {
    "text": "Isiah Whitlock Jr., ‘The Wire’ and ‘Veep’ Actor, Dies at 71 - Variety",
    "fullText": "Isiah Whitlock Jr., a character actor best known for his roles in 'The Wire,' 'Veep' and several Spike Lee movies, has died. He was 71.",
    "link": "https://variety.com/2025/tv/news/isiah-whitlock-jr-dead-the-wire-veep-1236620750/"
  },
  {
    "text": "Premier League as it happened: Arsenal cruise to win over Villa - ESPN",
    "fullText": "Arsenal got a convincing win over Aston Villa to continue top of the Premier League table on a day full of exciting matches.",
    "link": "https://www.espn.com/soccer/story/_/id/47439115/premier-league-live-updates-chelsea-bournemouth-aston-villa-arsenal-man-united-wolverhampton-wanderers"
  },
  {
    "text": "SNAP bans on soda, candy and other foods take effect in five states Jan. 1 - ABC News",
    "fullText": "Americans in five states who get government help paying for groceries will see new limits starting Thursday on soda, candy and other foods they can buy with those benefits",
    "link": "https://abcnews.go.com/Politics/wireStory/snap-bans-soda-candy-foods-effect-states-jan-128784918"
  },
  {
    "text": "Flu cases are surging and rates will likely get worse, new CDC data shows - NPR",
    "fullText": "Flu season is off to a rough start this year, according to new CDC data. The virus is spreading faster than in previous years and the surge is likely to get worse. Here's what you need to know.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/30/nx-s1-5661508/flu-cdc-health"
  },
  {
    "text": "Disney to pay $10m over alleged children's privacy law violations - BBC",
    "fullText": "Regulators accused Disney of failing to properly label kids' videos uploaded to YouYube, allowing for data collection and targeted advertising.",
    "link": "https://www.bbc.com/news/articles/crrnl94lq5vo"
  },
  {
    "text": "Trump’s social-media company just launched five ‘Made in America’ ETFs - MarketWatch",
    "fullText": "Truth Social ETFs have unique holdings, but it’s unclear how much Trump’s policies will influence their performance",
    "link": "https://www.marketwatch.com/story/trump-media-just-launched-5-made-in-america-etfs-testing-whether-political-power-can-function-as-an-investable-theme-a959b3ca"
  },
  {
    "text": "A Deadly, Drug-Resistant Fungus Threatens People Around the World, Scientists Warn - Gizmodo",
    "fullText": "The global burden of Candida auris has been increasing since its discovery in 2009, a new review finds.",
    "link": "https://gizmodo.com/a-deadly-super-fungus-is-on-the-rise-scientists-warn-2000704305"
  },
  {
    "text": "Judge orders Trump administration to continue to seek funding for the CFPB - NPR",
    "fullText": "The order is the latest in a complex legal battle over the fate of the Consumer Financial Protection Bureau, a watchdog agency.",
    "link": "https://www.npr.org/2025/12/30/nx-s1-5661581/cfpb-funding-order"
  },
  {
    "text": "3 hikers found dead during search and rescue effort on Mount Baldy in California, authorities say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/3-hikers-found-dead-search-rescue-effort-mount/story?id\\\\u003d128787732"
  }
]