[
  {
    "text": "Samsung Confirms Galaxy S26 Ultra Unpacked: How To Claim Your $900 Discount - Forbes",
    "fullText": "The date and time of the next Galaxy Unpacked have been confirmed by Samsung with details of how to watch and early pre-order discounts.",
    "link": "https://www.forbes.com/sites/davidphelan/2026/02/14/galaxy-s26-ultra-release-date-samsung-confirms-event-and-pre-order-perks/"
  },
  {
    "text": "Valentine’s Day at the Winter Olympics might look a little different, but it’s still special - AP News",
    "fullText": "At the Milan Cortina Games, winning medals isn’t the only thing making hearts swell. From the ice arenas to the snowy hills, love is in the air. From blown kisses in the kiss-and-cry to surprise proposals and public confessions, Cupid is definitely in attenda…",
    "link": "https://apnews.com/article/valentines-day-olympics-couples-italy-3df73a6441a32cf45cbdd73ddb96c91c"
  },
  {
    "text": "Cheating claims, curse words fly in Olympic curling controversy - ESPN",
    "fullText": "The often-sedate world of curling has gotten heated at the Winter Olympics as cheating allegations and audible curse words overshadowed a feisty match between two of the best men's teams.",
    "link": "https://www.espn.com/olympics/story/_/id/47926795/cheating-claims-curse-words-fly-olympic-curling-controversy"
  },
  {
    "text": "After a 2-decade ban, kites fill Lahore's skies during a Pakistani springtime festival - NPR",
    "fullText": "People gathered on rooftops to enjoy flying kites for the first time in years, celebrating the spring festival of Basant. The activity had been banned due to injuries and deaths during past celebrations.",
    "link": "https://www.npr.org/2026/02/14/g-s1-109711/pakistan-basant-kites-spring-festival-lahore"
  },
  {
    "text": "ChatGPT promised to help her find her soulmate. Then it betrayed her - NPR",
    "fullText": "ChatGPT sent screenwriter Micky Small down a fantastical rabbit hole. Now, she's finding her way out.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5711441/ai-chatgpt-openai-love-betrayal-delusion-chatbot"
  },
  {
    "text": "Tahoe snowstorm could make travel ‘impossible,’ officials warn - San Francisco Chronicle",
    "fullText": "A major winter storm is expected to hit California on President's Day weekend, adding multiple feet of snow to ski resorts but potentially closing highways.",
    "link": "https://www.sfchronicle.com/weather/article/tahoe-winter-storm-21352647.php"
  },
  {
    "text": "The DJI Romo robovac had security so poor, this man remotely accessed thousands of them - The Verge",
    "fullText": "A man discovered that thousands of DJI Romo robot vacuums had a security issue that could have let strangers look into owners’ homes and remotely control them.",
    "link": "https://www.theverge.com/tech/879088/dji-romo-hack-vulnerability-remote-control-camera-access-mqtt"
  },
  {
    "text": "MAGA-world figures attack Pam Bondi over Epstein files - Axios",
    "fullText": "Influential right-wing figures say the Justice Department mishandled the case.",
    "link": "https://www.axios.com/2026/02/13/epstein-files-fracture-trump-coalition-bondi"
  },
  {
    "text": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel - CNBC",
    "fullText": "Cuba’s government appears to be on the brink of economic collapse amid a worsening energy crisis.",
    "link": "https://www.cnbc.com/2026/02/14/cuba-fuel-shortage-trump-tariffs.html"
  },
  {
    "text": "Cody Rhodes overcomes all the odds to keep his WrestleMania dream alive - Cageside Seats",
    "fullText": "Cody miraculously punches his ticket to WWE Elimination Chamber, in part because Sami Zayn is still a big loser.",
    "link": "https://www.cagesideseats.com/wwe/418084/cody-rhodes-qualifies-wwe-elimination-chamber-sami-zayn-jacob-fatu-drew-mcintyre-interference"
  },
  {
    "text": "Prime Minister Carney and Canada's main opposition leader hold hands during school shooting vigil - AP News",
    "fullText": "Canadian Prime Minister Mark Carney and the country’s opposition leaders paid tribute to the victims of one of the worst mass shootings in the country’s history at a vigil in the devastated northern British Columbia town. Carney and Conservative Opposition le…",
    "link": "https://apnews.com/article/canada-school-shooting-vigil-carney-7d2d2ec8e302befe808f822432ed9a03"
  },
  {
    "text": "3 grand slams in a game? Baylor slugger makes history - MLB.com",
    "fullText": "It wasn’t long into the 2026 college baseball season by the time Baylor’s Tyce Armstrong made some serious history.\nDuring the Bears’ season opener Friday against New Mexico State at Baylor Ballpark in Waco, Texas, Armstrong pulled off an amazing feat at the …",
    "link": "https://www.mlb.com/news/ncaa-tyce-armstrong-three-grand-slams-in-a-game"
  },
  {
    "text": "40 Epics Sales to Shop This President’s Day Weekend - Gear Patrol",
    "fullText": "Major brands are marking down gear, apparel, and home goods for the long weekend — here are the sales worth your time.",
    "link": "https://www.gearpatrol.com/deals/best-presidents-day-weekend-sales-2026/"
  },
  {
    "text": "WWE SmackDown Spoiler Lineup for February 13, 2026: Full Match Card and Backstage Notes Revealed - Ringside News",
    "fullText": "WWE SmackDown is set to deliver an exciting night of action on February 13, 2026 with a lineup featuring thrilling matches and intense rivalries. Fans can",
    "link": "https://www.ringsidenews.com/wwe-smackdown-spoiler-lineup-february-13-2026-full-match-card-backstage-notes-revealed/"
  },
  {
    "text": "Trump reveals US helicopter pilots were wounded in Maduro raid - Military Times",
    "fullText": "The president also said one of the soldiers who helped capture Maduro will receive the Medal of Honor.",
    "link": "https://www.militarytimes.com/news/pentagon-congress/2026/02/13/trump-reveals-us-helicopter-pilots-were-wounded-in-maduro-raid/"
  },
  {
    "text": "WHO slams US-funded newborn vaccine trial as \"unethical\" - Ars Technica",
    "fullText": "CDC awarded $1.6 million for study birth dose of hepatitis B vaccine in Guinea-Bissau.",
    "link": "https://arstechnica.com/health/2026/02/who-slams-us-funded-newborn-vaccine-trial-as-unethical/"
  },
  {
    "text": "NBA All-Star 2026: Live updates, highlights through the weekend - ESPN",
    "fullText": "All of the live updates, top moments and results from NBA All-Star 2026 weekend in Los Angeles.",
    "link": "https://www.espn.com/nba/story/_/id/47900664/nba-all-star-weekend-2026-live-updates-results-highlights"
  }
]