[
  {
    "text": "Miami's Lewis encourages Lacy, resilient Rebels - ESPN",
    "fullText": "Hurricanes great Ray Lewis pulled Ole Miss running back Kewan Lacy aside after Thursday night's CFP semifinal, offering advice that reinforced the values of a Rebels team that never quit.",
    "link": "https://www.espn.com/college-football/story/_/id/47557832/miami-great-lewis-offers-encouragement-ole-miss-rb-lacy"
  },
  {
    "text": "Filipino Catholics express outrage over corruption scandal during massive religious procession - AP News",
    "fullText": "A massive crowd of mostly barefoot Filipino Catholics is joining an annual procession of a centuries-old statue of Jesus Christ in the Philippine capital, with some using the gathering to express outrage over a corruption scandal involving influential legisla…",
    "link": "https://apnews.com/article/philippines-black-nazarene-procession-161e06056084744f502169ffb72e5d13"
  },
  {
    "text": "CES 2026: Would you spend $9K on this OLED smart purse? - Mashable",
    "fullText": "Check out the handbag for the elite who want something that no one else has.",
    "link": "https://mashable.com/article/ces-2026-infinity-by-peuty-smart-oled-handbag"
  },
  {
    "text": "J&J strikes deal with US government to cut drug prices, gain tariff exemptions - CNBC",
    "fullText": "Johnson & Johnson said on Thursday that it reached an ⁠agreement with the Trump administration to cut drug prices in ‍exchange for ‍tariff exemptions.",
    "link": "https://www.cnbc.com/2026/01/09/johnson-johnson-strikes-deal-with-us-government-to-lower-drug-prices.html"
  },
  {
    "text": "Michigan State 76-66 Northwestern (Jan 8, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401825428"
  },
  {
    "text": "Fire Emblem: Path of Radiance comes to Nintendo Classics! – News – Nintendo Official Site - Nintendo",
    "fullText": "Play Fire Emblem: Path of Radiance and rediscover curated Nintendo classics with a Nintendo Switch Online + Expansion Pack membership!",
    "link": "https://www.nintendo.com/us/whatsnew/fire-emblem-path-of-radiance-comes-to-nintendo-classics/"
  },
  {
    "text": "Hochul and Mamdani to unveil free child care plan in New York City - abcnews.go.com",
    "fullText": "New York City parents may soon have access to free child care for their 2-year-olds, under a plan set to be unveiled by Gov. Kathy Hochul and Mayor Zohran Mamdani",
    "link": "https://abcnews.go.com/Business/wireStory/hochul-mamdani-unveil-free-child-care-plan-new-129013299"
  },
  {
    "text": "Season Start: For Demacia! Emote Twitch Drops - League of Legends",
    "fullText": "All the information you need to know to start the season right with Demacia inspired Twitch drops.",
    "link": "https://www.leagueoflegends.com/en-us/news/game-updates/season-start-for-demacia-emote-twitch-drops/"
  },
  {
    "text": "Bear removed after living underneath Altadena home for months - ABC7 Los Angeles",
    "fullText": "The bear that's been living underneath an Altadena home for almost two months has been removed.",
    "link": "https://abc7.com/post/bear-removed-living-underneath-altadena-home-months/18374455/"
  },
  {
    "text": "Sarah Jessica Parker, Helen Mirren honored at Golden Eve celebration - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/sarah-jessica-parker-dame-helen-mirren-honored-golden-eve/story?id\\\\u003d128960856"
  },
  {
    "text": "Doctors says ‘The Pitt’ reflects the gritty realities of medicine today - NPR",
    "fullText": "The Pitt is back for a new run, evoking the tensions health care providers face in the U.S. today. Here's what one doctor says to watch out for this season.",
    "link": "https://www.npr.org/2026/01/08/nx-s1-5671156/pitt-season-2-tv-show-medicine"
  },
  {
    "text": "Past/Present: Witten to join OU coaching staff - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "Jason Witten is expected to reunite with DeMarco Murray on the OU coaching staff.",
    "link": "https://www.dallascowboys.com/news/past-present-witten-to-join-ou-coaching-staff"
  },
  {
    "text": "Dark stars could help solve three pressing puzzles of the high-redshift universe - Phys.org",
    "fullText": "A recent study provides answers to three seemingly disparate yet pressing cosmic dawn puzzles. Specifically, the authors show how dark stars could help explain the unexpected discovery of \"blue monster\" galaxies, the numerous early overmassive black hole gala…",
    "link": "https://phys.org/news/2026-01-dark-stars-puzzles-high-redshift.html"
  },
  {
    "text": "First galaxy-wide wobbling black hole jet discovered in a disk galaxy - Phys.org",
    "fullText": "Astronomers using W. M. Keck Observatory on Maunakea, Hawaiʻi Island have uncovered the largest and most extended stream of super-heated gas ever observed flowing from a nearby galaxy, providing the clearest evidence yet that a supermassive black hole can dra…",
    "link": "https://phys.org/news/2026-01-galaxy-wide-black-hole-jet.html"
  },
  {
    "text": "The Official Website of Governor Phil Murphy - NJ.gov",
    "fullText": "The official website of the 56th Governor of New Jersey State, Phil Murphy.",
    "link": "https://www.nj.gov/governor/news/news/562026/approved/20260108a.shtml"
  },
  {
    "text": "How the Sphere Morphed Into an Interactive Lego Death Star - The Hollywood Reporter",
    "fullText": "Lego and Lucasfilm turned the Las Vegas landmark into the Death Star, letting visitors get into a full-size Lego X-Wing to try and tackle the trench run.",
    "link": "http://www.hollywoodreporter.com/business/business-news/sphere-star-wars-lego-death-star-activation-1236467061/"
  },
  {
    "text": "Former GLP-1 users regain lost weight after about 18 months, study says - The Washington Post",
    "fullText": "Those quitting Ozempic, Wegovy and other drugs regained weight four times faster than those using just diet and exercise, still key components in weight maintenance.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/08/ozempic-wegovy-weight-regain-glp1/"
  },
  {
    "text": "IRS announces first day of 2026 filing season; online tools and resources help with tax filing - IRS (.gov)",
    "fullText": "IR-2026-02, Jan. 8, 2026 — The Internal Revenue Service announced Monday, January 26, 2026, as the opening of the nation’s 2026 filing season. This year, several new tax law provisions of the One, Big, Beautiful Bill become effective, which could impact feder…",
    "link": "https://www.irs.gov/newsroom/irs-announces-first-day-of-2026-filing-season-online-tools-and-resources-help-with-tax-filing"
  },
  {
    "text": "CES 2026: Hyundai Motor Group leverages Group capabilities to lead the AI Robotics industry - hyundai.com",
    "fullText": "At the CES 2026, Hyundai presented its vision for the future where AI robotics empowers \npeople and production.",
    "link": "https://www.hyundai.com/worldwide/en/brand-journal/mobility-solution/ces-2026-robotics-mediaday"
  }
]