[
  {
    "text": "Stock futures are little changed ahead of jobs report, potential tariff ruling: Live updates - CNBC",
    "fullText": "Traders looked ahead to December's nonfarm payrolls report and awaited a potential Supreme Court ruling on Trump's tariffs.",
    "link": "https://www.cnbc.com/2026/01/08/stock-market-today-live-updates.html"
  },
  {
    "text": "Scientists find new clues to why female fertility declines with age - The Washington Post",
    "fullText": "New studies are shedding light on one of the biggest mysteries of human reproduction and what can be done to combat it.",
    "link": "https://www.washingtonpost.com/health/2026/01/09/ivf-fertility-aging-eggs/"
  },
  {
    "text": "Iran’s supreme leader says protesters are ‘ruining their own streets’ to please Trump - AP News",
    "fullText": "Iran's judiciary chief has vowed decisive punishment for protesters, signaling a coming crackdown against demonstrations. Iranian state television reported the comments from Gholamhossein Mohseni-Ejei on Friday. They came after Supreme Leader Ayatollah Ali Kh…",
    "link": "https://apnews.com/article/iran-protests-us-israel-war-economy-54e4024a0b9e6a9f3ab49153c8e28f05"
  },
  {
    "text": "Many Americans say the U.S. is not a moral leader but want it to be: NPR/Ipsos poll - NPR",
    "fullText": "Commissioned by NPR in partnership with Ipsos, the poll also highlights sharp partisan divides on key foreign policy issues.",
    "link": "https://www.npr.org/2026/01/09/nx-s1-5671094/npr-ipsos-us-opinion-poll-foreign-affairs"
  },
  {
    "text": "Your next primary care doctor could be online only, accessed through an AI tool : Shots - Health News - NPR",
    "fullText": "The shortage of primary care doctors is a national problem. To cope, a large health system in Massachusetts is using an AI tool to screen patients and refer them to other care.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5670382/primary-care-doctor-shortage-medical-ai-diagnosis"
  },
  {
    "text": "Nvidia’s Go-To Chipmaker TSMC Sees Revenue Top Estimates - Yahoo Finance",
    "fullText": "The go-to chipmaker for Nvidia Corp. reported a roughly 20% rise in December-quarter revenue to NT$1.05 trillion ($33.1 billion), based on calculations off...",
    "link": "https://finance.yahoo.com/news/nvidia-chipmaker-tsmc-sees-revenue-053720561.html"
  },
  {
    "text": "Elon Musk's Grok AI image editing limited to paid users after deepfakes - BBC",
    "fullText": "It comes after government urged Ofcom to use all its powers – up to and including an effective ban – against X.",
    "link": "https://www.bbc.com/news/articles/c99kn52nx9do"
  },
  {
    "text": "Miami's Lewis encourages Lacy, resilient Rebels - ESPN",
    "fullText": "Hurricanes great Ray Lewis pulled Ole Miss running back Kewan Lacy aside after Thursday night's CFP semifinal, offering advice that reinforced the values of a Rebels team that never quit.",
    "link": "https://www.espn.com/college-football/story/_/id/47557832/miami-great-lewis-offers-encouragement-ole-miss-rb-lacy"
  },
  {
    "text": "Shale chiefs warn Trump that Venezuelan oil will hobble US drillers - Financial Times",
    "fullText": "President’s effort to drive down crude prices will hit sector struggling to sustain output growth",
    "link": "https://www.ft.com/content/f498bdcb-c5df-4b10-a390-7b61adb140e4"
  },
  {
    "text": "5 blue states sue Trump admin over $10 billion child care funding freeze - Axios",
    "fullText": "The states say the administration cut off the money without evidence, without due process and without legal authority.",
    "link": "https://www.axios.com/2026/01/09/trump-child-care-funding-freeze-lawsuit-five-blue-states"
  },
  {
    "text": "Season Start: For Demacia! Emote Twitch Drops - League of Legends",
    "fullText": "All the information you need to know to start the season right with Demacia inspired Twitch drops.",
    "link": "https://www.leagueoflegends.com/en-us/news/game-updates/season-start-for-demacia-emote-twitch-drops/"
  },
  {
    "text": "Sarah Jessica Parker, Helen Mirren honored at Golden Eve celebration - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/sarah-jessica-parker-dame-helen-mirren-honored-golden-eve/story?id\\\\u003d128960856"
  },
  {
    "text": "100 skulls and mummified body parts found in a Pennsylvania grave robbery case, police say - abcnews.go.com",
    "fullText": "Police say a Pennsylvania man who had about 100 sets of human remains is charged with stealing from a graveyard at the edge of Philadelphia",
    "link": "https://abcnews.go.com/US/wireStory/100-skulls-mummified-body-parts-found-pennsylvania-grave-129037831"
  },
  {
    "text": "Your Zodiac Sign's Tarot Horoscope For January 9 Reveals What You Need To Know About Friday - YourTango",
    "fullText": "Each zodiac sign's daily tarot horoscope for Friday, January 9, 2026, during the Sun conjunct Mars in Capricorn transit. The collective tarot card is the Emperor.",
    "link": "https://www.yourtango.com/2026393615/tarot-horoscopes-friday-january-9-2026"
  },
  {
    "text": "Doctors says ‘The Pitt’ reflects the gritty realities of medicine today - NPR",
    "fullText": "The Pitt is back for a new run, evoking the tensions health care providers face in the U.S. today. Here's what one doctor says to watch out for this season.",
    "link": "https://www.npr.org/2026/01/08/nx-s1-5671156/pitt-season-2-tv-show-medicine"
  },
  {
    "text": "GeForce RTX 50 SUPER release reportedly put on hold - VideoCardz.com",
    "fullText": "NVIDIA RTX 50 SUPER indefinitely delayed NVIDIA has reportedly briefed AIB partners about a change of plans for the GeForce RTX 50 SUPER refresh. The post",
    "link": "https://videocardz.com/newz/geforce-rtx-50-super-release-reportedly-put-on-hold"
  }
]