[
  {
    "text": "6 skiers rescued, 9 still missing after avalanche near Lake Tahoe - San Francisco Chronicle",
    "fullText": "Rescuers reached six survivors after an avalanche near Lake Tahoe, but nine skiers remain missing amid severe Sierra storm conditions.",
    "link": "https://www.sfchronicle.com/california/article/california-avalanche-missing-skiers-21358994.php"
  },
  {
    "text": "Christine Lagarde to leave ECB before the end of her 8-year term - Financial Times",
    "fullText": "Central banker wants to give Macron and Merz chance to pick successor before French presidential election",
    "link": "https://www.ft.com/content/30bcb221-700e-4643-9ed5-dd9432c5be7c"
  },
  {
    "text": "Asia stocks rise as tech recoups some AI-fueled losses - Investing.com",
    "fullText": "Asia stocks rise as tech recoups some AI-fueled losses",
    "link": "https://www.investing.com/news/stock-market-news/asia-stocks-rise-as-tech-recoups-some-aifueled-losses-4510018"
  },
  {
    "text": "Two Changes Made To Current WWE Championship? - WrestleTalk",
    "fullText": "Two changes have seemingly been made to a current WWE Championship ahead of an upcoming title match next week.",
    "link": "https://wrestletalk.com/news/two-changes-made-wwe-championship/"
  },
  {
    "text": "U.S. offers more details on claim China conducted secret nuclear weapons test - The Washington Post",
    "fullText": "Remarks by a top administration official appeared to be aimed at dispelling skepticism of its assertions, as President Donald Trump vows to restart U.S. tests.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/china-nuclear-test-trump/"
  },
  {
    "text": "7 takeaways from No. 1 Michigan Basketball’s win at No. 7 Purdue - Maize n Brew",
    "fullText": "No. 1 Michigan Basketball picked up a massive 91-80 win at No. 7 Purdue. Here are 7 takeaways from the road victory:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/106473/michigan-basketball-takeaways-purdue-yaxel-lendeborg-elliot-cadeau-dusty-may"
  },
  {
    "text": "Governor says tax must return revenue to families, rejects income tax under $1M - KOMO",
    "fullText": "While he said the bill is moving in the right direction, he stressed it is not ready.",
    "link": "https://komonews.com/news/local/governor-more-revenue-to-taxpayers-via-millionaires-tax"
  },
  {
    "text": "Microsoft confirms new Windows 11 feature drop coming next month - Windows Central",
    "fullText": "Windows 11's latest Release Preview Channel update has given us our first look at Microsoft's next feature drop for the OS that's expected to begin rolling out imminently.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-next-windows-11-feature-drop-with-new-taskbar-emoji-and-settings-updates-heres-whats-coming-to-your-pc-very-soon"
  },
  {
    "text": "Japanese PM Takaichi's cabinet resigns - China Daily",
    "fullText": null,
    "link": "https://www.chinadaily.com.cn/a/202602/18/WS69950c60a310d6866eb398be.html"
  },
  {
    "text": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "fullText": "Tricia McLaughlin is leaving just over a year into Homeland Security Secretary Kristi L. Noem’s tenure leading the department.",
    "link": "https://www.washingtonpost.com/immigration/2026/02/17/tricia-mclaughlin-leaves-dhs/"
  },
  {
    "text": "Samsung Promotes New Features Ahead Of Galaxy S26 Ultra Launch - Forbes",
    "fullText": "Ahead of Galaxy Unpacked and the launch of the Galaxy S26 Ultra, Samsung has teased a new feature that will help the new flagship stand out against the competition.",
    "link": "https://www.forbes.com/sites/ewanspence/2026/02/17/samsung-galaxy-s26-ultra-new-features-upgrade-privacy-display/"
  },
  {
    "text": "NZ: OCR on hold at 2.25% with inflation expected to fall - Forex Factory",
    "fullText": "Annual consumers price inflation was slightly above the Monetary Policy Committee’s 1 to 3 percent target band at the end of 2025. Increases in food and electricity prices and local council rates were the biggest contributors to above-target inflation. The ec…",
    "link": "https://www.forexfactory.com/news/1384446-nz-ocr-on-hold-at-225-with-inflation"
  },
  {
    "text": "Bird flu suspected as dead geese are found at multiple parks across New Jersey, officials say - NJ.com",
    "fullText": "The cause of the geese deaths is suspected to be bird flu, officials said.",
    "link": "https://www.nj.com/news/2026/02/bird-flu-suspected-as-dead-geese-are-found-at-multiple-parks-across-new-jersey-officials-say.html"
  },
  {
    "text": "Sweden to face U.S. in men's hockey quarterfinals at Olympics - ESPN",
    "fullText": "Sweden avoided an early exit in this year's Winter Olympics, beating Latvia 5-1 to set up a quarterfinal matchup vs. the United States.",
    "link": "https://www.espn.com/olympics/story/_/id/47958703/sweden-face-us-men-hockey-quarterfinals-olympics"
  },
  {
    "text": "Health officials warn of possible measles exposure at St. Louis Lambert Airport, Collinsville church - STLPR",
    "fullText": "An individual with a confirmed measles case was in the airport on Feb. 7. Meanwhile, Illinois health officials say the same person may have exposed people at Good Shepherd Lutheran Church in Collinsville.",
    "link": "https://www.stlpr.org/health-science-environment/2026-02-17/possible-measles-exposure-at-st-louis-lambert-airport-collinsville-church"
  },
  {
    "text": "Exclusive / Palantir partnership is at heart of Anthropic, Pentagon rift - Semafor",
    "fullText": "The roots of the conflict point to the changing nature of software stacks as top officials push to modernize the military.",
    "link": "https://www.semafor.com/article/02/17/2026/palantir-partnership-is-at-heart-of-anthropic-pentagon-rift"
  },
  {
    "text": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy - CNN",
    "fullText": "Iranian and American negotiators departed their indirect talks in Geneva with an agreement to keep talking, doing little to ease fears of an impending regional war.",
    "link": "https://www.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy"
  },
  {
    "text": "Here’s how much snow the Sierra got this weekend — and how much is on the way - San Francisco Chronicle",
    "fullText": "Some California ski resorts tallied feet of snow over the past two days. More is coming.",
    "link": "https://www.sfchronicle.com/weather/article/sierra-snow-lake-tahoe-21358405.php"
  },
  {
    "text": "Astronomers may have just found one of the missing links in galaxy evolution - Phys.org",
    "fullText": "A team of 48 astronomers from 14 countries, led by the University of Massachusetts Amherst, has discovered a population of dusty, star-forming galaxies at the far edges of the universe that formed only a billion years after the Big Bang, believed to have occu…",
    "link": "https://phys.org/news/2026-02-astronomers-links-galaxy-evolution.html"
  }
]