[
  {
    "text": "The most fascinating monitors at CES 2026 - Ars Technica",
    "fullText": "Big sizes, big resolution, and big ideas.",
    "link": "https://arstechnica.com/gadgets/2026/01/the-most-fascinating-monitors-at-ces-2026/"
  },
  {
    "text": "Jersey Mike's strikes European expansion deal led by founder Peter Cancro - CNBC",
    "fullText": "Jersey Mike's plans to open 400 stores in the U.K. and Ireland, with more locations to follow in Europe.",
    "link": "https://www.cnbc.com/2026/01/12/jersey-mikes-european-expansion-peter-cancro.html"
  },
  {
    "text": "AI can now 'see' optical illusions. What does it tell us about our own brains? - BBC",
    "fullText": "Our eyes can frequently play tricks on us, but scientists have discovered that some artificial intelligence can fall for the same illusions.",
    "link": "https://www.bbc.com/future/article/20251218-how-ai-is-shedding-new-light-on-optical-illusions"
  },
  {
    "text": "Exercise is as effective as medication in treating depression, study finds - NPR",
    "fullText": "New research shows exercise is as effective as medication at reducing symptoms of depression. And you don't need to run a marathon to see benefits. So how much is enough?",
    "link": "https://www.npr.org/2026/01/12/nx-s1-5667599/exercise-is-as-effective-as-medication-in-treating-depression-study-finds"
  },
  {
    "text": "Iran protests: Tehran ready for 'war and dialogue' with US - DW",
    "fullText": "Iran has responded to threats from the US, saying it is ready for war but will also seek dialogue. Meanwhile, German Chancellor Merz has called on the regime to end the violence against its people. DW has more.",
    "link": "https://www.dw.com/en/iran-protests-tehran-ready-for-war-and-dialogue-with-us/live-75471666"
  },
  {
    "text": "Breaking | China, EU reach deal on electric vehicle tariffs after lengthy negotiations - South China Morning Post",
    "fullText": "Breakthrough follows duties levied by Brussels in October 2024 as part of investigation into industry subsidies.",
    "link": "https://www.scmp.com/economy/global-economy/article/3339588/china-eu-reach-deal-electric-vehicle-tariffs-after-lengthy-negotiations"
  },
  {
    "text": "Horoscope for Monday, January 12, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/12/horoscopes-today-monday-january-12-2026"
  },
  {
    "text": "NFL Divisional Round: Biggest immediate question for advancing/eliminated playoff teams - NFL.com",
    "fullText": "In this edition of The First Read, Jeffri Chadiha reveals the most pressing question for each of the NFL teams that advanced to the Divisional Round and each of the squads that lost on Wild Card Weekend.",
    "link": "https://www.nfl.com/news/nfl-divisional-round-biggest-immediate-question-for-advancing-eliminated-playoff-teams-x3405"
  },
  {
    "text": "Gold, silver hit record highs on safe-haven demand, Fed rate-cut bets - CNBC",
    "fullText": "Gold ⁠prices surged about 2% to an all-time high of $4,600 per ounce on Monday, while silver ‍also set a new record.",
    "link": "https://www.cnbc.com/2026/01/12/gold-silver-hit-record-highs-on-safe-haven-demand-fed-rate-cut-bets.html"
  },
  {
    "text": "Autism advocates celebrate release of ‘magical’ first-ever Barbie on the spectrum - CNN",
    "fullText": "The new doll carries a pink fidget spinner that actually spins, wears pink noise-cancelling headphones to reduce sensory overload and holds a pink tablet that represents her augmentative and alternative communication, or AAC, device.",
    "link": "https://www.cnn.com/2026/01/12/health/autism-barbie-doll-wellness"
  },
  {
    "text": "Golden Globes 2026 Winners: ‘One Battle After Another’ Earns 4 Awards, ‘Adolescence’ Leads TV - Variety",
    "fullText": "See the winners of the Golden Globes 2026 awards, including 'One Battle After Another' which won four awards.",
    "link": "https://variety.com/lists/golden-globes-2026-winners-one-battle-after-another/"
  },
  {
    "text": "SEPTA Regional Rail's morning express service will resume Monday - 6abc Philadelphia",
    "fullText": "SEPTA resumed services Monday for thousands of riders who take regional rail morning express from the suburbs to Philadelphia and T-trolley routes through the Center City trolley tunnel.",
    "link": "https://6abc.com/post/septa-regional-rails-morning-express-service-will-resume-monday/18389196/"
  },
  {
    "text": "Timberwolves 104-103 Spurs (Jan 11, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810407"
  },
  {
    "text": "Trump Says He May Veto Extension of Health Care Subsidies - Bloomberg.com",
    "fullText": "President Donald Trump said Sunday he may veto a bill to extend Obamacare subsidies if Congress sent one to his desk.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-12/trump-says-he-may-veto-extension-of-health-care-subsidies"
  },
  {
    "text": "Chaos erupts as U-Haul drives into crowd during anti-Iranian regime rally in Westwood - ABC7 Los Angeles",
    "fullText": "Chaos erupted after a U-Haul drove into a crowd during an anti-Iranian regime rally near the federal building in Westwood on Sunday afternoon.",
    "link": "https://abc7.com/post/haul-drives-crowd-during-anti-iranian-regime-rally-westwood-lapd-says/18388519/"
  },
  {
    "text": "49ers Set to Face the Seattle Seahawks in Divisional Round - 49ers.com",
    "fullText": "The San Francisco 49ers will continue their postseason run on the road against the Seattle Seahawks for the NFC Divisional Round.",
    "link": "https://www.49ers.com/news/49ers-set-to-face-the-seattle-seahawks-in-divisional-round"
  },
  {
    "text": "Australia social media ban: Meta blocks 550,000 accounts under new law - BBC",
    "fullText": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
    "link": "https://www.bbc.com/news/articles/cpqye2yygl4o"
  }
]