[
  {
    "text": "Brewers Trade Freddy Peralta To Mets - MLB Trade Rumors",
    "fullText": "Freddy Peralta is a New York Met. Read up on the blockbuster move and all its implications at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-trade-for-freddy-peralta.html"
  },
  {
    "text": "Democrats seek to block Homeland Security funding over ICE concerns - The Washington Post",
    "fullText": "The spending bill is set for a vote Thursday, and it’s not clear if it will have enough support to pass.",
    "link": "https://www.washingtonpost.com/politics/2026/01/21/democrats-try-block-ice-funding/"
  },
  {
    "text": "Former CIA chief: Actions of the Iranian regime not sustainable, Iran in very difficult situatiion - jpost.com",
    "fullText": "Citing recent degradations of Iran’s proxies, such as Hezbollah, Hamas, and the Assad regime, Petraeus labeled the past year as “very very damaging” to Iran.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-884113"
  },
  {
    "text": "Knicks end 4-game skid with blowout home win against Nets - ESPN",
    "fullText": "The Knicks ended their four-game losing streak Wednesday night with the most lopsided victory in franchise history, beating the Nets 120-66.",
    "link": "https://www.espn.com/nba/story/_/id/47688765/knicks-end-4-game-skid-blowout-home-win-nets"
  },
  {
    "text": "Mysterious Giants Could Be a Whole New Kind of Life That No Longer Exists - ScienceAlert",
    "fullText": "Ever since their discovery more than 165 years ago, massive fossilized structures left by an organism known as Prototaxites have proven impossible to categorize.",
    "link": "https://www.sciencealert.com/mysterious-giants-could-be-a-whole-new-kind-of-life-that-no-longer-exists"
  },
  {
    "text": "Supreme Court appears likely to allow Lisa Cook to remain on Fed board - The Washington Post",
    "fullText": "Such a decision, which would hold while a lawsuit challenging her removal plays out, would prevent Trump from exerting greater influence over the powerful central bank.",
    "link": "https://www.washingtonpost.com/politics/2026/01/21/fed-lisa-cook-supreme-court-trump/"
  },
  {
    "text": "Autopsy report classifies ICE detainee’s death as a homicide - The Washington Post",
    "fullText": "The report deeming an ICE detainee’s death in Texas a homicide comes the same day that a federal judge temporarily barred the deportation of two witnesses.",
    "link": "https://www.washingtonpost.com/business/2026/01/21/ice-homicide-detainee-death-autopsy/"
  },
  {
    "text": "Exclusive | The U.S. Is Actively Seeking Regime Change in Cuba by the End of the Year - WSJ - The Wall Street Journal",
    "fullText": "After ousting Venezuela’s leader, the Trump administration is searching for Havana insiders who could cut a deal to end Communist rule",
    "link": "https://www.wsj.com/world/americas/the-u-s-is-actively-seeking-regime-change-in-cuba-by-the-end-of-the-year-1d0f178a"
  },
  {
    "text": "Lucas: Notre Dame Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the last home game of the month.",
    "link": "https://goheels.com/news/2026/1/21/mens-basketball-lucas-notre-dame-rapid-reactions"
  },
  {
    "text": "Fernando Mendoza Updates LinkedIn Bio After Indiana's CFP Title, Writes Inspirational Post - Bleacher Report",
    "fullText": "Fernando Mendoza is probably a few months away from being the top overall pick in the 2026 NFL draft. But that doesn't mean he's above updating... his LinkedIn profile.",
    "link": "https://bleacherreport.com/articles/25365668-fernando-mendoza-updates-linkedin-bio-after-indianas-cfp-title-writes-inspirational-post"
  },
  {
    "text": "Winter storm this weekend: Snowstorm set to hit the Philadelphia region, with potential for icy mix | Live Updates - 6abc.com",
    "fullText": "It's looking more likely that there will be a significant snowstorm in the Philadelphia region this weekend.",
    "link": "https://6abc.com/live-updates/winter-storm-weekend-snowstorm-set-hit-philadelphia-region-potential-icy-mix-live-updates/18444689/"
  },
  {
    "text": "Thurston County reports first flu-related death as state sees sharp rise in cases - komonews.com",
    "fullText": "PHSS said each year, hundreds of thousands of people in the United States are hospitalized with flu-related illnesses.",
    "link": "https://komonews.com/news/local/thurston-county-influenza-related-death-washington-state-death-flu-related-symptoms-phss-washington-state-department-of-health-statewide-illness"
  },
  {
    "text": "2027 Volvo EX60 Revealed: Long Range, Fast Charging, And A Tesla Port - Motor1.com",
    "fullText": "The Volvo EX60 is officially here with up to 400 miles of range and a native NACS port. It adds 173 miles after 10 minutes of charging.",
    "link": "https://www.motor1.com/news/785028/volvo-ex60-revealed-specs-photos/"
  },
  {
    "text": "Canada’s prime minister just declared the end of the world as we know it - vox.com",
    "fullText": "Canadian Prime Minister Mark Carney’s historic speech, explained.",
    "link": "https://www.vox.com/today-explained-newsletter/475992/canada-mark-carney-davos-speech"
  },
  {
    "text": "Israel kills 3 journalists in Gaza, including CBS News contributor - The Washington Post",
    "fullText": "The journalists were killed Wednesday in a strike on their car in central Gaza. Israel’s military said it struck “several suspects” who were operating a drone.",
    "link": "https://www.washingtonpost.com/world/2026/01/21/israel-strike-journalists-gaza-cbs-news/"
  },
  {
    "text": "Final Oscar Nominations Predictions via Feinberg Forecast - hollywoodreporter.com",
    "fullText": "The Hollywood Reporter's executive editor of awards coverage projects that the field will be led by 'Sinners' (with a record-breaking 15 noms), 'One Battle After Another' (12), Frankenstein (11) and 'Hamnet' (11).",
    "link": "http://www.hollywoodreporter.com/lists/final-oscar-nominations-predictions-feinberg-forecast/"
  },
  {
    "text": "Clair Obscur: Expedition 33 leads resist calls to \"scale up,\" insist they \"love making games more than managing\" - GamesIndustry.biz",
    "fullText": "Clair Obscur: Expedition 33 developer Sandfall Interactive is resisting calls to \"scale up now [it has] a lot more mone…",
    "link": "https://www.gamesindustry.biz/clair-obscur-expedition-33-leads-resist-calls-to-scale-up-insist-they-love-making-games-more-than-managing"
  },
  {
    "text": "The Beauty Cast: Ashton Kutcher, Evan Peters, Bella Hadid & More - hollywoodreporter.com",
    "fullText": "The FX show, adapted by Murphy and longtime collaborator Matt Hodgson from the comic book, explores the extremes people will go to achieve perfection — with a star-studded cast.",
    "link": "http://www.hollywoodreporter.com/lists/the-beauty-cast-ashton-kutcher-evan-peters-bella-hadid/"
  },
  {
    "text": "Apple to Revamp Siri as a Built-In iPhone, Mac Chatbot to Fend Off OpenAI - Bloomberg.com",
    "fullText": "Apple Inc. plans to revamp Siri later this year by turning the digital assistant into the company’s first artificial intelligence chatbot, thrusting the iPhone maker into a generative AI race dominated by OpenAI and Google.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-21/ios-27-apple-to-revamp-siri-as-built-in-iphone-mac-chatbot-to-fend-off-openai"
  },
  {
    "text": "Valentino’s Greatest Design Moments - The Cut",
    "fullText": "The late designer, who passed away over the weekend at 93, was the stars’ go-to dressmaker for decades.",
    "link": "https://www.thecut.com/article/valentino-garavani-greatest-design-moments-death.html"
  }
]