[
  {
    "text": "Derrick Henry Has a Historic Game in Green Bay - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Ravens RB Derrick Henry rolled for four touchdowns and a season-high 216 yards in the Ravens' win over the Packers.",
    "link": "https://www.baltimoreravens.com/news/derrick-henry-ravens-monster-first-half-green-bay-three-touchdowns"
  },
  {
    "text": "Indonesian rescuers search for Spanish soccer coach and 3 children after tour boat sinks - CNN",
    "fullText": "Indonesian rescuers searched for a Spanish soccer coach and his three children on Saturday after a tour boat carrying 11 people sank overnight near Padar Island, a popular destination within Komodo National Park, officials said.",
    "link": "https://www.cnn.com/2025/12/27/asia/spanish-family-boat-sinks-indonesia-intl-hnk"
  },
  {
    "text": "EU backs Somalia after Israel recognizes Somaliland - DW",
    "fullText": "Israel’s support for Somaliland has triggered sharp pushback across Africa, the Middle East and beyond, with the EU urging calm and Somalia vowing to defend its sovereignty.",
    "link": "https://www.dw.com/en/eu-backs-somalia-after-israel-recognizes-somaliland/a-75318108"
  },
  {
    "text": "Newark Airport passenger may have exposed others to measles, New Jersey Health Department says - ABC7 New York",
    "fullText": "New Jersey's Health Department says someone with the disease passed through the airport on Friday, December 19.",
    "link": "https://abc7ny.com/post/newark-airport-passenger-may-have-exposed-others-measles-new-jersey-health-department-says/18325181/"
  },
  {
    "text": "Dark Energy may be changing and with it the fate of the Universe - BBC",
    "fullText": "A mysterious force called Dark Energy might be changing, in a way that challenges our current understanding of the nature of time and space.",
    "link": "https://www.bbc.com/news/articles/c17xe5kl78vo"
  },
  {
    "text": "Texans beat Chargers 20-16 to clinch a playoff berth - NBC Sports",
    "fullText": null,
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/texans-beat-chargers-20-16-to-clinch-a-playoff-berth"
  },
  {
    "text": "Broncos win AFC West for first time since 2015 - The Denver Post",
    "fullText": "The Broncos won the AFC West on Saturday when Houston beat the L.A. Chargers, ending a decade-long drought and securing at least one home playoff game next month. Denver will play for the No. 1 see…",
    "link": "https://www.denverpost.com/2025/12/27/broncos-win-afc-west-title-first-since-2015/"
  },
  {
    "text": "Jeffrey R. Holland, next in line to lead Church of Jesus Christ of Latter-day Saints, dies at 85 - AP News",
    "fullText": "Jeffrey R. Holland, a senior official in the Church of Jesus Christ of Latter-day Saints, has died at 85. The church announced his death on Saturday from complications from kidney disease. Holland led the Quorum of the Twelve Apostles, a key governing body. H…",
    "link": "https://apnews.com/article/jeffrey-holland-dead-mormons-f6c339ddc9688a5dd3523ce79ee8544b"
  },
  {
    "text": "Ex-Reality Star Arrested for Child, Animal Sex Crimes Had Animals Seized - TMZ",
    "fullText": "Former 'Neighbors With Benefits' reality star Tony McCollister had his animals seized during investigation for two different sex crimes.",
    "link": "https://www.tmz.com/2025/12/27/ex-reality-star-arrested-sex-crimes-animals-seized/"
  },
  {
    "text": "With Lamar Jackson Inactive, It’s Backup Battle in Lambeau - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "In a must-win game for the Ravens against the Packers, it will be Tyler Huntley vs. Malik Willis.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-inactive-ravens-packers-tyler-huntley-malik-willis-2025"
  },
  {
    "text": "Winter storm brings heavy snow and ice to busy holiday travel weekend - NPR",
    "fullText": "A powerful winter storm is impacting parts of the U.S. with major snowfall, ice, and below zero wind chills. The conditions are disrupting holiday travel and could last through next week.",
    "link": "https://www.npr.org/2025/12/27/g-s1-103821/winter-storm-post-christmas-travel"
  },
  {
    "text": "War-torn Myanmar votes in widely criticised 'sham' election - BBC",
    "fullText": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.",
    "link": "https://www.bbc.com/news/articles/cy7vly6gm76o"
  },
  {
    "text": "Samsung will debut two new wireless speakers at CES 2026 - The Verge",
    "fullText": "Samsung’s new wireless speakers from designer Erwan Bouroullec are designed to enhance the home design aesthetic.",
    "link": "https://www.theverge.com/news/850481/two-new-wireless-samsung-speakers-for-2026-lean-into-aesthetics"
  },
  {
    "text": "SpaceX scrubs launch Italian Earth observation satellite due to ground systems issue - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2025/12/27/live-coverage-spacex-to-launch-italian-earth-observation-satellite-on-final-falcon-9-flight-of-2025/"
  },
  {
    "text": "Search ongoing for Texas teen missing since Christmas Eve - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/search-ongoing-texas-teen-missing-christmas-eve/story?id\\\\u003d128724275"
  },
  {
    "text": "Dysart man claims $1 million lottery ticket - KCRG",
    "fullText": "William Zak of Dysart’s winning ticket matched all five white Powerball numbers.",
    "link": "https://www.kcrg.com/2025/12/27/dysart-man-claims-1-million-lottery-ticket/"
  },
  {
    "text": "A Gastroenterologist Says This Popular Food Is Wreaking Havoc on Your Gut - AOL.com",
    "fullText": "A gastroenterologist and dietitian share the number-one food that's wreaking havoc on your gut, plus explain why you should be limiting it for better health.",
    "link": "https://www.prevention.com/health/a69849055/food-impacting-gut/"
  },
  {
    "text": "Influencer Melissa Mae Carlton Announces Death of Daughter Year After Other Daughter Died - TMZ",
    "fullText": "Melissa Mae Carlton and her family are dealing with an unimaginable loss ... announcing the death of their daughter Molly, less than two years after their daughter Abigail passed away.",
    "link": "https://www.tmz.com/2025/12/27/melissa-mae-carlton-daughter-dies-one-year-after-other-child-death/"
  }
]