[
  {
    "text": "Trump’s campaign against ‘left-wing’ media finds a new target: Apple News - The Washington Post",
    "fullText": "Federal Trade Commission Chairman Andrew Ferguson wrote a letter to Apple that warned the company its choice of articles in Apple News could violate the law.",
    "link": "https://www.washingtonpost.com/technology/2026/02/12/apple-news-bias-ftc-ferguson-letter/"
  },
  {
    "text": "GoFundMe for James Van Der Beek's family tops $2 million to help with 'financial strain' following star's death - Yahoo News Canada",
    "fullText": "The former teen heartthrob had been living with Stage 3 colorectal cancer since 2023.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/gofundme-for-james-van-der-beeks-family-tops-2-million-to-help-with-financial-strain-following-stars-death-231553175.html"
  },
  {
    "text": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "fullText": "The Trump administration had removed the LGBTQ+ symbol, citing a policy limiting what can be displayed on federal property.",
    "link": "https://www.washingtonpost.com/nation/2026/02/12/pride-flag-stonewall-inn-trump/"
  },
  {
    "text": "Immigration surge in Minnesota to end. DHS nears shutdown. Live updates - USA Today",
    "fullText": "The drawdown comes amid the continued fallout from the fatal shootings of Alex Pretti and Renee Nicole Good by federal agents in Minneapolis.",
    "link": "https://www.usatoday.com/story/news/nation/2026/02/12/trump-administration-operation-metro-surge-minnesota/88402953007/"
  },
  {
    "text": "Casey Mears seals Daytona 500 starting spot in Duel 1 - NASCAR.com",
    "fullText": "Casey Mears raced his way into the Daytona 500, claiming one of the final two starting spots in a Thursday night qualifying race.",
    "link": "https://www.nascar.com/news-media/2026/02/12/cup-series-2026-daytona-duel-qualifying-races-starting-spots/"
  },
  {
    "text": "Asian Stocks to Drop as AI Jitters Hit Wall Street: Markets Wrap - Bloomberg.com",
    "fullText": "Asian equities retreated from a record after concerns over the impact of artificial intelligence on some companies spurred a selloff in US technology stocks. Gold and silver recouped some of their losses from the prior session.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-12/stock-market-today-dow-s-p-live-updates-"
  },
  {
    "text": "When Amazon badly needed a ride, Europe’s Ariane 6 rocket delivered - Ars Technica",
    "fullText": "This was the first launch of the Ariane 64, the most powerful rocket in European space history.",
    "link": "https://arstechnica.com/space/2026/02/when-amazon-badly-needed-a-ride-europes-ariane-6-rocket-delivered/"
  },
  {
    "text": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month - IGN",
    "fullText": "Crystal Dynamics has revealed the first brand new Legacy of Kain game in over two decades. It's called Legacy of Kain: Ascendance, and it's out sooner than you'd think: on March 31, 2026. That's next month!",
    "link": "https://www.ign.com/articles/legacy-of-kain-ascendance-the-first-new-legacy-of-kain-game-in-over-two-decades-is-out-next-month"
  },
  {
    "text": "‘Marathon’ Announces Free Open Beta Release Date, And It’s A Bit Late - Forbes",
    "fullText": "Bungie has announced the dates for Marathon's free open beta preview test, and it's going to be pretty late in the game.",
    "link": "https://www.forbes.com/sites/paultassi/2026/02/12/marathon-announces-free-open-beta-release-date-and-its-a-bit-late/"
  },
  {
    "text": "Laser weapon that shut down El Paso's skies was LOCUST system - Axios",
    "fullText": "What we know about the bizarre events leading up to the airspace closure.",
    "link": "https://www.axios.com/2026/02/12/el-paso-laser-weapon-locust-drone"
  },
  {
    "text": "EU leaders ready countermeasures to pressure from Russia, China and Trump - AP News",
    "fullText": "European Union leaders reached a broad agreement Thursday in a Belgian castle to restructure the 27-nation bloc’s economy as they face antagonism from Trump, strong-China and Russia. They met Thursday in a Belgian castle in a session meant to shape another su…",
    "link": "https://apnews.com/article/europe-eu-trump-china-russia-rethink-6461ea032aa4e3aa8e133bc5080ab922"
  },
  {
    "text": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "fullText": "\"This is very serious, and we're not going to let it go,\" said one House Democrat.",
    "link": "https://www.axios.com/2026/02/12/pam-bondi-trump-spying-congress-doj-epstein"
  },
  {
    "text": "ULA’s Vulcan rocket suffers another booster problem on the way to orbit - Ars Technica",
    "fullText": "Vulcan's Blue Origin-made BE-4 engines appear to have saved the rocket from failure.",
    "link": "https://arstechnica.com/space/2026/02/ulas-vulcan-launcher-still-has-a-solid-rocket-booster-problem/"
  },
  {
    "text": "Colorectal cancer is rising in younger adults. Here's who is most at risk and symptoms to watch for - AP News",
    "fullText": "The death of “Dawson’s Creek” actor James Van Der Beek highlights a rising trend in colorectal cancer among young adults. While overall colorectal cancer rates have inched down in recent years, rates for those under 50 have risen. It is now the top cancer kil…",
    "link": "https://apnews.com/article/colon-cancer-young-adults-boseman-van-der-beek-7200285f2060145b8369de9ed8db9c17"
  },
  {
    "text": "Sony Pictures Animation Bosses on ‘KPop’ Netflix Plans, ‘Spider-Verse’ Pressure and Betting on ‘GOAT’ - The Hollywood Reporter",
    "fullText": "Kristine Belson and Damien de Froberville make quietly radical creative choices, gambling — and winning — on 'Demon Hunters' and the 'Spider-Verse' franchise. Now they are back with 'GOAT,' their first theatrical effort in almost three years.",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/sony-kpop-demon-hunters-2-spider-verse-pressure-3-goat-1236503016/"
  },
  {
    "text": "‘Love Story’ revisits JFK Jr. and Carolyn Bessette. It’s stirred some backlash - AP News",
    "fullText": "FX and Hulu’s new series “Love Story: John F. Kennedy Jr. & Carolyn Bessette” retells the couple’s romance and death, and has sparked criticism from Kennedy's nephew, Jack Schlossberg. The show follows Kennedy and Bessette from an early meeting to the 1999 pl…",
    "link": "https://apnews.com/article/love-story-carolyn-bessette-jfk-jr-tv-d1b9a0981d9e27ad53b3e888fbf92238"
  },
  {
    "text": "Famous Clients Bail On Casey Wasserman Over Gross Sex Emails To Ghislaine Maxwell - Defector",
    "fullText": "While the world’s attention is currently focused on the various performances, admissions of infidelity, and blood-soaked mascots of the Milan Cortina Winter Olympics, the guy running the next Summer Olympics is coming under intense pressure for popping up in …",
    "link": "https://defector.com/famous-clients-bail-on-casey-wasserman-over-gross-sex-emails-to-ghislaine-maxwell"
  },
  {
    "text": "Astronomers detect a solar system they say should not be possible - CNN",
    "fullText": "A planetary system 116 light-years from Earth has a peculiar pattern. It could flip the script on how planets form, scientists say.",
    "link": "https://www.cnn.com/2026/02/12/science/solar-system-inside-out-planets"
  },
  {
    "text": "Eddie Hearn calls Dana White’s Zuffa world championship ‘cringiest sh*t I’ve ever seen’ - MMA Fighting",
    "fullText": "Eddie Hearn explains why he doesn’t think Dana White’s Zuffa boxing belts have any validity.",
    "link": "https://www.mmafighting.com/ufc/471569/eddie-hearn-calls-dana-white-introducing-zuffa-world-championship-cringiest-sht-ive-ever-seen"
  }
]