[
  {
    "text": "Northern lights may be visible unusually far south tonight. Here’s where. - The Washington Post",
    "fullText": "A solar storm of this strength could spark aurora visible to the naked eye as far south as parts of California, the central Plains and the Mid-Atlantic.",
    "link": "https://www.washingtonpost.com/weather/2026/01/19/aurora-northern-lights-forecast-states/"
  },
  {
    "text": "The Indiana-Miami Game Is the Hollywood Tangle We Didn’t Know We Needed - The Hollywood Reporter",
    "fullText": "Dwayne Johnson, Mark Cuban and even the writer of 'Rudy' are all in on the championship fray.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/watch-indiana-miami-cfp-cignetti-1236477566/"
  },
  {
    "text": "Current political climate spurs efforts to 'reclaim' MLK holiday - Politico",
    "fullText": "Activists worry American society has taken steps backward in recent years.",
    "link": "https://www.politico.com/news/2026/01/19/martin-luther-king-birthday-holiday-00735898"
  },
  {
    "text": "Fed chief Powell to attend Supreme Court arguments on Trump bid to fire Lisa Cook - CNBC",
    "fullText": "Federal Reserve Chairman Jerome Powell's planned attendance comes as he faces a federal criminal probe about the central bank's costly renovation project.",
    "link": "https://www.cnbc.com/2026/01/19/fed-powell-supreme-court-trump-lisa-cook.html"
  },
  {
    "text": "Pixel 10’s Magic Cue feature seems to be preparing Google Tasks & Wallet integration - 9to5Google",
    "fullText": "New findings reveal that, months after launch, Google might be expanding on the Pixel 10’s Magic Cue feature by adding...",
    "link": "http://9to5google.com/2026/01/19/pixel-10s-magic-cue-feature-seems-to-be-preparing-google-tasks-wallet-integration/"
  },
  {
    "text": "Why the same cold virus makes some people more miserable than others - The Washington Post",
    "fullText": "A new study shows the intricacies of the cold virus and how it interacts with nasal airway cells, revealing why some people are hit harder than others.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/common-cold-virus-variability/"
  },
  {
    "text": "Trump's DEI crackdown is changing MLK Day - Axios",
    "fullText": "Educators and advocates say the Trump administration is waging an assault on Black history that makes teaching about King fraught.",
    "link": "https://www.axios.com/2026/01/19/mlk-day-martin-luther-king-trump"
  },
  {
    "text": "Valentino Dies: Legendary Italian Fashion Designer Was 93 - Deadline",
    "fullText": "Valentino Dies: Legendary Italian Fashion Designer Was 93",
    "link": "http://deadline.com/2026/01/valentino-dead-legendary-italian-fashion-designer-93-1236689607/"
  },
  {
    "text": "Man killed, 3 bystanders hurt in shooting at iconic New Orleans restaurant - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/man-killed-3-bystanders-hurt-shooting-iconic-new/story?id\\\\u003d129346480"
  },
  {
    "text": "Modder Blasts ‘Corpo Logic’ Over Cyberpunk 2077 VR Takedown - Kotaku",
    "fullText": "Paywalled mods turn Baldur's Gate 3 and every other major game into unofficial VR ports",
    "link": "https://kotaku.com/cyberpunk-2077-vr-mod-baldurs-gate-3-takedown-2000660987"
  },
  {
    "text": "Millie Bobby Brown says goodbye to ‘Stranger Things’ with new look - Page Six",
    "fullText": "The actress is welcoming a new chapter after the conclusion of the Netflix show with a fresh chop.",
    "link": "https://pagesix.com/2026/01/19/style/millie-bobby-brown-shows-off-bob-haircut-on-joy-awards-2026-red-carpet/"
  },
  {
    "text": "In historic first for Virginia, Adam Spanberger becomes first gentleman - The Washington Post",
    "fullText": "The computer engineer and avid bicyclist said he’s happy working behind the scenes to support his wife and Virginia’s new governor, Abigail Spanberger.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/19/adam-spanberger-virginia-first-gentleman/"
  },
  {
    "text": "Trump is going to Davos — here are the big names who aren't - CNBC",
    "fullText": "A who's who of heads of state, top CEOs and tech pioneers are landing in Davos for the 2026 World Economic Forum meeting. But some big names aren't going.",
    "link": "https://www.cnbc.com/2026/01/19/trump-world-economic-forum-davos-who-isnt-going.html"
  },
  {
    "text": "China previews how powerful its new Xuntian space telescope will be ahead of 2027 launch (video) - Space",
    "fullText": "Mock observations test the performance of the Chinese Space Station Telescope as the 2-meter-class observatory moves closer to launch.",
    "link": "https://www.space.com/astronomy/china-previews-how-powerful-its-new-xuntian-space-telescope-will-be-ahead-of-2027-launch-video"
  },
  {
    "text": "DOJ Abandons Probe of Fatal ICE Shooting of Renee Good - Talking Points Memo",
    "fullText": "Get Your Tickets Now! We’re hosting our first Morning Memo Live event...",
    "link": "http://talkingpointsmemo.com/morning-memo/doj-abandons-probe-of-fatal-ice-shooting-of-renee-good"
  },
  {
    "text": "Denmark sends more troops to Greenland - politico.eu",
    "fullText": "Denmark says its troops could stay in Greenland for one to two years.",
    "link": "https://www.politico.eu/article/denmark-to-boost-military-presence-in-greenland/"
  },
  {
    "text": "When is Apple releasing the more powerful M5 MacBook Pro models? - 9to5Mac",
    "fullText": "Apple’s base M5 MacBook Pro launched in October, but the M5 Pro and M5 Max versions are still missing. Here's when they could be released.",
    "link": "https://9to5mac.com/2026/01/19/new-macbook-pro-release-date/"
  },
  {
    "text": "Enemy Reaction, 2026 NFC Divisional Round: San Francisco 49ers - Field Gulls",
    "fullText": "Bye-bye, Niner Gang! The Seahawks are heading for the NFC Championship Game.",
    "link": "https://www.fieldgulls.com/seattle-seahawks-game-analysis/160512/enemy-reaction-2026-nfc-divisional-round-san-francisco-49ers-fans-meltdown"
  },
  {
    "text": "Melissa Gilbert writes emotional letter to judge in defense of husband Timothy Busfield - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/melissa-gilbert-writes-emotional-letter-judge-defense-husband/story?id\\\\u003d129242146"
  }
]