[
  {
    "text": "Cooper Flagg left game early vs. Denver with ankle injury - NBA",
    "fullText": "Cooper Flagg injured the same ankle two nights earlier, leaving briefly to get it taped before returning.",
    "link": "https://www.nba.com/news/mavs-cooper-flagg-sprained-ankle"
  },
  {
    "text": "X to stop Grok AI from undressing images of real people after backlash - BBC",
    "fullText": "Grok will no longer allow users to remove clothing from images of real people in jurisdictions where it is illegal.",
    "link": "https://www.bbc.com/news/articles/ce8gz8g2qnlo"
  },
  {
    "text": "TSMC fourth-quarter profit beats estimates, soaring 35%, as AI chip demand stays strong - CNBC",
    "fullText": "TSMCy delivered another estimate-beating quarter, with profit up 35% from a year ago as advanced chip orders tied to AI continued to dominate its business.",
    "link": "https://www.cnbc.com/2026/01/15/tsmc-q4-profit-record-ai-chip-demand-nt1-trillion.html"
  },
  {
    "text": "Jalen Brunson leaves game early with ankle injury - NBA",
    "fullText": "The All-Star point guard was hurt in the first quarter when he was dribbling and his ankle appeared to give out.",
    "link": "https://www.nba.com/news/jalen-brunson-ankle-injury"
  },
  {
    "text": "European nations to send troops to Greenland as US annexation threats escalate - CNN",
    "fullText": "Several NATO countries are deploying small numbers of military personnel to Greenland to participate in joint exercises with Denmark as US President Donald Trump ramps up his threats to forcibly annex the Arctic island.",
    "link": "https://www.cnn.com/2026/01/15/world/europe-troops-greenland-trump-nato-intl-hnk"
  },
  {
    "text": "The famed Rocky statue in Philadelphia is getting a new home atop the Art Museum steps - 6abc Philadelphia",
    "fullText": "Get ready to climb the steps next time you want to pose with the Rocky statue at the Philadelphia Art Museum.",
    "link": "https://6abc.com/post/famed-rocky-statue-philadelphia-is-getting-new-home-atop-art-museum-steps/18405156/"
  },
  {
    "text": "The U.S. freezes new immigrant visas for 75 countries: See the full list - CNBC",
    "fullText": "The U.S. said Wednesday it will pause issuing immigrant visas to citizens of 75 countries over concerns that they may use public assistance in the future.",
    "link": "https://www.cnbc.com/2026/01/15/us-stops-immigrant-visas-for-75-countries-see-the-full-list.html"
  },
  {
    "text": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "fullText": "Sweeping cuts to mental health and addiction programs worth more than $2 billion are being reversed. After a political backlash from Republicans and Democrats, the grant money will be restored.",
    "link": "https://www.npr.org/2026/01/14/nx-s1-5677714/trump-administration-mental-health-addiction-grant-cuts-restored"
  },
  {
    "text": "Two Palestine Action protesters end 73-day hunger strike - BBC",
    "fullText": "The BBC understands that one of the protesters was taken to hospital earlier on Wednesday in a poor condition.",
    "link": "https://www.bbc.com/news/articles/cwy1q98qyego"
  },
  {
    "text": "Reports: Shooting involving federal law enforcement in north Minneapolis - kare11.com",
    "fullText": "A large crowd has formed in the Hawthorne neighborhood.",
    "link": "https://www.kare11.com/article/news/local/ice-in-minnesota/reports-shooting-involving-federal-law-enforcement-in-north-minneapolis/89-f0dc3033-f01c-4870-961a-369dc16bde21"
  },
  {
    "text": "Bruno Mars Adds 30+ New Dates to ‘The Romantic Tour’ - Variety",
    "fullText": "Bruno Mars has added 30+ new dates to his 2026 Romantic Tour' announced earlier this week, which marks his first full headline tour in nearly a decade.",
    "link": "https://variety.com/2026/music/news/bruno-mars-adds-romantic-tour-dates-1236631834/"
  },
  {
    "text": "Security Alert – U.S. Embassy Doha (January 14, 2026) - U.S. Embassy Doha – Qatar (.gov)",
    "fullText": null,
    "link": "https://qa.usembassy.gov/security-alert-u-s-embassy-doha-january-14-2026/"
  },
  {
    "text": "Colorado appeals panel appears skeptical of Tina Peters’ sentence - The Colorado Sun",
    "fullText": "The three-judge panel was dismissive of many of the arguments made by Peters' attorneys. But they grilled the state's lawyer over the trial judge reciting Peters' false statements about elections in handing down her sentence.",
    "link": "http://coloradosun.com/2026/01/14/tina-peters-colorado-court-of-appeals-arguments/"
  },
  {
    "text": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "fullText": "WASHINGTON — President Donald Trump has told his national security team that he would want any U.S. military action in Iran to deliver a swift and decisive blow to the regime and not spark a sustained war that dragged on for weeks or months, according to a U.…",
    "link": "https://www.nbcnews.com/politics/white-house/trump-want-military-action-iran-swift-decisive-sources-say-rcna254076"
  },
  {
    "text": "At least 171 measles cases confirmed in 9 states: CDC - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/171-measles-cases-confirmed-9-states-cdc/story?id\\\\u003d129198221"
  },
  {
    "text": "Divisional Round Injury Report: Seahawks vs. 49ers - Seattle Seahawks",
    "fullText": "Details on the Seahawks’ injury situation heading into their divisional round playoff game against the 49ers.",
    "link": "https://www.seahawks.com/news/divisional-round-injury-report-seahawks-vs-49ers"
  },
  {
    "text": "Android 16 QPR3 Beta 2 takes a big leap forward - Android Police",
    "fullText": "This is a big step up",
    "link": "https://www.androidpolice.com/android-16-qpr3-beta-2-now-live/"
  },
  {
    "text": "DOH reports travel-related Zika, dengue cases on Oahu - Honolulu Star-Advertiser",
    "fullText": "The Hawaii Department of Health said a travel-related Zika virus case has been confirmed on Oahu.",
    "link": "https://www.staradvertiser.com/2026/01/14/breaking-news/doh-reports-travel-related-zika-dengue-cases-on-oahu/"
  },
  {
    "text": "Musk and Hegseth vow to “make Star Trek real” but miss the show’s lessons - Ars Technica",
    "fullText": "AI weapons systems may annihilate their creators.",
    "link": "https://arstechnica.com/culture/2026/01/pentagons-arsenal-of-freedom-tour-borrows-name-from-star-trek-episode-about-killer-ai/"
  },
  {
    "text": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "fullText": "On Jan. 6, there were 211 cases. The outbreak, which began in October, is now at 434.",
    "link": "https://arstechnica.com/health/2026/01/sc-measles-outbreak-has-gone-berserk-124-cases-since-friday-409-quarantined/"
  }
]