[
  {
    "text": "Breaking Amish Star Jeremiah Raber Life-Flighted to Hospital - TMZ",
    "fullText": "\"Breaking Amish\" star Jeremiah Raber is opening up about a frightening health scare that landed him in the hospital.",
    "link": "https://www.tmz.com/2026/01/04/breaking-amish-jeremiah-raber-life-flighted-hospital/"
  },
  {
    "text": "Greece: Thousands stranded across Europe as air space disrupted - BBC",
    "fullText": "A fault with radio communications caused air traffic controllers to temporarily suspend arrivals and departures.",
    "link": "https://www.bbc.com/news/articles/cgezjlzwz1do"
  },
  {
    "text": "Rubio sets out US demands for Venezuela’s remaining leaders - Financial Times",
    "fullText": "Washington is controlling Caracas through naval embargo on oil exports, secretary of state says",
    "link": "https://www.ft.com/content/fed60da2-4e43-400f-9635-5f2ed8dca452"
  },
  {
    "text": "Govee’s latest smart lights can make your ceiling more interesting - The Verge",
    "fullText": "Govee announced the Sky Ceiling Light and Ceiling Light Ultra at CES 2026. No prices or launch dates have been shared.",
    "link": "https://www.theverge.com/tech/853006/govee-sky-ceiling-light-ultra-specs"
  },
  {
    "text": "Jackery’s solar-powered Gazebo is a good DIY idea - The Verge",
    "fullText": "The Jackery Gazebo is fitted with 2,000W of solar panels, integrated lighting, a pull-down projection screen, and weather-resistant AC outlets.",
    "link": "https://www.theverge.com/tech/852600/jackerys-solar-powered-gazebo-is-a-good-diy-idea"
  },
  {
    "text": "If You Sleep In This 1 Position, Doctors Say You Need To Stop Immediately - HuffPost",
    "fullText": "It may feel safe and comfy, but experts warn it could lead to lasting nerve damage.",
    "link": "https://www.huffpost.com/entry/t-rex-sleep-position-arms-goog_l_69405dcbe4b0fa125e7f4dd9"
  },
  {
    "text": "Premier League live updates: Man United travel to Leeds - ESPN",
    "fullText": "Premier League live updates: Liverpool face Fulham",
    "link": "https://www.espn.com/soccer/story/_/id/47466065/premier-league-live-updates-leeds-united-manchester-united-fulham-liverpool-manchester-city-chelsea"
  },
  {
    "text": "Donald Trump's plan to seize Venezuela oil industry after Nicolas Maduro captured faces major hurdles - ABC7 Los Angeles",
    "fullText": "President Donald Trump's plan to take control of Venezuela's oil industry and ask American companies to revitalize it after capturing President Nicolás Maduro in a raid isn't likely to have a significant immediate impact on oil prices.",
    "link": "https://abc7.com/post/nicolas-maduro-venezuelas-president-arrives-us-capture-operation-donald-trump-says-will-let-run-country/18350260/"
  },
  {
    "text": "New 'super scary’ fungus already detected in Connecticut, experts warn - CT Insider",
    "fullText": "Candida auris was first discovered in 2009, with the first clinical case identified in 2016. Since then, the fungus has spread to nearly every state in the U.S.",
    "link": "https://www.ctinsider.com/connecticut/article/ct-candida-auris-spread-fungus-symptoms-pandemic-21267814.php"
  },
  {
    "text": "Trump wants U.S. oil companies in Venezuela. Here's what to know - NPR",
    "fullText": "President Trump wants more U.S. oil companies to \"go in\" to Venezuela. But there are economic, historical, and climate reasons that may not be easy. Here's what you need to know about oil in Venezuela.",
    "link": "https://www.npr.org/2026/01/04/nx-s1-5665795/trump-us-oil-companies-venezuela"
  },
  {
    "text": "NFL Week 18 playoff seed scenarios: Every possible seed for the final day of the season - NBC Sports",
    "fullText": "It's the final day of the regular season, and the playoff field is almost set, as 12 teams have clinched playoff berths and the Seahawks have clinched the top seed in the NFC.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/nfl-week-18-playoff-seed-scenarios-every-possible-seed-for-the-final-day-of-the-season"
  },
  {
    "text": "Nick Emmanwori Shines In Dominant Defensive Performance As Seahawks Top 49ers - Seattle Seahawks",
    "fullText": "After barely playing in Seattle’s Week 1 game against the 49ers, rookie safety Nick Emmanwori played a bit role in the Seahawks’ Week 18 win.",
    "link": "https://www.seahawks.com/news/nick-emmanwori-shines-in-dominant-defensive-performance-as-seahawks-top-49ers"
  },
  {
    "text": "Leonardo DiCaprio Backs Cinema, While Kylie Jenner Cheers Timothée Chalamet - Variety",
    "fullText": "At the Palm Springs Awards gala, Leonardo DiCaprio spoke about the importance of cinema, while Kylie Jenner cheered on Timothée Chalamet.",
    "link": "https://variety.com/2026/film/awards/leonardo-dicaprio-timothee-chalamet-kylie-jenner-palm-springs-1236623049/"
  },
  {
    "text": "Bucs Run Over Panthers, Keep NFC South Title in Play - Tampa Bay Buccaneers",
    "fullText": "In a steady rain, the Buccaneers controlled the line of scrimmage and outrushed Carolina by 121 yards to hold on for a 16-14 win that kept them in contention for a division title depending upon Sunday's Saints-Falcons tilt",
    "link": "https://www.buccaneers.com/news/panthers-bucs-week-18-recap-postgame-report-2025"
  },
  {
    "text": "Appeals panel says California's ban on open carry in more populated counties is unconstitutional - ABC News",
    "fullText": "The ruling was issued by two judges on the 9th U.S. Circuit Court of Appeals",
    "link": "https://abcnews.go.com/US/wireStory/appeals-panel-californias-ban-open-carry-populated-counties-128880151"
  },
  {
    "text": "A group of about 20 US investors is already planning a trip to Venezuela in March - Business Insider",
    "fullText": "Charles Myers, chairman of Signum Global Advisors, told Business Insider he is preparing a group of 15-20 investors to travel to Venezuela in March.",
    "link": "https://www.businessinsider.com/foreign-investment-oil-tourism-venezuela-charles-myers-finance-expert-2026-1"
  },
  {
    "text": "Tommy Lee Jones' Daughter Victoria Was Offered Plea Deal Before Death - Yahoo",
    "fullText": "Tommy Lee Jones' daughter Victoria had a plea deal that demanded sobriety waiting to be signed ahead of her sudden death ... TMZ has learned.",
    "link": "https://www.tmz.com/2026/01/03/tommy-lee-jones-daughter-victoria-offered-plea-before-death/"
  },
  {
    "text": "New Year, Same Na’vi Reigning the Box Office - Vulture",
    "fullText": "‘Avatar: Fire and Ash’ is still holding strong for the third weekend in a row and for the first weekend of the new year.",
    "link": "http://www.vulture.com/article/avatar-fire-and-ash-box-office-new-years.html"
  }
]