[
  {
    "text": "Game Recap: Ravens Finish Season With Gut-Wrenching Loss to Steelers - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Sixth-round rookie Tyler Loop missed a 44-yard field goal attempt at the buzzer as the Ravens fell to the Steelers in the AFC North title game.",
    "link": "https://www.baltimoreravens.com/news/tyler-loop-lamar-jackson-ravens-steelers-field-goal-miss-afc-north-title-recap"
  },
  {
    "text": "Prime ministers of Greenland, Denmark tell Trump to stop U.S. takeover threats - Axios",
    "fullText": "Denmark's PM said the U.S. has \"no right to annex\" Greenland and the territory's leader called Trump's comments today \"disrespectful.\"",
    "link": "https://www.axios.com/2026/01/05/greenland-denmark-us-trump-venezuela"
  },
  {
    "text": "Cuba says 32 Cuban officers were killed in US operation in Venezuela that captured Nicolás Maduro - ABC7 Los Angeles",
    "fullText": "\"You know, a lot of Cubans were killed yesterday... No death on our side,\" President Donald Trump said.",
    "link": "https://abc7.com/post/cuba-says-32-cuban-officers-were-killed-us-operation-venezuela/18353414/"
  },
  {
    "text": "Timothée Chalamet Proclaims His 'Love' for Kylie Jenner, 'My Partner of 3 Years,' as He Wins at Critics Choice Awards - People.com",
    "fullText": "Timothée Chalamet thanked his 'partner of three years' Kylie Jenner during his 2026 Critics Choice Awards acceptance speech. The actor took home the prize for best actor for his role in 'Marty Supreme.'",
    "link": "https://people.com/critics-choice-awards-2026-best-actor-timothee-chalamet-thanks-kylie-jenner-11876051"
  },
  {
    "text": "Venezuela’s Rodriguez Asks US for Cooperation After Maduro Raid - Bloomberg.com",
    "fullText": "Delcy Rodríguez, the acting president of Venezuela, asked the US to work with her country, striking a more conciliatory tone toward the Trump administration after her initial outrage at the capture of President Nicolás Maduro.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-05/venezuela-s-rodriguez-asks-us-for-cooperation-after-maduro-raid"
  },
  {
    "text": "CES 2026 Live: Tech's Big Event Kicks Off From Las Vegas - CNET",
    "fullText": "Follow us all week as we cover the biggest technology conference of the year, including new reveals and intriguing concepts that will all lead up to CNET officially choosing the best of CES 2026.",
    "link": "https://www.cnet.com/news-live/ces-2026-news-live-updates/"
  },
  {
    "text": "Atlanta Falcons part ways with Raheem Morris and Terry Fontenot - Atlanta Falcons",
    "fullText": "Search for successors to begin immediately.",
    "link": "https://www.atlantafalcons.com/news/atlanta-falcons-part-ways-with-raheem-morris-terry-fontenot"
  },
  {
    "text": "The new Ultraloq smart lock uses both your face and your palm to let you in - The Verge",
    "fullText": "Ultraloq is launching a smart lock that reads your palm and a new camera that works on HaLow Wi-Fi for extended range at CES",
    "link": "https://www.theverge.com/tech/853844/ultraloq-ces-smart-lock-face-palm-reading"
  },
  {
    "text": "Critics Choice Awards: Winners List (Updating Live) - The Hollywood Reporter",
    "fullText": "Among the winners so far are 'Sinners,' 'KPop Demon Hunters,' 'The Studio,' 'Adolescence' and 'Jimmy Kimmel Live!'",
    "link": "http://www.hollywoodreporter.com/lists/critics-choice-awards-2026-winners-list-full/"
  },
  {
    "text": "Local health officials identify first pediatric flu death in Ohio - WHIO TV",
    "fullText": "The first pediatric flu death in Ohio for the 2025-26 season has been identified.",
    "link": "https://www.whio.com/news/local/local-health-officials-identify-first-pediatric-flu-death-ohio/3XZF4R5YHRDDTNBNZMMSXVCK6Y/"
  },
  {
    "text": "N Korea’s Kim oversees hypersonic missile tests, cites geopolitical crisis - Al Jazeera",
    "fullText": "Kim underscores need to bolster N Korea’s nuclear deterrent, citing ‘recent geopolitical crisis’, state media reports.",
    "link": "https://www.aljazeera.com/news/2026/1/5/n-koreas-kim-oversaw-hypersonic-missile-tests-cites-geopolitical-crisis"
  },
  {
    "text": "NFL Playoffs: Full Wild Card Slate, Seeds and Scenarios - OutKick",
    "fullText": "Our postseason snapshot breaks down the AFC and NFC brackets, Wild Card matchups, notable Week 18 swings, and the one result that still shapes the road ahead.",
    "link": "https://www.outkick.com/sports/nfl-playoffs-seeds-wild-card-matchups-afc-nfc-bracket"
  },
  {
    "text": "Boston Dynamics is training an AI-powered humanoid robot to do factory work - CBS News",
    "fullText": "While it's not ready to join the workforce yet, Atlas, an AI-powered humanoid, is learning how to do human tasks.",
    "link": "https://www.cbsnews.com/news/boston-dynamics-training-ai-humanoids-to-perform-human-jobs-60-minutes/"
  },
  {
    "text": "Oracle vs. Palantir: Wall Street Is Neutral on One of These AI Stocks but Expects the Other to Surge - The Motley Fool",
    "fullText": "Oracle and Palantir took center stage this year as the artificial intelligence sector continued to dominate the conversation.",
    "link": "https://www.fool.com/investing/2026/01/04/oracle-vs-palantir-wall-street-is-neutral-on-one-o/"
  },
  {
    "text": "Charlotte Niddam: Teen girl educated in UK died in Swiss bar fire - BBC",
    "fullText": "The family of Charlotte Niddam announced her death \"with great sadness\" as Swiss authorities confirmed all victims had been identified.",
    "link": "https://www.bbc.com/news/articles/cwy8p13ezdxo"
  },
  {
    "text": "Saudi-backed forces regain control of Yemen’s Hadramout after days of airstrikes - AP News",
    "fullText": "Saudi-backed forces have retaken Yemen's port city of Mukalla from southern separatists. The capital of Hadramout province was reclaimed by Yemen’s internationally recognized government after Saudi airstrikes. Video shows the Saudi-backed National Shield Forc…",
    "link": "https://apnews.com/article/yemen-separatists-mukalla-saudi-forces-85bf58559c19afa2851f777ceb970831"
  },
  {
    "text": "Myles Garrett breaks NFL single-season sack record with 23 and laments not getting 2 more - AP News",
    "fullText": "The Cleveland Browns' Myles Garrett has set the NFL's single-season sack record with his 23rd. He reached the milestone during the fourth quarter of Sunday's win over the Cincinnati Bengals. Garrett sacked Joe Burrow for a 6-yard loss, surpassing the previous…",
    "link": "https://apnews.com/article/browns-garrett-bengals-burrow-5937c3174f7b5e9edad6ee56024f7eb0"
  }
]