[
  {
    "text": "Trump says Iran wants to negotiate as the death toll in protests rises to at least 646 - AP News",
    "fullText": "U.S. President Donald Trump says Iran wants to negotiate with the U.S. after his threat to strike the country over its crackdown on protesters. Activists said Tuesday the death toll in the demonstrations has risen to at least 646. Iran hasn’t yet responded to…",
    "link": "https://apnews.com/article/iran-protests-us-israel-war-nuclear-economy-53f2b79c8a0de827b1b8602ac9f0a57b"
  },
  {
    "text": "As Canada tries to reduce its dependence on the US, its leader will visit China to rebuild ties - AP News",
    "fullText": "Canadian Prime Minister Mark Carney is visiting China this week to mend relations with the world's second-largest economy. It's the first visit by a Canadian leader in eight years. Carney aims to double non-U.S. exports over the next decade to reduce Canada’s…",
    "link": "https://apnews.com/article/china-canada-carney-trump-us-tariffs-economy-c8227349417cd2fdd134e8a4894bc1e5"
  },
  {
    "text": "Which are Iran’s main opposition groups? - Al Jazeera",
    "fullText": "Iran’s fragmented opposition includes figures living abroad, such as Reza Pahlavi, the heir of the former monarch.",
    "link": "https://www.aljazeera.com/news/2026/1/12/which-are-irans-main-opposition-groups"
  },
  {
    "text": "Hong Kong court hears arguments on sentencing of former publisher Jimmy Lai; no decision yet - AP News",
    "fullText": "A Hong Kong court is hearing arguments about the sentencing of democracy advocate Jimmy Lai. His conviction under a national security law could mean life in prison. Lai founded the now-defunct Apple Daily and was arrested in 2020. In December, he was found gu…",
    "link": "https://apnews.com/article/jimmy-lai-apple-daily-foreign-collusion-mitigation-6c475aacc05e570b89d536c66cad10ca"
  },
  {
    "text": "Galaxy S26 with Exynos 2600 makes first Geekbench appearance – Global entry confirmed? - Sammy Fans",
    "fullText": "For the first time, Samsung’s upcoming Galaxy S26 has surfaced on Geekbench with the Exynos 2600 processor. The first listing alone revealed the phone’s graphics capabilities, backed by Samsung Xclipse 960 GPU. This listing is important because it’s the first…",
    "link": "https://www.sammyfans.com/2026/01/11/samsung-galaxy-s26-exynos-2600-first-geekbench/"
  },
  {
    "text": "Dell tested NVIDIA N1X laptop just two months ago - VideoCardz.com",
    "fullText": "New NVIDIA N1X laptop spotted, so is it still coming? Watching NVIDIA CES keynotes reminds me of Knives Out movies. You are trying to solve the riddle of",
    "link": "https://videocardz.com/newz/dell-tested-nvidia-n1x-laptop-just-two-months-ago"
  },
  {
    "text": "This Dead Star With a Glowing Shock Wave Shouldn’t Exist - Gizmodo",
    "fullText": "The recent discovery has left astronomers dumbfounded.",
    "link": "https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244"
  },
  {
    "text": "AI can now 'see' optical illusions. What does it tell us about our own brains? - BBC",
    "fullText": "Our eyes can frequently play tricks on us, but scientists have discovered that some artificial intelligence can fall for the same illusions.",
    "link": "https://www.bbc.com/future/article/20251218-how-ai-is-shedding-new-light-on-optical-illusions"
  },
  {
    "text": "Capital One drops 6%, other banks hit after Trump calls for credit card rate cap - CNBC",
    "fullText": "Posting on Truth Social, Trump said he would \"no longer let the American Public be 'ripped off' by Credit Card Companies.\"",
    "link": "https://www.cnbc.com/2026/01/12/trump-credit-card-limit-banks-jpmorgan-citi.html"
  },
  {
    "text": "Bills open as 1.5-point favorites at Denver - NBC Sports",
    "fullText": "The bettors believe in the Bills.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/bills-open-as-1-5-point-favorites-at-denver"
  },
  {
    "text": "Coinbase Stock (COIN) Faces Senate Review on Stablecoin Rewards - TipRanks",
    "fullText": "Coinbase Global ($COIN), the largest crypto exchange in the U.S., is monitoring a major crypto bill as it approaches Senate review, according to a Bloomberg report. At the center of",
    "link": "https://www.tipranks.com/news/coinbase-stock-coin-in-focus-as-stablecoin-rewards-face-senate-scrutiny"
  },
  {
    "text": "Portland putting ‘sand in the gears’ of local ICE operations after high-profile shootings - The Globe and Mail",
    "fullText": "Elected officials are proposing legislation and throwing up bureaucratic hurdles in an effort to make work difficult for federal agents",
    "link": "https://www.theglobeandmail.com/world/article-portland-ice-high-profile-shootings-protests/"
  },
  {
    "text": "‘Industry’ Is Back in a Big Way—and With a New Story to Tell - The Ringer",
    "fullText": "Brain bleeds, short sales, sex toys, and board meetings: All the market indicators point to a big return for HBO’s ‘Industry.’ Here’s our recap of Season 4, Episode 1, “PayPal of Bukkake.”",
    "link": "https://www.theringer.com/2026/01/11/tv/industry-season-4-episode-1-recap-hbo-paypal-of-bukkake"
  },
  {
    "text": "Oklahoma State shuts out Oklahoma 37-0 in Bedlam rivalry dual - NCAA.com",
    "fullText": "No. 5 Oklahoma State and No. 15 Oklahoma will meet Sunday at 5pm in Stillwater for the famous Bedlam dual. Here's what you need to know about the rivalry and the best matches to watch in this year's matchup.",
    "link": "https://www.ncaa.com/live-updates/wrestling-men/d1/oklahoma-state-wrestling-shuts-out-oklahoma-37-0-bedlam-rivalry-dual"
  },
  {
    "text": "Chaos erupts as U-Haul drives into crowd during anti-Iranian regime rally in Westwood - ABC7 Los Angeles",
    "fullText": "Chaos erupted after a U-Haul drove into a crowd during an anti-Iranian regime rally near the federal building in Westwood on Sunday afternoon.",
    "link": "https://abc7.com/post/haul-drives-crowd-during-anti-iranian-regime-rally-westwood-lapd-says/18388519/"
  },
  {
    "text": "Trump Indicates He’s Really Not Into Netflix Buying WB, Wants To Stop The Streamer’s So-Called “Cultural Takeover” - Deadline",
    "fullText": "Trump has firmly put his thumb on Netflix buying Warner Bros, so it seems",
    "link": "http://deadline.com/2026/01/trump-against-netflix-warner-bros-deal-1236679318/"
  },
  {
    "text": "Bob Dylan, Trey Anastasio, John Mayer, and More Remember Bob Weir - Pitchfork",
    "fullText": "John Mayer, Nancy Wilson, and Billy Corgan also paid tribute to the founding Grateful Dead member",
    "link": "https://pitchfork.com/news/bob-dylan-trey-anastasio-bruce-hornsby-and-more-remember-bob-weir/"
  },
  {
    "text": "George Clooney Says He’d Be ‘Honored’ to Work With Paul Dano, Owen Wilson and Matthew Lillard After Quentin Tarantino Insults: ‘We Are Living in a Time of Cruelty’ - Variety",
    "fullText": null,
    "link": "https://variety.com/2026/film/news/george-clooney-quentin-tarantino-paul-dano-1236628246/"
  },
  {
    "text": "Retired SF Firefighter Denied Cancer Treatment, Causing City to Question Blue Shield Health Plan - SFist",
    "fullText": "The family and friends of retired firefighter Ken Jones implored the city’s Health Service Board this week to persuade Blue Shield to reverse the denial of Jones’s crucial cancer treatment coverage through his city-run health plan, and many others have also b…",
    "link": "https://sfist.com/2026/01/11/sf-to-reevaluate-citys-blue-shield-health-plan-after-retired-firefighter-denied-cancer-treatment/"
  }
]