[
  {
    "text": "Should your therapy session be outdoors? More therapists are trying it. - The Washington Post",
    "fullText": "A growing body of research shows that getting outside is good for mood and memory. Some therapists are bringing their practices outdoors to boost the benefits.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/16/outdoor-therapy-mental-health/"
  },
  {
    "text": "Whirlwind day of diplomacy as US holds talks on Iran and Ukraine in Geneva - CNN",
    "fullText": "US envoy Steve Witkoff and US President Donald Trump’s son-in-law Jared Kushner are meeting with both Iranian and Ukrainian officials today in separate meetings in Geneva. Follow here for the latest.",
    "link": "https://www.cnn.com/politics/live-news/trump-administration-iran-talks-02-17-26"
  },
  {
    "text": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
    "fullText": "A number of prominent figures have stepped down or are facing investigations after their communications with Jeffrey Epstein and his former longtime companion, Ghislaine Maxwell, were released last month.",
    "link": "https://www.washingtonpost.com/politics/2026/02/17/epstein-files-resignations-investigations/"
  },
  {
    "text": "Hochul, Mamdani announce $1.5B for NYC budget ahead of preliminary plan - Gothamist",
    "fullText": "The state funding comes a day before Mamdani presents his preliminary budget, as his administration revises the city’s deficit estimate downward.",
    "link": "https://gothamist.com/news/hochul-mamdani-announce-15b-for-nyc-budget-ahead-of-preliminary-plan"
  },
  {
    "text": "Daniel Jeremiah 2026 NFL mock draft 2.0: Giants one of six teams to pick WR; Chiefs go RB - NFL.com",
    "fullText": "In his second mock of the 2026 NFL Draft, Daniel Jeremiah forecasts the Giants to kick off a receiver run that goes six deep in the first 32 picks. Check out the full Round 1 projection.",
    "link": "https://www.nfl.com/news/daniel-jeremiah-2026-nfl-mock-draft-2-0"
  },
  {
    "text": "Simple Lifelong Habits Can Cut Your Alzheimer's Risk by 38%, Study Finds - ScienceAlert",
    "fullText": "A lifetime of engaging with language and the written word – including reading books, writing, and learning languages – could be one of the best ways to keep your mind sharp and delay or prevent dementia, according to a new study.",
    "link": "https://www.sciencealert.com/simple-lifelong-habits-can-cut-your-alzheimers-risk-by-38-study-finds"
  },
  {
    "text": "Josh Kushner’s Thrive Capital Raises $10 Billion in New Funding - Bloomberg.com",
    "fullText": "The backer of OpenAI, Stripe, SpaceX and Skims says it’s taking “ride-or-die” approach to investing.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-17/josh-kushner-s-thrive-capital-raises-10-billion-in-new-funding"
  },
  {
    "text": "The record-breaking cocaine boom — and its deadly fallout : Planet Money - NPR",
    "fullText": "Cocaine has made a roaring comeback, and it's having some big negative effects in the U.S. and around the world.",
    "link": "https://www.npr.org/sections/planet-money/2026/02/17/g-s1-110042/the-record-breaking-cocaine-boom-and-its-deadly-fallout"
  },
  {
    "text": "2026 NFL franchise tag window opens today - NFL.com",
    "fullText": "The NFL's 2026 franchise tag window opens Feb. 17 and runs through March 3. What does that mean for players headed to free agency?",
    "link": "https://www.nfl.com/news/2026-nfl-franchise-tag-window-opens-today"
  },
  {
    "text": "‘Jordan is next’: West Bank annexation signals ‘silent transfer’ - Al Jazeera",
    "fullText": "Jordan warns of war as Israel’s ‘silent transfer’ in the occupied West Bank becomes an operational reality.",
    "link": "https://www.aljazeera.com/features/2026/2/17/jordan-is-next-west-bank-annexation-signals-silent"
  },
  {
    "text": "Lindsey Vonn returns to US after Winter Olympics crash - BBC",
    "fullText": "Lindsey Vonn is home in the United States after four operations on the broken leg she sustained at the Winter Olympics - but is yet to stand up nine days after the crash.",
    "link": "https://www.bbc.com/sport/articles/c62gx5wl92wo"
  },
  {
    "text": "Measles Outbreaks Are Increasingly Common. Here’s What You Need to Know. - Slate",
    "fullText": "Babies normally don’t get the measles vaccine until they’re a year old. But you can ask for it sooner!",
    "link": "https://slate.com/technology/2026/02/measles-outbreaks-vaccines-babies-guide.html"
  },
  {
    "text": "3 big changes are proposed for FEMA. This is what experts really think of them - NPR",
    "fullText": "The Trump administration is proposing massive changes to the Federal Emergency Management Agency. We asked disaster experts to weigh in.",
    "link": "https://www.npr.org/2026/02/17/nx-s1-5698320/fema-reform-trump-hurricane-earthquake"
  },
  {
    "text": "Noem's use of Coast Guard resources strains her relationship with the military branch, sources say - NBC News",
    "fullText": "WASHINGTON — Homeland Security Secretary Kristi Noem’s relationship with U.S.",
    "link": "https://www.nbcnews.com/politics/immigration/noems-use-coast-guard-resources-strains-relationship-military-branch-s-rcna258904"
  },
  {
    "text": "Why Congress failed to reach an Obamacare deal - Politico",
    "fullText": "Lawmakers delayed negotiations despite a drumbeat of warnings. That was just the first problem.",
    "link": "https://www.politico.com/news/2026/02/17/inside-congress-failed-battle-to-keep-obamacare-premiums-from-skyrocketing-00781825"
  },
  {
    "text": "Horoscope for Tuesday, February 17, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/17/horoscopes-today-tuesday-february-17-2026"
  },
  {
    "text": "James Van Der Beek's friend slams critics of family's GoFundMe: 'You have no idea what they endured' - Entertainment Weekly",
    "fullText": "James Van Der Beek's friend Mehcad Brooks slammed critics of the family's GoFundMe with a powerful message on social media: 'It's ok to stfu.'",
    "link": "https://ew.com/james-van-der-beek-friend-mehcad-brooks-slams-critics-family-gofundme-11907522"
  }
]