[
  {
    "text": "Dr. William Foege, leader in smallpox eradication, dies - ABC News",
    "fullText": "The 6-foot-7 inch Foege literally stood out in the field of public health.",
    "link": "https://abcnews.go.com/Health/wireStory/dr-william-foege-leader-smallpox-eradication-dies-129543666"
  },
  {
    "text": "Sean McVay: Seahawks had \"fortuitous bust\" on key fourth-down play - NBC Sports",
    "fullText": "Although the NFC Championship had many compelling moments, the game came down to one key play.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/sean-mcvay-seahawks-had-fortuitous-bust-on-key-fourth-down-play"
  },
  {
    "text": "Russell Wilson, Marshawn Lynch Hype Sam Darnold, Kenneth Walker III After Seahawks Reach Super Bowl - Bleacher Report",
    "fullText": "A former Seattle Seahawks quarterback-running back duo showed love to the team's new quarterback-running back duo on Sunday.",
    "link": "https://bleacherreport.com/articles/25369144-russell-wilson-marshawn-lynch-hype-sam-darnold-kenneth-walker-iii-after-seahawks-reach-super-bowl"
  },
  {
    "text": "Iran Is Selling More Oil but Making Less Money - The Wall Street Journal",
    "fullText": "Middlemen and buyers take advantage of embattled regime’s limited options for unloading crude",
    "link": "https://www.wsj.com/world/middle-east/iran-is-selling-more-oil-but-making-less-money-841985ea"
  },
  {
    "text": "Japan returns pandas to China amid strained ties - BBC",
    "fullText": "The twin cubs' departure will leave Japan without any pandas for the first time since 1972.",
    "link": "https://www.bbc.com/news/articles/c8d0l778dero"
  },
  {
    "text": "Japan Government Bond Yields, Stocks Fall After Yen’s Rebound - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/finance/japan-government-bond-yields-stocks-fall-after-yens-rebound-8c6a1914"
  },
  {
    "text": "Israel launches ‘large-scale operation’ to locate last hostage in Gaza - Politico",
    "fullText": "The return of Ran Gvili is widely seen as the last obstacle to proceeding to the second phase of the U.S.-brokered ceasefire.",
    "link": "https://www.politico.com/news/2026/01/25/israel-launches-large-scale-operation-to-locate-last-hostage-in-gaza-00745872"
  },
  {
    "text": "Yen Extends Gains Amid Threat of Intervention: Markets Wrap - Bloomberg.com",
    "fullText": "The dollar fell against all of its major peers after a rate check Friday by the Federal Reserve Bank of New York spurred speculation the US may assist Japan in efforts to boost the yen. Gold rose above $5,000 for the first time and US stock futures dropped wi…",
    "link": "https://www.bloomberg.com/news/articles/2026-01-25/yen-extends-gains-amid-threat-of-intervention-markets-wrap"
  },
  {
    "text": "If You Inherited The “I Need A Little Treat” Gene, These 16 Under-$10 Impulse Buys Won’t Break The Bank - BuzzFeed",
    "fullText": "\"I can't help it. It's in my DNA.\" —You adding goodies to your cart",
    "link": "https://www.buzzfeed.com/melanie_aman/little-treats-under-10-impulse-buys-an"
  },
  {
    "text": "'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home - TMZ",
    "fullText": "Quinton Aaron -- the actor who played Michael Oher in \"The Blind Side\" -- has been hospitalized after collapsing at his home .. TMZ has learned.",
    "link": "https://www.tmz.com/2026/01/25/blind-side-actor-quinton-aaron-hospitalized-after-falling-at-home/"
  },
  {
    "text": "CNBC Daily Open: Canada is drawing Trump's ire — and faces a 100% tariff - CNBC",
    "fullText": "Trump threatened Canada with tariffs of 100% if it strikes a deal with China. Trump also withdrew an invitation to the Canada to join his \"Board of Peace.\"",
    "link": "https://www.cnbc.com/2026/01/26/cnbc-daily-open-canada-is-drawing-trumps-ire-and-faces-a-100percent-tariff.html"
  },
  {
    "text": "This Is the Vaccine Story RFK Jr. Doesn’t Want You to Hear - The Bulwark",
    "fullText": "The Trump administration says we should learn from other countries. Maybe they should have looked someplace besides Denmark.",
    "link": "https://www.thebulwark.com/p/this-is-the-vaccine-story-rfk-jr-doesnt-want-you-to-hear-meningitis-meningococcal-disease"
  },
  {
    "text": "A major winter storm has hit the D.C. region. Here’s what to know - wamu.org",
    "fullText": "Snow, extreme cold, and sleet will disrupt travel, business, and services in the D.C. area Sunday and throughout the week.",
    "link": "https://wamu.org/story/26/01/25/major-winter-storm-has-hit-the-dc-region/"
  },
  {
    "text": "Winter storm leaves hundreds of thousands of customers without power across the South - PBS",
    "fullText": "A massive winter storm dumped sleet, freezing rain and snow across much of the U.S. on Sunday, leaving hundreds of thousands of homes and businesses in the Southeast without electricity.",
    "link": "https://www.pbs.org/newshour/nation/winter-storm-leaves-hundreds-of-thousands-of-customers-without-power-across-the-south"
  },
  {
    "text": "5 Free Apps Actually Better Than Premium Alternatives - bgr.com",
    "fullText": "While most professional-grade apps lock premium features behind a paywall, apps like VLC, DaVinci Resolve, Bitwarden, etc., are completely free yet useful.",
    "link": "https://www.bgr.com/2079999/free-apps-better-premium-alternatives/"
  },
  {
    "text": "Philadelphia snow updates: Latest forecast, storm timing, travel impact and more - whyy.org",
    "fullText": "Significant snow accumulations are impacting Pennsylvania, New Jersey and Delaware. Here’s everything you need to know.",
    "link": "http://whyy.org/articles/philadelphia-snow-storm-updates-latest-forecast-timing/"
  },
  {
    "text": "Ukraine says US security guarantees deal '100% ready' - DW.com",
    "fullText": "President Volodymyr Zelenskyy said the US deal on security guarantees for Ukraine is completely ready, and Kyiv is simply waiting for a time and place to sign it.",
    "link": "https://www.dw.com/en/ukraine-says-us-security-guarantees-deal-100-ready/a-75653357"
  }
]