[
  {
    "text": "Park Service removes slavery exhibit at Independence Park in Philadelphia - The Washington Post",
    "fullText": "Park staff dismantled an exhibit about George Washington’s slave ownership amid a wider push to remove information on racism, sexism and climate change.",
    "link": "https://www.washingtonpost.com/climate-environment/2026/01/22/slavery-exhibit-removed/"
  },
  {
    "text": "Asian Stocks to Gain After US Data, BOJ in Focus: Markets Wrap - Bloomberg.com",
    "fullText": "Asian stocks climbed to a record and the dollar held its losses as global investors favored non-US assets amid policy unpredictability and geopolitical risks. Precious metals also set new all-time highs.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-22/stock-market-today-dow-s-p-live-updates"
  },
  {
    "text": "Death toll in Iran protest crackdown is reportedly at 5,002 as Trump says US 'armada' approaching - AP News",
    "fullText": "Activists report that Iran's crackdown on nationwide protests has killed at least 5,002 people. Many more are feared dead, but information is scarce in part because Iran has imposed the most comprehensive internet blackout in its history. The U.S.-based Human…",
    "link": "https://apnews.com/article/iran-protests-crackdown-death-toll-acb1968a973f19be217ea28b4a7adb0b"
  },
  {
    "text": "Video Shows Comedian Corey Holcomb Punch Female Comic in the Face - TMZ",
    "fullText": "There's nothing funny about what comedian Corey Holcomb appears to do in this video ... socking a woman right in the face, igniting a Hollywood street brawl.",
    "link": "https://www.tmz.com/2026/01/22/comedian-corey-holcomb-video-punch-face-cristina-payne/"
  },
  {
    "text": "Live updates: Vance blames Minnesota officials for ICE presence but concedes misconduct should be investigated - CNN",
    "fullText": "An immigration enforcement campaign is underway in Maine, a state that is home to a sizable Somali population, becoming the latest target of the Trump administration’s turbocharged, coast-to-coast crackdown. Follow for live updates",
    "link": "https://www.cnn.com/us/live-news/ice-minnesota-minneapolis-maine-immigration-01-22-26"
  },
  {
    "text": "Contractor indicted over alleged leaks to Washington Post - Politico",
    "fullText": "Auelio Perez-Lugones faces six felony charges related to unauthorized disclosure and possession of classified information.",
    "link": "https://www.politico.com/news/2026/01/22/washington-post-classified-docs-00743280"
  },
  {
    "text": "'The Pitt': Noah Wyle on Honoring Muslim Community After Tree of Life Attack - Variety",
    "fullText": "Noah Wyle and 'The Pitt' producers wanted to honor the Tree of Life attack victims and the Muslim community who helped in their latest season.",
    "link": "https://variety.com/2026/tv/news/the-pitt-noah-wyle-muslim-community-tree-of-life-attack-1236638423/"
  },
  {
    "text": "Trump budget office orders review of funds to Democratic-controlled states - The Washington Post",
    "fullText": "President Donald Trump said his administration would cut off federal resources to “sanctuary cities” on Feb. 1.",
    "link": "https://www.washingtonpost.com/business/2026/01/22/democratic-states-federal-funding-review/"
  },
  {
    "text": "Jaime King's Husband Austin Sosa Files For Divorce - TMZ",
    "fullText": null,
    "link": "https://www.tmz.com/2026/01/22/jaime-king-austin-sosa-files-divorce/"
  },
  {
    "text": "Winter storm could lift Conference Championship ratings - NBC Sports",
    "fullText": "A major winter storm is coming this weekend, and that could be good news for the NFL.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/winter-storm-could-lift-conference-championship-ratings"
  },
  {
    "text": "Mets acquire Vidal Brujan from Twins for cash considerations - SNY",
    "fullText": "The Mets made a trade with the Twins on Thursday night, acquiring utilityman Vidal Brujan for cash considerations.",
    "link": "https://sny.tv/articles/mets-trade-for-vidal-brujan-twins"
  },
  {
    "text": "Trump sues JPMorgan, Jamie Dimon over cutting off banking access - The Washington Post",
    "fullText": "President Donald Trump filed suit against JPMorgan Chase and its CEO, Jamie Dimon, saying the bank abruptly closed his accounts.",
    "link": "https://www.washingtonpost.com/business/2026/01/22/trump-lawsuit-jpmorganchase-dimon/"
  },
  {
    "text": "The deal to secure TikTok’s future in the US has finally closed - CNN",
    "fullText": "The joint venture acquiring TikTok’s US assets has been formally established and has announced its leadership team, according to the company, one day before the deadline set by President Donald Trump for the app’s US assets to be spun off by Chinese parent co…",
    "link": "https://www.cnn.com/2026/01/22/tech/tiktok-us-deal-closes"
  },
  {
    "text": "House Republicans barely defeat Venezuela war powers resolution to check Trump’s military actions - AP News",
    "fullText": "The House has barely rejected a Democratic-backed resolution that would have prevented President Donald Trump from sending U.S. military forces to Venezuela. A tied vote on the legislation fell just short of the majority needed for passage. Democrats forced t…",
    "link": "https://apnews.com/article/trump-venezuela-house-war-powers-19b78647b9d39cad589fa9fc4477e815"
  },
  {
    "text": "Hall of Famer Carlos Beltran: Not defined by Astros scandal - ESPN",
    "fullText": "Carlos Beltrán was the only player mentioned by name in the 2017 Astros' sign-stealing scandal, but the Hall of Famer said it doesn't define who he is.",
    "link": "https://www.espn.com/mlb/story/_/id/47697338/hall-famer-carlos-beltran-says-astros-scandal-define-him"
  },
  {
    "text": "Trump Reverses Course on Plan Allowing Homebuyers to Tap 401(k)s - Bloomberg.com",
    "fullText": "President Donald Trump threw cold water on a policy his administration was developing to allow savers in 401(k) retirement plans to use some of that money for down payments on homes — a proposal that had been a key part of his efforts to address voters’ affor…",
    "link": "https://www.bloomberg.com/news/articles/2026-01-22/trump-reverses-course-on-plan-allowing-homebuyers-to-tap-401-k-s"
  },
  {
    "text": "Weather update: Friday classes canceled - news.wisc.edu",
    "fullText": "In response to the extreme cold, UW–Madison is canceling classes on Friday, January 23.",
    "link": "https://news.wisc.edu/weather-update-friday-classes-canceled/"
  },
  {
    "text": "Elon Musk’s Fortune Hits Record $788 Billion As Tesla Spikes 4% - Forbes",
    "fullText": "Musk is closing in on the $800 billion mark as his net worth sets a new record.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/22/elon-musks-net-worth-hits-788-billion-in-record-setting-surge/"
  },
  {
    "text": "Heart disease deaths declined. And here's how to reduce your risk of the #1 killer - NPR",
    "fullText": "An annual report from the American Heart Association shows deaths from heart disease and stroke are down, encouraging news after the rate went up in the early years of the pandemic.",
    "link": "https://www.npr.org/2026/01/22/nx-s1-5685136/heart-disease-deaths-prevention-american-heart-association"
  }
]