[
  {
    "text": "Ex-Olympic snowboarder accused in drug smuggling ring heads to court - ABC News",
    "fullText": "A former Canadian Olympic snowboarder turned top FBI fugitive is expected to appear in federal court on charges related to allegedly running a billion-dollar multinational drug trafficking ring and orchestrating multiple killings",
    "link": "https://abcnews.go.com/US/wireStory/olympic-snowboarder-accused-drug-smuggling-ring-heads-court-129575968"
  },
  {
    "text": "Clemson Announces 2026 Football Schedule - Clemson Tigers",
    "fullText": "CLEMSON, S.C. — The Atlantic Coast Conference announced its 2026 football schedule on Monday evening, unveiling Clemson’s full 2026 regular season slate on ACC Network and ESPN2. Clemson will kick off its 2026 season on Saturday, Sept. 5, when Clemson faces t…",
    "link": "https://clemsontigers.com/clemson-announces-2026-football-schedule/"
  },
  {
    "text": "Chris Dudley returns to politics, aims to unseat Governor Tina Kotek in 2024 - katu.com",
    "fullText": "Former Portland Trail Blazer Chris Dudley is getting back into politics.",
    "link": "https://katu.com/news/local/chris-dudley-returns-to-politics-aims-to-unseat-governor-tina-kotek-in-2024-oregon-salem-john-kitzhaber-ed-diehl-david-medina"
  },
  {
    "text": "Republican drops bid for governor, citing GOP’s ‘retribution’ on Minnesota - The Washington Post",
    "fullText": "Chris Madel said in a video posted to social media that ICE operations in his state have been an “unmitigated disaster” and that he “cannot support the national Republicans’ stated retribution on the citizens of our state, nor can I count myself a member of a…",
    "link": "https://www.washingtonpost.com/politics/2026/01/26/madel-republican-minnesota-governor-race-drops-out/"
  },
  {
    "text": "SCHOOL CLOSINGS: List of Georgia districts canceling or going virtual Tuesday - wsbtv.com",
    "fullText": "These districts have changed their schedules on Tuesday.",
    "link": "https://www.wsbtv.com/news/local/school-closings-list-georgia-districts-canceling-or-going-virtual-tuesday/2LAT5ELIOBC23BLMLN2CG2XC2M/"
  },
  {
    "text": "This is Android 17’s blur, new screen recorder, & more in leaked screenshots [Gallery] - 9to5Google",
    "fullText": "The Android 17 leaks continue today with a preview at the upcoming blur effect for System UI, as well as functional changes and updates.",
    "link": "http://9to5google.com/2026/01/26/android-17-leak/"
  },
  {
    "text": "Trump says tariffs on South Korean autos, pharma, to rise to 25% over trade deal approval delay - CNBC",
    "fullText": "South Korean-based automaker Hyundai Motor is the largest importer of new vehicles from that country into the United States.",
    "link": "https://www.cnbc.com/2026/01/26/trump-south-korea-tariffs-trade-autos-pharma.html"
  },
  {
    "text": "Starmer Says UK Won’t Be Forced to Choose Between US, China - Bloomberg.com",
    "fullText": "Prime Minister Keir Starmer said the UK wouldn’t have to choose between the US and China, as he heralded “significant opportunities” for British businesses ahead of his trip to Beijing this week.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-26/starmer-says-uk-won-t-be-forced-to-choose-between-us-and-china"
  },
  {
    "text": "Doctors face-palm as RFK Jr.’s top vaccine advisor questions need for polio shot - Ars Technica",
    "fullText": "Kirk Milhoan's comments come as federal vaccine policy slides to insignificance.",
    "link": "https://arstechnica.com/science/2026/01/do-we-really-need-polio-shots-deep-thoughts-by-rfk-jr-advisor-get-dragged/"
  },
  {
    "text": "S&P 500 closes higher as Meta and Apple rise ahead of earnings reports: Live updates - CNBC",
    "fullText": "The S&P 500 rose as traders braced for a big week, with key earnings reports and a U.S. monetary policy meeting.",
    "link": "https://www.cnbc.com/2026/01/25/stock-market-today-live-updates.html"
  },
  {
    "text": "Former Citigroup executive sues bank over handling of sexual harassment claims - Financial Times",
    "fullText": "Complaint alleges ‘unrelenting and egregious sexual harassment’ by wealth chief Andy Sieg",
    "link": "https://www.ft.com/content/6b539d0f-d469-40ad-a967-5d712221038a"
  },
  {
    "text": "Why has Microsoft been routing example.com traffic to a company in Japan? - Ars Technica",
    "fullText": "Company's autodiscover caused users' test credentials to be sent outside Microsoft networks.",
    "link": "https://arstechnica.com/information-technology/2026/01/odd-anomaly-caused-microsofts-network-to-mishandle-example-com-traffic/"
  },
  {
    "text": "Marburg virus disease - Ethiopia - World Health Organization (WHO)",
    "fullText": "On 26 January 2026, the Ministry of Health of Ethiopia declared the end of the Marburg virus disease (MVD) outbreak. This declaration came after two consecutive incubation periods (a total of 42 days) since the last person confirmed with MVD died and was give…",
    "link": "https://www.who.int/emergencies/disease-outbreak-news/item/2026-DON592"
  },
  {
    "text": "Nicki Minaj and ‘Marty Supreme’ Actor Kevin O’Leary Set to Join Trump at Launch Event for “Trump Accounts” - hollywoodreporter.com",
    "fullText": "The Treasury Department is hosting the summit in Washington D.C. Wednesday, with Trump, Minaj, O'Leary, Cheryl Hines and Secretary Scott Bessent all slated to participate.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/nicki-minaj-kevin-oleary-trump-accounts-event-1236485271/"
  },
  {
    "text": "These Companies—Palantir, AT&T, Deloitte—Have The Biggest ICE Contracts As DHS Funding Under Fire - Forbes",
    "fullText": "Demonstrations have demanded an end to federal funding for ICE, after two protesters were killed by federal agents in Minneapolis.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/26/these-companies-palantir-att-deloitte-have-the-biggest-ice-contracts-as-dhs-funding-under-fire/"
  },
  {
    "text": "James Cameron’s Next Movie Delays Its Release Date - ComingSoon.net",
    "fullText": "The release date for James Cameron's next movie, which was supposed to come out in March, has been pushed back.",
    "link": "https://www.comingsoon.net/movies/news/2088056-james-cameron-next-movie-delays-release-date"
  },
  {
    "text": "Trump, Bondi statements fuel legal case against Minnesota surge - Politico",
    "fullText": "At a hearing Monday, a judge focused on a letter the attorney general sent to Gov. Tim Walz that appeared to set conditions on winding down Operation Metro Surge.",
    "link": "https://www.politico.com/news/2026/01/26/minnesota-operation-metro-surge-case-00746755"
  },
  {
    "text": "Anthropic launches interactive Claude apps, including Slack and other workplace tools - TechCrunch",
    "fullText": "Claude users will now be able to call up interactive apps inside the chatbot interface, with Cowork integration coming soon.",
    "link": "https://techcrunch.com/2026/01/26/anthropic-launches-interactive-claude-apps-including-slack-and-other-workplace-tools/"
  },
  {
    "text": "Google to pay $68 million over allegations its voice assistant eavesdropped on users - CBS News",
    "fullText": "Class-action lawsuit alleged that Google's voice assistant illegally recorded and shared private conversations with advertisers.",
    "link": "https://www.cbsnews.com/news/google-voice-assistant-lawsuit-settlement-68-million/"
  }
]