[
  {
    "text": "US accuses Russia of 'dangerous and inexplicable escalation' of war in Ukraine as Trump seeks peace - ABC News",
    "fullText": "The United States is accusing Russia of a “dangerous and inexplicable escalation” of the nearly four-year war in Ukraine at a time when the Trump administration is trying to advance negotiations toward peace",
    "link": "https://abcnews.go.com/US/wireStory/us-accuses-russia-dangerous-inexplicable-escalation-war-ukraine-129149728"
  },
  {
    "text": "Global temperatures dipped in 2025 but more heat records on way, scientists warn - BBC",
    "fullText": "The last three years were Earth's hottest on record, as humanity's carbon emissions continue to heat the planet.",
    "link": "https://www.bbc.com/news/articles/c5y5p9rzd4ko"
  },
  {
    "text": "Michigan State 81-60 Indiana (Jan 13, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401825438"
  },
  {
    "text": "Stranger Things documentary-maker gives reason for last minute script - BBC",
    "fullText": "The making-of documentary gives fans an insight into the production process of the hit sci-fi show.",
    "link": "https://www.bbc.com/news/articles/c89qel5l5vno"
  },
  {
    "text": "Japanese stocks open at record highs as expectations of snap poll rise - CNBC",
    "fullText": "This comes as Japan's ruling LDP under new Prime Minister Sanae Takaichi is expected to call an election in February.",
    "link": "https://www.cnbc.com/2026/01/14/asia-pacific-nikkei-225-japan-takaichi-election-record.html"
  },
  {
    "text": "Lawmakers meet Danish officials to rebuke Trump’s Greenland grab - Politico",
    "fullText": "The closed-door meeting comes as Trump has floated the idea of obtaining Greenland “one way or another.”",
    "link": "https://www.politico.com/live-updates/2026/01/13/congress/lawmakers-meet-danish-officials-rebuke-trump-greenland-00726166"
  },
  {
    "text": "Claudette Colvin, US civil rights pioneer, dies at 86 - BBC",
    "fullText": "Colvin was arrested for refusing to give up her bus seat to a white person months before the famous case of Rosa Parks.",
    "link": "https://www.bbc.com/news/articles/c1dknn00v3eo"
  },
  {
    "text": "Fact check: Trump litters Detroit economic speech with numerous false claims about economy - CNN",
    "fullText": "Inflation hasn’t “stopped.” Consumer prices are up during this presidential term, not “down.” Grocery prices are rising, not starting to fall “rapidly.” US businesses and consumers, not China, pay US tariffs on Chinese imports. It’s impossible to reduce presc…",
    "link": "https://www.cnn.com/2026/01/13/politics/detroit-speech-trump-economic-club"
  },
  {
    "text": "A Knight of the Seven Kingdoms review: The new Game of Thrones prequel is 'very funny' and a 'total delight' - BBC",
    "fullText": "The latest spin-off from Game of Thrones tells the story of an inexperienced knight and his cheeky squire. With its mix of brutal drama and plentiful humour, it's a \"nailed-on winner\".",
    "link": "https://www.bbc.com/culture/article/20260113-a-knight-of-the-seven-kingdoms-review"
  },
  {
    "text": "'Super flu' confirmed in Calif. as hospitalizations hit season high - SFGATE",
    "fullText": "A mutated influenza strain has spread across the globe this flu season, worrying medical experts.",
    "link": "https://www.sfgate.com/bayarea/article/super-flu-confirmed-calif-hospitalizations-high-21292907.php"
  },
  {
    "text": "FTC accuses AI search engine of 'rampant consumer deception' - NPR",
    "fullText": "Federal officials say a company that operates hundreds of landing pages for AI answers is running an operation that has duped thousands of users, who were unable to stop costly monthly charges.",
    "link": "https://www.npr.org/2026/01/13/nx-s1-5676150/ftc-lawsuit-just-answers-consumer-deception"
  },
  {
    "text": "Los Angeles Chargers Sign 14 Players to Contracts - Chargers.com",
    "fullText": "The Los Angeles Chargers today signed the following 14 players to Reserve/Future free agent contracts. 11 of the players finished the 2025 season on the team’s practice squad",
    "link": "https://www.chargers.com/news/sign-14-players-to-contracts-2026"
  },
  {
    "text": "Eagles make change at offensive coordinator - Philadelphia Eagles",
    "fullText": "Head Coach Nick Sirianni met with Kevin Patullo on Tuesday to inform him of the decision.",
    "link": "https://www.philadelphiaeagles.com/news/eagles-make-change-at-offensive-coordinator-kevin-patullo"
  },
  {
    "text": "New documents shed light on Renee Good’s ties to ICE monitoring efforts in Minneapolis - CNN",
    "fullText": "The woman killed by an ICE agent in Minneapolis last week served on the board of her son’s school, which linked to documents encouraging parents to monitor ICE and directing them to training.",
    "link": "https://www.cnn.com/2026/01/13/us/renee-good-minneapolis-ice-monitoring-school-invs"
  },
  {
    "text": "Rediscover your playful past with the Nintendo Switch 2025 Year in Review - nintendo.com",
    "fullText": "Take a scroll down memory lane and see your gameplay stats for the Nintendo Switch and Nintendo Switch 2 systems.",
    "link": "https://www.nintendo.com/us/whatsnew/rediscover-your-playful-past-with-the-nintendo-switch-2025-year-in-review/"
  },
  {
    "text": "11 Things To Do Before Animal Crossing: New Horizons' 3.0 Update - GameSpot",
    "fullText": "If it's been a while since you've visited your island, get ready for Animal Crossing's big 3.0 update and Switch 2 upgrade with these steps.",
    "link": "https://www.gamespot.com/gallery/things-to-do-before-animal-crossing-new-horizons-3-0-update/2900-7403/"
  },
  {
    "text": "Scientists Watched Viruses Attack Bacteria in Space. Things Got Weird - Gizmodo",
    "fullText": "\"Microbes continue to evolve under microgravity, and they do so in ways that are not always predictable.\"",
    "link": "https://gizmodo.com/scientists-watched-viruses-attack-bacteria-in-space-things-got-weird-2000709619"
  },
  {
    "text": "Money in Your Pockets: Governor Hochul Unveils New Initiatives to Make New York More Affordable - Governor Kathy Hochul (.gov)",
    "fullText": "Governor Hochul announced sweeping proposals to lower costs and make New York more affordable for individuals and families as part of her 2026 State of the State.",
    "link": "https://www.governor.ny.gov/news/money-your-pockets-governor-hochul-unveils-new-initiatives-make-new-york-more-affordable"
  }
]