[
  {
    "text": "Man who killed Japan's ex-PM Shinzo Abe gets life in prison - BBC",
    "fullText": "Abe's assassination stunned the country where there is virtually no gun crime.",
    "link": "https://www.bbc.com/news/articles/c86v5lj39zpo"
  },
  {
    "text": "Lindsey Halligan out as U.S. attorney following pressure from judges - The Washington Post",
    "fullText": "Halligan’s departure followed a pair of orders by federal judges in Virginia that sought to replace her and accused her of “masquerading” as U.S. attorney.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/20/halligan-judges-standoff-virginia-prosecutor/"
  },
  {
    "text": "White Sox To Trade Luis Robert Jr. To Mets - MLB Trade Rumors",
    "fullText": "Luis Robert haș finally been traded after years of rumors. Find the details on the move at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-to-acquire-luis-robert.html"
  },
  {
    "text": "Watch: Netflix Teases 2026 K-Drama, Film, And Variety Show Lineup - Soompi",
    "fullText": "Get ready for another exciting year of Korean dramas, films, variety content, and more! On January 21, Netflix unveiled its 2026 K-Content Lineup,",
    "link": "http://www.soompi.com/article/1813581wpp/watch-netflix-teases-2026-k-drama-film-and-variety-show-lineup"
  },
  {
    "text": "Report: Cody Bellinger is choosing from four teams - Yardbarker",
    "fullText": "The Cody Bellinger sweepstakes appear to be down to a Final Four.",
    "link": "https://larrybrownsports.com/baseball/cody-bellinger-choosing-4-teams/737246"
  },
  {
    "text": "Amazon gets approval to build massive retail concept in Orland Park - chicago.suntimes.com",
    "fullText": "The estimated 230,000-square-foot store will offer shoppers general merchandise and grocery items.",
    "link": "https://chicago.suntimes.com/real-estate/2026/01/20/amazon-approval-build-massive-new-retail-concept-orland-park"
  },
  {
    "text": "Donkey Kong Country Returns HD Gets A Free Switch 2 Update And Adds Dixie Kong - Nintendo Life",
    "fullText": "Download Version 1.1.0 for Switch and Switch 2 today!",
    "link": "https://www.nintendolife.com/news/2026/01/donkey-kong-country-returns-hd-gets-a-free-switch-2-update-and-adds-dixie-kong"
  },
  {
    "text": "College GameDay compares Indiana’s college football emergence to Butler in college basketball - On3",
    "fullText": "It's hard to find a comparison for what Curt Cignetti accomplished at Indiana by winning the national championship Monday.",
    "link": "https://www.on3.com/news/college-gameday-compares-indianas-college-football-emergence-to-butler-in-college-basketball/"
  },
  {
    "text": "Driver killed and several injured after train derails near Barcelona, local media report - BBC",
    "fullText": "At least 37 people have been injured, five seriously, in a second crash, after Sunday's two-train collision in Andalusia.",
    "link": "https://www.bbc.com/news/articles/c1m78xl0gmpo"
  },
  {
    "text": "Galaxy S26 Ultra color lineup looks pretty boring, and didn’t even copy iPhone orange - 9to5Google",
    "fullText": "New leaks have revealed the likely lineup for Samsung’s Galaxy S26 Ultra colors, and it sounds pretty tame. Leaker Evan...",
    "link": "http://9to5google.com/2026/01/20/galaxy-s26-ultra-color-lineup-looks-pretty-boring-and-didnt-even-copy-iphone-orange/"
  },
  {
    "text": "Winter Storm Warnings issued for 3 counties ahead of heavy incoming snow - mlive.com",
    "fullText": "“Travel could be very difficult. The hazardous conditions will impact the Wednesday morning commute.\"",
    "link": "https://www.mlive.com/weather/2026/01/winter-storm-warnings-issued-for-3-counties-ahead-of-heavy-incoming-snow.html"
  },
  {
    "text": "OnePlus phones are reportedly no more as Oppo pulls the plug on the company - XDA",
    "fullText": "Things are looking dire.",
    "link": "https://www.xda-developers.com/oneplus-phones-are-reportedly-no-more-as-oppo-pulls-the-plug-on-the-company/"
  },
  {
    "text": "Rams sound off on third round vs. Seahawks: ‘We’re the better team’ - The Seattle Times",
    "fullText": "The Seahawks face the Rams for the third time this season, this time for a spot in the Super Bowl. The Rams have expressed their confidence in winning the rubber match.",
    "link": "https://www.seattletimes.com/sports/seahawks/rams-sound-off-on-third-round-vs-seahawks-were-the-better-team/"
  },
  {
    "text": "The great Davos divorce: America's allies draw red line with Trump - Axios",
    "fullText": "\"Being a happy vassal is one thing. Being a miserable slave is something else.\"",
    "link": "https://www.axios.com/2026/01/20/davos-trump-greenland-europe-carney-macron"
  },
  {
    "text": "Governor Abbott activates state emergency response resources ahead of winter storm - fox4news.com",
    "fullText": "Governor Abbott has mobilized state emergency resources and agencies to prepare for a severe arctic cold front expected to bring life-threatening temperatures and hazardous winter weather to Texas.",
    "link": "https://www.fox4news.com/news/governor-abbott-activates-state-emergency-response-resources-ahead-winter-storm-jan-2026"
  },
  {
    "text": "'KPop'Demon Hunters' Breaks More Netflix Records: What We Watched - Deadline",
    "fullText": "Netflix released its What We Watched report for the second half of 2025, and 'KPop Demon Hunters' led the way.",
    "link": "http://deadline.com/2026/01/netflix-viewership-second-half-2025-kpop-record-wednesday-1236690643/"
  },
  {
    "text": "Trump added $2.25 trillion to the national debt in his first year back in charge, watchdog says - Fortune",
    "fullText": "The Peter G. Peterson Foundation, a nonpartisan budget watchdog, ran the numbers exclusively for Fortune.",
    "link": "https://fortune.com/2026/01/20/how-much-national-debt-grew-trump-first-year-back-in-office-president/"
  },
  {
    "text": "Complex building blocks of life form spontaneously in space, research reveals - Phys.org",
    "fullText": "Challenging long-held assumptions, Aarhus University researchers have demonstrated that the protein building blocks essential for life as we know it can form readily in space. This discovery, appearing in Nature Astronomy, significantly raises the statistical…",
    "link": "https://phys.org/news/2026-01-complex-blocks-life-spontaneously-space.html"
  },
  {
    "text": "Red Cross announces severe emergency blood shortage, calls on Americans to donate - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/red-cross-announces-severe-emergency-blood-shortage-calls/story?id\\\\u003d129379990"
  },
  {
    "text": "Russia’s top diplomat says NATO faces a deep crisis over Greenland - AP News",
    "fullText": "Russian Foreign Minister Sergey Lavrov says the bid by U.S. President Donald Trump to take over Greenland poses a “deep crisis” for NATO and raises questions about the alliance’s preservation as a single military-political bloc. Lavrov told reporters it could…",
    "link": "https://apnews.com/article/russia-lavrov-trump-putin-nato-greenland-ukraine-f4026977b1f4fb4d08be07ed54c34c07"
  }
]