[
  {
    "text": "Activist Investor Pushes Warner to Walk Away From Netflix Deal - The Wall Street Journal",
    "fullText": "Ancora builds a roughly $200 million stake in Warner Bros. Discovery and favors a deal with David Ellison’s Paramount Skydance",
    "link": "https://www.wsj.com/business/deals/activist-investor-pushes-warner-to-walk-away-from-netflix-deal-0bbe663e"
  },
  {
    "text": "Oak Lawn freight train derailment impacting Metra SWS services, roads near Central Avenue and 108th Street railroad crossing - ABC7 Chicago",
    "fullText": "A freight train derailment impacted Metra services and caused road closures in Oak Lawn on Wednesday.",
    "link": "https://abc7chicago.com/post/oak-lawn-freight-train-derailment-impacting-metra-services-roads-central-avenue-108th-street-railroad-crossing/18585059/"
  },
  {
    "text": "Pokémon Pokopia - The Final Preview - IGN",
    "fullText": "We’ve had some relaxing Pokémon games over the years, but we’ve never quite had a game that embraced this secondary cozy aesthetic fully into its gameplay–until now, with Pokémon Pokopia. I played the first hour of Pokémon’s first life-sim, and the sheer amou…",
    "link": "https://www.ign.com/articles/pokemon-pokopia-the-final-preview"
  },
  {
    "text": "Stock futures tick higher as traders await delayed January jobs report: Live updates - CNBC",
    "fullText": "Investors are looking ahead to the January jobs report, due Wednesday morning. The results could be a key catalyst for the market.",
    "link": "https://www.cnbc.com/2026/02/10/stock-market-today-live-updates.html"
  },
  {
    "text": "What a cardiologist eats in a day for better heart health - The Washington Post",
    "fullText": "Dariush Mozaffarian is a leader in the food-is-medicine movement. This is exactly what he eats — and yes, dessert is on the list.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/11/what-cardiologist-eats-heart-health/"
  },
  {
    "text": "'Hard to forgive' Olympian for cheating, declaration, woman says - ESPN",
    "fullText": "The former girlfriend of biathlon athlete Sturla Holm Laegreid said it will be \"hard to forgive\" him for cheating on her -- and for making a public display of it after he won an Olympic medal.",
    "link": "https://www.espn.com/olympics/story/_/id/47895366/hard-forgive-olympian-cheating-declaration-woman-says"
  },
  {
    "text": "Poll: Trump's ratings on immigration tumble as Americans lose confidence in his top issue - NBC News",
    "fullText": "Support for President Donald Trump’s immigration agenda is in free fall in early 2026 after federal immigration agents shot and killed two Americans last month, according to the new NBC News Decision Desk Poll powered by SurveyMonkey",
    "link": "https://www.nbcnews.com/politics/trump-administration/poll-trumps-ratings-immigration-tumble-americans-lose-confidence-top-i-rcna258159"
  },
  {
    "text": "Down-ballot races at stake in Texas GOP Senate primary - The Texas Tribune",
    "fullText": "Both John Cornyn and Ken Paxton argue they’re best equipped to carry the torch for Republicans and fight off Democratic headwinds in local races.",
    "link": "http://www.texastribune.org/2026/02/11/texas-us-senate-gop-primary-down-ballot-coattails-2026/"
  },
  {
    "text": "Russian drone strike kills three Ukrainian toddlers and their father - CNN",
    "fullText": "Three toddlers and their father were killed in a Russian drone strike in eastern Ukraine that also injured their pregnant mother, local emergency services said.",
    "link": "https://www.cnn.com/2026/02/11/europe/russian-drone-strike-toddlers-killed"
  },
  {
    "text": "The sell-off in AI losers has been so steep that this famed activist investor has reportedly sprung into action - MarketWatch",
    "fullText": "Elliott takes a stake in LSEG; Blackstone ups its stake in Anthropic",
    "link": "https://www.marketwatch.com/story/the-sell-off-in-ai-losers-has-been-so-steep-that-this-famed-activist-investor-has-reportedly-sprung-into-action-c100732b"
  },
  {
    "text": "Pam Bondi to face questions from House lawmakers about her DOJ leadership - NPR",
    "fullText": "The attorney general's appearance before the House Judiciary Committee comes one year into her tenure, a period marked by a striking departure from traditions and norms at the Justice Department.",
    "link": "https://www.npr.org/2026/02/11/nx-s1-5707280/pam-bondi-oversight-hearing-department-of-justice"
  },
  {
    "text": "From TSA lines to disaster relief, here’s how a DHS shutdown would hurt - Politico",
    "fullText": "Immigration and border security agencies wouldn't as affected in a funding lapse as other parts of the department.",
    "link": "https://www.politico.com/news/2026/02/10/dhs-shutdown-impact-furloughs-00775499"
  },
  {
    "text": "Father of U.S.-based Hong Kong activist convicted under national security law - NPR",
    "fullText": "The father of a U.S.-based activist wanted by Hong Kong authorities was convicted of attempting to deal with an absconder's financial assets on Wednesday, in the first court case of its kind brought under a homegrown national security law.",
    "link": "https://www.npr.org/2026/02/11/nx-s1-5711128/father-us-hong-kong-activist-convicted-security-law"
  },
  {
    "text": "U.S. Olympians Rally After Trump Jab Fuels Free Speech Spat: 'Pretty Childish' - HuffPost",
    "fullText": "\"Considering that side of the political spectrum always champions free speech, it's a little, I think, surprising to see them so triggered.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-winter-olympians-rally_n_698c2b59e4b04325c3fbcaf4"
  },
  {
    "text": "Annual governors' gathering with White House unraveling after Trump excludes Democrats - NPR",
    "fullText": "An annual meeting of the nation's governors that has long served as a rare bipartisan gathering is unraveling after President Donald Trump excluded Democratic governors from White House events.",
    "link": "https://www.npr.org/2026/02/11/g-s1-109579/annual-governors-gathering"
  },
  {
    "text": "Inside the Ralph Lauren fall 2026 fashion show: Anne Hathaway, Lana Del Rey, Lili Reinhart and more celebrities - Page Six",
    "fullText": "See all the biggest names at the show.",
    "link": "https://pagesix.com/2026/02/10/style/ralph-lauren-fall-winter-2026-fashion-show-anne-hathaway-lana-del-rey-lili-reinhart-and-more/"
  },
  {
    "text": "ChatGPT’s deep research tool adds a built-in document viewer so you can read its reports - The Verge",
    "fullText": "OpenAI is rolling out a full-screen document viewer for ChatGPT’s deep research tool, making it easier to navigate.",
    "link": "https://www.theverge.com/ai-artificial-intelligence/876775/openai-deep-research-chatgpt-full-screen-report-viewer"
  }
]