[
  {
    "text": "A blinding parasitic eye disease affects mostly contact lens wearers. Here’s how to avoid it - CNN",
    "fullText": "Acanthamoeba keratitis is a rare but blinding parasitic eye disease. Experts share how to avoid it and treat it.",
    "link": "https://www.cnn.com/2026/01/10/health/acanthamoeba-keratitis-symptoms-treatment-wellness"
  },
  {
    "text": "Influencer, White House welfare fraud claims are distorted, but the system has risks - NPR",
    "fullText": "Federal officials are targeting Democratic-led states over alleged safety-net fraud. Critics worry a drumbeat of unfounded accusations could undermine public trust.",
    "link": "https://www.npr.org/2026/01/10/nx-s1-5672684/benefits-fraud-unlawful-accusation-new-york-california-colorado-social-services"
  },
  {
    "text": "Heritage Foundation calls on US to prioritize marriage and family in new report - abcnews.go.com",
    "fullText": "The Heritage Foundation think tank is urging the federal government “to save and restore the American family,” kicking off the midterm election year with a call for conservatives to focus on domestic issues",
    "link": "https://abcnews.go.com/Politics/wireStory/heritage-foundation-calls-us-prioritize-marriage-family-new-129070529"
  },
  {
    "text": "Kevin Durant passes Wilt Chamberlain on career scoring list - NBA",
    "fullText": "Durant needed 15 points to eclipse Chamberlain, who scored 31,419 points. A 3rd-quarter jumper gave him 31,422.",
    "link": "https://www.nba.com/news/kevin-durant-passes-wilt-chamberlain-for-7th-on-the-nbas-career-scoring-list"
  },
  {
    "text": "Defense attorney disputes police narrative in Portland Border Patrol shooting - Oregon Public Broadcasting - OPB",
    "fullText": "The Department of Homeland Security identified the individuals shot as Venezuelan gang members. The federal defender first told OPB that the allegations are “a well-worn playbook.”",
    "link": "https://www.opb.org/article/2026/01/09/defense-attorney-disputes-police-narrative-in-portland-border-patrol-shooting/"
  },
  {
    "text": "North Korea vows response as it accuses the South of flying drones across the border - abcnews.go.com",
    "fullText": "North Korea has accused South Korea of flying drones across the border between the nations",
    "link": "https://abcnews.go.com/International/wireStory/north-korea-vows-response-accuses-south-flying-drones-129077683"
  },
  {
    "text": "Storm Goretti: Snow and ice warnings cover most of UK as tens of thousands without power - BBC",
    "fullText": "Yellow weather warnings for most of the UK remain until Saturday afternoon, with a further warning for some parts on Sunday.",
    "link": "https://www.bbc.com/news/articles/cvgdezxj617o"
  },
  {
    "text": "'Out of stock': What went wrong at luxury retailer Saks? - BBC",
    "fullText": "Saks Global, which owns Saks Fifth Avenue and Neiman Marcus, is expected to imminently file for bankruptcy protection, leaving questions about the retailer's future.",
    "link": "https://www.bbc.com/news/articles/czdq1z73pv9o"
  },
  {
    "text": "Figure skater Glenn wins 3rd straight U.S. title - ESPN",
    "fullText": "Amber Glenn wins her third consecutive U.S. Figure Skating title with a stunning free skate performance.",
    "link": "https://www.espn.com/olympics/story/_/id/47565368/efimova-mitrofanov-defend-pairs-title-face-citizenship-wait"
  },
  {
    "text": "Judge says Trump administration can’t block child care, other program money for 5 states for now - abcnews.go.com",
    "fullText": "A judge has ruled that President Donald Trump’s administration cannot block child care and other federal social service money from flowing to five states for now",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-trump-administration-block-child-care-program-money-129072240"
  },
  {
    "text": "Dolphins agree to terms with Jon-Eric Sullivan as General Manager - Miami Dolphins",
    "fullText": "The Miami Dolphins announced today that they have agreed to terms with Jon-Eric Sullivan to serve as the team’s general manager.",
    "link": "https://www.miamidolphins.com/news/dolphins-agree-to-terms-with-jon-eric-sullivan-as-general-manager"
  },
  {
    "text": "Microsoft issues important warning for Windows 11 Insiders - Neowin",
    "fullText": null,
    "link": "https://www.neowin.net/news/microsoft-issues-important-warning-for-windows-11-insiders/"
  },
  {
    "text": "Multiple small avalanches release in Juneau after city issues evacuation advisory - KTOO",
    "fullText": "Some residents have chosen to evacuate and others remain at home after city issues avalanche evacuation advisory. Several small avalanches have released in the usual paths across downtown and Thane.",
    "link": "https://www.ktoo.org/2026/01/09/multiple-small-avalanches-release-in-juneau-after-city-issues-evacuation-advisory/"
  },
  {
    "text": "Our perspective regarding the situation in Venezuela as shared with President Trump - Exxon Mobil Corporation",
    "fullText": "ExxonMobil Chairman and CEO Darren Woods, alongside other industry executives, attended a meeting hosted by President Donald Trump today to discuss the future of the oil and gas industry in Venezuela.",
    "link": "https://corporate.exxonmobil.com/news/news-releases/2026/our-perspective-regarding-the-situation-in-venezuela"
  },
  {
    "text": "‘Buckle up!’: CNBC anchor shocked as US trade deficit plunges to lowest since 2009. How to take advantage in 2026 - Yahoo Finance",
    "fullText": "It’s the smallest trade deficit since June 2009.",
    "link": "https://finance.yahoo.com/news/buckle-cnbc-anchor-shocked-us-215900943.html"
  },
  {
    "text": "Neil Young Scorches Donald Trump In New Editorial: ‘It’s ICE Cold Here in America’ - Rolling Stone",
    "fullText": "In a new editorial on the Neil Young Archives, Neil Young blasts Donald Trump and gives fans an update on the 4th Archive Series box set.",
    "link": "http://www.rollingstone.com/music/music-news/neil-young-donald-trump-editorial-ice-1235496906/"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Kansas City hit by a new ‘super flu’ variant causing a surge of cases - KCUR",
    "fullText": "Approximately 80% of active flu cases are an unexpected strain of Influenza A virus that health officials are calling a super flu. The Kansas City area has seen a dramatic spike in cases in recent weeks.",
    "link": "https://www.kcur.org/health/2026-01-12/kansas-city-super-flu-variant-influenza-illness-sick-respiratory-hospital"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "‘The Wire,’ ‘Gilmore Girls’ and 9 More Worthy Candidates for the Emmys’ New Legacy Award - The Hollywood Reporter",
    "fullText": "The Television Academy has said it might use the honor to correct past oversights.",
    "link": "http://www.hollywoodreporter.com/lists/the-wire-parks-and-rec-emmy-legacy-award-candidates/"
  }
]