[
  {
    "text": "Fire chief, four others critically injured in 'catastrophic' explosion at Boonville church - WSTM",
    "fullText": "Emergency crews responded to a report of a gas and odor explosion at Abundant Life Church in Boonville, Oneida County, N.Y.",
    "link": "https://cnycentral.com/news/local/report-emergency-crews-respond-to-explosion-at-oneida-county-church"
  },
  {
    "text": "Hilary Duff Says New Album Explores Complicated Family Life Amid Haylie Beef - tmz.com",
    "fullText": "Hilary Duff says her new album is her finally being ready to share who she is ... including her \"very complicated\" family dynamic and beef with her sister Haylie.",
    "link": "https://www.tmz.com/2026/02/17/hilary-duff-new-album-explores-family-drama/"
  },
  {
    "text": "Hegseth forces ouster of senior Army spokesman in latest internal clash - The Washington Post",
    "fullText": "Col. David Butler, who had been selected by senior Army leaders for promotion to brigadier general, will instead retire, officials said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/pete-hegseth-dan-driscoll-david-butler/"
  },
  {
    "text": "Norway's Tormod Frostad captures Olympic freeski big air gold - ESPN",
    "fullText": "Tormod Frostad of Norway won the gold medal in big air freeskiing at the Milan Cortina Olympics, beating Mac Forehand of the United States on the last jump of a high-scoring final Tuesday night.",
    "link": "https://www.espn.com/olympics/story/_/id/47957482/norway-tormod-frostad-captures-olympic-freeski-big-air-gold"
  },
  {
    "text": "Driver fleeing ICE officers crashes, killing a Georgia teacher, authorities say - NBC News",
    "fullText": "School officials identified the woman killed as Linda Davis, a special education teacher at Herman W. Hesse K-8 School.",
    "link": "https://www.nbcnews.com/news/us-news/driver-fleeing-ice-officers-crashes-killing-georgia-teacher-authoritie-rcna259418"
  },
  {
    "text": "WGA West Staff Goes On Strike Ahead Of Writers Union’s AMPTP Negotiations - Deadline",
    "fullText": "The WGA West staff has called a strike after negotiating its first contract with union management since September",
    "link": "http://deadline.com/2026/02/wga-west-staff-strike-ahead-of-amptp-negotiations-1236727415/"
  },
  {
    "text": "Peru’s leader José Jerí ousted over ‘Chifa-gate’ scandal, as presidential ‘curse’ strikes again - CNN",
    "fullText": "Peru’s president has been ousted after being censured by Congress, marking the country’s eighth change of leader in nearly a decade of political instability.",
    "link": "https://www.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam"
  },
  {
    "text": "Stephen Colbert says CBS didn't air interview out of fear of FCC - NBC News",
    "fullText": "“Late Show” host Stephen Colbert said CBS did not air his Monday interview with Texas state Rep.",
    "link": "https://www.nbcnews.com/business/media/stephen-colbert-cbs-james-talarico-fcc-rcna259341"
  },
  {
    "text": "Federal judge rules Kilmar Abrego Garcia can’t be re-detained by immigration authorities - AP News",
    "fullText": "A federal judge has ruled that U.S. Immigration and Customs Enforcement cannot re-detain Kilmar Abrego Garcia because a 90-day detention period has expired and the U.S. government has no viable plan for deporting him. The Salvadoran national’s case has become…",
    "link": "https://apnews.com/article/abrego-garcia-immigration-ice-ec79dc6e073493ec8a8284fa32c7a2fb"
  },
  {
    "text": "Stock Market Today: Dow, Nasdaq Steady; Warner Bros., Paramount Stocks in Focus— Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-17-2026"
  },
  {
    "text": "Cabinet secretary frontrunner faced multiple bullying complaints - BBC",
    "fullText": "Claims emerge after the Cabinet Office said there was only one complaint about Antonia Romeo's conduct which was dismissed after an inquiry.",
    "link": "https://www.bbc.com/news/articles/cn0zjw5pz48o"
  },
  {
    "text": "Miley Cyrus to Return for ‘Hannah Montana 20th Anniversary Special,’ March Release Set on Disney+ - Variety",
    "fullText": "Miley Cyrus is returning to her Disney roots with the \"Hannah Montana 20th Anniversary Special\" on Disney+.",
    "link": "https://variety.com/2026/tv/news/miley-cyrus-hannah-montana-20th-anniversary-special-disney-1236665605/"
  },
  {
    "text": "Trump family business files for trademark rights on any airports using the president’s name - AP News",
    "fullText": "The Trump family company wants to trademark the use of the president’s name on any airports but says it doesn’t plan on charging a fee — at least for a proposed renaming of one near his Florida home. Applications filed by the Trump Organization with the feder…",
    "link": "https://apnews.com/article/trump-family-trademark-airports-d636dc340af72e6f2c8997b83745ff1d"
  },
  {
    "text": "What I Heard at NBA All-Star Weekend: Ideas to Stop Tanking, LeBron James Retirement Plans - Sports Illustrated",
    "fullText": "Also, more on Jayson Tatum’s plans to return from injury and players reacting to Chris Paul’s abrupt retirement.",
    "link": "https://www.si.com/nba/what-i-heard-at-nba-all-star-weekend-ideas-to-stop-tanking-lebron-james-retirement-plans"
  },
  {
    "text": "Bay Area gets first winter weather advisory in 3 years - SFGATE",
    "fullText": "Multiple storms are bringing cold temperatures, along with lightning and snow showers, to the region.",
    "link": "https://www.sfgate.com/weather/article/bay-area-weather-snow-21358119.php"
  },
  {
    "text": "Jesse Jackson, a leading African American voice on global stage, dies at 84 - The Washington Post",
    "fullText": "A former aide to Martin Luther King Jr., he launched two historic presidential campaigns while spreading a message of hope and resilience: “I am — somebody.”",
    "link": "https://www.washingtonpost.com/obituaries/2026/02/17/jesse-jackson-dead-civil-rights/"
  },
  {
    "text": "Google Pixel 'Project Toscana' reportedly upgrades face unlock hardware, compares to iPhone Face ID - 9to5Google",
    "fullText": "Biometrics are a core part of any smartphone nowadays, and Google Pixel is one of the few brands that balances...",
    "link": "http://9to5google.com/2026/02/17/google-pixel-face-unlock-project-toscana-report/"
  },
  {
    "text": "2026 NFL franchise tag primer: Candidates to watch while window is open - NFL.com",
    "fullText": "With NFL free agency just around the corner, Judy Battista spotlights seven notable candidates for the franchise tag before the 2026 deadline. Will the Colts retain quarterback Daniel Jones or let him test the open market?",
    "link": "https://www.nfl.com/news/2026-nfl-franchise-tag-primer-candidates-to-watch-while-window-is-open"
  },
  {
    "text": "Google teases I/O 2026 with ‘Make Build Unlock’ puzzle - 9to5Google",
    "fullText": "The journey to Google I/O 2026 is well underway this morning with a puzzle to figure out the dates for the developer conference.",
    "link": "http://9to5google.com/2026/02/17/google-io-2026-puzzle/"
  },
  {
    "text": "The Women of 'KPop Demon Hunters' on Overcoming Rejection, 'Golden's' Success - Variety",
    "fullText": "The Women of \"KPop Demon Hunters\"  on overcoming rejection, \"Golden's\" success and breaking boundaries for Korean Culture: \"Drop the K. It's No More\"",
    "link": "https://variety.com/2026/music/news/women-kpop-demon-hunters-rejection-golden-success-1236658705/"
  }
]