[
  {
    "text": "Bad Bunny Humiliates MAGA’s Super Bowl Act Ahead of Showdown - The Daily Beast",
    "fullText": "Bad Bunny is set to blow Kid Rock’s show out of the water.",
    "link": "https://www.thedailybeast.com/bad-bunny-humiliates-magas-super-bowl-act-ahead-of-showdown/"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date Latest: What To Expect And When - Forbes",
    "fullText": "Samsung will launch the Galaxy S26 Ultra, Galaxy S26+ and Galaxy S26 later this month. When can you expect the launch, the pre0-orders, reviews and retail sales to start?",
    "link": "https://www.forbes.com/sites/ewanspence/2026/02/08/samsung-galaxy-s26-ultra-launch-date-release-date-galaxy-unpacked-new-galaxy-s26/"
  },
  {
    "text": "Super Bowl 2026: When Green Day performs, how to watch live - Mashable",
    "fullText": "If Green Day is your must-see moment, don’t wait for kickoff.",
    "link": "https://mashable.com/article/super-bowl-green-day-performance-time-livestream-info"
  },
  {
    "text": "Rep. Tony Gonzales defends conditions at Texas detention center with measles outbreak - cbsnews.com",
    "fullText": "Rep. Tony Gonzales said the Dilley detention facility, the only immigration facility that houses children, is \"nicer than some elementary schools.\"",
    "link": "https://www.cbsnews.com/news/tony-gonzales-dilley-detention-facility-conditions-measles/"
  },
  {
    "text": "Federal judge orders Fulton County Georgia election case documents unsealed by Tuesday - CNBC",
    "fullText": "The FBI last month raided an election facility central to President Donald Trump's debunked claims of fraud in the 2020 election.",
    "link": "https://www.cnbc.com/2026/02/08/georgia-trump-election-case-judge-federal-unsealed.html"
  },
  {
    "text": "Jordon Hudson trolls Robert Kraft with \"Orchids of Asia\" T-shirt - NBC Sports",
    "fullText": "Nobody does petty better than Bill Belichick.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jordon-hudson-trolls-robert-kraft-with-orchids-of-asia-t-shirt"
  },
  {
    "text": "'Killjoy' - did VAR get late drama in Liverpool v Man City right? - BBC",
    "fullText": "Manchester City's win at Liverpool ended in complete chaos - but did the referee and the VAR get Dominik Szoboszlai's red card right?",
    "link": "https://www.bbc.com/sport/football/articles/c5yjkgyxk2mo"
  },
  {
    "text": "Trump cut science funding. Small businesses are paying the price. - Politico",
    "fullText": "Some federal contractors are feeling the squeeze after the president slashed support for climate programs and other research efforts.",
    "link": "https://www.politico.com/news/2026/02/08/trump-cut-science-funding-now-small-businesses-are-paying-the-price-00765051"
  },
  {
    "text": "“The Moment” is Charli xcx’s disturbing sellout fantasy - Salon.com",
    "fullText": "In her concept film, the \"Brat\" singer succumbs to a world where success isn't enough. It looks a lot like our own.",
    "link": "https://www.salon.com/2026/02/08/the-moment-is-charli-xcxs-disturbing-sellout-fantasy/"
  },
  {
    "text": "‘I think I could be done’: Jon Jones gives update on UFC future - MMA Fighting",
    "fullText": "Jon Jones appears to be leaning towards retirement for good from UFC competition.",
    "link": "https://www.mmafighting.com/ufc/471030/i-think-i-could-be-done-jon-jones-gives-update-on-ufc-future"
  },
  {
    "text": "Andrew shared confidential information with Epstein as trade envoy, files suggest - BBC",
    "fullText": "Under official guidance, trade envoys have a duty of confidentiality over sensitive, commercial, or political information.",
    "link": "https://www.bbc.com/news/articles/c99j01p1yjro"
  },
  {
    "text": "Fetterman: 'I absolutely would expect' another government shutdown - Politico",
    "fullText": "The Democratic senator said he doesn’t see a path toward a deal on Homeland Security funding.",
    "link": "https://www.politico.com/news/2026/02/08/fetterman-government-shutdown-00770652"
  },
  {
    "text": "Wes Moore suggests race may be why he was not invited to gov dinner with Trump - Politico",
    "fullText": "The nation’s only sitting Black governor was not invited to a traditionally bipartisan event involving the National Governors Association and the White House.",
    "link": "https://www.politico.com/news/2026/02/08/wes-moore-race-governors-trump-00770586"
  },
  {
    "text": "From Svedka to Anthropic, brands make bold plays with AI in Super Bowl ads - TechCrunch",
    "fullText": "From the first AI-generated Big Game ad courtesy of Svedka to Anthropic's beef with OpenAI, here are the biggest ads from Super Bowl LX.",
    "link": "https://techcrunch.com/2026/02/08/super-bowl-60-ai-ads-svedka-anthropic-brands-commercials/"
  },
  {
    "text": "Scientists Just Found a Fossil at the Bottom of the Ocean. Here’s What It Reveals About Our Ancestors! - The Daily Galaxy",
    "fullText": "A fossil from a long-lost human species has surfaced from the depths of the ocean, but this discovery isn’t what we expected. What does this jawbone tell us about how Denisovans lived and thrived in surprising places?",
    "link": "https://dailygalaxy.com/2026/02/scientists-found-fossil-at-bottom-of-ocean/"
  },
  {
    "text": "Trump wants to run the economy hot, as midterm elections approach - The Washington Post",
    "fullText": "The administration predicts an economic boom that will lift Republicans in November’s congressional elections, driven by big tax refunds and investment incentives.",
    "link": "https://www.washingtonpost.com/business/2026/02/08/economic-boom-2026-elections/"
  },
  {
    "text": "Morgan McSweeney quits as PM's chief of staff following Mandelson scandal - BBC",
    "fullText": "Keir Starmer and McSweeney decided it was the right time for him to leave, the BBC understands, as Jill Cuthbertson and Vidhya Alakeson are appointed acting chiefs of staff.",
    "link": "https://www.bbc.com/news/live/c74wd01egvyt"
  },
  {
    "text": "Democrat Chasity Verret Martinez wins Louisiana state House special seat in district Trump won - cbsnews.com",
    "fullText": "Democrat Chasity Verret Martinez defeated her Republican opponent in a district President Trump won by 13 points in 2024.",
    "link": "https://www.cbsnews.com/news/chasity-verret-martinez-wins-democrat-louisiana-special-election-trump/"
  }
]