[
  {
    "text": "How packaging and logistics companies are automating their warehouses - CNBC",
    "fullText": "Companies like UPS, FedEx and DHL are increasingly turning to automation in their warehouse processes to work toward greater efficiency and lower costs.",
    "link": "https://www.cnbc.com/2026/02/13/shipping-auotmation-logistics-labor.html"
  },
  {
    "text": "Former SNP chief executive Peter Murrell accused of embezzling £459,000 over 12-year period - BBC",
    "fullText": "The former SNP chief executive is accused of illicitly purchasing items including luxury goods, jewellery, cosmetics, two cars and a motorhome.",
    "link": "https://www.bbc.com/news/articles/cg7erzygx52o"
  },
  {
    "text": "Experts who worry about child vaccination need to look in the mirror - The Hill",
    "fullText": "All of us simply want to understand what is best for our children.",
    "link": "https://thehill.com/opinion/healthcare/5735208-experts-who-worry-about-child-vaccination-need-to-look-in-the-mirror/"
  },
  {
    "text": "Dubai's DP World replaces CEO after Epstein links emerge - CNBC",
    "fullText": "Sultan Ahmed bin Sulayem had been the CEO of Dubai's largest port operator since 2016 and chairman since 2007.",
    "link": "https://www.cnbc.com/2026/02/13/dubais-dp-world-replaces-ceo-after-epstein-links-emerge.html"
  },
  {
    "text": "Russell tops Day 3 morning session at Bahrain test - Formula 1",
    "fullText": "George Russell set the pace during the morning session on the third day of pre-season testing in Bahrain, the Mercedes driver heading Lewis Hamilton and Max Verstappen on the timesheets.",
    "link": "https://www.formula1.com/en/latest/article/russell-tops-morning-timesheets-on-day-3-of-first-pre-season-test-in-bahrain.4CTYYDQSa2PSGzxHoJd7h6"
  },
  {
    "text": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again - Live Science",
    "fullText": "A record-breaking gravitational wave signal let scientists \"listen\" to a distant black hole merger and put Einstein's gravity to its toughest test yet.",
    "link": "https://www.livescience.com/physics-mathematics/record-breaking-gravitational-wave-puts-einsteins-relativity-to-its-toughest-test-yet-and-proves-him-right-again"
  },
  {
    "text": "Who will police Gaza, and how? - NPR",
    "fullText": "Under President Trump's Gaza ceasefire plan, Arab countries and the European Union are supposed to train a new police force in the Gaza Strip. But U.S. plans have run into serious challenges.",
    "link": "https://www.npr.org/2026/02/13/g-s1-109343/gaza-israel-police"
  },
  {
    "text": "RFK Jr. made promises to get his job as health secretary. He's broken many of them - NPR",
    "fullText": "In his confirmation hearings, Robert F. Kennedy Jr. told U.S. senators that he would not cut funding for vaccine research or change the nation's official vaccine recommendations. He did both.",
    "link": "https://www.npr.org/2026/02/13/nx-s1-5712721/rfk-jr-children-vaccines-cdc-funding-autism-immunizations"
  },
  {
    "text": "A bipartisan effort to save health subsidies failed. Will ICE reform be different? - NPR",
    "fullText": "A bipartisan effort in Congress to restrain immigration enforcement tactics is flailing despite a Friday deadline to fund the Department of Homeland Security. The pattern is increasingly familiar.",
    "link": "https://www.npr.org/2026/02/13/g-s1-109818/bipartisan-effort-save-health-subsidies-failed-ice-reform-different"
  },
  {
    "text": "CEO Marc Benioff's ICE jokes stir outrage in a pivotal time for Salesforce - Business Insider",
    "fullText": "CEO Marc Benioff's ICE jokes at a Salesforce event stirred employee backlash, adding to company challenges like stock decline.",
    "link": "https://www.businessinsider.com/marc-benioff-ice-jokes-outrage-pivotal-time-salesforce-2026-2"
  },
  {
    "text": "Bangladesh Nationalist Party claims victory in country’s first election since 2024 uprising - AP News",
    "fullText": "The Bangladesh Nationalist Party has claimed victory in the country’s first election since the 2024 uprising, positioning itself to form the next government and potentially reshape Bangladesh’s political landscape after years of intense rivalry and disputed p…",
    "link": "https://apnews.com/article/bangladesh-election-hasina-tarique-rahman-bnp-8ec3a74b4488dfe998b3d1d232c3ba4f"
  },
  {
    "text": "Horoscope for Friday, February 13, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/13/horoscopes-today-friday-february-13-2026"
  },
  {
    "text": "Ukrainian forces say Russian troops paid them for a fake Starlink service that instead revealed battlefield locations - Business Insider",
    "fullText": "Ukrainian OSINT groups pushed the ruse by pretending to complain about a Russian Telegram bot actually run by Kyiv's troops, the division said.",
    "link": "https://www.businessinsider.com/ukraine-starlink-operation-cyber-assault-fake-registration-location-data-2026-2"
  },
  {
    "text": "Second US aircraft carrier is being sent to the Middle East, AP source says, as Iran tensions high - AP News",
    "fullText": "The world’s largest aircraft carrier, the USS Gerald R. Ford, has been ordered to sail from the Caribbean Sea to the Middle East. That's according to a person familiar with the matter who spoke Thursday on condition of anonymity. It comes as U.S. President Do…",
    "link": "https://apnews.com/article/trump-iran-aircraft-carrier-military-8db3fab10476949acda8b973be416204"
  },
  {
    "text": "A Pilot Fired Over Kristi Noem’s Missing Blanket and the Constant Chaos Inside DHS - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/policy/chaos-kristi-noem-homeland-security-f095ac95"
  },
  {
    "text": "Google Docs rolling out Gemini-powered audio summaries - 9to5Google",
    "fullText": "After introducing text-to-speech in August, Google Docs is now rolling out audio summaries. Available for...",
    "link": "http://9to5google.com/2026/02/12/google-docs-audio-summaries/"
  },
  {
    "text": "Seahawks' Julian Love sets record straight on how much they knew was coming from Patriots offense in Super Bowl LX - NFL.com",
    "fullText": "With NFL Films capturing some prophetic words from Julian Love during Super Bowl LX, many were led to believe the Seahawks D knew just what was coming from the Patriots offense. The standout safety explained just how much they knew on Thursday's The Insid",
    "link": "https://www.nfl.com/news/seahawks-julian-love-sets-record-straight-on-how-much-they-knew-was-coming-from-patriots-offense-in-super-bowl-lx"
  }
]