[
  {
    "text": "Top diplomats of China, Cambodia and Thailand meet as Beijing seeks a stronger role in dispute - AP News",
    "fullText": "Foreign ministers from Cambodia and Thailand have convened with their Chinese counterpart to discuss the border dispute between the two Southeast Asian countries. The trilateral meeting Monday was held in a southwestern Chinese province north of the region wh…",
    "link": "https://apnews.com/article/china-thailand-cambodia-meeting-yunnan-border-dispute-730a88992ab3188a2f8effcf25ecb915"
  },
  {
    "text": "Science history: Richard Feynman gives a fun little lecture — and dreams up an entirely new field of physics — Dec. 29, 1959 - Live Science",
    "fullText": "In a short talk at Caltech, physicist Richard Feynman laid out a vision of manipulating and controlling atoms at the tiniest scale. It would precede the field of nanotechnology by decades.",
    "link": "https://www.livescience.com/physics-mathematics/particle-physics/science-history-richard-feynman-gives-a-fun-little-lecture-and-dreams-up-an-entirely-new-field-of-physics-dec-29-1959"
  },
  {
    "text": "China signals tolerance for stronger renminbi - Financial Times",
    "fullText": "Central bank fixes currency at highest level against dollar in 15 months",
    "link": "https://www.ft.com/content/0dfded3d-c3b4-4a25-b18c-b04b9610fd1f"
  },
  {
    "text": "Horoscope for Monday, December 29, 2025 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2025/12/29/horoscopes-today-monday-december-29-2025"
  },
  {
    "text": "Red Wings 3-2 Maple Leafs (Dec 28, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nhl/recap?gameId\\\\u003d401802952"
  },
  {
    "text": "NFL Week 17 winners and losers: Steelers, Packers stumble; who's still alive in playoff race? - NFL.com",
    "fullText": "Judy Battista reveals the 10 biggest winners and losers from Week 17. Who's still alive in the playoff race heading into the final week of the 2025 regular season? And which individual performances stood out?",
    "link": "https://www.nfl.com/news/nfl-week-17-winners-and-losers-steelers-packers-stumble-who-s-still-alive-in-playoff-race"
  },
  {
    "text": "US-Nigeria strikes: Living in fear of Lakurawa - the militant group Trump targeted - BBC",
    "fullText": "\"We cannot live freely. You cannot even play music\" - residents tell the BBC of militants' rule.",
    "link": "https://www.bbc.com/news/articles/cy7vr76l521o"
  },
  {
    "text": "Kosovo's ruling party wins election after months of political deadlock - BBC",
    "fullText": "The decisive victory for the Albanian nationalist Vetevendosje party means a third term for leader Albin Kurti.",
    "link": "https://www.bbc.com/news/articles/ce3z3w4wy0go"
  },
  {
    "text": "Takeaways from Trump’s meeting with Zelensky in Florida - CNN",
    "fullText": "Ukrainian President Volodymyr Zelensky traded freezing, missile-tormented Kyiv on Sunday for the frescoed dining room at Mar-a-Lago, where he hoped to gain President Donald Trump’s sign-off on a revised 20-point peace plan to end the war in his country.",
    "link": "https://www.cnn.com/2025/12/28/politics/trump-zelensky-florida-meeting-takeaways"
  },
  {
    "text": "Justice Department says Jan. 6 pipe bomb suspect believed election conspiracy theories - Politico",
    "fullText": "The DOJ said in a new filing that the suspect was not “openly political” but believed the 2020 election had been tampered with.",
    "link": "https://www.politico.com/news/2025/12/28/pipe-bomb-justice-department-jan-6-suspect-00707242"
  },
  {
    "text": "‘Bomb cyclone’ forecasted to bring heavy snow, blizzard conditions and dangerous travel - NPR",
    "fullText": "A 'bomb cyclone' is intensifying severe winter weather for millions of people across the U.S. The system is expected to knock out power and disrupt holiday travel.",
    "link": "https://www.npr.org/2025/12/28/nx-s1-5659746/bomb-cyclone-blizzard-dangerous-travel"
  },
  {
    "text": "‘Super flu’ cases rising across US: What to know - NewsNation",
    "fullText": "The “super flu” is a variant of influenza A H3N2 called subclade K that doctors say is more severe and takes longer to recover from.",
    "link": "https://www.newsnationnow.com/health/super-flu-cases-what-to-know/"
  },
  {
    "text": "Lower-cost space missions like NASA's ESCAPADE are starting to deliver exciting science – but at a price in risk and trade‑offs - Space",
    "fullText": "This low-cost mission is still only getting started, and it's taking bigger risks than typical big-ticket NASA missions.",
    "link": "https://theconversation.com/lower-cost-space-missions-like-nasas-escapade-are-starting-to-deliver-exciting-science-but-at-a-price-in-risk-and-trade-offs-270619"
  },
  {
    "text": "Trump chooses to go back to the moon — and to do it this decade - The Hill",
    "fullText": "All the stars are aligned.",
    "link": "https://thehill.com/opinion/technology/5659865-trump-orders-moon-return/"
  },
  {
    "text": "4 Exciting Smart TVs Coming Out In 2026 - bgr.com",
    "fullText": "The 2026 TV lineup features the LG Micro RGB evo, Samsung's expanded Micro RGB series, and the flagship S99H OLED. See the top 4 TVs redefining entertainment.",
    "link": "https://www.bgr.com/2057922/smart-tvs-coming-out-2026/"
  },
  {
    "text": "Nancy Pelosi predicts Dems win House gavel back in ‘26, reflects on career and Jan. 6 attack - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/nancy-pelosi-predicts-dems-win-house-gavel-back/story?id\\\\u003d128684674"
  }
]