[
  {
    "text": "Everything to know about Nipah virus amid cases being detected in India - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/nipah-virus-amid-cases-detected-india/story?id\\\\u003d129667635"
  },
  {
    "text": "The meaning of Xi’s military purge - Financial Times",
    "fullText": "Relations between Chinese Communist leaders and the army have always been fraught",
    "link": "https://www.ft.com/content/1e722210-d6c6-4972-a60c-92d460059fa8"
  },
  {
    "text": "Hornets 123-121 Mavericks (Jan 29, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810538"
  },
  {
    "text": "'The PItt' Season 2: How Tracy Ifeachor's Character Is Written Out - Deadline",
    "fullText": "'The Pitt' explains what Tracy Ifeachor's character Dr. Collins has moved on to do following actor's exit.",
    "link": "http://deadline.com/2026/01/the-pitt-tracy-ifeachor-dr-collins-exit-explained-season-2-1236629934/"
  },
  {
    "text": "Sean Grayson sentenced to 20 years in prison for fatal shooting of Sonya Massey - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sean-grayson-faces-20-years-prison-fatal-shooting/story?id\\\\u003d129668798"
  },
  {
    "text": "Amazon Blocks Mainstream Press From Watching ‘Melania’ Documentary at Kennedy Center - Variety",
    "fullText": "After a red carpet attended by Donald and Melania Trump, mainstream media were banned from attending a screening of Amazon MGM's Melania documentary.",
    "link": "https://variety.com/2026/film/news/melania-documentary-premiere-amazon-blocks-press-1236645317/"
  },
  {
    "text": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody - mprnews.org",
    "fullText": "The children were taken into ICE custody after their mother was detained at a court appointment. School leaders say the mother asked them to bring the kids to the detention center because there were no family members in Minnesota to care for them.",
    "link": "https://www.mprnews.org/story/2026/01/29/2-more-kids-from-liam-ramos-columbia-heights-school-in-ice-custody"
  },
  {
    "text": "Eva Longoria, John Leguizamo & Xochitl Gomez Among 100-Plus Latino Artists To Sign Open Letter To Hollywood Following ‘Deep Cuts’ Casting Backlash - Deadline",
    "fullText": "More than 100 Latino actors, artists and storytellers sign an open letter to Hollywood about representation amid 'Deep Cuts' casting backlash.",
    "link": "http://deadline.com/2026/01/open-letter-deep-cuts-latino-representation-hollywood-1236702919/"
  },
  {
    "text": "Can Silicon Valley make a governor? Matt Mahan is betting yes - Politico",
    "fullText": "For all the region’s financial and cultural heft, the bastion of Big Tech has been a cul-de-sac of political power in California.",
    "link": "https://www.politico.com/news/2026/01/29/can-silicon-valley-make-a-governor-matt-mahan-is-betting-yes-00756444"
  },
  {
    "text": "Your Halo Story | Halo - Official Site (en) - Halo Waypoint",
    "fullText": "<p>I’m obsessed with stories. This comes as a shock to many of you, I know. These days when we hear the term, the immediate association is likely with penwoven narratives underpinning myriad entertainment properties and creative content. Or perhaps some varia…",
    "link": "https://www.halowaypoint.com/news/your-halo-story-chapter-01"
  },
  {
    "text": "Man who squirted apple cider vinegar on Omar is charged with assaulting and intimidating her - AP News",
    "fullText": "The Justice Department has charged a man who squirted apple cider vinegar on Democratic U.S. Rep. Ilhan Omar at an event in Minneapolis. The man arrested for Tuesday’s attack, Anthony Kazmierczak, faces a charge of forcibly assaulting, opposing, impeding and …",
    "link": "https://apnews.com/article/ihan-omar-vinegar-attack-minneapolis-385a30eaf6acc40d6ba5c6c45c09304d"
  },
  {
    "text": "Massachusetts on \"razor's edge\" with weekend storm. Maps show best chance for snow, high winds. - CBS News",
    "fullText": "It does not appear that the storm will track close enough to New England to deliver what could have been, a devastating and destructive blow.",
    "link": "https://www.cbsnews.com/boston/news/massachusetts-snow-map-boston-storm-bombogenesis/"
  },
  {
    "text": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "fullText": "\"It is amazing to see that we are gradually moving towards combining these breakthrough observations across multiple frequencies and completing the picture of the jet launching region.\"",
    "link": "https://www.space.com/astronomy/black-holes/astronomers-watch-1st-black-hole-ever-imaged-launch-a-3-000-light-year-long-cosmic-jet-from-its-glowing-shadow"
  },
  {
    "text": "Trump says Putin will not attack Ukraine cities during cold week - BBC",
    "fullText": "Ukraine's Air Force said regions near the front line had been targeted by drones and a ballistic missile overnight.",
    "link": "https://www.bbc.com/news/articles/c4g4yj92kwro"
  },
  {
    "text": "Landmark crypto bill clears Senate hurdle but Democrats withhold support over lack of 'gryfto' rules to prevent Trump family conflicts of interest - Fortune",
    "fullText": "The blockchain industry has raised millions in fresh funding to advance its political agenda in Washington, D.C.",
    "link": "https://fortune.com/2026/01/29/clarity-act-gryfto-crypto-senate-agriculture-committee-booker-trump-banking/"
  },
  {
    "text": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "fullText": "Federal officials have a plan that could curb billions of dollars in overpayments to Medicare Advantage plans. But will they follow through on it?",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691896/medicare-advantage-health-insurance-trump-oz-cms-upcoding"
  },
  {
    "text": "ESPN drops top 50 NFL free agents of 2026, 4 of top 21 are Packers - Acme Packing Company",
    "fullText": "Assume that the Green Bay Packers will end up with four ‘27 compensatory draft picks from their ‘26 free agency losses.",
    "link": "https://www.acmepackingcompany.com/green-bay-packers-free-agency/78932/espn-drops-top-50-nfl-free-agents-of-2026-4-of-top-21-are-packers"
  },
  {
    "text": "Samsung’s confusing Galaxy S26 pricing raises base model cost, but makes Ultra cheaper - 9to5Google",
    "fullText": "New reports reveal that Samsung is, in fact, planning to raise the price of the Galaxy S26 series, but only...",
    "link": "http://9to5google.com/2026/01/29/samsung-galaxy-s26-pricing-means-more-expensive-base-cheaper-ultra/"
  },
  {
    "text": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet - The Daily Galaxy",
    "fullText": "Curiosity switched on its lights during the Martian night, capturing a rare view that is forcing scientists to look at the Red Planet in a new way.",
    "link": "https://dailygalaxy.com/2026/01/curiosity-just-lit-up-mars-never-seen-side/"
  }
]