[
  {
    "text": "Stock Market Today: Dow Opens Higher After Selloff; Gold Extends Gains — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on the Dow, S&P 500, Nasdaq and other markets.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-fed-lisa-cook-trump-nvidia-01-21-2026"
  },
  {
    "text": "Judge denies lawmaker request for ‘independent monitor’ to oversee Epstein files release - Politico",
    "fullText": "But the judge noted that his order didn’t foreclose the lawmakers’ right to sue.",
    "link": "https://www.politico.com/live-updates/2026/01/21/congress/epstein-files-release-request-00738707"
  },
  {
    "text": "Israeli PM Netanyahu agrees to join Trump's Board of Peace - BBC",
    "fullText": "Israel is the latest country to publicly accept an invitation to Trump's new organisation, joining Albania, Bahran, Hungary, Morocco and the UAE.",
    "link": "https://www.bbc.com/news/articles/cn8jek4vv8ko"
  },
  {
    "text": "Prince Harry visibly emotional as he says Mail made wife Meghan’s life a misery - CNN",
    "fullText": "Prince Harry struggled to hold back his emotions as he wrapped up his evidence at a London court on Wednesday, as part of his lawsuit against the publisher of the Daily Mail over allegations of unlawful information gathering, saying “they have made my wife’s …",
    "link": "https://www.cnn.com/2026/01/21/media/prince-harry-daily-mail-publisher-day-three-intl"
  },
  {
    "text": "Manchester City: Squad to refund ticket costs for fans after Champions League loss - BBC",
    "fullText": "The Manchester City squad will refund the ticket costs for 374 supporters who travelled to Norway to witness their side's shock 3-1 Champions League defeat at Bodo/Glimt on Tuesday.",
    "link": "https://www.bbc.com/sport/football/articles/c4gwp79rdz7o"
  },
  {
    "text": "ICE targeted off-duty police officers in Twin Cities, local police say - The Washington Post",
    "fullText": "The police chief of one Minneapolis suburb said all of the officers who had been stopped there by Immigration and Customs Enforcement were people of color.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/21/minnesota-minneapolis-off-duty-police-targeted-ice/"
  },
  {
    "text": "Jamie Dimon says U.S. should impose Trump's credit card rate cap in Vermont and Massachusetts - CNBC",
    "fullText": "JPMorgan Chase CEO Jamie Dimon on Wednesday advocated for a test of President Donald Trump's proposed credit card rate cap in Vermont and Massachusetts.",
    "link": "https://www.cnbc.com/2026/01/21/jamie-dimon-trump-credit-card-rate-cap-vermont-massachusetts.html"
  },
  {
    "text": "Greenland’s strategic position in seven maps: Why Trump wants the island - Al Jazeera",
    "fullText": "The world’s largest island sits in the Arctic Circle and is strategically and economically valuable.",
    "link": "https://www.aljazeera.com/news/2026/1/21/greenlands-strategic-position-in-seven-maps-why-trump-wants-the-island"
  },
  {
    "text": "NBA power rankings: Every team slotted 1-30 at the midway point of the season - SB Nation",
    "fullText": "Let’s rank every team in the NBA using a tier list.",
    "link": "https://www.sbnation.com/nba/1100840/nba-power-rankings-tier-listing-every-team-by"
  },
  {
    "text": "iPhone 18 Pro Dynamic Island confusion now appears to be resolved - 9to5Mac",
    "fullText": "There’s been considerable confusion about the fate of the iPhone 18 Pro Dynamic Island, with conflicting claims about the position...",
    "link": "https://9to5mac.com/2026/01/21/iphone-18-pro-dynamic-island-confusion-now-appears-to-be-resolved/"
  },
  {
    "text": "California’s Newsom hopes Trump ‘doesn’t double down on stupid’ in Davos - politico.eu",
    "fullText": "Democratic governor suggests slumping markets could pull U.S. president back from his threats to seize Greenland.",
    "link": "https://www.politico.eu/article/us-california-gavin-newsom-hopes-donald-trump-doesnt-double-down-on-stupid-davos-greenland/"
  },
  {
    "text": "How North Carolina erased medical debt for 2.5 million people - NPR",
    "fullText": "The state partnered with a nonprofit to wipe out the debts. It also has a plan in place to prevent medical debt for people in specific income brackets.",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5678541/north-carolina-undue-medical-debt-erased"
  },
  {
    "text": "The Rays have a stadium site. What will it take to build a ballpark? - tampabay.com",
    "fullText": "The new ownership took an important step Tuesday, but a stadium is far from guaranteed. Here’s a look at the road ahead.",
    "link": "https://www.tampabay.com/sports/rays/2026/01/21/rays-stadium-hillsborough-college-dale-mabry-buccaneers-lightning/"
  },
  {
    "text": "Why ‘aspirational clutter’ is some of the hardest to part with - The Washington Post",
    "fullText": "The idea of who we are doesn’t always align with reality — and that’s often reflected in our unused stuff.",
    "link": "https://www.washingtonpost.com/home/2026/01/21/what-is-aspirational-clutter/"
  },
  {
    "text": "Japan restarts world's largest nuclear power plant - BBC",
    "fullText": "Japan restarts a reactor at the world's largest nuclear plant nearly 15 years after the Fukushima meltdown.",
    "link": "https://www.bbc.com/news/articles/cq6v0v32rg1o"
  },
  {
    "text": "House committee set to approve resolutions holding Clintons in contempt of Congress - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/house-committee-set-approve-resolutions-holding-clintons-contempt/story?id\\\\u003d129381902"
  },
  {
    "text": "6 daily habits to slow aging, from a Harvard brain expert - The Washington Post",
    "fullText": "Harvard scientist Rudolph Tanzi shares his plan for brain health and aging well, including habits for sleep, stress and social interaction.",
    "link": "https://www.washingtonpost.com/health/2026/01/21/brain-aging-tips-harvard/"
  },
  {
    "text": "Heart disease fatalities drop but are still leading cause of death in the US: Report - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/heart-disease-fatalities-drop-leading-cause-death-us/story?id\\\\u003d129394510"
  },
  {
    "text": "1 year into Trump's second term, a consumer watchdog agency is 'hanging by a thread' - NPR",
    "fullText": "The Trump administration has ordered work stoppages and layoffs and has tried cutting off funding to effectively dismantle the Consumer Financial Protection Bureau.",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5683060/cfpb-consumer-watchdog-agency-trump-second-term"
  },
  {
    "text": "Trump administration claims offshore wind poses a threat. But it won't say how. - NPR",
    "fullText": "The Interior Department said pausing construction of offshore wind farms would allow the government agencies to work with project developers to mitigate potential risks. But wind companies say the administration isn't sharing information about newly-discovere…",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5678635/trump-offshore-wind-national-security-climate-change"
  }
]