[
  {
    "text": "Cumberland County DA cancels news conference on ICE activity after state court concern - Portland Press Herald - Maine Sunday Telegram",
    "fullText": "The event was planned as officials in Maine's 2 largest cities anticipate an increased presence from U.S. Immigration and Customs Enforcement in the coming days.",
    "link": "https://www.pressherald.com/2026/01/16/cumberland-county-da-portland-officials-plan-friday-news-conference-on-ice-activity/"
  },
  {
    "text": "Stock Market Today: Dow Futures Gain; Wavers Near Record-Highs — Live Updates - The Wall Street Journal",
    "fullText": "Live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-01-16-2026"
  },
  {
    "text": "Takeaways from Nick Sirianni's and Howie Roseman's year-end press conference - PhillyVoice",
    "fullText": "From why the Eagles didn't change playcallers midseason to what they're going to be looking for in their next OC and who will have a say in it.",
    "link": "https://www.phillyvoice.com/takeaways-nick-sirianni-and-howie-roseman-year-end-press-conference/"
  },
  {
    "text": "Trump's proposed ban on buying single-family homes introduces uncertainty for family offices - CNBC",
    "fullText": "Wall Street landlords are the primary target of Trump's proposed ban, but investment firms of the ultra rich could get caught in the crosshairs.",
    "link": "https://www.cnbc.com/2026/01/16/trump-investors-homes-family-offices.html"
  },
  {
    "text": "Ukraine substation fire leaves city without power in freezing temperatures - BBC",
    "fullText": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "link": "https://www.bbc.com/news/live/cy7myy6k0jyt"
  },
  {
    "text": "A 4-year-old died of flu complications. Her mother has a message for other parents - CNN",
    "fullText": "Four-year-old Ellie Rudd – who loved mud and getting dressed up and having dance parties with her brother and sisters – died January 6, after the flu and a co-infection with an adenovirus turned into pneumonia and sepsis.",
    "link": "https://www.cnn.com/2026/01/16/health/ellie-rudd-pediatric-flu"
  },
  {
    "text": "China and Canada announce tariffs relief after a high-stakes meeting - BBC",
    "fullText": "Canola oil and electric cars are at the centre of the deal agreed by Mark Carney and Xi Jinping after years of strained ties.",
    "link": "https://www.bbc.com/news/articles/cy59pvkqvl5o"
  },
  {
    "text": "US seizes 6th tanker in the Caribbean - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/us-seizes-6th-tanker-caribbean/story?id\\\\u003d129239923"
  },
  {
    "text": "Science shows very different psychiatric disorders might have the same cause - The Washington Post",
    "fullText": "A sweeping new study of psychiatric and genetic records has the potential to change treatment for millions of psychiatric patients.",
    "link": "https://www.washingtonpost.com/health/2026/01/01/psychiatric-disorders-genetic-bipolar-schizophrenia/"
  },
  {
    "text": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities - CNN",
    "fullText": "Public opinion on nearly every aspect of President Donald Trump’s first year back in the White House is negative, a new CNN poll conducted by SSRS finds, with a majority of Americans saying Trump is focused on the wrong priorities and doing too little to addr…",
    "link": "https://www.cnn.com/2026/01/16/politics/trump-economy-first-year-cnn-poll"
  },
  {
    "text": "'A Knight of the Seven Kingdoms' is 'Game of Thrones' for the haters - NPR",
    "fullText": "There are no dragons, no maps and no internecine family trees in this Game of Thrones prequel about an underdog knight and his would-be squire.",
    "link": "https://www.npr.org/2026/01/16/nx-s1-5671737/a-knight-of-the-seven-kingdoms-review-hbo-game-of-thrones-prequel"
  },
  {
    "text": "Republicans are scrambling to counter Trump on Greenland - Politico",
    "fullText": "GOP lawmakers are stepping up their warnings and engaging in diplomacy as the president's threats escalate.",
    "link": "https://www.politico.com/news/2026/01/16/greenland-trump-republicans-congress-00732945"
  },
  {
    "text": "Darren Waller thinks Tua Tagovailoa still struggles with trauma from head injuries - NBC Sports",
    "fullText": "\"I think there could be some trauma still stored in his body from what he's gone through with the head injuries,\" Waller said.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/darren-waller-thinks-tua-tagovailoa-still-struggles-with-trauma-from-head-injuries"
  },
  {
    "text": "Why access to Venezuela’s ‘heavy’ oil is ‘tremendous’ news for US refiners - Al Jazeera",
    "fullText": "The type of oil held by Venezuela makes it particularly lucrative for US refineries, analysts say.",
    "link": "https://www.aljazeera.com/news/2026/1/16/why-access-to-venezuelas-heavy-oil-is-tremendous-news-for-us-refiners"
  },
  {
    "text": "Horoscope for Friday, January 16, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/16/horoscopes-today-friday-january-16-2026"
  }
]