[
  {
    "text": "Bangladesh’s former Prime Minister Khaleda Zia dies - Al Jazeera",
    "fullText": "Bangladesh’s first female prime minister dies after a prolonged illness in Dhaka, her party says.",
    "link": "https://www.aljazeera.com/news/2025/12/30/bangladeshs-former-prime-minister-khaleda-zia-dies"
  },
  {
    "text": "Father of NASCAR's Hamlin dies after house fire - ESPN",
    "fullText": "Denny Hamlin's father died and his mother was critically injured after a weekend fire heavily damaged the North Carolina home where they lived.",
    "link": "https://www.espn.com/racing/nascar/cup/story/_/id/47449265/denny-hamlin-father-dies-house-fire-mother-hospitalized"
  },
  {
    "text": "LG officially enters the art TV category with the Gallery TV - The Verge",
    "fullText": "The LG Gallery TV will compete with Samsung’s The Frame as well as the Hisense CanvasTV and TCL Nxtvision art TVs.",
    "link": "https://www.theverge.com/news/850876/lg-gallery-tv-ces-2026"
  },
  {
    "text": "Stock futures are little changed after S&P 500 posts back-to-back losses: Live updates - CNBC",
    "fullText": "Stocks slipped on Monday as investors sold their tech holdings heading into the end of 2025.",
    "link": "https://www.cnbc.com/2025/12/29/stock-market-today-live-updates.html"
  },
  {
    "text": "Measles case reported in East Bay: Here’s where the infected person shopped before Christmas - San Francisco Chronicle",
    "fullText": "Contra Costa County reported a measles case on Monday; people may have been exposed at Walnut Creek shops and other public locations before Christmas.",
    "link": "https://www.sfchronicle.com/health/article/measles-walnut-creek-21266900.php"
  },
  {
    "text": "Trump says U.S. destroyed loading dock in Venezuela - The Washington Post",
    "fullText": "Trump would not say whether the military or the CIA conducted the strike in Venezuela amid escalating U.S. pressure on Nicolás Maduro.",
    "link": "https://www.washingtonpost.com/politics/2025/12/29/trump-venezuela-strike-comment/"
  },
  {
    "text": "News & Notes: Lamar Jackson's Status Undetermined, But There's Optimism - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Harbaugh has ‘no headspace’ for head coach battle narrative. Ravens’ plan was to ‘ramp up’ Derrick Henry’s usage. Harbaugh pinpoints problems with Ravens’ pass defense in Green Bay.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-back-contusion-undetermined-optimism-john-harbaugh-mike-tomlin-ravens-defense-derrick-henry"
  },
  {
    "text": "Samsung’s New Wi-Fi Speaker Has Big Monolith Energy - Gizmodo",
    "fullText": "Playing the theme to '2001: A Space Odyssey' on this thing might feel a little too on-the-nose.",
    "link": "https://gizmodo.com/samsungs-new-wi-fi-speaker-has-big-monolith-energy-2000703920"
  },
  {
    "text": "Trump admin can share immigrants’ Medicaid data with ICE, judge rules - Politico",
    "fullText": "Blue states sued to prevent Medicaid data from being used in deportations.",
    "link": "https://www.politico.com/news/2025/12/29/trump-admin-can-share-immigrants-medicaid-data-ice-judge-rules-00707716"
  },
  {
    "text": "Chappell Roan and Apple Martin Recant Their Brigitte Bardot Tributes - Vulture",
    "fullText": "Chappell Roan, Apple Martin, and Odessa A’zion have all realized in real time what Brigitte Bardot “stood for.’ The “It” girls are all recanting tributes to the recently deceased French actress.",
    "link": "http://www.vulture.com/article/chappell-roan-brigitte-bardot-tribute.html"
  },
  {
    "text": "Noem says Homeland Security is investigating fraud in Minneapolis - PBS",
    "fullText": "Homeland Security Secretary Kristi Noem on Monday posted a video on the social platform X showing DHS officers going into an unidentified business and questioning the person working behind the counter. Noem said that officers were “conducting a massive invest…",
    "link": "https://www.pbs.org/newshour/nation/noem-says-homeland-security-is-investigating-fraud-in-minneapolis"
  },
  {
    "text": "Transcript from Charlie Kirk shooting suspect hearing for must be released, judge orders - PBS",
    "fullText": "State District Judge Tony Graf said Monday the transcript must be posted on the court docket by the end of the day.",
    "link": "https://www.pbs.org/newshour/nation/transcript-from-charlie-kirk-shooting-suspect-hearing-for-must-be-released-judge-orders"
  },
  {
    "text": "States get first Trump administration awards from rural health fund - Axios",
    "fullText": "It includes a big award for Alaska, whose lawmakers' support was critical to the bill's passage.",
    "link": "https://www.axios.com/2025/12/29/rural-health-fund-trump-administration-states"
  },
  {
    "text": "Trump says Hamas must disarm very soon or \"there will be hell to pay\" - CBS News",
    "fullText": "Israeli Prime Minister Benjamin Netanyahu also announced President Trump will receive the Israel Prize for his work on peace negotiations.",
    "link": "https://www.cbsnews.com/news/trump-netanyahu-mar-a-lago-meeting/"
  },
  {
    "text": "Flu cases on the rise amid holiday travel, gatherings, latest CDC data shows - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/flu-cases-rise-amid-holiday-travel-gatherings-latest/story?id\\\\u003d128761006"
  },
  {
    "text": "Rams vs Falcons Prediction, Monday Night Football Spread Pick, Odds - Action Network",
    "fullText": "Find Rams vs Falcons predictions, picks and NFL odds for Monday Night Football.",
    "link": "https://www.actionnetwork.com/nfl/los-angeles-rams-vs-atlanta-falcons-prediction-pick-odds-nfl-monday-night-football-december-29"
  },
  {
    "text": "More than 75% of US adults may meet criteria for obesity under new definition: Study - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/75-us-adults-meet-criteria-obesity-new-definition/story?id\\\\u003d128747616"
  }
]