[
  {
    "text": "Philadelphia snow updates: Dangerous cold stretch, snowfall totals and latest storm impact - whyy.org",
    "fullText": "Bitter temps will linger across Pennsylvania, New Jersey and Delaware this week. Here’s everything you need to know.",
    "link": "http://whyy.org/articles/philadelphia-snow-storm-updates-latest-forecast-monday-snowfall-totals/"
  },
  {
    "text": "Grant Udinski withdraws from Browns head coaching search - NBC Sports",
    "fullText": "Grant Udinski will not be the next Browns head coach.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/grant-udinski-withdraws-from-browns-head-coaching-search"
  },
  {
    "text": "Apple introduces new AirTag with expanded range and improved findability - Apple",
    "fullText": "Apple today unveiled the new AirTag, now with an expanded finding range and a louder speaker.",
    "link": "https://www.apple.com/newsroom/2026/01/apple-introduces-new-airtag-with-expanded-range-and-improved-findability/"
  },
  {
    "text": "Budweiser Super Bowl Commercial Teams Clydesdale With American Bald Eagle, ‘Free Bird’ - Variety",
    "fullText": "Budweiser's newest Super Bowl commercial will team a Clydesdale with a bald eagle and the Lynyrd Skynyrd classic 'Free Bird' in a pro-America spot",
    "link": "https://variety.com/2026/tv/news/budweiser-super-bowl-commercial-clydesdale-bald-eagle-1236640721/"
  },
  {
    "text": "Israel recovers body of last hostage in Gaza - CNN",
    "fullText": "The Israeli military announced Monday that it has recovered the remains of the final deceased hostage in Gaza, marking the first time since 2014 that there are no Israeli hostages in the enclave.",
    "link": "https://www.cnn.com/2026/01/26/middleeast/last-hostage-gaza-recovered-israel-intl"
  },
  {
    "text": "Chris Madel ends GOP bid for governor, says he can’t support federal ‘retribution’ against Minnesota - Star Tribune",
    "fullText": "His exit comes as some other Republicans have started to distance themselves from the Trump administration’s immigration crackdown in the state.",
    "link": "https://www.startribune.com/chris-madel-ends-gop-bid-for-governor-says-he-cant-support-federal-retribution-against-minnesota/601570793"
  },
  {
    "text": "Nigella Lawson to replace Prue Leith on The Great British Bake Off - BBC",
    "fullText": "The TV chef says she's \"bubbling with excitement\" to be joining Paul Hollywood on the Channel 4 show.",
    "link": "https://www.bbc.com/news/articles/cgk80pzxkexo"
  },
  {
    "text": "Samsung, if You Add This to the Galaxy S26 Ultra, I'd Be Eternally Grateful - CNET",
    "fullText": "Commentary: I've tested phones for 14 years, and I've got a few ideas on how Samsung can improve its next phone.",
    "link": "https://www.cnet.com/tech/mobile/samsung-if-you-add-this-to-the-galaxy-s26-ultra-id-be-eternally-grateful/"
  },
  {
    "text": "Former astronaut on lunar spacesuits: “I don’t think they’re great right now” - Ars Technica",
    "fullText": "These are just the difficulties of designing a spacesuit for the lunar environment.\"",
    "link": "https://arstechnica.com/space/2026/01/former-astronaut-on-lunar-spacesuits-i-dont-think-theyre-great-right-now/"
  },
  {
    "text": "Storm dies down in Upstate NY, but how long will bitter cold last? - syracuse.com",
    "fullText": "Temperatures will be well below normal through the weekend.",
    "link": "https://www.syracuse.com/weather/2026/01/storm-winds-down-in-upstate-ny-but-how-long-will-bitter-cold-last.html"
  },
  {
    "text": "An unusual Fed ‘rate check’ triggered a free fall in the U.S. dollar and investors are fleeing into gold - Fortune",
    "fullText": "Washington may be attempting to prop up the yen, exacerbating fears the U.S. is becoming too politically volatile to remain a safe haven for investors",
    "link": "https://fortune.com/2026/01/26/fed-rate-check-us-dollar-gold/"
  },
  {
    "text": "The market has cooled on tech. These are the trades to make now, says this strategist. - MarketWatch",
    "fullText": "Use options to play Meta, Microsoft and Apple says Evercore ISI",
    "link": "https://www.marketwatch.com/story/caution-ahead-of-big-tech-earnings-means-these-are-the-trades-to-make-1b343472"
  },
  {
    "text": "Pro-ICE churches should be shamed - Salon.com",
    "fullText": "Cities Church in St. Paul is the persecutor, not the persecuted",
    "link": "https://www.salon.com/2026/01/26/pro-ice-churches-should-be-shamed/"
  },
  {
    "text": "Scientists just got the clearest picture of the dark universe yet: 'Now the dream has come true' - Space",
    "fullText": "\"These results from the Dark Energy Survey shine new light on our understanding of the universe and its expansion.\"",
    "link": "https://www.space.com/astronomy/dark-universe/scientists-just-got-the-clearest-picture-of-the-dark-universe-yet-now-the-dream-has-come-true"
  },
  {
    "text": "Is your penis really an indicator of longevity? Bryan Johnson thinks so — the real experts weigh in - New York Post",
    "fullText": "Are these biohackers playing the long game — or overextending themselves for a pipe dream?",
    "link": "https://nypost.com/2026/01/26/health/is-your-penis-an-indicator-of-longevity-experts-weigh-in/"
  },
  {
    "text": "How $16B in earmarks evaded conservative ire — and helped clinch a funding deal - Politico",
    "fullText": "Republican leaders have agreed to earmarks for thousands of pet projects in specific congressional districts.",
    "link": "https://www.politico.com/news/2026/01/26/earmarks-conservatives-government-funding-00745730"
  },
  {
    "text": "Natural gas prices hit $6 for first time since 2022 as massive winter storm sweeps U.S. - CNBC",
    "fullText": "U.S. natural gas prices surged above $6 for the first time since late 2022 on Monday as a massive winter storm sweeps across the country.",
    "link": "https://www.cnbc.com/2026/01/26/us-natural-gas-prices-snow-ice-winter-storm-fern.html"
  },
  {
    "text": "Lifetime alcohol use linked to higher risk of colorectal cancer, new study finds - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/lifetime-alcohol-linked-higher-risk-colorectal-cancer-new/story?id\\\\u003d129547475"
  }
]