[
  {
    "text": "Feds arrest Don Lemon, Minnesota journalist and two others over church protest - NPR",
    "fullText": "Lemon was arrested by U.S. agents days after covering an anti-ICE protest at a St. Paul church. U.S. Attorney General Pam Bondi called the protest a \"coordinated attack.\"",
    "link": "https://www.npr.org/2026/01/30/nx-s1-5693756/don-lemon-arrest-cnn-minneapolis"
  },
  {
    "text": "We finally heard from Trump Mobile… and they immediately ghosted us - The Verge",
    "fullText": "I got a reply from Trump Mobile executive Don Hendrickson, but then he left me on read.",
    "link": "https://www.theverge.com/tech/870934/trump-mobile-executive-team-don-hendrickson"
  },
  {
    "text": "These 12 cities will be hit hard by a bomb cyclone this weekend - The Washington Post",
    "fullText": "A powerful nor’easter will deliver a dangerous combination of heavy snow, frigid temperatures, strong winds and coastal flooding from the Southeast to New England.",
    "link": "https://www.washingtonpost.com/weather/2026/01/30/snow-storm-forecast-cities-east-coast-noreaster-bomb-cylone/"
  },
  {
    "text": "The Sundance Film Festival’s big moments and breakout movies - AP News",
    "fullText": "The last Sundance Film Festival in Utah is drawing to a close this weekend. The Park City gathering has been a nostalgic farewell, as it moves to Boulder, Colorado in 2027. A Wednesday night screening of “Little Miss Sunshine” was especially emotional, with f…",
    "link": "https://apnews.com/article/sundance-film-festival-2026-breakouts-moments-deals-f630b9ee4a706fc78f421f94a7ee9783"
  },
  {
    "text": "Panama Canal ports will keep operating after court finds concession unconstitutional, president says - AP News",
    "fullText": "Panama’s president has vowed that critical ports at both ends of the Panama Canal will continue to operate without interruption. President José Raúl Mulino spoke in a recorded message on Friday after the country’s Supreme Court ruled that the concession held …",
    "link": "https://apnews.com/article/panama-canal-ports-us-china-b5fe3cdcc1fce45dbf1b0843a620830a"
  },
  {
    "text": "Jeffrey Epstein sent thousands of pounds to Peter Mandelson’s husband, emails show - Financial Times",
    "fullText": "Payments to Reinaldo Avila da Silva raise fresh questions about disgraced financier’s friendship with UK’s former Washington ambassador",
    "link": "https://www.ft.com/content/c950f80a-3946-4986-b7ec-e0c61e628049"
  },
  {
    "text": "Kylie Kelce Has Surprising Response to Question About Travis Kelce and Taylor Swift's Wedding Plans - Yahoo News Canada",
    "fullText": "The mother of four was asked about her brother-in-law's wedding to the pop star during a 'Today' show appearance",
    "link": "https://people.com/kylie-kelce-surprising-response-travis-kelce-taylor-swift-wedding-question-11895995"
  },
  {
    "text": "Eli Lilly plans $3.5 billion manufacturing plant in Pennsylvania to make next-generation obesity injections - CNBC",
    "fullText": "The plant will help make Lilly's experimental drug called retatrutide, which has shown the highest weight loss seen to date in a late-stage trial.",
    "link": "https://www.cnbc.com/2026/01/30/eli-lilly-3point5-billion-pennsylvania-plant-obesity-drugs.html"
  },
  {
    "text": "Tesla throws in the towel on car sales - The Verge",
    "fullText": "Is Tesla still a car company? Elon Musk is pushing AI, robots, and robotaxis, but the bulk of the company’s revenues still come from car sales. How much longer will that last?",
    "link": "https://www.theverge.com/transportation/870332/tesla-throws-in-the-towel-on-car-sales"
  },
  {
    "text": "‘Iron Lung’ $3.5M, ‘Send Help’ $2.2M In Previews – Box Office - Deadline",
    "fullText": "Markiplier’s self-financed feature take on the video game Iron Lung broke out with $3.5M in previews on Thursday night, we’re told. Meanwhile, Sam Raimi’s genre pic Send Help from 20th Century Studios saw $2.2M. Iron Lung went into the weekend with $6M in pre…",
    "link": "http://deadline.com/2026/01/box-office-iron-lung-send-help-melania-shelter-1236703378/"
  },
  {
    "text": "Three reasons for the record rise in gold prices, and one why they are falling - BBC",
    "fullText": "Gold has fallen from recent highs but there are several reasons investors are still finding refuge in the precious metal.",
    "link": "https://www.bbc.com/news/articles/c87r2700dq8o"
  },
  {
    "text": "The Massive Nucleus of 3I/ATLAS and its Puzzling Methane Outgassing, Based on New Data from the… - Avi Loeb – Medium",
    "fullText": "What a glorious day! Today, new data on the interstellar object 3I/ATLAS was released from the Hubble and Webb space telescopes in two…",
    "link": "https://avi-loeb.medium.com/the-massive-nucleus-of-3i-atlas-and-its-puzzling-methane-outgassing-based-on-new-data-from-the-72e540d8fe46"
  },
  {
    "text": "Treasury Sanctions Iranian Regime Officials for Violent Repression and Corruption - U.S. Department of the Treasury (.gov)",
    "fullText": "First Designation of IRGC-Linked Digital Asset ExchangeWASHINGTON—Today, the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) took additional action against Iranian officials responsible for the regime’s brutal crackdown on its own pe…",
    "link": "https://home.treasury.gov/news/press-releases/sb0375"
  },
  {
    "text": "New Nintendo Direct Rumors Point To An Incoming Flood Of Switch 2 Ports - Kotaku",
    "fullText": "February will reportedly kick off with a new Partner Showcase",
    "link": "https://kotaku.com/february-nintendo-direct-switch-2-3d-mario-2000664537"
  },
  {
    "text": "Russell Wilson ‘made the right decision’: Malcolm Butler on that fateful pick - seattletimes.com",
    "fullText": "Malcolm Butler crushed Seahawks fans in 2015, picking off Russell Wilson at the goal line to win the Super Bowl for the Patriots. We asked him about the play.",
    "link": "https://www.seattletimes.com/sports/seahawks/with-seahawks-patriots-super-bowl-rematch-set-we-called-malcolm-butler/"
  },
  {
    "text": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "fullText": "Israel says it will reopen Gaza’s border crossing with Egypt in both directions over the weekend. The move announced on Friday will allow Palestinians to enter and leave the territory after nearly two years of near-complete closure. The Israeli military body …",
    "link": "https://apnews.com/article/israel-palestinians-gaza-rafah-border-crossing-reopening-823d4b0aef641c3f19d4cc7b527325b1"
  },
  {
    "text": "The 12 NFL Teams That Haven’t Won a Super Bowl and Why - Sports Illustrated",
    "fullText": "Of the dozen ringless squads, four have never graced the field for the big game. Is it due to long-term ineptitude or merely some bad luck?",
    "link": "https://www.si.com/nfl/the-12-nfl-teams-that-havent-won-super-bowl-why"
  },
  {
    "text": "Comet C/2025 K1 (ATLAS) crumbles apart in stunning new telescope images - Space",
    "fullText": "The comet broke into pieces after making a close approach around the sun in October 2025.",
    "link": "https://www.space.com/astronomy/comets/comet-c-2025-k1-atlas-crumbles-apart-in-stunning-new-telescope-images"
  },
  {
    "text": "Scientists Link These Popular Sweeteners to Cognitive Decline - Prevention",
    "fullText": "There is a connection between artificial sweeteners and cognitive decline, according to a study. Here's what you need to know.",
    "link": "https://www.prevention.com/health/a70194979/artificial-sweeteners-and-cognitive-decline-study/"
  }
]