[
  {
    "text": "U.S. offers more details on claim China conducted secret nuclear weapons test - The Washington Post",
    "fullText": "Remarks by a top administration official appeared to be aimed at dispelling skepticism of its assertions, as President Donald Trump vows to restart U.S. tests.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/china-nuclear-test-trump/"
  },
  {
    "text": "Spurs signing veteran center Mason Plumlee to 10-day deal - ESPN",
    "fullText": "Free agent center Mason Plumlee is signing a 10-day contract with the San Antonio Spurs.",
    "link": "https://www.espn.com/nba/story/_/id/47959713/spurs-signing-veteran-center-mason-plumlee-10-day-deal"
  },
  {
    "text": "Mourinho's 'big mistake' after 'disgusting' Vinicius incident - BBC",
    "fullText": "Trent Alexander-Arnold calls the alleged racist abuse of team-mate Vinicius Junior a \"disgrace to football\", while opposition manager Jose Mourinho is criticised for his comments.",
    "link": "https://www.bbc.com/sport/football/articles/cp9myemmg3ro"
  },
  {
    "text": "Why California could be the big winner as EPA abandons climate policy - Politico",
    "fullText": "The federal government is walking away from its tailpipe emissions rules, sparking a legal debate over whether states can now write their own standards.",
    "link": "https://www.politico.com/news/2026/02/17/epa-abandoning-climate-regulatory-power-california-ev-goals-00785469"
  },
  {
    "text": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors - AP News",
    "fullText": "Gisèle Pelicot has released a memoir that recounts her drugging and mass rape case and sends a powerful message of hope and support to victims of sexual abuse. On Tuesday, her book comes out worldwide in 22 languages. Pelicot says writing it helped her reflec…",
    "link": "https://apnews.com/article/gisele-pelicot-book-france-dominique-rape-4cd6f5bacc7fa9d483d610a3b38551a5"
  },
  {
    "text": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "fullText": "Tricia McLaughlin is leaving just over a year into Homeland Security Secretary Kristi L. Noem’s tenure leading the department.",
    "link": "https://www.washingtonpost.com/immigration/2026/02/17/tricia-mclaughlin-leaves-dhs/"
  },
  {
    "text": "No bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu - NBC News",
    "fullText": "The judge said in his ruling that Aimen Halim did not \"drum\" up enough evidence in his lawsuit arguing the \"boneless wings\" should be labeled \"chicken nuggets.\"",
    "link": "https://www.nbcnews.com/news/us-news/judge-allows-buffalo-wild-wings-keep-boneless-chicken-menu-nuggets-rcna259460"
  },
  {
    "text": "Antarctica’s ‘Gravity Hole’ Has Been Quietly Growing Stronger - Gizmodo",
    "fullText": "Scientists aren't fully sure what this means for Antarctica's future, however.",
    "link": "https://gizmodo.com/antarcticas-gravity-hole-has-been-quietly-growing-stronger-2000722955"
  },
  {
    "text": "Air Force One will sport Trump’s preferred paint job, after Air Force again reverses course - CNN",
    "fullText": "President Donald Trump’s preferred paint colors will be applied to the new planes which will serve as Air Force One, an Air Force official tells CNN.",
    "link": "https://www.cnn.com/2026/02/17/us/new-af1-paint-job"
  },
  {
    "text": "Trump family business files for trademark rights on any airports using the president’s name - AP News",
    "fullText": "The Trump family company wants to trademark the use of the president’s name on any airports but says it doesn’t plan on charging a fee — at least for a proposed renaming of one near his Florida home. Applications filed by the Trump Organization with the feder…",
    "link": "https://apnews.com/article/trump-family-trademark-airports-d636dc340af72e6f2c8997b83745ff1d"
  },
  {
    "text": "Health officials warn of possible measles exposure at St. Louis Lambert Airport, Collinsville church - STLPR",
    "fullText": "An individual with a confirmed measles case was in the airport on Feb. 7. Meanwhile, Illinois health officials say the same person may have exposed people at Good Shepherd Lutheran Church in Collinsville.",
    "link": "https://www.stlpr.org/health-science-environment/2026-02-17/possible-measles-exposure-at-st-louis-lambert-airport-collinsville-church"
  },
  {
    "text": "Here’s how much snow the Sierra got this weekend — and how much is on the way - San Francisco Chronicle",
    "fullText": "Some California ski resorts tallied feet of snow over the past two days. More is coming.",
    "link": "https://www.sfchronicle.com/weather/article/sierra-snow-lake-tahoe-21358405.php"
  },
  {
    "text": "Nine arrested in France over death of far-right student - BBC",
    "fullText": "Quentin Deranque died on Saturday, two days after being beaten in Lyon by masked men believed to be far-left militants.",
    "link": "https://www.bbc.com/news/articles/cvgj1qrqd47o"
  },
  {
    "text": "Hegseth forces ouster of senior Army spokesman in latest internal clash - The Washington Post",
    "fullText": "Col. David Butler, who had been selected by senior Army leaders for promotion to brigadier general, will instead retire, officials said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/pete-hegseth-dan-driscoll-david-butler/"
  },
  {
    "text": "Oil Falls After Iran Calls Nuclear Talks With US Constructive - Bloomberg",
    "fullText": "Oil edged lower on signs that the US and Iran have made progress in nuclear talks, eroding a risk premium in benchmark futures prices.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-16/latest-oil-market-news-and-analysis-for-feb-17"
  },
  {
    "text": "Google shares how Android 17 is making everything run smoother - Android Authority",
    "fullText": "Google shares the technical details behind its new system to reduce missed frames in Android 17, now in beta testing.",
    "link": "https://www.androidauthority.com/android-17-missed-frames-3641660/"
  },
  {
    "text": "State confirms outbreak of sexually transmitted fungal infection, experts urge caution - Fox News",
    "fullText": "The fungal skin infection TMVII is spreading in Minnesota through direct contact. Health experts advise medical care for round, red rashes that can be painful or itchy.",
    "link": "https://www.foxnews.com/health/state-confirms-outbreak-sexually-transmitted-fungal-infection-experts-urge-caution"
  },
  {
    "text": "'Can You Use Labo VR Goggles For Virtual Boy Games On Switch?' & Other Nintendo Classics VB Questions Answered - Nintendo Life",
    "fullText": "(Yes, you can, with a Switch 1)",
    "link": "https://www.nintendolife.com/guides/can-you-use-labo-vr-goggles-for-virtual-boy-games-on-switch-and-other-nintendo-classics-vb-questions-answered"
  }
]