[
  {
    "text": "Iran briefly closes airspace as U.S. tensions rise, flights rerouted across region - CNBC",
    "fullText": "Iran temporarily closed most of its airspace late Wednesday, forcing airlines to reroute flights as tensions with the United States escalated.",
    "link": "https://www.cnbc.com/2026/01/15/iran-briefly-closes-airspace-as-us-tensions-rise-flights-rerouted-across-region.html"
  },
  {
    "text": "At least 171 measles cases confirmed in 9 states: CDC - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/171-measles-cases-confirmed-9-states-cdc/story?id\\\\u003d129198221"
  },
  {
    "text": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "fullText": "On Jan. 6, there were 211 cases. The outbreak, which began in October, is now at 434.",
    "link": "https://arstechnica.com/health/2026/01/sc-measles-outbreak-has-gone-berserk-124-cases-since-friday-409-quarantined/"
  },
  {
    "text": "Nasa astronauts begin 'bittersweet' medical evacuation from space station - BBC",
    "fullText": "The crew is expected to splash down off the coast of California in the early hours of Thursday local time.",
    "link": "https://www.bbc.com/news/articles/c205r8n0276o"
  },
  {
    "text": "Niners LB Fred Warner doesn't rule out playing Saturday vs. Seahawks: 'Just taking it day by day' - NFL.com",
    "fullText": "Niners LB Fred Warner (ankle) isn’t yet ruling out being ready sooner than anticipated for Saturday night’s playoff showdown against the host Seattle Seahawks.",
    "link": "https://www.nfl.com/news/niners-lb-fred-warner-doesn-t-rule-out-playing-saturday-vs-seahawks"
  },
  {
    "text": "Division I Cabinet adopts new transfer windows in several sports - NCAA.org",
    "fullText": "<p>The Division I Cabinet on Wednesday approved changes to the transfer windows in several sports, including men's and women's basketball, men's wrestling, men's ice hockey, and men's and women's track and field. The changes to the notification-of-transfer wi…",
    "link": "https://www.ncaa.org/news/2026/1/14/media-center-division-i-cabinet-adopts-new-transfer-windows-in-several-sports.aspx"
  },
  {
    "text": "Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States - The White House (.gov)",
    "fullText": "BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION 1.  On October 24, 2025, the Secretary of Commerce (Secretary) transmitted to me a report Every child deserves a safe and nurturing home where they can learn, grow, and reach their full potential…",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/adjusting-imports-of-processed-critical-minerals-and-their-derivative-products-into-the-united-states/"
  },
  {
    "text": "S&P 500 books back-to-back losses as tech sells off, Bank of America slides after earnings: Live updates - CNBC",
    "fullText": "The three major averages fell for a second consecutive session.",
    "link": "https://www.cnbc.com/2026/01/13/stock-market-today-live-updates.html"
  },
  {
    "text": "Saks Global declares bankruptcy. What does it mean for shoppers? - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Business/saks-global-declares-bankruptcy-shoppers/story?id\\\\u003d129198953"
  },
  {
    "text": "Kiefer Sutherland arrested and accused of assaulting ride-share driver, L.A. police say - NBC News",
    "fullText": "Actor Kiefer Sutherland, a film and television star since the 1980s, was arrested Monday after he was alleged to have physically assaulted and threatened a ride-share driver, police said.",
    "link": "https://www.nbcnews.com/news/us-news/kiefer-sutherland-arrested-allegedly-assaulting-ride-share-driver-l-po-rcna253933"
  },
  {
    "text": "God of War | Prime Video - Amazon MGM Studios Press Site",
    "fullText": null,
    "link": "http://press.amazonmgmstudios.com/us/en/press-release/ryan-hurst-tapped-to-play-kratos-in-prime-videos-i"
  },
  {
    "text": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights - Slate",
    "fullText": "The conservative movement spent years working to prevent anything like Bostock from happening again.",
    "link": "https://slate.com/news-and-politics/2026/01/supreme-court-trans-rights-gorsuch-bostock-trump.html"
  },
  {
    "text": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "fullText": "Today, the U.S. Department of Education’s Office for Civil Rights (OCR) initiated investigations into eighteen educational entities in ten states based on complaints submitted to OCR alleging that they have violated Title IX.",
    "link": "http://www.ed.gov/about/news/press-release/us-department-of-educations-office-civil-rights-initiates-18-title-ix-investigations"
  },
  {
    "text": "Report: Harrison-Nunes UFC 324 title clash ppd. - ESPN",
    "fullText": "Kayla Harrison's highly anticipated UFC title defense against Amanda Nunes has reportedly been postponed after Harrison underwent surgery this week to repair herniated discs in her neck.",
    "link": "https://www.espn.com/mma/story/_/id/47610921/report-harrison-neck-surgery-title-bout-vs-nunes-postponed"
  },
  {
    "text": "US announces start of phase two of Trump's Gaza peace plan - BBC",
    "fullText": "It includes the establishment of a technocratic Palestinian government, as well as the reconstruction and demilitarisation of Gaza, US envoy Steve Witkoff says.",
    "link": "https://www.bbc.com/news/articles/cjw1nxe5pvlo"
  },
  {
    "text": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it - BBC",
    "fullText": "The satellite technology has become a vital communications lifeline after the government shut down the internet last week.",
    "link": "https://www.bbc.com/news/articles/c0r4veg0rrzo"
  },
  {
    "text": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "fullText": "Opting out of childhood vaccines is becoming more common across most of the United States, leaving larger shares of the population vulnerable to preventable diseases like measles, which is continuing its record-breaking spread across the country.",
    "link": "https://www.cnn.com/2026/01/14/health/vaccine-exemptions-county-risk-measles-vis"
  },
  {
    "text": "Brazilian au pair testifies against former employer and lover in double homicide case - ABC News",
    "fullText": "A Brazilian au pair is testifying against her former employer and lover in a double homicide case that she says was part of an elaborate scheme to get rid of the man’s wife",
    "link": "https://abcnews.go.com/US/wireStory/brazilian-au-pair-testifies-former-employer-lover-double-129210132"
  }
]