[
  {
    "text": "Which countries could be in Trump's sights next? - BBC",
    "fullText": "Trump has made numerous threats against other nations in Washington's orbit.",
    "link": "https://www.bbc.com/news/articles/cd0ye72r4vpo"
  },
  {
    "text": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process - Ars Technica",
    "fullText": "New chips launch \"this month,\" targeting high-end ultraportable PCs.",
    "link": "https://arstechnica.com/gadgets/2026/01/intel-launches-core-ultra-series-3-cpus-made-using-its-long-awaited-18a-process/"
  },
  {
    "text": "Trump's 'Donroe Doctrine' seeks influence over Western Hemisphere citing old US policy - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trumps-donroe-doctrine-seeks-influence-western-hemisphere-citing/story?id\\\\u003d128926397"
  },
  {
    "text": "Oscar Predictions via Feinberg Forecast: A New Year and a New Landscape - The Hollywood Reporter",
    "fullText": "The Hollywood Reporter's Scott Feinberg updates his picks following the Critics Choice Awards and the Palm Springs International Film Festival's Awards Gala, and ahead of the Actor Awards nominations.",
    "link": "http://www.hollywoodreporter.com/lists/oscar-predictions-2026-feinberg-forecast-new-year/"
  },
  {
    "text": "Bethenny Frankel Contracts Bacterial Infection After Partying in St. Barths - TMZ",
    "fullText": "Bethenny Frankel's luxury New Year's getaway took a seriously itchy turn because she ended up with a bacterial infection on her face after partying it up in St. Barths.",
    "link": "https://www.tmz.com/2026/01/05/bethenny-frankel-leaves-st-barths-bacterial-infection/"
  },
  {
    "text": "Magnitude 6.2 quake hits Shimane Prefecture - The Japan Times",
    "fullText": "The initial jolt was a magnitude 6.2 quake that measured strong 5 on Japan's seismic intensity scale. There was no threat of a tsunami.",
    "link": "https://www.japantimes.co.jp/news/2026/01/06/japan/shimane-strong-earthquakes/"
  },
  {
    "text": "Ohio police release video of person of interest in killing of dentist and his wife - CBS News",
    "fullText": "Investigators believe Spencer and Monique Tepe were fatally shot between 2 a.m. and 5 a.m. last Tuesday in their home located in the Near East Side neighborhood of downtown Columbus.",
    "link": "https://www.cbsnews.com/news/ohio-police-release-video-of-person-of-interest-in-killing-of-dentist-and-his-wife/"
  },
  {
    "text": "Maxx Crosby addresses Pete Carroll’s firing - NBC Sports",
    "fullText": "The Raiders, as expected, fired coach Pete Carroll on Monday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/maxx-crosby-addresses-pete-carrolls-firing"
  },
  {
    "text": "Tony Dokoupil’s ‘CBS Evening News’ Debut Is an Inauspicious Sign of Where CBS News Is Headed - Variety",
    "fullText": "Tony Dokoupil tripped up over transitions and bulldozed a health expert over vaccines",
    "link": "https://variety.com/2026/tv/columns/tony-dokoupil-cbs-evening-news-1236624122/"
  },
  {
    "text": "Asian defense stocks extend rally as Venezuela tensions linger, markets mixed - CNBC",
    "fullText": "Investors continued to assess ongoing geopolitical tensions following the U.S.′ attack on Venezuela.",
    "link": "https://www.cnbc.com/2026/01/06/asia-pacific-markets-today-tuesday-nikkei-225-kospi-hsi-hang-send-index-venezuela-maduro.html"
  },
  {
    "text": "U.S. overhauls childhood vaccine schedule, recommends fewer shots - The Washington Post",
    "fullText": "The U.S. no longer broadly recommends vaccines for flu, hepatitis A, rotavirus and meningococcal disease. Health officials say the guidance aligns with that of peer countries.",
    "link": "https://www.washingtonpost.com/health/2026/01/05/childhood-vaccine-immunization-schedule-overhaul/"
  },
  {
    "text": "Nvidia unveils 'reasoning' AI technology for self-driving cars - BBC",
    "fullText": "Nvidia is partnering with Mercedes-Benz to launch a driverless car powered by its 'Alpamayo' tech",
    "link": "https://www.bbc.com/news/articles/c0jv1vd571wo"
  },
  {
    "text": "What are flu rates in your state? Cases surge in 45 states, breaking records - NBC News",
    "fullText": "Doctor visits for flu-like symptoms — fevers, sore throat, extreme fatigue and body aches — have hit the highest level in nearly 30 years, the CDC reported.",
    "link": "https://www.nbcnews.com/health/health-news/flu-2026-states-deaths-cdc-symptoms-superflu-rcna251910"
  },
  {
    "text": "A $400,000 profit on Maduro's capture raises insider trading questions on Polymarket - NPR",
    "fullText": "Online sleuths have tried to uncover who placed a winning bet on the Venezuelan leader's arrest to no avail. Still, prediction market watchers say the bet appears suspicious.",
    "link": "https://www.npr.org/2026/01/05/nx-s1-5667232/polymarket-maduro-bet-insider-trading"
  },
  {
    "text": "Scientists just got some ancient clues about future sea-level rise — and it’s bad news - The Washington Post",
    "fullText": "Rock samples collected from the Greenland ice sheet’s Prudhoe Dome show it completely melted in the past 10,000 years — and could vanish again amid climate change.",
    "link": "https://www.washingtonpost.com/climate-environment/2026/01/05/greenland-rocks-melting-ice/"
  },
  {
    "text": "He was sentenced to death. Rob and Michele Reiner loved him like a son. - NBC News",
    "fullText": "Nanon Williams was sent to death row for a murder he says he didn't commit. Decades later, through daily emails and prison calls, Rob and Michele Reiner became family.",
    "link": "https://www.nbcnews.com/news/us-news/rob-reiner-michele-texas-nanon-williams-sentenced-death-rcna252305"
  },
  {
    "text": "3 child flu deaths reported in Massachusetts: \"We are seeing children who are seriously ill\" - CBS News",
    "fullText": "Three children have died from the flu in Massachusetts so far this season, the Department of Public Health said Monday.",
    "link": "https://www.cbsnews.com/boston/news/child-flu-death-massachusetts/"
  },
  {
    "text": "Jury selected in trial for former Uvalde officer charged in Robb Elementary shooting response - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/trial-begins-former-uvalde-officer-charged-robb-elementary/story?id\\\\u003d128898094"
  }
]