[
  {
    "text": "Dow drops 840 points, S&P 500 heads for worst drop in 3 months on Trump tariff threat over Greenland: Live updates - CNBC",
    "fullText": "Treasury yields spiked and the U.S. dollar declined as Trump's threat caused a flight from U.S. assets.",
    "link": "https://www.cnbc.com/2026/01/19/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump says 'no going back' on Greenland takeover: Live updates - USA Today",
    "fullText": "President Trump's pursuit of Greenland threatens to reignite a trade war with Europe and upend the NATO alliance.",
    "link": "https://www.usatoday.com/story/news/world/2026/01/20/trump-greenland-europe-tariffs/88261309007/"
  },
  {
    "text": "South Dakota SCIF plan puzzles DHS, CISA officials - Politico",
    "fullText": "Those familiar with the effort say there is no clear national security justification for such a facility in South Dakota, where DHS Secretary Kristi Noem served as governor.",
    "link": "https://www.politico.com/news/2026/01/20/south-dakota-scif-cisa-noem-00736496"
  },
  {
    "text": "Even George R.R. Martin Was Surprised by That Poop Scene in 'A Knight of the Seven Kingdoms' - Gizmodo",
    "fullText": "Toilet humor arrives early in the series premiere of HBO's new 'Game of Thrones' spinoff.",
    "link": "https://gizmodo.com/knight-of-the-seven-kingdoms-poop-scene-george-rr-martin-2000712028"
  },
  {
    "text": "NCAA champ Michael La Sasso leaving Ole Miss to join Phil Mickelson’s LIV Golf team - Golf Channel",
    "fullText": "The Ole Miss senior will debut for the HyFlyers at next month’s LIV opener in Saudi Arabia, meaning he will forfeit his remaining college eligibility and his Masters exemption this April.",
    "link": "https://www.golfchannel.com/ncaa/news/ncaa-champ-michael-la-sasso-leaving-ole-miss-to-join-phil-mickelsons-liv-golf-team"
  },
  {
    "text": "Billy Bob Thornton Opted for a 'More Humble' Prosthetic in “Landman” Scene After the 'Original' One 'Made Everyone Laugh' - Yahoo News UK",
    "fullText": "Billy Bob Thornton did not do full-frontal nudity in 'Landman' season 2, despite some fans saying he did, and the show's co-creator Christian Wallace revealed that they opted for a different prosthetic for the scene after one 'made everyone laugh.'",
    "link": "https://people.com/billy-bob-thornton-opted-for-more-humble-prosthetic-in-landman-scene-11888525"
  },
  {
    "text": "Netflix Would Get Turner Classic Movies In a Warner Bros. Deal, Too. What’s Its Plan? - The Hollywood Reporter",
    "fullText": "The streaming giant discloses for the first time that it'll acquire the brand. What will it do with a basic cable channel?",
    "link": "http://www.hollywoodreporter.com/business/digital/netflix-tcm-plans-turner-classic-movies-deal-1236478523/"
  },
  {
    "text": "Supreme Court skeptical of Hawaii's 'vampire rule' for gun owners - NBC News",
    "fullText": "The Supreme Court weighs a challenge to a Hawaii gun restriction dubbed the “vampire rule,\" requiring permission to carry firearms onto private property.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-tackles-hawaiis-vampire-rule-gun-owners-private-property-rcna252389"
  },
  {
    "text": "Drug pricing, patent losses and deals: Here's what pharma execs see ahead in the industry - CNBC",
    "fullText": "Big pharma is grappling with new drug pricing deals and roughly $300 billion in potential lost revenue from patent expirations of blockbuster drugs.",
    "link": "https://www.cnbc.com/2026/01/20/drug-pricing-patent-losses-deals-novo-nordisk-pfizer.html"
  },
  {
    "text": "Netflix reports earnings after the bell. Here's what to expect - CNBC",
    "fullText": "Netflix this week amended its offer for Warner Bros. Discovery assets amid a Paramount Skydance hostile takeover attempt.",
    "link": "https://www.cnbc.com/2026/01/20/netflix-nflx-earnings-q4-2025.html"
  },
  {
    "text": "2 Winners and 6 Losers from the 49ers loss to the Seahawks - Niners Nation",
    "fullText": "The 49ers 35-point loss means there won’t be many winners in this edition",
    "link": "https://www.ninersnation.com/san-francisco-49ers-news/155534/2-winners-and-6-losers-from-the-49ers-loss-to-the-seahawks"
  },
  {
    "text": "Alexander Skarsgard’s Brat Winter: Acting With Charli XCX, Romancing Olivia Colman in a Prosthetic Mask and Playing a Gay Dom in ‘Pillion’ - Variety",
    "fullText": "Alexander Skarsgard graces the cover of Variety before touching down in Sundance to premiere two movies: Charli xcx's 'The Moment' and 'Wicker.'",
    "link": "https://variety.com/2026/film/features/alexander-skarsgard-pillion-sex-charli-xcx-the-moment-1236633739/"
  },
  {
    "text": "Samsung deleted its Bixby reboot reveal, but confirmed when it will arrive - 9to5Google",
    "fullText": "Samsung announced its big Bixby reboot earlier today, but has since deleted the post entirely. Through both its US and...",
    "link": "http://9to5google.com/2026/01/20/samsung-bixby-reboot-deleted/"
  },
  {
    "text": "5 Cool Costco Finds That Can Help You Build Your Own Retro Arcade - bgr.com",
    "fullText": "There are many items available at Costco, which are perfect for a home arcade. These include remote-control string lights, wall decor, and gaming machines.",
    "link": "https://www.bgr.com/2076136/costco-finds-build-retro-arcade/"
  },
  {
    "text": "Greenland Leader Tells People to Prepare for Possible Invasion - Bloomberg.com",
    "fullText": "Greenland’s prime minister said the Arctic island’s population and its authorities need to start preparing for a possible military invasion, even as it remains an unlikely scenario, as President Donald Trump continues to threaten taking over the territory.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-20/greenland-leader-tells-people-to-prepare-for-possible-invasion"
  },
  {
    "text": "Naomi Osaka makes grand entrance and big fashion statement at Australian Open - AP News",
    "fullText": "Naomi Osaka has made a fashion statement and quite an entrance to the Australian Open. Osaka was wearing a wide-brim hat, veil and holding a white parasol as she walked onto Rod Laver Arena for her first-round match. The No. 16 seed then won a tough three-set…",
    "link": "https://apnews.com/article/naomi-osaka-costume-tennis-australian-open-b3dbbb2afd43d062cafa5d2bbe8908e3"
  },
  {
    "text": "Israeli crews begin bulldozing headquarters of UN agency for Palestinian refugees in East Jerusalem - AP News",
    "fullText": "Israeli forces have targeted two United Nations facilities as part of their crackdown on the U.N. agency for Palestinian refugees. On Tuesday, crews bulldozed the United Nations Relief and Works Agency's offices in Sheikh Jarrah and fired tear gas at a vocati…",
    "link": "https://apnews.com/article/israel-palestinians-gaza-east-jerusalem-unrwa-cc9c5b2cac2332f0207d485f381be53d"
  }
]