[
  {
    "text": "Dollar Firms, Stocks Look Weaker as Sentiment Ebbs: Markets Wrap - Bloomberg",
    "fullText": "Stocks staged a global retreat, with S&P 500 futures pointing to a fourth day of declines, as investors sold all kinds of risky assets amid a rout in precious metals. Bitcoin traded near $77,000 after weekend losses.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-01/dollar-firms-stocks-look-weaker-as-sentiment-ebbs-markets-wrap"
  },
  {
    "text": "Trump plans to close Kennedy Center for about two years, starting in July - The Washington Post",
    "fullText": "Under a proposal by President Donald Trump, the closure could begin July 4, with construction beginning immediately.",
    "link": "https://www.washingtonpost.com/style/2026/02/01/kennedy-center-trump-closure-construction/"
  },
  {
    "text": "'TODAY' Anchor Savannah Guthrie’s Mom Missing - TMZ",
    "fullText": "Authorities in Arizona are searching for Nancy Guthrie, the mother of 'TODAY' anchor Savannah Guthrie, who was reported missing under what authorities are calling concerning circumstances.",
    "link": "https://www.tmz.com/2026/02/01/today-anchor-savannah-guthrie-s-mom-missing/"
  },
  {
    "text": "Diamondbacks Interested In Carlos Santana - MLB Trade Rumors",
    "fullText": "The former All-Star and Gold Glover is on Arizona's radar. Visit MLB Trade Rumors for more on how Santana would fit into Arizona's plans.",
    "link": "https://www.mlbtraderumors.com/2026/02/diamondbacks-interested-in-carlos-santana.html"
  },
  {
    "text": "Lightning players wear full-padded Bucs uniforms, get Baker Mayfield escort before Stadium Series in Tampa - Fox News",
    "fullText": "The Tampa Bay Lightning wore throwback Buccaneers uniforms arriving at Raymond James Stadium for the NHL's Stadium Series outdoor game against the Boston Bruins.",
    "link": "https://www.foxnews.com/sports/lightning-players-wear-full-padded-bucs-uniforms-get-baker-mayfield-escort-before-stadium-series-tampa"
  },
  {
    "text": "Kendrick Lamar Makes Grammys History as Most-Awarded Rapper, Breaking Jay-Z’s Record - Variety",
    "fullText": "Kendrick Lamar has made Grammys history in becoming the most-awarded rap artist, beating the record previously held by Jay-Z.",
    "link": "https://variety.com/2026/music/news/kendrick-lamar-breaks-grammys-record-most-awarded-rapper-1236642301/"
  },
  {
    "text": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "fullText": "The nor’easter, which became a bomb cyclone offshore of North Carolina late Saturday, will go down as the biggest snowstorm in decades for parts of the state.",
    "link": "https://www.washingtonpost.com/weather/2026/02/01/winter-storm-north-carolina-florida-snow-impacts/"
  },
  {
    "text": "5 Zodiac Signs With Good Horoscopes On February 2, 2026 - YourTango",
    "fullText": "Five zodiac signs have good horoscopes on February 2, 2026. They are: Pisces, Libra, Taurus, Virgo, and Gemini.",
    "link": "https://www.yourtango.com/2026394363/zodiac-signs-good-horoscopes-february-2-2026"
  },
  {
    "text": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters - AP News",
    "fullText": "The mayor of Portland, Oregon, has demanded that U.S. Immigration and Customs Enforcement leave his city after federal agents launched tear gas at demonstrators — including young children — outside an ICE facility during a weekend protest. Mayor Keith Wilson …",
    "link": "https://apnews.com/article/portland-protest-tear-gas-mayor-keith-wilson-1f21fc3d3d4b7a2874239a29ece52c06"
  },
  {
    "text": "Farmers Insurance Open: Justin Rose secures record-breaking victory - BBC",
    "fullText": "England's Justin Rose clinches an utterly dominant win at the Farmers Insurance Open in a new tournament record score.",
    "link": "https://www.bbc.com/sport/golf/articles/c74wk9g2272o"
  },
  {
    "text": "Tens of thousands back Czech president amid cabinet dispute - dw.com",
    "fullText": "A large rally in Prague showed support for Czech President Petr Pavel, who accused the country's top diplomat of blackmail. The row centers on Pavel's refusal to appoint a controversial candidate as environment minister.",
    "link": "https://www.dw.com/en/tens-of-thousands-back-czech-president-amid-cabinet-dispute/a-75754342"
  },
  {
    "text": "Lakers vs Knicks Prediction, Odds, NBA Picks for Sunday, Feb. 1 - Action Network",
    "fullText": "Find Los Angeles Lakers vs New York Knicks predictions, odds, and NBA picks for Sunday, February 1.",
    "link": "https://www.actionnetwork.com/nba/los-angeles-lakers-vs-new-york-knicks-prediction-pick-odds-sunday-february-1"
  },
  {
    "text": "“Meanwhile in U Street – Broken Water Main, cars are frozen in the water that is rapidly freezing.” Good Lord This is not Good - PoPville",
    "fullText": "Update from AlertDC: \"DC Water reports a water outage on Wallach Place, NW, between 13th and 14th Streets due to utility repairs. The estimated restoration is 8-10 hours. Affected customers can contact DC Water at 202-612-3400.\" Update from PuckBuddys: \"Walla…",
    "link": "https://www.popville.com/2026/02/u-street-broken-watermain-freeze/"
  },
  {
    "text": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says - Politico",
    "fullText": "“It doesn't matter if you happen to be a former CNN journalist,\" he argued.",
    "link": "https://www.politico.com/news/2026/02/01/don-lemon-todd-blanche-press-religion-00759255"
  },
  {
    "text": "Pokémon GO Events This Week: February 2 to February 8, 2026 - Pokémon GO Hub",
    "fullText": "Pokémon GO’s February 2 to February 8 week has us entering the final month of Precious Paths! Get ready for carnival with the debut of Flamigo, and show off your catching skills with Oricorio. Plus the weekly rotating Spotlight and Raid Hours, Dynamax Battles…",
    "link": "https://pokemongohub.net/post/event/pokemon-go-events-this-week-february-2-to-february-8-2026/"
  },
  {
    "text": "Bright Light Streaks Across New Zealand Skyline: What Could It Be? - The Daily Galaxy",
    "fullText": "A mysterious streak of light appeared over Wellington, New Zealand, on January 30, 2026.",
    "link": "https://dailygalaxy.com/2026/02/bright-light-streaks-across-new-zealand/"
  },
  {
    "text": "The Science of the Modern Base Season: Why Zone 2 Isn’t Enough Anymore - Outside Magazine",
    "fullText": "It's important to keep working hard all through the year, avoiding a major reliance on Zone 2 training. This is why.",
    "link": "https://velo.outsideonline.com/road/road-training/the-science-of-the-modern-base-season-why-zone-2-isnt-enough-anymore/#article"
  },
  {
    "text": "Chicago doctors keep patient alive for 48 hours without lungs - NewsNation",
    "fullText": "The patient was able to stay alive without the presence of any lungs for 48 hours before receiving a double transplant.",
    "link": "https://www.newsnationnow.com/us-news/midwest/chicago-doctors-keep-patient-alive-without-lungs/"
  },
  {
    "text": "Plastic pollution promotes hazardous water conditions, new study finds - Phys.org",
    "fullText": "Dangerous concentrations of algae such as \"red tides\" have been consistently emerging in locations around the world. A region in Southern Australia is experiencing a nine-month toxic algae bloom that spans thousands of miles and has caused thousands of deaths…",
    "link": "https://phys.org/news/2026-01-plastic-pollution-hazardous-conditions.html"
  }
]