[
  {
    "text": "U-Haul drives into crowd during anti-Iranian regime rally in Westwood, LAPD says - ABC7 Los Angeles",
    "fullText": "Chaos erupted after a driver allegedly plowed a U-Haul into a crowd during an anti-Iranian regime protest near the federal building in Westwood on Sunday afternoon.",
    "link": "https://abc7.com/post/haul-drives-crowd-during-anti-iranian-regime-rally-westwood-lapd-says/18388519/"
  },
  {
    "text": "Stock futures are flat ahead of a busy week of earnings, economic data: Live updates - CNBC",
    "fullText": "Traders are preparing for the kickoff of earnings season, with major Wall Street banks set to report results in the days ahead.",
    "link": "https://www.cnbc.com/2026/01/11/stock-market-today-live-updates.html"
  },
  {
    "text": "UK can legally stop shadow fleet tankers, ministers believe - BBC",
    "fullText": "Existing law could be used to approve the use of military force to stop sanction-busting ships operated by Russia and Iran.",
    "link": "https://www.bbc.com/news/articles/cy8pn7jgy3no"
  },
  {
    "text": "No. 2 Buckeyes Blank No. 23 Indiana, 45-0 - Ohio State | Official Athletics Website",
    "fullText": "COLUMBUS, Ohio – No. 2 Ohio State (12-0, 1-0) shutout visiting No. 23 Indiana (5-2, 0-1) Sunday in the Big Ten opener at the Covelli Center. The Buckeyes rec...",
    "link": "https://ohiostatebuckeyes.com/news/2026/1/11/wrestling-no-2-buckeyes-blank-no-23-indiana-45-0"
  },
  {
    "text": "The struggle of resizing windows on macOS Tahoe - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46579864"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "Details Of Red Sox’ Pursuit Of Alex Bregman - MLB Trade Rumors",
    "fullText": "The Red Sox missed out on Alex Bregman. Visit MLB Trade Rumors for details on their offer to him and next steps now that he's a Cub.",
    "link": "https://www.mlbtraderumors.com/2026/01/details-of-red-sox-pursuit-of-alex-bregman.html"
  },
  {
    "text": "Golden Globes 2026: Seen and Heard at Every Star-Studded Party - The Hollywood Reporter",
    "fullText": "It turns out even the A-list is absolutely defenseless when face-to-face with the thrall of the 'Heated Rivalry' guys.",
    "link": "http://www.hollywoodreporter.com/lists/golden-globes-2026-parties-heated-rivalry/"
  },
  {
    "text": "Iran Edges Closer to a Revolution That Would Reshape the World - Bloomberg.com",
    "fullText": "If the uprising succeeds in toppling the Islamic Republic, it would upend global geopolitics and energy markets — with the risk of widespread chaos.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-11/iran-edges-closer-to-a-revolution-that-would-reshape-the-world"
  },
  {
    "text": "SpaceX launches NASA's Pandora exoplanet mission, 3 dozen other satellites (video) - Space",
    "fullText": "Pandora will study the atmospheres of at least 20 exoplanets during its yearlong mission.",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/watch-spacex-launch-nasas-pandora-exoplanet-studying-satellite-on-jan-11"
  },
  {
    "text": "49ers vs. Eagles Live Updates | Wild Card Round - Philadelphia Eagles",
    "fullText": "Follow along as the No. 3 seeded Eagles host the No. 6 49ers.",
    "link": "https://www.philadelphiaeagles.com/news/eagles-49ers-playoffs-live-updates-game-recap-nfl-2025-wild-card-round"
  },
  {
    "text": "Stocks are signaling that another commodities ‘supercycle’ is afoot in 2026 - MarketWatch",
    "fullText": "‘We are seeing oil, gold and silver rally as geopolitical tensions are rising, especially after the military operation in Venezuela,’ says one CIO",
    "link": "https://www.marketwatch.com/story/stocks-are-signaling-that-another-commodities-supercycle-is-afoot-in-2026-5e697dc6"
  },
  {
    "text": "CES 2026: 7 biggest news stories across TVs, laptops, and other weird gadgets you missed - ZDNET",
    "fullText": "It's a wrap for the world's largest technology trade show - here are the top announcements throughout the week-long event.",
    "link": "https://www.zdnet.com/article/ces-2026-recap/"
  },
  {
    "text": "Schefter: Packers CEO Ed Policy has a decision to make about Matt LaFleur - NBC Sports",
    "fullText": "We've got another potential source off between Ian Rapoport and Adam Schefter regarding John Harbaugh.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/schefter-packers-ceo-ed-policy-has-a-decision-to-make-about-matt-lafleur"
  },
  {
    "text": "Google’s AI Inbox could be a glimpse of Gmail’s future - The Verge",
    "fullText": "We’ve tried Google’s AI Inbox, and while it has some promise, if you have a good email management system already, it may not change that.",
    "link": "https://www.theverge.com/tech/859864/google-gmail-ai-inbox-hands-on"
  },
  {
    "text": "This Island Spider That Deletes Half Its DNA, and Scientists Say It Shouldn’t Be Possible - The Daily Galaxy",
    "fullText": "A team set out to compare two closely related spiders, and stumbled into a paradox. The island species doesn’t behave like island species are supposed to.",
    "link": "https://dailygalaxy.com/2026/01/spider-deletes-half-dna-shouldnt-possible/"
  },
  {
    "text": "Trump tells Cuba to 'make a deal, before it is too late' - BBC",
    "fullText": "Trump has been turning his attention to Cuba since US forces seized Venezuelan leader Nicolás Maduro.",
    "link": "https://www.bbc.com/news/articles/cx2kv2gn62vo"
  }
]