[
  {
    "text": "Potential measles exposure reported at Upstate Walmart - WYFF News 4",
    "fullText": "Health officials in South Carolina are reporting a possible measles exposure at a Walmart store.",
    "link": "https://www.wyff4.com/article/measles-exposure-walmart-in-south-carolina/70395048"
  },
  {
    "text": "Two Changes Made To Current WWE Championship? - WrestleTalk",
    "fullText": "Two changes have seemingly been made to a current WWE Championship ahead of an upcoming title match next week.",
    "link": "https://wrestletalk.com/news/two-changes-made-wwe-championship/"
  },
  {
    "text": "U.S. offers more details on claim China conducted secret nuclear weapons test - The Washington Post",
    "fullText": "Remarks by a top administration official appeared to be aimed at dispelling skepticism of its assertions, as President Donald Trump vows to restart U.S. tests.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/china-nuclear-test-trump/"
  },
  {
    "text": "Judge blocks deportation of Palestinian activist who led protests at Columbia - AP News",
    "fullText": "An immigration judge has dismissed the Trump administration’s deportation case against Mohsen Mahdawi, a Palestinian graduate student and Columbia protest leader. Judge Nina Froes said government lawyers made a procedural mistake by failing to certify a piece…",
    "link": "https://apnews.com/article/mohsen-mahdawi-trump-columbia-deportation-8d0746636b3f4baed4704283e0cadae3"
  },
  {
    "text": "7 takeaways from No. 1 Michigan Basketball’s win at No. 7 Purdue - Maize n Brew",
    "fullText": "No. 1 Michigan Basketball picked up a massive 91-80 win at No. 7 Purdue. Here are 7 takeaways from the road victory:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/106473/michigan-basketball-takeaways-purdue-yaxel-lendeborg-elliot-cadeau-dusty-may"
  },
  {
    "text": "'Just push us into the sea': The frustration of an area failed by politics - BBC",
    "fullText": "In Horden, County Durham, Westminster slogans have long been left unmet as the population has plummeted.",
    "link": "https://www.bbc.com/news/articles/cm2136jnjx1o"
  },
  {
    "text": "Microsoft confirms new Windows 11 feature drop coming next month - Windows Central",
    "fullText": "Windows 11's latest Release Preview Channel update has given us our first look at Microsoft's next feature drop for the OS that's expected to begin rolling out imminently.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-next-windows-11-feature-drop-with-new-taskbar-emoji-and-settings-updates-heres-whats-coming-to-your-pc-very-soon"
  },
  {
    "text": "Why California could be the big winner as EPA abandons climate policy - Politico",
    "fullText": "The federal government is walking away from its tailpipe emissions rules, sparking a legal debate over whether states can now write their own standards.",
    "link": "https://www.politico.com/news/2026/02/17/epa-abandoning-climate-regulatory-power-california-ev-goals-00785469"
  },
  {
    "text": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "fullText": "Tricia McLaughlin is leaving just over a year into Homeland Security Secretary Kristi L. Noem’s tenure leading the department.",
    "link": "https://www.washingtonpost.com/immigration/2026/02/17/tricia-mclaughlin-leaves-dhs/"
  },
  {
    "text": "Bird flu suspected as dead geese are found at multiple parks across New Jersey, officials say - NJ.com",
    "fullText": "The cause of the geese deaths is suspected to be bird flu, officials said.",
    "link": "https://www.nj.com/news/2026/02/bird-flu-suspected-as-dead-geese-are-found-at-multiple-parks-across-new-jersey-officials-say.html"
  },
  {
    "text": "Air Force One will sport Trump’s preferred paint job, after Air Force again reverses course - CNN",
    "fullText": "President Donald Trump’s preferred paint colors will be applied to the new planes which will serve as Air Force One, an Air Force official tells CNN.",
    "link": "https://www.cnn.com/2026/02/17/us/new-af1-paint-job"
  },
  {
    "text": "GameHub will give Mac owners another imperfect way to play Windows games - Ars Technica",
    "fullText": "GameHub's existing Windows emulator on Android has its fair share of issues.",
    "link": "https://arstechnica.com/gaming/2026/02/gamehub-will-give-mac-owners-another-imperfect-way-to-play-windows-games/"
  },
  {
    "text": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy - CNN",
    "fullText": "Iranian and American negotiators departed their indirect talks in Geneva with an agreement to keep talking, doing little to ease fears of an impending regional war.",
    "link": "https://www.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy"
  },
  {
    "text": "Here’s how much snow the Sierra got this weekend — and how much is on the way - San Francisco Chronicle",
    "fullText": "Some California ski resorts tallied feet of snow over the past two days. More is coming.",
    "link": "https://www.sfchronicle.com/weather/article/sierra-snow-lake-tahoe-21358405.php"
  },
  {
    "text": "Astronomers may have just found one of the missing links in galaxy evolution - Phys.org",
    "fullText": null,
    "link": "https://phys.org/news/2026-02-astronomers-links-galaxy-evolution.html"
  },
  {
    "text": "Hegseth forces ouster of senior Army spokesman in latest internal clash - The Washington Post",
    "fullText": "Col. David Butler, who had been selected by senior Army leaders for promotion to brigadier general, will instead retire, officials said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/pete-hegseth-dan-driscoll-david-butler/"
  },
  {
    "text": "Bayer agrees to $7.25 billion proposed settlement over thousands of Roundup cancer lawsuits - AP News",
    "fullText": "Bayer has agreed to a proposed $7.25 billion deal to settle thousands of U.S. lawsuits that blame Roundup for causing cancer. Bayer and lawyers for cancer patients announced Tuesday that they were filing the proposed settlement in St. Louis. It comes as the U…",
    "link": "https://apnews.com/article/bayer-monsanto-roundup-lawsuits-settlement-154ad7c6bdff3a91b06c4e327321160b"
  },
  {
    "text": "Air pollution directly linked to Alzheimer’s risk, scientists say - Financial Times",
    "fullText": "Particles from combustion of fossil fuels may damage brain health more than thought, research suggests",
    "link": "https://www.ft.com/content/35c5904e-c1bc-452c-9f38-29b6b1b77066"
  }
]