[
  {
    "text": "South Korean leader says he asked China's Xi to act as mediator on North Korea issues - abcnews.go.com",
    "fullText": "South Korean President Lee Jae Myung says he asked Chinese President Xi Jinping to serve as a mediator to help resolve the North Korean nuclear crisis and ease animosities between the two Koreas",
    "link": "https://abcnews.go.com/International/wireStory/south-korean-leader-asked-chinas-xi-act-mediator-128973063"
  },
  {
    "text": "People coming off weight-loss injections risk fast weight gain - BBC",
    "fullText": "Overweight people shed large amounts on jabs but gain 0.8 kg a month on average once off them, study shows.",
    "link": "https://www.bbc.com/news/articles/c050ljnrv2qo"
  },
  {
    "text": "NASA postpones spacewalk to monitor ‘medical concern’ with astronaut - CNN",
    "fullText": "The space agency said Wednesday it was postponing a spacewalk because of a medical concern with an unidentified astronaut.",
    "link": "https://www.cnn.com/2026/01/07/science/nasa-astronaut-spacewalk-medical-concern"
  },
  {
    "text": "Trump White House attempts to rewrite history of Jan. 6, accuses Capitol Police of escalating tensions - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-white-house-attempts-rewrite-history-jan-6/story?id\\\\u003d128953694"
  },
  {
    "text": "How tariff disruption will continue reshaping the global economy in 2026 - BBC",
    "fullText": "Trump's import levies are still changing the patterns of international trade.",
    "link": "https://www.bbc.com/news/articles/czejp3gep63o"
  },
  {
    "text": "Withdrawing the United States from International Organizations, Conventions, and Treaties that Are Contrary to the Interests of the United States - The White House (.gov)",
    "fullText": "MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES By the authority vested in me as President by the Constitution and the laws of the United",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/withdrawing-the-united-states-from-international-organizations-conventions-and-treaties-that-are-contrary-to-the-interests-of-the-united-states/"
  },
  {
    "text": "PRIORITIZING THE WARFIGHTER IN DEFENSE CONTRACTING - The White House (.gov)",
    "fullText": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.  Purpose.",
    "link": "https://www.whitehouse.gov/presidential-actions/2026/01/prioritizing-the-warfighter-in-defense-contracting/"
  },
  {
    "text": "Common food preservatives linked to cancer and type 2 diabetes - CNN",
    "fullText": "Two large studies found a significant association between eating preservatives in many foods and a higher risk of type 2 diabetes and several cancers.",
    "link": "https://www.cnn.com/2026/01/07/health/food-preservatives-cancer-diabetes-wellness"
  },
  {
    "text": "Oldest known poison arrows were used to hunt animals 60,000 years ago - CNN",
    "fullText": "Stone Age arrowheads found in South Africa showcase the knowledge and strategy of prehistoric hunter-gatherers, according to a new study.",
    "link": "https://www.cnn.com/2026/01/07/science/oldest-known-poison-arrow-use"
  },
  {
    "text": "Key airline used by Trump for deportations cuts ties with ICE - Axios",
    "fullText": "Avelo will cease operations for the government on January 27.",
    "link": "https://www.axios.com/2026/01/07/ice-trump-avelo-airlines-deportations"
  },
  {
    "text": "Barcelona 5-0 Athletic (Jan 7, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Barcelona vs. Athletic Club Spanish Supercopa game from January 7, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/748115"
  },
  {
    "text": "What are the Cowboys looking for in their next defensive coordinator? - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "In their end of season press conference, Jerry Jones, Stephen Jones and Brian Schottenheimer weighed in on what they're looking for in the next Cowboys defensive coordinator.",
    "link": "https://www.dallascowboys.com/news/what-are-the-cowboys-looking-for-in-their-next-defensive-coordinator"
  },
  {
    "text": "‘Tangled’ Live-Action Movie Finds Its Leads: Teagan Croft, Milo Manheim (Exclusive) - The Hollywood Reporter",
    "fullText": "The casting ends a lengthy search for Rapunzel and Flynn Rider.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/tangled-live-action-movie-teagan-croft-milo-manheim-1236466753/"
  },
  {
    "text": "Apple reportedly finds Apple Card partner to replace Goldman Sachs - 9to5Mac",
    "fullText": "Apple has found an Apple Card partner replacement for Goldman Sachs, according to a new Wall Street Journal report. The...",
    "link": "https://9to5mac.com/2026/01/07/apple-reportedly-finds-apple-card-partner-to-replace-goldman-sachs/"
  },
  {
    "text": "Aleppo: Thousands flee clashes between Syrian government and Kurdish fighters - BBC",
    "fullText": "At least 12 people have reportedly been killed in the city, where the army is demanding Kurdish fighters leave two neighbourhoods.",
    "link": "https://www.bbc.com/news/articles/cn0y1pnq00qo"
  },
  {
    "text": "Cambodian Scam Tycoon Wanted by U.S. Extradited to China - The Wall Street Journal",
    "fullText": "Justice Department accused Chen Zhi of running a sprawling scam empire targeting Americans",
    "link": "https://www.wsj.com/world/asia/cambodian-scam-tycoon-wanted-by-u-s-extradited-to-china-b483e24c"
  },
  {
    "text": "Dell admits consumers don’t care about AI PCs - The Verge",
    "fullText": "Dell is now shifting it focus this year away from being ‘all about the AI PC.’",
    "link": "https://www.theverge.com/news/857723/dell-consumers-ai-pcs-comments"
  },
  {
    "text": "Separate and alone: How Nicolás Maduro and his wife can expect to be treated in jail - CNN",
    "fullText": "Nicolás Maduro and his wife, Cilia Flores, can reasonably expect two things to happen as they get accustomed to their new day-to-day life at the notorious Metropolitan Detention Center in Brooklyn, New York: They will be uncomfortable and kept out of harm’s w…",
    "link": "https://www.cnn.com/2026/01/07/us/nicolas-maduro-wife-treatment-jail-mdc"
  }
]