[
  {
    "text": "Live updates: Middle East allies urge Trump to hold off on Iran strikes, diplomat says - AP News",
    "fullText": "Several Middle Eastern allies of the United States have urged the Trump administration to hold off on strikes against Iran for the government's deadly crackdown on protesters, according to an Arab diplomat familiar with the matter.",
    "link": "https://apnews.com/live/donald-trump-news-updates-1-16-2026"
  },
  {
    "text": "Virginia Democrats set up a referendum to try to flip as many as 4 GOP-held US House seats - CNN",
    "fullText": "Virginia on Friday became the latest state to escalate the nationwide redistricting battle ahead of November’s midterm elections that will determine which party controls the US House during the final two years of President Donald Trump’s time in office.",
    "link": "https://www.cnn.com/2026/01/16/politics/virginia-redistricting-democrats-referendum"
  },
  {
    "text": "Novo Nordisk shares rise 5% after Wegovy obesity pill has ‘solid’ launch - CNBC",
    "fullText": "The early data is a boost to the Danish drugmaker's hopes of winning back more market share from Eli Lilly this year in the obesity drug space.",
    "link": "https://www.cnbc.com/2026/01/16/novo-nordisk-shares-wegovy-obesity-pill-launch.html"
  },
  {
    "text": "Major winter storm moving, bringing strong wind gusts, snow to Plains and Northeast - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/major-winter-storm-moving-bringing-strong-wind-gusts/story?id\\\\u003d129278259"
  },
  {
    "text": "Box Office: ‘28 Years Later: Bone Temple’ Makes $2.1 Million in Previews - Variety",
    "fullText": "'28 Years Later: The Bone Temple' opens with $2.1 million in previews at the box office.",
    "link": "https://variety.com/2026/film/box-office/box-office-28-years-later-bone-temple-previews-1236631409/"
  },
  {
    "text": "Trump bets on rural health as a winning midterm message - The Washington Post",
    "fullText": "The president is promoting a $50 billion fund designed to help communities where hospitals are struggling, amid criticism of his deep Medicaid cuts.",
    "link": "https://www.washingtonpost.com/politics/2026/01/16/trump-rural-health-midterms/"
  },
  {
    "text": "Ryan Garcia causes streamer to scream in pain, vomit after vicious body shot - MMA Fighting",
    "fullText": "Ryan Garcia left an influencer in intense pain and anguish after a body punch.",
    "link": "https://www.mmafighting.com/boxing/466573/ryan-garcia-causes-streamer-to-scream-in-pain-vomit-after-vicious-body-shot"
  },
  {
    "text": "Trump floats new tariffs in push to acquire Greenland - CNBC",
    "fullText": "The comments show Trump considering applying his aggressive tariff strategies to his efforts to acquire Greenland.",
    "link": "https://www.cnbc.com/2026/01/16/trump-greenland-tariffs.html"
  },
  {
    "text": "Rams vs. Bears weather update: Snow, wind, cold in forecast for NFL divisional round - NBC Sports",
    "fullText": "The current forecast for kickoff is a temperature of 19 degrees, wind gusts of 20 miles per hour and a 45 percent chance of snow.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/rams-vs-bears-weather-update-snow-wind-cold-in-forecast-for-nfl-divisional-round"
  },
  {
    "text": "Rich list 2016 vs. 2026: Who climbed, slipped, and disappeared from the world's 10 wealthiest people - Business Insider",
    "fullText": "Elon Musk now dominates the rich list while Bill Gates and Warren Buffett have tumbled down the rankings largely due to their charitable giving.",
    "link": "https://www.businessinsider.com/top-10-rich-list-2016-musk-buffett-gates-bezos-wealth-2026-1"
  },
  {
    "text": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "fullText": "The parent company of X and Grok, xAI, launched a counter-suit saying she had violated its terms of service.",
    "link": "https://www.bbc.com/news/articles/cp37erw0zwwo"
  },
  {
    "text": "Cumberland County DA cancels news conference on ICE activity after state court concern - Portland Press Herald - Maine Sunday Telegram",
    "fullText": "The event was planned as officials in Maine's 2 largest cities anticipate an increased presence from U.S. Immigration and Customs Enforcement in the coming days.",
    "link": "https://www.pressherald.com/2026/01/16/cumberland-county-da-portland-officials-plan-friday-news-conference-on-ice-activity/"
  },
  {
    "text": "Ted Sarandos: “I Don’t Know Why” Trump Shared Article Saying to “Stop” Netflix Deal for Warner Bros. - The Hollywood Reporter",
    "fullText": "\"I don’t want to overread it, either,\" the Netflix co-CEO says in a measured new interview.",
    "link": "http://www.hollywoodreporter.com/business/business-news/ted-sarandos-trump-netflix-deal-warner-bros-1236476148/"
  },
  {
    "text": "After a month of no answer, NASA will try hailing its silent MAVEN Mars orbiter today - Space",
    "fullText": "MAVEN has enough fuel to stay in orbit until 2030, but after a month of silence, scientists say recovery is increasingly unlikely.",
    "link": "https://www.space.com/astronomy/mars/after-a-month-of-no-answer-nasa-will-try-hailing-its-silent-maven-mars-orbiter-today"
  },
  {
    "text": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded - BBC",
    "fullText": "The secret discussions, bombshell leak and sacking which led to Robert Jenrick defecting to the Reform party.",
    "link": "https://www.bbc.com/news/articles/ce3ejzz78gxo"
  },
  {
    "text": "Trump's proposed ban on buying single-family homes introduces uncertainty for family offices - CNBC",
    "fullText": "Wall Street landlords are the primary target of Trump's proposed ban, but investment firms of the ultra rich could get caught in the crosshairs.",
    "link": "https://www.cnbc.com/2026/01/16/trump-investors-homes-family-offices.html"
  },
  {
    "text": "‘A piece of chicken, a piece of broccoli’: Agriculture secretary says healthy meals cost $3 - The Washington Post",
    "fullText": "Brooke Rollins drew ridicule on social media after saying a meal could be a “piece of chicken, a piece of broccoli, a corn tortilla and one other thing.”",
    "link": "https://www.washingtonpost.com/business/2026/01/16/three-dollar-meals-rollins/"
  }
]