[
  {
    "text": "Iran’s crown prince says survival of Tehran government ‘sends a clear signal to every bully’ - AP News",
    "fullText": "Police say around 200,000 people have demonstrated against Iran’s government on the sidelines of a gathering of world leaders in Germany. The giant protest in Munich on Saturday answered a call from Iran’s exiled Crown Prince Reza Pahlavi for cranked up inter…",
    "link": "https://apnews.com/article/iran-munich-protests-reza-pahlavi-53d2448dd26d28a1206ecefdfde168f2"
  },
  {
    "text": "Padres, Nick Castellanos Agree To Contract - MLB Trade Rumors",
    "fullText": "After his tumultuous exit from Philadelphia, Castellanos quickly lands a new deal. Visit MLB Trade Rumors for more on the Padres' signing.",
    "link": "https://www.mlbtraderumors.com/2026/02/padres-nick-castellanos-agree-to-contract.html"
  },
  {
    "text": "The Goldilocks economy, if you don't look too close - Axios",
    "fullText": "The economy and the markets look stable, on the surface at least.",
    "link": "https://www.axios.com/2026/02/14/cpi-report-inflation-ai-jobs-market"
  },
  {
    "text": "5 ways heartbreak affects the body - CNN",
    "fullText": "Heartbreak isn’t just an emotional experience. It can physically hurt. Discover five ways love affects your body and what an expert says can help.",
    "link": "https://www.cnn.com/2026/02/14/health/love-heartbreak-effect-body-wellness"
  },
  {
    "text": "Researcher skeptical of ‘Havana syndrome’ tested secret weapon on himself - The Washington Post",
    "fullText": "The CIA investigated a Norwegian government experiment with a pulsed-energy machine in which a researcher built and tested a “Havana syndrome” device on himself.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/14/havana-syndrome-cia-norway-experiment/"
  },
  {
    "text": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "fullText": "The administration’s attacks on Lemon and independent journalists have boosted their online attention and revenue.",
    "link": "https://www.washingtonpost.com/technology/2026/02/14/don-lemon-arrest-trump-administration/"
  },
  {
    "text": "I found the best Presidents Day TV deals on the latest from Samsung, Sony and more - CNN",
    "fullText": "Presidents Day is an excellent time to upgrade your TV, and the deals this year span every popular brand from LG to Samsung.",
    "link": "https://www.cnn.com/cnn-underscored/deals/presidents-day-tv-sales-2026-02-14"
  },
  {
    "text": "It's a dangerous complication of pregnancy — but a new drug holds promise - NPR",
    "fullText": "Researchers celebrate early results of a drug that may become the first treatment for a serious complication of pregnancy called preeclampsia. It's got the potential to save many lives.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5708744/preeclampsia-pregnancy-complication-treatment"
  },
  {
    "text": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts - Space",
    "fullText": "Saturday, Feb. 14, 2026: Updates on SpaceX and NASA's Crew-12 astronaut mission to the International Space Station.",
    "link": "https://www.space.com/news/live/spacex-nasa-crew-12-astronauts-launch-to-iss-feb-14-2026"
  },
  {
    "text": "What makes a good book-to-film adaptation? We have thoughts (and favorites) - NPR",
    "fullText": "Little Women (2019), Blade Runner (1982) and more favorites from NPR staff.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5706661/wuthering-heights-adaptations-movies-little-women-nickel-boys-starship-troopers-blade-runner"
  },
  {
    "text": "Meet the power couples of the 2026 Winter Games, from rivals to teammates - NPR",
    "fullText": "Some of these power couples span multiple sports, while others compete in the same discipline — or even on the same team.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5713531/olympic-paralympic-power-couples-team-usa"
  },
  {
    "text": "Don’t forget: All post office locations to close, mail won’t be delivered - MLive.com",
    "fullText": "Valentine’s Day isn’t the only holiday this month.",
    "link": "https://www.mlive.com/news/us-world/2026/02/dont-forget-all-post-office-locations-to-close-mail-wont-be-delivered.html"
  },
  {
    "text": "After a 2-decade ban, kites fill Lahore's skies during a Pakistani springtime festival - NPR",
    "fullText": "People gathered on rooftops to enjoy flying kites for the first time in years, celebrating the spring festival of Basant. The activity had been banned due to injuries and deaths during past celebrations.",
    "link": "https://www.npr.org/2026/02/14/g-s1-109711/pakistan-basant-kites-spring-festival-lahore"
  },
  {
    "text": "Dr. Oz pushes AI avatars as a fix for rural health care. Not so fast, critics say - NPR",
    "fullText": "Dr. Mehmet Oz, who heads the Centers for Medicare and Medicaid Services, is advancing a $50 billion plan to modernize rural health care.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5704189/dr-oz-ai-avatars-replace-rural-health-workers"
  },
  {
    "text": "ChatGPT promised to help her find her soulmate. Then it betrayed her - NPR",
    "fullText": "ChatGPT sent screenwriter Micky Small down a fantastical rabbit hole. Now, she's finding her way out.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5711441/ai-chatgpt-openai-love-betrayal-delusion-chatbot"
  },
  {
    "text": "Tahoe snowstorm could make travel ‘impossible,’ officials warn - San Francisco Chronicle",
    "fullText": "A major winter storm is expected to hit California on President's Day weekend, adding multiple feet of snow to ski resorts but potentially closing highways.",
    "link": "https://www.sfchronicle.com/weather/article/tahoe-winter-storm-21352647.php"
  },
  {
    "text": "College Basketball Picks Today: Greg Peterson Best Bets for Saturday, February 14 - VSiN",
    "fullText": "College basketball picks today from Greg Peterson for today, Saturday, February 14.",
    "link": "http://vsin.com/college-basketball/college-basketball-picks-today-greg-peterson-best-bets-for-saturday-february-14/"
  },
  {
    "text": "40 Epics Sales to Shop This President’s Day Weekend - Gear Patrol",
    "fullText": "Major brands are marking down gear, apparel, and home goods for the long weekend — here are the sales worth your time.",
    "link": "https://www.gearpatrol.com/deals/best-presidents-day-weekend-sales-2026/"
  }
]