[
  {
    "text": "A strong nor’easter could soon hit the East Coast. Here’s what could happen. - The Washington Post",
    "fullText": "A swath of the Mid-Atlantic and Northeast, including cities from D.C. to Boston, could face accumulating snow and strong winds.",
    "link": "https://www.washingtonpost.com/weather/2026/02/19/noreaster-storm-east-coast-forecast/"
  },
  {
    "text": "Treasuries Head for Worst Run in a Month on Inflation Fears - Bloomberg.com",
    "fullText": "Treasuries are on course for their longest losing streak in a month as growing tensions between the US and Iran fuel oil-driven inflation fears.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-19/treasuries-head-for-worst-run-in-a-month-on-inflation-fears"
  },
  {
    "text": "Hilary Duff Is Ready for Her Pop Return - Rolling Stone",
    "fullText": "Hilary Duff takes us inside her incredibly relatable comeback album 'Luck … or Something.'",
    "link": "http://www.rollingstone.com/music/music-features/hilary-duff-interview-new-album-luck-or-something-1235511649/"
  },
  {
    "text": "US Jobless Claims Drop by the Most Since November to 206,000 - Bloomberg.com",
    "fullText": "Applications for US unemployment benefits fell by the most since November, adding to evidence of stabilization in the labor market.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-19/us-jobless-claims-decline-by-the-most-since-november-to-206-000"
  },
  {
    "text": "Over 1,000 Kenyans enlisted to fight in Russia-Ukraine war, report says - BBC",
    "fullText": "Investigators call the recruitment a well-organised trafficking ring involving immigration staff and security agencies.",
    "link": "https://www.bbc.com/news/articles/ce8w266769go"
  },
  {
    "text": "James Van Der Beek Merch Email Reactions Explained - BuzzFeed",
    "fullText": "“Adding emotional pressure to influence people’s decision is beyond inappropriate.”",
    "link": "https://www.buzzfeed.com/stephaniesoteriou/james-van-der-beek-uncomfortable-email-reacts"
  },
  {
    "text": "Wolves 2-2 Arsenal: Gunners collapse late as title lead starts to slip away - NBC Sports",
    "fullText": "Arsenal were 2-0 up and coasting to a seven-point lead in the Premier League title race, before they shipped two goals in the final half-hour and drew last-place Wolves 2-2 at Molineux Stadium on Wednesday.",
    "link": "https://www.nbcsports.com/soccer/news/wolves-2-2-arsenal-video-highlights-analysis-recap"
  },
  {
    "text": "Amid Epstein fallout, Bill Gates becomes point of controversy at India AI summit - CNBC",
    "fullText": "Bill Gates has become a point of controversy at a major Indian AI festival this week, amid the fallout of the latest Epstein file release.",
    "link": "https://www.cnbc.com/2026/02/19/amid-epstein-fallout-bill-gates-becomes-point-of-controversy-at-india-ai-summit-.html"
  },
  {
    "text": "UN experts say destruction by Sudan's rebels in el-Fasher in October bears 'hallmarks of genocide' - Associated Press News",
    "fullText": "U.N.-backed investigators say Sudan’s paramilitary Rapid Support Forces have carried out a campaign in the city of el-Fasher in the Darfur region that shows “hallmarks of genocide” against non-Arab communities. The fact-finding mission says the group inflicte…",
    "link": "https://apnews.com/article/rsf-sudan-genocide-un-85b79539f9e4b18e25dd6ef82d5b53ee"
  },
  {
    "text": "Former Nebraska first lady Susanne Shore runs for NU regent in Omaha - Nebraska Examiner",
    "fullText": "Susanne Shore, Nebraska's former first lady under then-Gov. Pete Ricketts, is running for an Omaha seat on the NU Board of Regents.",
    "link": "https://nebraskaexaminer.com/2026/02/19/former-nebraska-first-lady-susanne-shore-runs-for-nu-regent-in-omaha/"
  },
  {
    "text": "Blood tests show potential for predicting start of Alzheimer’s symptoms - The Washington Post",
    "fullText": "The technique is not yet precise enough to predict a patient’s exact trajectory but could help find long-sought preventive treatment.",
    "link": "https://www.washingtonpost.com/health/2026/02/19/alzheimers-tests-symptom-onset-predictions/"
  },
  {
    "text": "Steve Cohen's $3.4 Billion Payday Tops Hedge Fund Ranks - Bloomberg.com",
    "fullText": "The Point72 founder edges Tepper and Englander to take the No. 1 spot in Bloomberg’s annual listing.",
    "link": "https://www.bloomberg.com/news/features/2026-02-19/mets-owner-steve-cohen-leads-hedge-funds-with-3-4-billion-haul"
  },
  {
    "text": "Canadians kind of hate America now. Our new poll shows just how much. - Politico",
    "fullText": "It’s not just about the trade war. Nearly half of America’s neighbors to the north now think the U.S. is a bigger threat to world peace than Russia.",
    "link": "https://www.politico.com/news/2026/02/19/5-charts-show-just-how-badly-the-us-has-torpedoed-its-relationship-with-canada-00787084"
  },
  {
    "text": "How Epstein and Maxwell used an elite Midwest arts school to prey on girls - NPR",
    "fullText": "Jeffrey Epstein and Ghislaine Maxwell lavished money on the Interlochen Center for the Arts to gain access, documents show — even funding an on-campus lodge they stayed in. In the process, two teenagers were pulled into their orbit.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5707290/epstein-files-victims-interlochen-ghislaine-maxwell"
  },
  {
    "text": "Ilia Malinin says person who came to Olympics a few weeks ago is ‘dust’ - The Washington Post",
    "fullText": "Gone is the shy 21-year-old who talked effusively about figure skating, replaced by a young man whose words come in measured and concrete thoughts about a larger purpose.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/19/ilia-malinin-olympic-disappointment/"
  },
  {
    "text": "Galaxy S25 gets the One UI 8.5 Beta 5 update - SamMobile",
    "fullText": "Samsung is rolling out a new beta version of One UI 8.5 (Android 16 QPR2) to the Galaxy S25, Galaxy S25+, and the Galaxy S25 Ultra in India. Carrying firmware version ZZAN, this is the fourth beta version of the software in the country, and if released in oth…",
    "link": "https://www.sammobile.com/news/galaxy-s25-gets-new-one-ui-8-5-beta-update/"
  },
  {
    "text": "Airbus Shares Slide as Engine Shortages Hit A320 Production - The Wall Street Journal",
    "fullText": "Plane maker targets lower delivery goal after latest supply-chain challenge",
    "link": "https://www.wsj.com/business/earnings/airbus-warns-of-hit-to-a320-jet-production-from-pratt-whitney-engine-shortage-98bc96f1"
  },
  {
    "text": "Trump heads to Georgia, a target of his election falsehoods, as Republicans look for midterm boost - Associated Press News",
    "fullText": "President Donald Trump is weighing military action against Iran, leading an immigration crackdown, and teasing a federal takeover of state elections. But on Thursday, White House insists he will focus on the economy when he visits battleground Georgia. The tr…",
    "link": "https://apnews.com/article/trump-georgia-economy-midterm-elections-greene-29075b0f22be1569aafe144ab7ca025b"
  },
  {
    "text": "Bird flu concerns: Traumatized Hainesport Twp. residents forced to dispose dead birds amid suspected outbreak - 6abc Philadelphia",
    "fullText": "Chiquita Anderson, who lives in the Lakeside at Creekview community, said her son recently watched a bird fall from the sky in her backyard.",
    "link": "https://6abc.com/post/bird-flu-concerns-traumatized-hainesport-twp-residents-forced-dispose-dead-birds-amid-suspected-outbreak/18618685/"
  },
  {
    "text": "Google launches Snapseed camera for iPhone with pro manual controls, retro film - 9to5Google",
    "fullText": "After soft-launching in December, Snapseed for iOS is now officially rolling out its new camera that makes the app more than an image editor.",
    "link": "http://9to5google.com/2026/02/18/snapseed-camera-iphone/"
  }
]