[
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Star Wars Shake-Up: Kathleen Kennedy Steps Down as George Lucas Protégé Dave Filoni, Exec Lynwen Brennan Take Over Lucasfilm - The Hollywood Reporter",
    "fullText": "The change in leadership may mean a new hope for the storied franchise or it could be an attack of the clones by giving fans more of the same.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/star-wars-kathleen-kennedy-steps-down-dave-filoni-1236465012/"
  },
  {
    "text": "“I am very annoyed”: Pharma execs blast RFK Jr.’s attack on vaccines - Ars Technica",
    "fullText": "Pharma execs had avoided conflict with Trump admin, but now join doctors in rebukes.",
    "link": "https://arstechnica.com/health/2026/01/big-pharma-is-openly-railing-against-rfk-jr-s-anti-vaccine-agenda/"
  },
  {
    "text": "Trump threatens to use Insurrection Act to deploy troops to Minnesota to \"put an end\" to protests - CBS News",
    "fullText": "An Immigration and Customs Enforcement officer​ shot a man Wednesday night in north Minneapolis after allegedly being attacked by men with shovels during an arrest operation, three U.S. officials told CBS News.",
    "link": "https://www.cbsnews.com/minnesota/live-updates/minnesota-ice-shooting-protests-trump-insurrection-act/"
  },
  {
    "text": "Bettors and players fixed dozens of NCAA basketball games, prosecutors say - The Washington Post",
    "fullText": "In the latest gambling scandal to rock sports, a federal indictment accuses bettors and athletes of “point-shaving” in NCAA and Chinese Basketball Association games.",
    "link": "https://www.washingtonpost.com/sports/2026/01/15/ncaa-point-shaving-indictment/"
  },
  {
    "text": "Stock Market Today: Dow Closes Higher; Chip Stocks Rally After TSMC Earnings — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-01-15-2026"
  },
  {
    "text": "Native Americans are being swept up by ICE in Minneapolis, tribes say - washingtonpost.com",
    "fullText": "Tribal leaders say Indigenous people have been stopped, questioned, harassed and, in some cases, detained solely on the basis of their skin color or names.",
    "link": "https://www.washingtonpost.com/politics/2026/01/15/native-americans-ice-minneapolis/"
  },
  {
    "text": "At Detroit auto show, spotlight dims for EVs - AP News",
    "fullText": "The North American International Auto Show in Detroit once dedicated an entire track on its coveted show floor to getting consumers comfortable with electric vehicles and charging. It’s a different story at this year’s show amid President Donald Trump's anti-…",
    "link": "https://apnews.com/article/detroit-auto-show-electric-vehicles-evs-trump-7dda882748aea036821009340e6dbaa8"
  },
  {
    "text": "Josh Allen off Bills injury report; Terrel Bernard and Ed Oliver questionable for Sunday - NBC Sports",
    "fullText": "Josh Allen moved up to full practice participation on Wednesday and the team confirmed that he's good to go for Saturday's game in Denver on Thursday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/josh-allen-off-bills-injury-report-terrel-bernard-and-ed-oliver-questionable-for-sunday"
  },
  {
    "text": "Rosters announced for 2026 AHL All-Star Classic - The American Hockey League",
    "fullText": null,
    "link": "https://theahl.com/news/rosters-announced-2026-ahl-all-star-classic"
  },
  {
    "text": "3 more Democratic lawmakers say they are under federal investigation over illegal orders social media video - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/3-democratic-lawmakers-federal-investigation-illegal-orders-social/story?id\\\\u003d129244803"
  },
  {
    "text": "Drug ring's \"monkey\" technique used young swimmers to stash cocaine on ships at sea, Spanish police say - CBS News",
    "fullText": "Police said they had busted a network that saw smugglers swim on the high seas to help stash Colombian cocaine on container ships and hijack vessels.",
    "link": "https://www.cbsnews.com/news/drug-ring-monkey-technique-swimmers-stash-cocaine-ships-spain-police/"
  },
  {
    "text": "College students and teens could be fueling the prediction markets boom - CNBC",
    "fullText": "Where sports betting is legal, it's often limited to those 21 years or older. Kalshi and Polymarket are open to anyone 18 or older, with some exceptions.",
    "link": "https://www.cnbc.com/2026/01/15/prediction-markets-college-students-teens-could-be-fueling-the-boom.html"
  },
  {
    "text": "Netanyahu says the announced start of Gaza ceasefire’s next phase is a ‘declarative move’ - AP News",
    "fullText": "Israeli strikes in Gaza have killed nine people, including three women, following the U.S. announcement of a second phase in the fragile ceasefire. Israeli Prime Minister Benjamin Netanyahu called the ceasefire largely symbolic, questioning its implementation…",
    "link": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-netanyahu-ceasefire-b916e332a2f88200ee9540d48c3d83a1"
  },
  {
    "text": "There's an internet blackout in Iran. How are videos and images getting out? - NPR",
    "fullText": "Starlink is illegal in Iran, but people are still using the satellite internet service to get around the government's internet shutdown.",
    "link": "https://www.npr.org/2026/01/15/nx-s1-5678567/iran-internet-blackout-starlink"
  },
  {
    "text": "ICE No. 2 steps down to launch run for battleground House district in Ohio - NBC News",
    "fullText": "Immigrations and Customs Enforcement Deputy Director Madison Sheahan on Thursday resigned her post and launched a campaign for Congress in Ohio, jumping into a crowded Republican primary for a seat that became more GOP-friendly after a recent redistricting pu…",
    "link": "https://www.nbcnews.com/politics/2026-election/ice-no-2-steps-launch-run-battleground-house-district-ohio-rcna254218"
  },
  {
    "text": "How To Add Jalopnik As A Preferred Source On Google - Jalopnik",
    "fullText": "Please sir, I want some more.",
    "link": "https://www.jalopnik.com/2076831/how-add-jalopnik-google-preferred-sources/"
  },
  {
    "text": "The 2026 NWSL Schedule is Here! | News | NWSLsoccer.com - NWSL",
    "fullText": "Highlighted by NWSL Rivalry Weekend and the return of Decision Day, the league’s 14th year of play kicks off this March as the world’s biggest stars in women’s football return to the pitch.",
    "link": "https://www.nwslsoccer.com/news/the-2026-nwsl-schedule-is-here"
  }
]