[
  {
    "text": "Dow set to fall more than 600 points on Trump’s new tariff threat over Greenland: Live updates - CNBC",
    "fullText": "Stock futures on Monday night pointed to a downbeat session on Wall Street as President Donald Trump intensifies his rhetoric on Greenland.",
    "link": "https://www.cnbc.com/2026/01/19/stock-market-today-live-updates.html"
  },
  {
    "text": "'Act of great stupidity': Trump launches another tirade against a NATO ally. This time it's the UK - CNBC",
    "fullText": "The White House voiced its support for the deal last year, but on Tuesday, Trump said it was \"an act of great stupidity.\"",
    "link": "https://www.cnbc.com/2026/01/20/trump-uk-chagos-davos-starmer-nato.html"
  },
  {
    "text": "Trump threatens 200% tariff on French wines as Macron reportedly snubs 'Board of Peace' seat - CNBC",
    "fullText": "Trump also reiterated his plans to control Greenland, saying that European leaders \"won't push back too much.\"",
    "link": "https://www.cnbc.com/2026/01/20/trump-threatens-200percent-tariff-on-french-wines-and-champagnes-.html"
  },
  {
    "text": "Lawsuit contests RFK Jr.’s new vaccine guidance for children - The Washington Post",
    "fullText": "Several public health organizations accused the health secretary of packing a key advisory committee with vaccine skeptics, arguing its latest guidance should be voided.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/rfk-childhood-vaccines-lawsuit/"
  },
  {
    "text": "Powerball jackpot winning numbers for Monday, January 19, 2026 - USA Today",
    "fullText": "While everyone wants to be the first Powerball jackpot winner of 2026, no one has yet claimed Christmas Eve's $1.8 billion prize.",
    "link": "https://www.usatoday.com/story/money/lottery/2026/01/19/powerball-winning-numbers-mlk-day-monday-january-19-2026/88253054007/"
  },
  {
    "text": "NVIDIA’s Laptop Chips, After a Long-Awaited Build-Up, Are Set to Debut This Year By Q2; N1/N1X SoCs to Challenge x86 Supremacy - Wccftech",
    "fullText": "NVIDIA plans to release ARM-based laptop chips as soon as this year, featuring the N1/N1X variants that are expected to dominate.",
    "link": "https://wccftech.com/nvidia-laptop-chips-after-a-long-awaited-build-up-are-set-to-debut-this-year/"
  },
  {
    "text": "Citi Downgrades European Stocks on US Friction Over Greenland - Bloomberg.com",
    "fullText": "The Citigroup Inc. strategist who called European stocks’ outperformance has turned more cautious on the region, citing worsening relations between Brussels and Washington over President Donald Trump’s push to seize Greenland.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-20/citi-downgrades-european-stocks-on-us-friction-over-greenland"
  },
  {
    "text": "100 vehicles pile up in Michigan crash as snowstorm moves across the country - ABC News",
    "fullText": "More than 100 vehicles smashed into each other or slid off the interstate in Michigan as snow fueled by the Great Lakes blanketed the state",
    "link": "https://abcnews.go.com/US/wireStory/100-vehicles-pile-michigan-crash-snowstorm-moves-country-129359102"
  },
  {
    "text": "In San Antonio, the nation's largest MLK march takes on added meaning - Texas Public Radio | TPR",
    "fullText": "The nation’s largest Martin Luther King Jr. Day march carries special significance in San Antonio, where a small Black community helped build a tradition that now draws hundreds of thousands each year.",
    "link": "https://www.tpr.org/arts-culture/2026-01-19/in-san-antonio-the-nations-largest-mlk-march-takes-on-added-meaning"
  },
  {
    "text": "Russia targets nuclear power plant substations, thousands in Kyiv without power, water - The Kyiv Independent",
    "fullText": "At least one person in Kyiv has been injured, local authorities reported. Ukraine's Air Force has warned that Russian ballistic missiles are targeting multiple regions, including the capital.",
    "link": "https://kyivindependent.com/russia-attacks-kyiv-with-ballistic-missiles-targeting-city-on-freezing-night-amid-energy-crisis/"
  },
  {
    "text": "How to take pictures of the Northern Lights with Google Pixel and other Android phones - 9to5Google",
    "fullText": "The Northern Lights are the most visible they've been in decades, and you can capture it with a picture from Android or Google Pixel phones.",
    "link": "http://9to5google.com/2026/01/19/how-to-take-pictures-northern-lights-android-google-pixel/"
  },
  {
    "text": "After Further Review: Breaking Down the Patriots Defense's Playoff Breakout, Maye Review, and Quick-Hit Notes From Divisional Round Win vs. Texans - New England Patriots",
    "fullText": "The Patriots advanced to the AFC Championship Game thanks to another great defensive performance vs. the Texans on Sunday. Here's how they did it.",
    "link": "https://www.patriots.com/news/after-further-review-breaking-down-the-patriots-defense-s-playoff-breakout-maye-review-and-quick-hit-notes-from-divisional-round-win-vs-texans"
  },
  {
    "text": "Are 'tech dense' farms the future of farming? - BBC",
    "fullText": "A host of technology is on offer to farmers, promising to raise farming yields and lower food prices.",
    "link": "https://www.bbc.com/news/articles/c78e4l3rm22o"
  },
  {
    "text": "'Absolutely Rolled': U.S. Officials Blast Canada's Cheap Chinese EV Deal - InsideEVs",
    "fullText": "China Inc.'s biggest move into North America yet has industry officials and politicians on edge. But affordability concerns take center stage.",
    "link": "https://insideevs.com/news/784813/us-china-canada-ev-tariff-recation/"
  },
  {
    "text": "The fastest human spaceflight mission in history crawls closer to liftoff - Ars Technica",
    "fullText": "After a remarkably smooth launch campaign, Artemis II reached its last stop before the Moon.",
    "link": "https://arstechnica.com/space/2026/01/nasas-artemis-ii-rocket-rolls-to-launch-pad-but-key-test-looms-ahead/"
  },
  {
    "text": "Several WNY travel advisories in effect - wivb.com",
    "fullText": "BUFFALO, N.Y. (WIVB) — A winter storm warning has been issued for all of Western New York with the exception of Allegany, Niagara and Orleans Counties until Wednesday at 4 p.m. due to heavy lake effect snow and strong winds. Travel advisories are in effect fo…",
    "link": "https://www.wivb.com/news/local-news/several-wny-travel-advisories-in-effect/"
  },
  {
    "text": "Chiefs plan to bring back longtime assistant Eric Bieniemy as next OC - NFL.com",
    "fullText": "The Kansas City Chiefs are set to bring back a familiar face to their coaching staff. The Chiefs plan to hire longtime assistant Eric Bieniemy as their next offensive coordinator, NFL Network Insider Tom Pelissero reported on Monday.",
    "link": "https://www.nfl.com/news/chiefs-plan-to-bring-back-longtime-assistant-eric-bieniemy-as-next-oc"
  }
]