[
  {
    "text": "Minnesota’s chief judge, a veteran in conservative legal circles, takes on ICE - Politico",
    "fullText": "The low-key George W. Bush appointee confronting Trump’s immigration tactics ordered the head of Immigration and Customs Enforcement to his courtroom.",
    "link": "https://www.politico.com/news/2026/01/27/patrick-schiltz-judge-minneapolis-ice-00750030"
  },
  {
    "text": "The DHS crisis is squeezing Susan Collins - Politico",
    "fullText": "The Maine Republican is under immense pressure as a huge funding package hangs by a thread and federal agents swarm her state.",
    "link": "https://www.politico.com/news/2026/01/27/susan-collins-dhs-ice-shutdown-00751545"
  },
  {
    "text": "Bari Weiss to CBS News staff: Without a shift in strategy, “we are toast.” - The Washington Post",
    "fullText": "The CBS News editor in chief said the network needs to produce journalism people want as she named a raft of new contributors from her website, the Free Press.",
    "link": "https://www.washingtonpost.com/business/2026/01/27/bari-weiss-cbs-news-allhands/"
  },
  {
    "text": "4 takeaways from No. 3 Michigan Basketball’s win vs No. 5 Nebraska - Maize n Brew",
    "fullText": "It wasn’t always pretty, but No. 3 Michigan Basketball hung on to beat now-formerly undefeated Nebraska. Here are 4 takeaways from the Wolverines’ huge win:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/104862/michigan-basketball-takeaways-nebraska-dusty-may-trey-mckenney-morez-johnson-aday-mara"
  },
  {
    "text": "After Further Review: How the Patriots Defense Won the AFC Title Game, Maye Breakdown, and Quick-Hit Film Notes From Sunday's Win in Denver - New England Patriots",
    "fullText": "The Patriots are headed back to the Super Bowl thanks to a 10-7 win over the Broncos on Sunday, but they'll need more from the offense in Santa Clara.",
    "link": "https://www.patriots.com/news/after-further-review-how-the-patriots-defense-won-the-afc-title-game-maye-breakdown-and-quick-hit-film-notes-from-sunday-s-win-in-denver"
  },
  {
    "text": "Denise Richards Wants Judge To Deny Ex Aaron Phypers' Slice of Her OnlyFans Money - TMZ",
    "fullText": "Denise Richards wants a judge to stop ex-husband Aaron Phypers from getting half of her hard-earned OnlyFans money ... and she says he missed an important deadline that could blow up in his face.",
    "link": "https://www.tmz.com/2026/01/27/denise-richards-wants-aaron-phypers-away-from-onlyfans-money/"
  },
  {
    "text": "NBA Rising Stars 2026 Draft Results, Rosters for Carmelo Anthony, Vince Carter, Tracy McGrady - Bleacher Report",
    "fullText": "The Rising Stars Tournament, comprised of the top rookie and sophomore plaeyrs in the NBA, now has its four teams.",
    "link": "https://bleacherreport.com/articles/25372871-nba-rising-stars-2026-draft-results-rosters-carmelo-anthony-vince-carter-tracy-mcgrady"
  },
  {
    "text": "Diplomats Worry Xi’s Purge Will Curb Critical Contact With China - Bloomberg.com",
    "fullText": "Xi Jinping’s purge of top Chinese generals has cost Western governments a key contact and deepened fears that the People’s Liberation Army is becoming even more walled-off from contact.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-27/diplomats-worry-xi-s-purge-will-curb-critical-contact-with-china"
  },
  {
    "text": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington D.C. - NPR",
    "fullText": "After a yearlong investigation, the National Transportation Safety Board did not find a single cause for the deadly collision near Washington, D.C., but blamed the crash on multiple systemic failures.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5689091/ntsb-dca-midair-collision-black-hawk-helicopter"
  },
  {
    "text": "Stock Market Today: Dow Slips 400 Points; UnitedHealth Stock Slides After Earnings — Live Updates - The Wall Street Journal",
    "fullText": "S&P hits new high; dollar slumps on new Trump comments",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-01-27-2026"
  },
  {
    "text": "Big Ten Conference Announces 2026 Football Schedule - Big Ten Conference",
    "fullText": "The official athletics website for Big Ten Conference",
    "link": "https://bigten.org/fb/article/59266/"
  },
  {
    "text": "Dozens of CDC vaccination databases have been frozen under RFK Jr. - Ars Technica",
    "fullText": "Anti-vaccine Kennedy may be \"enacting a self-fulfilling prophecy,\" expert says.",
    "link": "https://arstechnica.com/health/2026/01/rfk-jr-lets-cdc-vaccination-data-rot-dozens-of-databases-frozen/"
  },
  {
    "text": "Microsoft promises behind the scenes platform changes on Windows 11 in 2026 - Windows Central",
    "fullText": "After a rough few weeks, Microsoft has promised to make behind-the-scenes platform changes to Windows 11 as it begins testing the next wave of features.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-vows-to-make-behind-the-scenes-platform-changes-as-it-begins-testing-next-phase-of-windows-11"
  },
  {
    "text": "Guy Fieri shares gruesome details of terrifying fall that 'snapped' his muscle 'literally in half' (exclusive) - AOL.com",
    "fullText": "The celebrity chef tells EW that the injury has made him \"look at people that have disabilities\" and realize, \"We take a lot of things for granted.\"",
    "link": "https://ew.com/guy-fieri-new-details-terrifying-fall-snapped-his-muscle-in-half-11893801"
  },
  {
    "text": "Boeing Earnings Trounce Expectations. The Stock Is All Over the Place. - Barron's",
    "fullText": "",
    "link": "https://www.barrons.com/articles/boeing-earnings-stock-price-225a6d1c"
  },
  {
    "text": "Carney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos - AP News",
    "fullText": "Canadian Prime Minister Mark Carney has told U.S. President Donald Trump that he stands by his comments made at the World Economic Forum in Davos. Carney plans to diversify Canada’s trade away from the U.S. with a dozen new deals. On Tuesday, Carney rejected …",
    "link": "https://apnews.com/article/carney-trump-canada-trade-davos-bessent-tariffs-8e83cdd9443f6f4a523b6e05fd63843a"
  },
  {
    "text": "Trump Claims Ilhan Omar Is Worth $44M. Here’s Why That’s Highly Unlikely. - Forbes",
    "fullText": "Her 2024 disclosure reported total business values rather than individual stakes, creating wide net-worth ranges that opponents have taken as literal estimates of her personal wealth.",
    "link": "https://www.forbes.com/sites/zacheverson/2026/01/27/ilhan-omar-trump-net-worth-disclosure-30-44-million/"
  }
]