[
  {
    "text": "Actor Timothy Busfield accused of child sex abuse in New Mexico - The Seattle Times",
    "fullText": "Authorities in New Mexico have issued an arrest warrant for director and Emmy Award-winning actor Timothy Busfield to face a child sex abuse charge.",
    "link": "https://www.seattletimes.com/entertainment/actor-timothy-busfield-accused-of-child-sex-abuse-in-new-mexico/"
  },
  {
    "text": "'Out of stock': What went wrong at luxury retailer Saks? - BBC",
    "fullText": "Saks Global, which owns Saks Fifth Avenue and Neiman Marcus, is expected to imminently file for bankruptcy protection, leaving questions about the retailer's future.",
    "link": "https://www.bbc.com/news/articles/czdq1z73pv9o"
  },
  {
    "text": "Joint statement on the situation in Iran - canada.ca",
    "fullText": "“We commend the bravery of the Iranian people as they stand up for their dignity and their fundamental right to peaceful protest.",
    "link": "https://www.canada.ca/en/global-affairs/news/2026/01/joint-statement-on-the-situation-in-iran.html"
  },
  {
    "text": "Judge says Trump administration can’t block child care, other program money for 5 states for now - abcnews.go.com",
    "fullText": "A judge has ruled that President Donald Trump’s administration cannot block child care and other federal social service money from flowing to five states for now",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-trump-administration-block-child-care-program-money-129072240"
  },
  {
    "text": "South Africa's strained ties with US face new test - war games with China, Iran and Russia - BBC",
    "fullText": "The naval exercises could inflame relations with Donald Trump - who is already at loggerheads with Pretoria.",
    "link": "https://www.bbc.com/news/articles/c62wxezynk2o"
  },
  {
    "text": "Multiple small avalanches release in Juneau after city issues evacuation advisory - KTOO",
    "fullText": "Some residents have chosen to evacuate and others remain at home after city issues avalanche evacuation advisory. Several small avalanches have released in the usual paths across downtown and Thane.",
    "link": "https://www.ktoo.org/2026/01/09/multiple-small-avalanches-release-in-juneau-after-city-issues-evacuation-advisory/"
  },
  {
    "text": "Wrexham stun Forest in third round proper - TheFA.com",
    "fullText": "Arthur Okonkwo was Wrexham's hero as the Championship side defeated their Premier League visitors",
    "link": "https://www.thefa.com/news/2026/jan/09/emirates-fa-cup-third-round-wrap-wrexham-forest-20260109"
  },
  {
    "text": "Buffalo Bills at Jacksonville Jaguars | Where to watch, stream and listen | AFC Wild Card Round - BuffaloBills.com",
    "fullText": "TV Channel, Streaming and Radio for Bills at Jaguars",
    "link": "https://www.buffalobills.com/news/buffalo-bills-at-jacksonville-jaguars-where-to-watch-stream-and-listen-afc-wild-card-round"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Kansas City hit by a new ‘super flu’ variant causing a surge of cases - KCUR",
    "fullText": "Approximately 80% of active flu cases are an unexpected strain of Influenza A virus that health officials are calling a super flu. The Kansas City area has seen a dramatic spike in cases in recent weeks.",
    "link": "https://www.kcur.org/health/2026-01-12/kansas-city-super-flu-variant-influenza-illness-sick-respiratory-hospital"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "How to watch, listen and follow: Carolina vs. Los Angeles Rams in the Wild Card round - Panthers.com",
    "fullText": "The Panthers game will air on FOX at 4:30 p.m. ET.",
    "link": "https://www.panthers.com/news/how-to-watch-listen-and-follow-carolina-vs-los-angeles-rams-in-the-wild-card-round-playoffs"
  },
  {
    "text": "‘The White Lotus’ Season 4 to Shoot at 19th-Century Castle Hotel in Saint-Tropez (EXCLUSIVE) - Variety",
    "fullText": "Season 4 of 'The White Lotus' will shoot at a 19th-century palace turned hotel called the Château de La Messardière in Saint-Tropez on the Riviera.",
    "link": "https://variety.com/2026/tv/global/white-lotus-season-4-location-saint-tropez-hotel-1236627285/"
  },
  {
    "text": "Exercise can be nearly as effective as therapy for depression - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46557233"
  },
  {
    "text": "Major retailer closing stores in 12 states, including New York - Syracuse.com",
    "fullText": "The closures are part of the retailer's previously announced plan to shutter 150 locations by 2026, with clearance sales beginning in mid-January at affected stores.",
    "link": "https://www.syracuse.com/business/2026/01/major-retailer-closing-stores-in-12-states-including-new-york.html"
  },
  {
    "text": "House easily passes spending package as lawmakers work to avoid another shutdown - PBS",
    "fullText": "The House passed a bipartisan package of three spending bills on Thursday that would fund parts of the federal government through September, demonstrating the eagerness of lawmakers to avoid another government shutdown near the end of the month.",
    "link": "https://www.pbs.org/newshour/politics/house-easily-passes-spending-package-as-lawmakers-work-to-avoid-another-shutdown"
  },
  {
    "text": "Jumpstart your year with these games under $30! - Nintendo",
    "fullText": "Find something to play without breaking the bank. Shop now on Nintendo.com or Nintendo eShop on your device.",
    "link": "https://www.nintendo.com/us/whatsnew/jumpstart-your-year-with-these-games-under-usd30-jan-2026/"
  },
  {
    "text": "Secretary Bessent Announces Initiatives to Combat Rampant Fraud in Minnesota - U.S. Department of the Treasury (.gov)",
    "fullText": "Actions Increase Transparency, Seek Accountability for Taxpayer DollarsWASHINGTON— In Minnesota, Secretary of the Treasury Scott Bessent announced several initiatives to combat rampant government benefits fraud in Minnesota, which has wasted billions of taxpa…",
    "link": "https://home.treasury.gov/news/press-releases/sb0354"
  }
]