[
  {
    "text": "Stock market hits all-time high as Dow closes above 50,000 - The Washington Post",
    "fullText": "The Dow Jones Industrial Average finished at a record 50,115.67 on Friday, rising more than 1,200 points for the day.",
    "link": "https://www.washingtonpost.com/business/2026/02/06/stock-market-hits-all-time-high-dow-closes-above-50000/"
  },
  {
    "text": "Yankees To Re-Sign Paul Goldschmidt - MLB Trade Rumors",
    "fullText": "Despite losing playing time to Ben Rice down the stretch, Goldy is back for a second season in the Bronx. MLB Trade Rumors explains why.",
    "link": "https://www.mlbtraderumors.com/2026/02/yankees-to-re-sign-paul-goldschmidt.html"
  },
  {
    "text": "Column | At a broken Kennedy Center, the National Symphony begins a new journey - The Washington Post",
    "fullText": "The NSO is losing its home — after becoming a world-class orchestra.",
    "link": "https://www.washingtonpost.com/entertainment/music/2026/02/06/broken-kennedy-center-national-symphony-begins-new-journey/"
  },
  {
    "text": "Quinton Aaron 'Excited' For Super Bowl in Positive Health Update - TMZ",
    "fullText": "Quinton Aaron is still in the hospital ... but it sure sounds like things are looking up, as TMZ just got a great update from his family.",
    "link": "https://www.tmz.com/2026/02/06/quinton-aaron-health-update/"
  },
  {
    "text": "Lakers optimistic Luka Dončić avoided major injury, out vs. Warriors - Silver Screen and Roll",
    "fullText": "It appears that Luka Dončić won’t miss a lot of time due to his recent hamstring injury.",
    "link": "https://www.silverscreenandroll.com/lakers-injury-report/107519/lakers-injury-report-luka-doncic-hamstring-warriors-status-doubtful-update"
  },
  {
    "text": "Spoiler: WWE Star Expected to Make SmackDown Debut Tonight - Ringside News",
    "fullText": "Fresh off his Royal Rumble showing, Oba Femi is officially headed to the main roster. According to WrestleVotes, the former NXT Champion will make his",
    "link": "https://www.ringsidenews.com/spoiler-wwe-star-expected-make-smackdown-debut-tonight/"
  },
  {
    "text": "War Department Cuts Ties With Harvard University - U.S. Department of War (.gov)",
    "fullText": "Secretary of War Pete Hegseth announced the War Department would sever its academic ties with Harvard University, because attendance at the school no longer meets the needs of the War Department or",
    "link": "https://www.war.gov/News/News-Stories/Article/Article/4399812/war-department-cuts-ties-with-harvard-university/"
  },
  {
    "text": "Nothing could stop the U.S. figure skating team. Not even JD Vance’s motorcade. - The Washington Post",
    "fullText": "Alysa Liu and world champion dance team of Madison Chock and Evan Bates have the Americans leading the team event after day one.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/06/olympics-team-figure-skating-jd-vance/"
  },
  {
    "text": "Will Sunday's snap election gamble pay off for Japan's first female premier? - BBC",
    "fullText": "Sanae Takaichi is popular - but inflation and a diplomatic row with China weigh on voters' minds.",
    "link": "https://www.bbc.com/news/articles/ckgl53zll3jo"
  },
  {
    "text": "AI companies pour big money into Super Bowl battle - CNBC",
    "fullText": "Google, Amazon and Meta are among the companies advertising their AI tools during Super Bowl 60.",
    "link": "https://www.cnbc.com/2026/02/06/super-bowl-ai-companies-pour-big-money-into-ads.html"
  },
  {
    "text": "UNITED STATES-INDIA JOINT STATEMENT - The White House (.gov)",
    "fullText": "The United States of America (United States) and India are pleased to announce that they have reached a framework for an Interim Agreement regarding",
    "link": "https://www.whitehouse.gov/briefings-statements/2026/02/united-states-india-joint-statement/"
  },
  {
    "text": "Trump administration scolds Mamdani for executive order reaffirming sanctuary protections - Politico",
    "fullText": "The administration’s rebuke comes as the president has threatened to freeze federal funding for sanctuary jurisdictions like New York City.",
    "link": "https://www.politico.com/news/2026/02/06/trump-mamdani-sanctuary-protections-00769929"
  },
  {
    "text": "TrumpRx: See the 43 drugs available on the Trump administration's new discounted drug site - cbsnews.com",
    "fullText": "Here's what to know about TrumpRx, including how it works, who can use it, and how much money it can save.",
    "link": "https://www.cbsnews.com/news/trumprx-drugs-website-discount/"
  },
  {
    "text": "Why a bump to $700 could be a \"death sentence\" for the Steam Machine - Ars Technica",
    "fullText": "Analysts expect Valve might be hit particularly hard by soaring RAM, storage prices.",
    "link": "https://arstechnica.com/gaming/2026/02/why-a-bump-to-700-could-be-a-death-sentence-for-the-steam-machine/"
  },
  {
    "text": "Exclusive | Hobbit-Inspired Startup Becomes First New Bank Greenlighted by Trump 2.0 - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/finance/banking/hobbit-inspired-startup-becomes-first-new-bank-greenlighted-by-trump-2-0-0d6075ef"
  },
  {
    "text": "Canada plants a flag in Greenland - Politico",
    "fullText": "Foreign Affairs Minister Anand insists Nuuk is a long-term Arctic play — with Anchorage up next.",
    "link": "https://www.politico.com/news/2026/02/06/canada-greenland-consulate-opens-flag-00769338"
  },
  {
    "text": "The Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die - Slate",
    "fullText": "The president's lies have gone nuclear.",
    "link": "https://slate.com/news-and-politics/2026/02/trump-news-russia-nuclear-treaty-why.html"
  },
  {
    "text": "Something Mysteriously Powerful Slammed Into Earth in 2023. Scientists Now Have a Theory - Gizmodo",
    "fullText": "The science here gets really dark.",
    "link": "https://gizmodo.com/something-unimaginably-powerful-slammed-into-earth-in-2023-scientists-now-have-a-theory-2000719040"
  },
  {
    "text": "Maine reports first measles case since 2019 - The Portland Press Herald",
    "fullText": "The case was confirmed by the Maine CDC on Thursday.",
    "link": "https://www.pressherald.com/2026/02/06/maine-reports-first-measles-case-since-2019-2/"
  },
  {
    "text": "Can Disney’s Josh and Dana Honeymoon Last? - Puck",
    "fullText": "After a year-plus contest for the C.E.O. gig ended with a D’Amaro victory and a pretty good consolation prize for Walden, the highly choreographed vibes have been only positive. But conflicting styles and potentially existential challenges in Walden’s expande…",
    "link": "https://puck.news/can-disneys-josh-damaro-dana-walden-coexist/"
  }
]