[
  {
    "text": "Big Tech’s ‘breathtaking’ $660bn spending spree reignites AI bubble fears - Financial Times",
    "fullText": "Stocks tumble despite strong earnings reports from most Silicon Valley heavyweights",
    "link": "https://www.ft.com/content/0e7f6374-3fd5-46ce-a538-e4b0b8b6e6cd"
  },
  {
    "text": "Mike White Gives ‘The White Lotus’ Season 4 Update During ‘Survivor 50’ Return: “I Can’t Pass This Up” - Deadline",
    "fullText": "Although Season 4 of 'The White Lotus' is headed to the south of France, creator Mike White has to survive Fiji first.",
    "link": "http://deadline.com/2026/02/mike-white-white-lotus-season-4-update-survivor-50-1236710840/"
  },
  {
    "text": "Browns star Myles Garrett named 2025 AP NFL Defensive Player of Year after breaking sack record - NFL.com",
    "fullText": "Cleveland Browns star pass rusher Myles Garrett was named the 2025 AP NFL Defensive Player of the Year during \"NFL Honors\" on Thursday night.",
    "link": "https://www.nfl.com/news/myles-garrett-browns-de-defensive-player-of-the-year-2025"
  },
  {
    "text": "US and Russia agree to reestablish military dialogue after Ukraine talks - AP News",
    "fullText": "The U.S. and Russia have agreed to reestablish high-level, military-to-military dialogue for the first time in more than four years. The step is another sign of warming relations between the two countries since President Donald Trump took office and sought to…",
    "link": "https://apnews.com/article/russia-ukraine-talks-peace-abu-dhabi-witkoff-31ccc70ae7599507bc5a98a6cd87e2aa"
  },
  {
    "text": "Stock futures drop as Amazon slide adds to Wall Street's tech woes: Live updates - CNBC",
    "fullText": "Thursday night's action followed a rough day on Wall Street, with the market once again bogged down by technology stocks.",
    "link": "https://www.cnbc.com/2026/02/05/stock-market-today-live-updates.html"
  },
  {
    "text": "New iPhone launching this month with four key changes: report - 9to5Mac",
    "fullText": "According to a new report today, Apple’s next iPhone is launching very soon. Macwelt reports that the iPhone 17e is...",
    "link": "https://9to5mac.com/2026/02/05/new-iphone-launching-soon-with-four-new-features/"
  },
  {
    "text": "At least 3 dead, 6 injured after car crashes into 99 Ranch Market in Westwood - ABC7 Los Angeles",
    "fullText": "At least three people were killed and six others were injured after a car crashed into a 99 Ranch Market in Westwood.",
    "link": "https://abc7.com/post/2-dead-5-injured-car-crashes-westwood-grocery-store/18548729/"
  },
  {
    "text": "Bezalel Zini, brother of Israel’s security chief, arrested in bust of alleged Gaza smuggling ring - cnn.com",
    "fullText": "The brother of Israel’s security chief was arrested along with 14 others in a major police bust of an alleged smuggling ring accused of shipping crates of illegal goods into the Gaza Strip.",
    "link": "https://www.cnn.com/2026/02/05/middleeast/brother-shin-bet-chief-gaza-israel-smuggling-latam-intl"
  },
  {
    "text": "The Switch 2 is getting a new Virtual Console (kind of) - Ars Technica",
    "fullText": "Hamster Corp.'s new \"Console Archives\" does what Nintendon't.",
    "link": "https://arstechnica.com/gaming/2026/02/the-virtual-console-is-sort-of-back-on-the-switch-2/"
  },
  {
    "text": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-shifts-explanation-dni-gabbard-fbi-georgia-election/story?id\\\\u003d129890577"
  },
  {
    "text": "Tim Cook Teases Plans for Apple's Upcoming 50th Anniversary - MacRumors",
    "fullText": "Apple turns 50 this year, and its CEO Tim Cook has promised to celebrate the milestone. The big day falls on April 1, 2026.   \"I've been...",
    "link": "https://www.macrumors.com/2026/02/05/tim-cook-teases-apple-50th-anniversary/"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "fullText": "The New START deal was the last vestige of arms control between the world’s largest superpowers.",
    "link": "https://www.politico.com/news/2026/02/05/trump-nuclear-arms-treaty-russia-00767497"
  },
  {
    "text": "Could Rain Impact The Winter Olympics Opening Ceremony? - The Weather Channel",
    "fullText": "The venue is set, the athletes are ready, but will the weather cooperate? Here is what we’re watching for the Opening Ceremony celebrations.",
    "link": "https://weather.com/forecast/regional/news/2026-02-04-winter-olympics-opening-ceremony-weather-milan-italy"
  },
  {
    "text": "New analysis suggests puzzling fossil may have been an unknown life-form - CNN",
    "fullText": "A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular life, according to a new study.",
    "link": "https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form"
  },
  {
    "text": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity - NASA (.gov)",
    "fullText": "NASA’s SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select",
    "link": "https://www.nasa.gov/humans-in-space/nasas-spacex-crew-12-to-study-adaptation-to-altered-gravity/"
  },
  {
    "text": "WDH reports flu-related death of Fremont County child - County 10",
    "fullText": "A recently reported flu-related death of a Fremont County child is a sad reminder that influenza can be a serious disease and should not be overlooked, according to a Wyoming Department of Health (WDH) official. Dr. Alexia Harrist, State Health Officer with W…",
    "link": "https://county10.com/wdh-reports-flu-related-death-of-fremont-county-child/"
  },
  {
    "text": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo",
    "fullText": "A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.",
    "link": "https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421"
  },
  {
    "text": "Chairman of major US law firm steps down after Epstein files release - BBC",
    "fullText": "Brad Karp’s company, Paul Weiss, previously said he did not participate in any misconduct.",
    "link": "https://www.bbc.com/news/articles/c7v02m633mjo"
  },
  {
    "text": "Minute Maid’s frozen juices are being discontinued - cnn.com",
    "fullText": "Pour, er squeeze, one out for a childhood staple: Minute Maid’s frozen juices are being discontinued after an 80-year run.",
    "link": "https://www.cnn.com/2026/02/05/food/minute-maid-frozen-discontinued"
  }
]