[
  {
    "text": "Trump Tariff Threats Weigh on Asian Risk Appetite: Markets Wrap - Bloomberg.com",
    "fullText": "European and US stock futures fell and haven assets such as gold rallied after President Donald Trump proposed new levies on eight countries that have opposed his plans to acquire Greenland. The dollar weakened against most of its major peers.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-18/trump-tariff-threats-weigh-on-asian-risk-appetite-markets-wrap"
  },
  {
    "text": "$1 billion gets a permanent seat on Trump's Board of Peace for Gaza, as India and others invited - AP News",
    "fullText": "At least eight more countries say the United States has invited them to join President Donald Trump’s new Board of Peace overseeing next steps for Gaza. A U.S. official confirms that a $1 billion contribution secures permanent membership, while a three-year a…",
    "link": "https://apnews.com/article/gaza-israel-palestinians-board-peace-hamas-5f902ea2b1158f0a806c247d139ff62f"
  },
  {
    "text": "Wildfires race across Chile, leaving 18 dead and forcing thousands to flee - AP News",
    "fullText": "Authorities in Chile say that wildfires raging across central and southern areas of the country have left at least 18 people dead. The flames have scorched thousands of acres of forest and destroyed scores of homes. The South American country is sweltering un…",
    "link": "https://apnews.com/article/chile-wildfires-heat-wave-boric-biobio-emergency-c70c05758271270353606fa409fb504d"
  },
  {
    "text": "Patriots favored by 4.5 at Broncos in AFC Championship Game - NBC Sports",
    "fullText": "The Patriots will be road favorites in Denver in next weekend's AFC Championship Game.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/patriots-favored-by-4-5-at-broncos-in-afc-championship-game"
  },
  {
    "text": "Texans’ C.J. Stroud Makes Unfortunate NFL History With Wild Run of Turnovers in Playoffs - Sports Illustrated",
    "fullText": "C.J. Stroud’s turnover numbers this postseason are unlike anything the NFL has ever seen.",
    "link": "https://www.si.com/nfl/texans-cj-stroud-unfortunate-nfl-history-turnovers-in-playoffs"
  },
  {
    "text": "Footage of ZeniMax’s Cancelled Project Blackbird Surfaces Online - Insider Gaming",
    "fullText": "Two minutes of in-engine footage of ZeniMax Online Studio's cancelled Project Blackbird has leaked online.",
    "link": "https://insider-gaming.com/blackbrird-footage-leaked/"
  },
  {
    "text": "A Democratic governor’s blueprint for surviving Trump - Politico",
    "fullText": "Phil Murphy, who leaves office Tuesday, has benefited from his relationship with the administration while avoiding the president’s public attacks.",
    "link": "https://www.politico.com/news/2026/01/18/a-democratic-governors-blueprint-for-surviving-trump-00734703"
  },
  {
    "text": "Trump's voice in a new Fannie Mae ad is generated by artificial intelligence, with his permission - AP News",
    "fullText": "What sounds like President Donald Trump narrating a new Fannie Mae ad actually is an AI-cloned voice reading text, according to a disclaimer in the video. The ad comes as the Trump administration is making a big push to make housing affordable and the preside…",
    "link": "https://apnews.com/article/trump-voice-ai-housing-fannie-ad-davos-7a792aed20c56bcc3f7b53733ec331ad"
  },
  {
    "text": "ReactOS For \"Open-Source Windows\" Achieves Massive Networking Performance Boost - Phoronix",
    "fullText": "ReactOS as the long-in-development 'open-source Windows' project has been on quite a roll recently",
    "link": "https://www.phoronix.com/news/ReactOS-Async-Net-Connect"
  },
  {
    "text": "Oregon man buys four 'refurbished' video game consoles from Temu and opens them up to see if they're legit - supercarblondie.com",
    "fullText": "This Oregon man got his hands on four refurbished video game consoles from Temu to have a closer look at whether or not they were worth the investment",
    "link": "https://supercarblondie.com/are-refurbished-video-game-consoles-temu-legit/"
  },
  {
    "text": "The Weekender: Outrageous Get-In Prices For The National Championship, Trinidad Chambliss Sues The NCAA and A Point Shaving Scandal Rocks College Basketball - Eleven Warriors",
    "fullText": "National championship ticket prices reached record highs, Trinidad Chambliss sued the NCAA while seeking a sixth-year of eligibility and a point-shaving scandal rocked college basketball.",
    "link": "https://www.elevenwarriors.com/college-sports/2026/01/161228/the-weekender-outrageous-get-in-prices-for-the-national-championship-trinidad-chambliss-sues-the-ncaa-and-a-point"
  },
  {
    "text": "Minneapolis Mayor Jacob Frey says federal agents are an \"occupying force\" - CBS News",
    "fullText": "Minneapolis Mayor Jacob Frey criticized the administration's immigration operations, calling the surge of federal agents an \"occupying force that has quite literally invaded our city.\"",
    "link": "https://www.cbsnews.com/news/jacob-frey-minneapolis-mayor-face-the-nation-federal-agents/"
  },
  {
    "text": "5 Clever Uses For Your Old PlayStation 3 - bgr.com",
    "fullText": "Even though the PlayStation 3 is going on 20 years old, turning it into an emulator or media server can breathe new life into that old console.",
    "link": "https://www.bgr.com/2074854/uses-for-your-old-ps3/"
  },
  {
    "text": "Why is flu season so bad this year? - Live Science",
    "fullText": "Flu season in the U.S. is particularly bad this year, and a new branch of the flu family tree may be to blame.",
    "link": "https://www.livescience.com/health/flu/why-is-flu-season-so-bad-this-year"
  },
  {
    "text": "'The Fall and Rise of Reggie Dinkins' Review: Tracy Morgan NBC Comedy - The Hollywood Reporter",
    "fullText": "Tina Fey and Robert Carlock (co-creator with Sam Means) are among executive producers of the comedy about a disgraced football star hoping a documentary will change his life.",
    "link": "http://www.hollywoodreporter.com/tv/tv-reviews/the-fall-and-rise-of-reggie-dinkins-review-tracy-morgan-nbc-1236477044/"
  },
  {
    "text": "NASA Caught The Ocean Turning Strange Colors Around These Islands - The Daily Galaxy",
    "fullText": "A glowing ring just appeared in the Pacific, and NASA caught it on camera.",
    "link": "https://dailygalaxy.com/2026/01/nasa-ocean-strange-colors-around-islands/"
  },
  {
    "text": "Trump suffers major losses in his war on offshore wind - Politico",
    "fullText": "The administration’s arguments that offshore wind farms present a national security risk failed to convince judges in three separate courts.",
    "link": "https://www.politico.com/news/2026/01/18/trump-offshore-wind-problems-00734850"
  }
]