[
  {
    "text": "Trump's Fed fight looks like something from another country - BBC",
    "fullText": "Donald Trump's stand-off with the US central bank has recalled episodes in other countries - which ended badly for the economy.",
    "link": "https://www.bbc.com/news/articles/cy9yxlz70dvo"
  },
  {
    "text": "Horoscope for Friday, January 16, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/16/horoscopes-today-friday-january-16-2026"
  },
  {
    "text": "Star Wars Shake-Up: Kathleen Kennedy Steps Down as George Lucas Protégé Dave Filoni, Exec Lynwen Brennan Take Over Lucasfilm - The Hollywood Reporter",
    "fullText": "The change in leadership may mean a new hope for the storied franchise or it could be an attack of the clones by giving fans more of the same.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/star-wars-kathleen-kennedy-steps-down-dave-filoni-1236465012/"
  },
  {
    "text": "Measles outbreak declared in Snohomish County - The Seattle Times",
    "fullText": "“We’re expecting more measles cases as a result of the previous exposures as well as these new outbreak cases,” Snohomish County Health Officer Dr. James Lewis said.",
    "link": "https://www.seattletimes.com/seattle-news/health/measles-outbreak-declared-in-snohomish-county/"
  },
  {
    "text": "S Korean firefighters tackle huge blaze in last of Seoul’s ‘shanty towns’ - Al Jazeera",
    "fullText": "No casualties reported as huge fire breaks out in makeshift homes on fringe of Seoul’s upmarket Gangnam district.",
    "link": "https://www.aljazeera.com/news/2026/1/16/south-korean-firefighters-tackle-huge-blaze-in-seouls-last-shanty-town"
  },
  {
    "text": "Kyle Shanahan on Brock Purdy’s 4-0 record at Seattle: “Brock doesn’t get rattled” - NBC Sports",
    "fullText": null,
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/kyle-shanahan-on-brock-purdys-4-0-record-at-seattle-brock-doesnt-get-rattled"
  },
  {
    "text": "Casting is dead. Long live casting! - The Verge",
    "fullText": "Netflix laid the groundwork for casting. Now, it’s pulled the plug on the technology. Is there still life left in second-screen playback control?",
    "link": "https://www.theverge.com/column/861948/casting-netflix-dead"
  },
  {
    "text": "Red Bull expecting engine 'struggles' for first few months of F1 2026 - The Race",
    "fullText": "Ford claimed that it and Red Bull will be “unstoppable” with its new engine partnership beginning in 2026 but the Formula 1 team has warned it may struggle for “the first few months”",
    "link": "https://www.the-race.com/formula-1/red-bull-expecting-engine-struggles-first-few-months-of-2026/"
  },
  {
    "text": "Judge blocks Trump administration from getting California’s voter rolls - The Washington Post",
    "fullText": "The Justice Department doesn’t have authority to use civil rights and voting laws to obtain voter lists, a judge rules, in a decision that could influence cases in other states.",
    "link": "https://www.washingtonpost.com/politics/2026/01/15/california-voter-data-trump/"
  },
  {
    "text": "How Minneapolis became America's flashpoint for protests - Axios",
    "fullText": "Minnesota's Twin Cities, front and center in anti-ICE protests, have been a decade-long hub for demonstrations against state-sanctioned violence.",
    "link": "https://www.axios.com/2026/01/15/minneapolis-st-paul-twin-cities-ice-blm-protest-history"
  },
  {
    "text": "Why the NFL chose NBC for Rams-Bears divisional-round game - Chicago Sun-Times",
    "fullText": "The home of “Sunday Night Football” has aired divisional playoff games before, but never in the 5:30 p.m. Sunday window.",
    "link": "https://chicago.suntimes.com/bears/2026/01/15/why-nfl-chose-nbc-for-rams-bears-divisional-rick-cordell-kevin-cross-fox-cbs-abc-espn-bills-49ers-seahawks-steelers-texans-aaron-rodgers"
  },
  {
    "text": "Brian Baldinger on Harbaugh's future with Giants: 'I think he will put a good staff together' | 'The Insiders' - NFL.com",
    "fullText": "<p>NFL Network analyst Brian Baldinger breaks down New York Giants now head coach John Harbaugh's future with the Giants.</p>",
    "link": "https://www.nfl.com/videos/brian-baldinger-on-harbaugh-s-future-with-giants-i-think-he-will-put-a-good-staff-together-the-insiders"
  },
  {
    "text": "Stock futures are little changed after rally in banks and tech lifts major averages: Live updates - CNBC",
    "fullText": "Semiconductor and bank stocks helped lift the broad market higher on Thursday.",
    "link": "https://www.cnbc.com/2026/01/15/stock-market-today-live-updates.html"
  },
  {
    "text": "Actor Timothy Busfield charged with sexually abusing boys on TV series set - BBC",
    "fullText": "The actor starred in the West Wing TV series and is also known for the baseball film Field of Dreams.",
    "link": "https://www.bbc.com/news/articles/cj9rvkde0xxo"
  },
  {
    "text": "Hilary Duff drops her spicy new single 'Roommates' - Yahoo",
    "fullText": "This is Duff's second single off her forthcoming album, \"Luck …or something,\" out next month.",
    "link": "https://www.yahoo.com/entertainment/music/article/hilary-duff-drops-her-spicy-new-single-roommates-000259768.html"
  },
  {
    "text": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com",
    "fullText": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction"
  },
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "fullText": "The company said it had stopped Grok from undressing people on the X platform. Grok’s stand-alone app still does it.",
    "link": "https://www.washingtonpost.com/technology/2026/01/15/grok-ai-image-generator-sexualized/"
  }
]