[
  {
    "text": "Dow surges 500 points as traders look past rout in precious metals and bitcoin: Live updates - CNBC",
    "fullText": "More than 100 S&P 500 companies are due to report this week, including Amazon, Alphabet and Disney.",
    "link": "https://www.cnbc.com/2026/02/01/stock-market-today-live-updates.html"
  },
  {
    "text": "Father of 5-year-old detained in Minnesota disputes government assertion he abandoned the boy - AP News",
    "fullText": "The father of a 5-year-old boy detained by immigration officers in Texas denies abandoning his son. Adrian Conejo Arias is originally from Ecuador. He tells ABC News he loves his son, Liam, and disputes claims from the Department of Homeland Security that he …",
    "link": "https://apnews.com/article/immigration-minnesota-trump-ice-liam-5cd3379ce44db7a38ad0b2c5e910da54"
  },
  {
    "text": "Brendan Banfield double murder trial: Man found guilty in elaborate plot to get rid of his wife - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/brendan-banfield-double-murder-trial-verdict-reached-man/story?id\\\\u003d129707348"
  },
  {
    "text": "The Trump Administration exempts new nuclear reactors from environmental review - NPR",
    "fullText": "The announcement comes just days after NPR revealed the administration had secretly rewritten safety and environmental standards.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5696525/trump-nuclear-safety-regulations-environmental-review"
  },
  {
    "text": "Here are the retailers with the most store openings and closures planned for 2026 - CNBC",
    "fullText": "Stores closures in the U.S. are expected to fall to the lowest level in the past three years, according to an analysis by Coresight Research.",
    "link": "https://www.cnbc.com/2026/02/02/store-openings-and-closures-2026-dollar-general-aldi-gamestop.html"
  },
  {
    "text": "Trump: ‘We should take over the voting’ - Democracy Docket",
    "fullText": "Trump, as usual, offered no evidence for any of his claims.",
    "link": "https://www.democracydocket.com/news-alerts/trump-calls-on-gop-to-nationalize-the-voting/"
  },
  {
    "text": "MLB To Take Over Broadcasts For Six Additional Teams - MLB Trade Rumors",
    "fullText": "The collapse of Main Street Sports continues to impact MLB clubs.",
    "link": "https://www.mlbtraderumors.com/2026/02/mlb-to-take-over-broadcasts-for-six-additional-teams.html"
  },
  {
    "text": "DeSantis’ Canadian drug import plan in Florida goes from campaign trail to tough realities - Politico",
    "fullText": "The state’s effort has stalled in part because it failed to win over the Canadian drug industry, which has consistently warned the Canadian government that the U.S. program jeopardized the country’s drug supply.",
    "link": "https://www.politico.com/news/2026/02/02/desantis-florida-canada-drug-imports-00759891"
  },
  {
    "text": "Microsoft Stock (NASDAQ:MSFT) Falters on Hibernation Fix Flop, Unexpected Xbox Permaban - TipRanks",
    "fullText": "Tech giant Microsoft ($MSFT) has not been having a great Monday so far. Reports of a hibernation bug previously thought fixed have emerged to say that the fix did not",
    "link": "https://www.tipranks.com/news/microsoft-stock-nasdaqmsft-falters-on-hibernation-fix-flop-unexpected-xbox-permaban"
  },
  {
    "text": "Paddy Pimblett reflects on brutal Justin Gaethje loss: ‘He made my face look different’ - MMA Fighting",
    "fullText": "Paddy Pimblett gives update on recovery from Justin Gaethje fight.",
    "link": "https://www.mmafighting.com/ufc/469616/paddy-pimblett-reflects-on-brutal-justin-gaethje-loss-he-made-my-face-look-different"
  },
  {
    "text": "Tens of thousands back Czech president amid cabinet dispute - dw.com",
    "fullText": "A large rally in Prague showed support for Czech President Petr Pavel, who accused the country's top diplomat of blackmail. The row centers on Pavel's refusal to appoint a controversial candidate as environment minister.",
    "link": "https://www.dw.com/en/tens-of-thousands-back-czech-president-amid-cabinet-dispute/a-75754342"
  },
  {
    "text": "Albert Breer’s Takeaways: Three Lessons From Sam Darnold’s Rise in Seattle - Sports Illustrated",
    "fullText": "The Seahawks took an unorthodox swing at quarterback that paid off big-time. Plus, why the Vikings fired Kwesi Adofo-Mensah and more.",
    "link": "https://www.si.com/nfl/albert-breer-takeaways-three-lessons-from-sam-darnold-seattle-rise"
  },
  {
    "text": "New iPhone Fold specs revealed, including design, cameras, more - 9to5Mac",
    "fullText": "New details have been shared by another leaker on several aspects of the iPhone Fold’s design, features, and more",
    "link": "https://9to5mac.com/2026/02/02/new-iphone-fold-specs-revealed-including-design-cameras-more/"
  },
  {
    "text": "U.S.-Iran nuclear talks planned for Friday amid military buildup - Axios",
    "fullText": "This would be the first meeting since the war in June.",
    "link": "https://www.axios.com/2026/02/02/iran-nuclear-talks-trump-military"
  },
  {
    "text": "Trump threatens to sue Trevor Noah over Epstein joke at 2026 Grammys - Axios",
    "fullText": "The star-studded stage of the Grammys became a  political pulpit Sunday.",
    "link": "https://www.axios.com/2026/02/02/trump-china-political-grammys-trevor-noah-epstein"
  },
  {
    "text": "I tried a Claude Code alternative that's local, open source, and completely free - how it works - ZDNET",
    "fullText": "I was curious if Block's Goose agent, paired with Ollama and the Qwen3-coder model, could really replace Claude Code. Here's how I got started.",
    "link": "https://www.zdnet.com/article/claude-code-alternative-free-local-open-source-goose-getting-started/"
  },
  {
    "text": "Google releases ‘Desktop Camera’ app that’s seemingly for Android PCs - 9to5Google",
    "fullText": "Google has quietly released a new \"Desktop Camera\" app that's seemingly meant for future Android PCs on the new desktop experience.",
    "link": "http://9to5google.com/2026/02/02/google-android-desktop-camera-app/"
  },
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA prepares to load propellant in critical fueling test - Space",
    "fullText": "Monday, Feb. 2, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-2-2026"
  },
  {
    "text": "Gold and silver prices fall after Friday's losses - BBC",
    "fullText": "Precious metal prices hit record highs in January as investors parked their money in \"safe havens\".",
    "link": "https://www.bbc.com/news/articles/cpdy0y3jle4o"
  },
  {
    "text": "UPDATE! An X8.1 (Strong) flare from Region 4366 - SpaceWeather.gov",
    "fullText": null,
    "link": "https://www.spaceweather.gov/news/update-x81-strong-flare-region-4366"
  }
]