[
  {
    "text": "SBI: Two people dead, two more injured in Mount Airy shooting - wral.com",
    "fullText": "According to the State Bureau of Investigation, the shooting happened on Welcome Baptist Church Road in Mount Airy.",
    "link": "https://www.wral.com/news/local/mount-airy-shooting-one-dead-three-injured-january-2026/"
  },
  {
    "text": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke - TMZ",
    "fullText": "\"The Blind Side\" star Quinton Aaron's family is revealing what led to his hospitalization ... they tell us he suffered a spinal stroke.",
    "link": "https://www.tmz.com/2026/01/29/quinton-aaron-suffered-spinal-stroke/"
  },
  {
    "text": "Exclusive | Spy Chief Tulsi Gabbard Is Hunting for 2020 Election Fraud - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/elections/spy-chief-tulsi-gabbard-is-hunting-for-2020-election-fraud-07ea2383"
  },
  {
    "text": "Trump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak - CNBC",
    "fullText": "The Miami federal court lawsuit says the IRS and Treasury failed to prevent the leak of Trumps tax records by former IRS employee Charles Littlejohn.",
    "link": "https://www.cnbc.com/2026/01/29/trump-sues-irs-and-treasury-for-10-billion-over-leak-of-tax-records.html"
  },
  {
    "text": "Your Halo Story | Halo - Official Site (en) - Halo Waypoint",
    "fullText": "<p>I’m obsessed with stories. This comes as a shock to many of you, I know. These days when we hear the term, the immediate association is likely with penwoven narratives underpinning myriad entertainment properties and creative content. Or perhaps some varia…",
    "link": "https://www.halowaypoint.com/news/your-halo-story-chapter-01"
  },
  {
    "text": "Stock Market Today: Microsoft Leads Tech Selloff — Live Updates - The Wall Street Journal",
    "fullText": "Live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-01-29-2026"
  },
  {
    "text": "Oscar Season’s Messy Side Comes for ‘Marty Supreme’ - hollywoodreporter.com",
    "fullText": "The nine-time Oscar nominee has faced resurfaced allegations regarding its director’s conduct on a previous movie, sharp criticism from the family who inspired its main character — and suspicions of a smear campaign.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/marty-supreme-safdie-oscars-1236488756/"
  },
  {
    "text": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "fullText": "\"It is amazing to see that we are gradually moving towards combining these breakthrough observations across multiple frequencies and completing the picture of the jet launching region.\"",
    "link": "https://www.space.com/astronomy/black-holes/astronomers-watch-1st-black-hole-ever-imaged-launch-a-3-000-light-year-long-cosmic-jet-from-its-glowing-shadow"
  },
  {
    "text": "Unable to Stop AI, SAG-AFTRA Mulls a Studio Tax on Digital Performers - Variety",
    "fullText": "SAG-AFTRA is considering whether to seek a contribution to a union fund every time a studio uses a synthetic performer in a film or TV show.",
    "link": "https://variety.com/2026/film/news/sag-aftra-ai-tilly-norwood-tax-digital-performers-1236644931/"
  },
  {
    "text": "Trump’s wide ambitions for Board of Peace spark new support for the United Nations - AP News",
    "fullText": "President Donald Trump’s latest attempt to sidestep the United Nations through his new Board of Peace appears to have inadvertently backfired. Major world powers have rejected U.S. aspirations for the board to have a larger international mandate beyond the Ga…",
    "link": "https://apnews.com/article/board-peace-trump-un-security-council-china-df62e5087f3e8097f856c637a75cbc51"
  },
  {
    "text": "Google gives Pixel Tablet another two years of Android OS updates - 9to5Google",
    "fullText": "Google’s mostly-forgotten Pixel Tablet is getting a new lease on life, as the company is giving its one and only...",
    "link": "http://9to5google.com/2026/01/29/google-gives-pixel-tablet-another-two-years-of-android-os-updates/"
  },
  {
    "text": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate - MMA Fighting",
    "fullText": "Watch Khamzat Chimaev get in the face of fiery fighter.",
    "link": "https://www.mmafighting.com/ufc/468742/video-khamzat-chimaev-confronts-fighter-after-near-brawl-with-teammate"
  },
  {
    "text": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "fullText": "Federal officials have a plan that could curb billions of dollars in overpayments to Medicare Advantage plans. But will they follow through on it?",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691896/medicare-advantage-health-insurance-trump-oz-cms-upcoding"
  },
  {
    "text": "Handling of Pretti investigation has some prosecutors on verge of quitting - The Washington Post",
    "fullText": "Federal prosecutors in Minneapolis, deeply frustrated by the response to the shootings of Renée Good and Alex Pretti, have suggested they could resign en masse.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/29/minneapolis-shootings-prosecutor-resignations/"
  },
  {
    "text": "Ole Miss Game Moved to Nashville - Vanderbilt Commodores",
    "fullText": "Dores to host Rebels Saturday in 5 p.m. tip at Memorial Gymnasium",
    "link": "https://vucommodores.com/ole-miss-game-moved-to-nashville/"
  },
  {
    "text": "An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account - WIRED",
    "fullText": "AI chat toy company Bondu left its web console almost entirely unprotected. Researchers who accessed it found nearly all the conversations children had with the company's stuffed animals.",
    "link": "https://www.wired.com/story/an-ai-toy-exposed-50000-logs-of-its-chats-with-kids-to-anyone-with-a-gmail-account/"
  },
  {
    "text": "Crypto bill clears U.S. Senate milestone despite Democrat opposition - CoinDesk",
    "fullText": "The market structure legislation for the first time advanced beyond a committee, setting up the next steps that could end with a vote of the overall chamber.",
    "link": "https://www.coindesk.com/policy/2026/01/29/crypto-bill-clears-u-s-senate-milestone-as-effort-advanced-through-first-committee"
  }
]