[
  {
    "text": "S&P 500 touches 7,000 for first time then retreats as traders await Fed decision: Live updates - CNBC",
    "fullText": "The S&P 500 rose to a milestone level ahead of the Federal Reserve's interest rate decision and earnings reports from major tech companies.",
    "link": "https://www.cnbc.com/2026/01/27/stock-market-today-live-updates.html"
  },
  {
    "text": "These Billionaires Are Speaking Out Against ICE, Minnesota Killings - Forbes",
    "fullText": "Some billionaires are beginning to speak out against ICE days after Alex Pretti became the second person this month to be killed by the federal agency.",
    "link": "https://www.forbes.com/sites/mikestunson/2026/01/28/bruce-springsteen-becomes-latest-billionaire-blasting-ice-and-pretti-killing/"
  },
  {
    "text": "Rep. Ilhan Omar attacked during town hall meeting in Minneapolis - The Washington Post",
    "fullText": "In a video from the event, a man walks up and sprays what appears to be a liquid at the Minnesota Democrat — who is a frequent target of Trump — before he is taken away by security.",
    "link": "https://www.washingtonpost.com/politics/2026/01/27/ilhan-omar-attack-town-hall-minneapolis/"
  },
  {
    "text": "Google Pixel’s Tensor chip said to help weather a rocky smartphone market in 2026 - 9to5Google",
    "fullText": "A new report forecasts the smartphone chipset market through 2026, and claims that Google’s efforts in building Tensor for Pixel...",
    "link": "http://9to5google.com/2026/01/28/google-pixels-tensor-chip-said-to-help-weather-a-rocky-smartphone-market-in-2026/"
  },
  {
    "text": "Kanye West Sets March Release Date for ‘Bully’ Album - Rolling Stone",
    "fullText": "Kanye West sets March 20 release date for new album 'Bully,' arriving via the independent music company Gamma. It follows his open letter ad in WSJ.",
    "link": "http://www.rollingstone.com/music/music-news/kanye-west-bully-release-date-signs-with-gamma-1235506094/"
  },
  {
    "text": "Bank of Canada rate decision: No change to the overnight rate, as expected - investingLive",
    "fullText": "Overnight rate unchanged at 2.25% BOC says The outlook for the global and Canadian economies is little changed vs Oct forecast the Bank expects inflation to stay close to the 2% target over the pro...",
    "link": "https://investinglive.com/centralbank/bank-of-canada-rate-decision-no-change-to-the-overnight-rate-as-expected-20260128/"
  },
  {
    "text": "Dutch government is ordered to protect residents on Caribbean island of Bonaire from climate change - AP News",
    "fullText": "A court has ordered the Dutch government to draw up a plan to protect residents of the Caribbean island of Bonaire from the devastating effects of climate change. The ruling on Wednesday was a sweeping victory for the islanders. The Hague District Court ruled…",
    "link": "https://apnews.com/article/climate-bonaire-netherlands-court-greenpeace-caribbean-island-c793ba6d63dd30a6dfb9c5cfa9f8452d"
  },
  {
    "text": "Spanish scientist finds cure for pancreatic cancer in major medical breakthrough - Times of India",
    "fullText": "Science News: A Spanish research team says it has developed a treatment that completely eliminated the most aggressive form of pancreatic cancer in laboratory mice,.",
    "link": "https://timesofindia.indiatimes.com/science/spanish-scientist-finds-cure-for-pancreatic-cancer-in-major-medical-breakthrough/articleshow/127714543.cms"
  },
  {
    "text": "NASA Webb Pushes Boundaries of Observable Universe Closer to Big Bang - NASA Science (.gov)",
    "fullText": "NASA’s James Webb Space Telescope has topped itself once again, delivering on its promise to push the boundaries of the observable universe closer to cosmic",
    "link": "https://science.nasa.gov/missions/webb/nasa-webb-pushes-boundaries-of-observable-universe-closer-to-big-bang/"
  },
  {
    "text": "Greetings from Mumbai, where residents take breathing space where they can find it - NPR",
    "fullText": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
    "link": "https://www.npr.org/2026/01/28/g-s1-107108/mumbai-india-arabian-sea-promenade"
  },
  {
    "text": "Five takeaways from IU basketball’s win against Purdue - Inside the Hall",
    "fullText": "IU basketball earned its first win against a ranked opponent in the Darian DeVries era on Tuesday night at Simon Skjodt Assembly Hall. The Hoosiers withstood a late run from rival Purdue for a 72-67 victory.",
    "link": "https://www.insidethehall.com/2026/01/28/five-takeaways-from-iu-basketballs-win-against-purdue/"
  },
  {
    "text": "Tyson Fury to face Arslanbek Makhmudov in comeback fight - ESPN",
    "fullText": "Tyson Fury's return to the ring has been confirmed with the former heavyweight world champion set to fight Arslanbek Makhmudov on April 11.",
    "link": "https://www.espn.com/boxing/story/_/id/47753624/tyson-fury-arslanbek-makhmudov-comeback-fight-boxing-netflix"
  },
  {
    "text": "Trump warns Iran 'time is running out' as US military builds up in Gulf - BBC",
    "fullText": "The US president, who has previously vowed to \"rescue\" protesters in Iran, says a \"massive Armada\" is on the way to the country.",
    "link": "https://www.bbc.com/news/articles/cly5pd459gko"
  },
  {
    "text": "Backed by NFL Stars, Rock League Wants to Push Curling to the Masses - Sports Illustrated",
    "fullText": "Backed by George Kittle, T.J. Hockenson and Jared Allen, a new pro league for the winter pastime works to engage fans beyond the Olympics.",
    "link": "https://www.si.com/winter-olympics/rock-league-popularize-curling-nfl-stars-digital-cover"
  },
  {
    "text": "Courtney Love Sets the Record Straight in New Doc 'Antiheroine' - Rolling Stone",
    "fullText": null,
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/courtney-love-documentary-antiheroine-sundance-1235499918/"
  },
  {
    "text": "Germany cuts growth forecasts amid slow recovery - Financial Times",
    "fullText": "Europe’s largest economy struggles to rebound despite government’s €1tn debt-funded investment spree",
    "link": "https://www.ft.com/content/1269e622-2452-41dd-abef-4fceec966d72"
  },
  {
    "text": "Harry Styles fans slam ticket prices for the singer's Together, Together tour: 'I'm so over this' - Yahoo",
    "fullText": "Included among Styles' 50-date extravaganza are six nights at Wembley Stadium in London and a 30-show residency at Madison Square Garden in New York City.",
    "link": "https://www.yahoo.com/entertainment/music/article/harry-styles-fans-slam-ticket-prices-for-the-singers-together-together-tour-im-so-over-this-212508909.html"
  },
  {
    "text": "Grok is the most antisemitic chatbot according to the ADL - The Verge",
    "fullText": "A new report by the Anti-Defamation League tested six chatbots for antisemitic content. Claude performed the best at detecting and refuting prompts; Grok performed the worst.",
    "link": "https://www.theverge.com/news/868925/adl-ai-antisemitism-report-grok-chatgpt-gemini-claude-deepseek-llama-elon-musk"
  },
  {
    "text": "Exclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26 - SamMobile",
    "fullText": "It was reported earlier that Samsung plans to introduce a major upgrade to wireless charging speeds with its future smartphones. The Galaxy S26 series supports up to 25W fast wireless charging. We are now bringing you an exclusive first look at Samsung’s 25W …",
    "link": "https://www.sammobile.com/news/exclusive-samsung-25w-wireless-charger-galaxy-s26-photos/"
  },
  {
    "text": "Scientists let AI loose on Hubble’s archives - The Verge",
    "fullText": "AI model AnomalyMatch took just 2.5 days to flag rarities like merging galaxies and gravitational lenses from 100 million image cutouts in Hubble’s archives.",
    "link": "https://www.theverge.com/news/869182/astronomers-ai-discover-cosmic-anomalies-hubble-archives"
  }
]