[
  {
    "text": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests - BBC",
    "fullText": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
    "link": "https://www.bbc.com/news/articles/c4g5345ylk0o"
  },
  {
    "text": "Trump threatens 200% tariff on French wines as Macron reportedly snubs 'Board of Peace' seat - CNBC",
    "fullText": "Trump also reiterated his plans to control Greenland, saying that European leaders \"won't push back too much.\"",
    "link": "https://www.cnbc.com/2026/01/20/trump-threatens-200percent-tariff-on-french-wines-and-champagnes-.html"
  },
  {
    "text": "Asian Stocks Face Wary Start as Tariff Feud Grows: Markets Wrap - Bloomberg.com",
    "fullText": "Treasuries joined a selloff in global bonds and stocks pulled back as President Donald Trump’s Greenland-related tariff threats reignited trade tensions, testing market confidence after a rally fueled by investments in artificial intelligence.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-19/stock-market-today-dow-s-p-live-updates"
  },
  {
    "text": "Indiana defeats Miami to win the College Football Playoff National Championship Game - NCAA.com",
    "fullText": "Here's everything you need to know for Indiana against Miami (Fla.) in the College Football Playoff National Championship Game on Monday night.",
    "link": "https://www.ncaa.com/live-updates/football/fbs/indiana-defeats-miami-win-college-football-playoff-national-championship-game"
  },
  {
    "text": "Lawsuit contests RFK Jr.’s new vaccine guidance for children - The Washington Post",
    "fullText": "Several public health organizations accused the health secretary of packing a key advisory committee with vaccine skeptics, arguing its latest guidance should be voided.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/rfk-childhood-vaccines-lawsuit/"
  },
  {
    "text": "Powerball jackpot winning numbers for Monday, January 19, 2026 - USA Today",
    "fullText": "While everyone wants to be the first Powerball jackpot winner of 2026, no one has yet claimed Christmas Eve's $1.8 billion prize.",
    "link": "https://www.usatoday.com/story/money/lottery/2026/01/19/powerball-winning-numbers-mlk-day-monday-january-19-2026/88253054007/"
  },
  {
    "text": "Knicks relentlessly booed off court during beatdown by Mavericks as spiral hits new low - New York Post",
    "fullText": "The Knicks ended Saturday’s game getting booed off the court by their own fans. Two days later, they didn’t wait nearly as long.",
    "link": "https://nypost.com/2026/01/19/sports/knicks-booed-off-court-after-worst-loss-of-season-to-mavericks/"
  },
  {
    "text": "Spanberger draws sharp lines for working with Trump — and for pushing back - The Washington Post",
    "fullText": "Virginia Gov. Abigail Spanberger (D) addressed a joint session of the General Assembly Monday afternoon and outlined how she will tackle the issue of affordability.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/19/virginia-spanberger-affordability-assembly-trump/"
  },
  {
    "text": "In San Antonio, the nation's largest MLK march takes on added meaning - Texas Public Radio | TPR",
    "fullText": "The nation’s largest Martin Luther King Jr. Day march carries special significance in San Antonio, where a small Black community helped build a tradition that now draws hundreds of thousands each year.",
    "link": "https://www.tpr.org/arts-culture/2026-01-19/in-san-antonio-the-nations-largest-mlk-march-takes-on-added-meaning"
  },
  {
    "text": "How to take pictures of the Northern Lights with Google Pixel and other Android phones - 9to5Google",
    "fullText": "The Northern Lights are the most visible they've been in decades, and you can capture it with a picture from Android or Google Pixel phones.",
    "link": "http://9to5google.com/2026/01/19/how-to-take-pictures-northern-lights-android-google-pixel/"
  },
  {
    "text": "ICE Continues to Remove the Worst of the Worst from Minneapolis Streets as DHS Law Enforcement Marks 3,000 Arrests During Operation Metro Surge - Homeland Security (.gov)",
    "fullText": "The U.S. Department of Homeland Security (DHS) released the following statement and information regarding U.S. Immigration and Customs Enforcement (ICE) arrests of dangerous criminal illegal aliens in Minneapolis, Minnesota over the weekend including murderer…",
    "link": "https://www.dhs.gov/news/2026/01/19/ice-continues-remove-worst-worst-minneapolis-streets-dhs-law-enforcement-marks-3000"
  },
  {
    "text": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case - AP News",
    "fullText": "Federal Reserve Chair Jerome Powell will attend the Supreme Court’s oral arguments Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair. The high court is considering whether Presid…",
    "link": "https://apnews.com/article/federal-reserve-jerome-powell-lisa-cook-supreme-court-7f135bd222013d4fe61eb8f03c663676"
  },
  {
    "text": "'Absolutely Rolled': U.S. Officials Blast Canada's Cheap Chinese EV Deal - InsideEVs",
    "fullText": "China Inc.'s biggest move into North America yet has industry officials and politicians on edge. But affordability concerns take center stage.",
    "link": "https://insideevs.com/news/784813/us-china-canada-ev-tariff-recation/"
  },
  {
    "text": "The fastest human spaceflight mission in history crawls closer to liftoff - Ars Technica",
    "fullText": "After a remarkably smooth launch campaign, Artemis II reached its last stop before the Moon.",
    "link": "https://arstechnica.com/space/2026/01/nasas-artemis-ii-rocket-rolls-to-launch-pad-but-key-test-looms-ahead/"
  },
  {
    "text": "Updates: Denmark, Greenland float NATO mission on island - dw.com",
    "fullText": "Denmark's defense minister said he and Greenland's defense minister raised the possibility of a NATO surveillance mission in Greenland in a meeting with the NATO chief Mark Rutte.",
    "link": "https://www.dw.com/en/greenland-updates-denmark-floats-nato-mission-on-island/live-75558976"
  },
  {
    "text": "Chiefs plan to bring back longtime assistant Eric Bieniemy as next OC - NFL.com",
    "fullText": "The Kansas City Chiefs are set to bring back a familiar face to their coaching staff. The Chiefs plan to hire longtime assistant Eric Bieniemy as their next offensive coordinator, NFL Network Insider Tom Pelissero reported on Monday.",
    "link": "https://www.nfl.com/news/chiefs-plan-to-bring-back-longtime-assistant-eric-bieniemy-as-next-oc"
  },
  {
    "text": "Natalya heel turn costs Maxxine Dupri Intercontinental championship - Cageside Seats",
    "fullText": "Why Nattie why?",
    "link": "https://www.cagesideseats.com/wwe/412041/natalya-heel-turn-costs-maxxine-dupri-intercontinental-championship-becky-lynch-wwe-raw"
  },
  {
    "text": "Microsoft veteran explains the flawed yet cool old Windows trick to restart PCs much faster - Neowin",
    "fullText": null,
    "link": "https://www.neowin.net/news/microsoft-veteran-explains-the-flawed-yet-cool-old-windows-trick-to-restart-pcs-much-faster/"
  },
  {
    "text": "What deep sea mud is revealing about giant earthquakes along the Pacific Coast - Phys.org",
    "fullText": "Marine turbidites are layers of mud and sand deposited on the deep ocean floor by massive underwater landslides and are often used as a historical record for reconstructing earthquake histories.",
    "link": "https://phys.org/news/2026-01-deep-sea-mud-revealing-giant.html"
  }
]