[
  {
    "text": "Live updates: Storm to bring heavy rain to Southern California - ABC7 Los Angeles",
    "fullText": "Heavy rain is expected across Southern California on New Year's Eve, raising flash flooding and debris flow concerns. Evacuation warnings are in place for millions of people in the region. Here's the latest.",
    "link": "https://abc7.com/live-updates/southern-california-weather-updates-storm-bring-heavy-rain-los-angeles-orange-riverside-ventura-san-bernardino-counties/18336250/"
  },
  {
    "text": "Several killed in explosion at Swiss ski resort town: Police - Al Jazeera",
    "fullText": "The New Year’s Eve fire occurred in a bar called Le Constellation in the Swiss town of Crans Montana.",
    "link": "https://www.aljazeera.com/news/2026/1/1/several-killed-in-explosion-fire-at-swiss-ski-resort-town-police"
  },
  {
    "text": "New Year's Eve celebrations welcome 2026 around the world. See the photos. - CBS News",
    "fullText": "New Zealand and Australia were among the first to welcome 2026, but in Sydney and some other cities, the festivities are tinged by grief.",
    "link": "https://www.cbsnews.com/news/new-year-2026-celebrations-around-world-photos-fireworks/"
  },
  {
    "text": "Bulgaria joins Eurozone despite pro-Russian disinformation - Financial Times",
    "fullText": "Euro adoption vilified by Moscow-leaning politicians and social media campaigns",
    "link": "https://www.ft.com/content/fa899392-404b-4510-b3fc-b868be67875e"
  },
  {
    "text": "Warren Buffett hands over Berkshire Hathaway’s reins to Greg Abel - Financial Times",
    "fullText": "Investors hunt for clues on how the investor’s protégé will shape the $1.1tn conglomerate",
    "link": "https://www.ft.com/content/790b3a97-9ec3-4403-aaa8-ac518a2694a9"
  },
  {
    "text": "Miami beats defending national champ Ohio State 24-14 in the CFP quarterfinal at Cotton Bowl - AP News",
    "fullText": "Keionte Scott returned an interception 72 yards for a touchdown and No. 10 Miami shocked defending champion Ohio State 24-14 in the first College Football Playoff quarterfinal at the Cotton Bowl. The 12-2 Hurricanes never trailed after going into Wednesday ni…",
    "link": "https://apnews.com/article/cotton-bowl-cfp-ohio-state-miami-score-c34e19efd652cd8b5c900693388f748b"
  },
  {
    "text": "‘Stranger Things 5’: Who Lives, Who Dies In Series Finale - Deadline",
    "fullText": "Stranger Things 5 ended with a two hour finale that's broken down here.",
    "link": "http://deadline.com/2025/12/stranger-things-5-series-finale-recap-who-dies-1236659537/"
  },
  {
    "text": "5 key takeaways from Jack Smith's deposition on the Trump probes - Axios",
    "fullText": "Smith denied \"any characterization that our work was in any way meant to hamper him in the Presidential election.\"",
    "link": "https://www.axios.com/2025/12/31/trump-jack-smith-election-transcript-testimony-fbi"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Adjusts Imports of Timber, Lumber, and Their Derivative Products into the United States - The White House (.gov)",
    "fullText": "SUPPORTING AMERICA’S LUMBER INDUSTRY: Today, President Donald J. Trump signed a Proclamation invoking Section 232 of the Trade Expansion Act of 1962 (Act)",
    "link": "https://www.whitehouse.gov/fact-sheets/2025/12/fact-sheet-president-donald-j-trump-adjusts-imports-of-timber-lumber-and-their-derivative-products-into-the-united-states/"
  },
  {
    "text": "Federal ruling blocks Hawaii's climate change tourist tax on cruise ships - ABC News",
    "fullText": "Federal ruling blocks Hawaii's climate change tourist tax on cruise ships",
    "link": "https://abcnews.go.com/US/wireStory/federal-ruling-blocks-hawaiis-climate-change-tourist-tax-128823291"
  },
  {
    "text": "Trump ends effort to keep National Guard in Chicago, Los Angeles, Portland - The Washington Post",
    "fullText": "President Trump has announced the withdrawal of National Guard troops from Chicago, Los Angeles and Portland, citing reduced crime rates.",
    "link": "https://www.washingtonpost.com/business/2025/12/31/trump-national-guard-chicago-los-angeles-portland/"
  },
  {
    "text": "Jennifer Lopez has cheeky response for why she's 'always naked' at 56 - USA Today",
    "fullText": "Don't like how Jennifer Lopez dresses at 56? She's got a message for you.",
    "link": "https://www.usatoday.com/story/entertainment/celebrities/2025/12/31/jennifer-lopez-56-haters-always-naked/87975421007/"
  },
  {
    "text": "Greene County teen marks state’s first pediatric flu death of the season - Dayton Daily News",
    "fullText": "",
    "link": "https://www.daytondailynews.com/local/greene-county-teen-marks-states-first-pediatric-flu-death-of-the-season/ZAA5ECPTA5HVPCV3NNYVTTA3PE/"
  },
  {
    "text": "MTV Channels Come Full Circle With Final Clip: “Video Killed The Radio Star” - Deadline",
    "fullText": "MTV Music, MTV 80s, MTV 90s, Club MTV and MTV Live in the UK went out just as the original music video channel began: with the Buggles \"Video Killed the Radio Star.\"",
    "link": "http://deadline.com/2025/12/mtv-off-air-video-killed-radio-star-1236659461/"
  },
  {
    "text": "Duke 42-39 Arizona State (Dec 31, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778329"
  },
  {
    "text": "Social media reactions from Michigan’s loss to Texas - Maize n Brew",
    "fullText": "Here’s what people are saying about Michigan’s loss against Texas in the Citrus Bowl.",
    "link": "https://www.maizenbrew.com/football/102458/michigan-football-citrus-bowl-social-media-reactions-texas-longhorns-bryce-underwood"
  },
  {
    "text": "Ex-champ Joshua out of hospital after car crash - ESPN",
    "fullText": "Two-time former heavyweight champion Anthony Joshua was released from the hospital Wednesday after being under observation for minor injuries suffered in a car crash.",
    "link": "https://www.espn.com/boxing/story/_/id/47466722/ex-champ-anthony-joshua-released-hospital-car-crash"
  },
  {
    "text": "Alleged drug smugglers jumped overboard in latest boat strikes, U.S. military says - CBS News",
    "fullText": "Three people were killed Tuesday when the first boat was hit, while individuals in two other boats jumped overboard, according to U.S. Southern Command.",
    "link": "https://www.cbsnews.com/news/alleged-drug-smugglers-jumped-overboard-latest-boat-strikes-pacific-us-military/"
  },
  {
    "text": "You can’t trust your eyes to tell you what’s real anymore, says the head of Instagram - The Verge",
    "fullText": "Adam Mosseri says Instagram creators are leaning into imperfection as a signal their content is real and not AI-generated, but the platform will need to evolve.",
    "link": "https://www.theverge.com/news/852124/adam-mosseri-ai-images-video-instagram"
  }
]