[
  {
    "text": "DOJ files federal charges against man accused of attacking Rep. Ilhan Omar - NBC News",
    "fullText": "The Justice Department filed charges Thursday against a man who allegedly tried to spray Rep.",
    "link": "https://www.nbcnews.com/politics/politics-news/doj-files-federal-charges-man-accused-attacking-rep-ilhan-omar-rcna256511"
  },
  {
    "text": "EU lists Iran's paramilitary Revolutionary Guard as terrorist organization over protest crackdown - AP News",
    "fullText": "The European Union has agreed to list Iran’s paramilitary Revolutionary Guard as a terrorist organization over Tehran’s bloody crackdown on nationwide protests. The bloc’s top diplomat made the announcement Thursday. It is a largely symbolic move that adds to…",
    "link": "https://apnews.com/article/european-union-iran-revolutionary-guard-terrorist-f7d9d64b1302cfc2d9311417b2dfeaf6"
  },
  {
    "text": "Microsoft is working to rebuild trust in Windows - The Verge",
    "fullText": "Microsoft is going to spend 2026 improving Windows 11. It comes after Windows update quality issues and complaints about the operating system.",
    "link": "https://www.theverge.com/tech/870045/microsoft-windows-11-issues-rebuilding-trust-notepad"
  },
  {
    "text": "S&P 500 falls 1% as Microsoft dive spoils Mag 7 earnings enthusiasm: Live updates - CNBC",
    "fullText": "\"Magnificent Seven\" companies Meta Platforms, Microsoft and Tesla posted earnings results after Wednesday's close.",
    "link": "https://www.cnbc.com/2026/01/28/stock-market-today-live-updates.html"
  },
  {
    "text": "Former Illinois sheriff’s deputy sentenced to 20 years for murder of Sonya Massey - NBC News",
    "fullText": "Sean Grayson, a former Illinois sheriff’s deputy convicted of second-degree murder for the 2024 death of Sonya Massey, was sentenced Thursday to 20 years in prison followed by two years of supervised probation",
    "link": "https://www.nbcnews.com/news/us-news/former-illinois-sheriffs-deputy-sentenced-murder-sonya-massey-rcna256475"
  },
  {
    "text": "'I can breathe again' says Israeli hostage held for nearly 500 days in Gaza - BBC",
    "fullText": "In his first international interview, Sasha Troufanov tells the BBC how he thought he would die in captivity after he was taken hostage on 7 October 2023.",
    "link": "https://www.bbc.com/news/articles/c8rm20gm364o"
  },
  {
    "text": "PFL CEO addresses Francis Ngannou’s future after not being featured in rankings - MMA Fighting",
    "fullText": "Francis Ngannou signed with the PFL in free agency but to date he’s only had one fight in the promotion",
    "link": "https://www.mmafighting.com/pfl/468487/pfl-ceo-addresses-francis-ngannous-future-after-not-being-featured-in-rankings"
  },
  {
    "text": "Zayn Malik Appears to Take a Dig at Harry Styles Ticket Prices - TMZ",
    "fullText": "Zayn Malik has entered the chat ... after fans expressed shock, frustration and outright rage over Harry Styles' startling ticket prices, Zayn seemed to add to the pile-on during a recent concert.",
    "link": "https://www.tmz.com/2026/01/29/zayn-malik-calls-out-ticket-prices-harry-styles/"
  },
  {
    "text": "FBI raid in Georgia highlights Trump's 2020 election obsession and hints at possible future actions - AP News",
    "fullText": "President Donald Trump is pushing the federal government to back up his bogus claims that widespread fraud cost him reelection in 2020. On Wednesday, the FBI served a search warrant at the election headquarters of Fulton County, Georgia, which includes most o…",
    "link": "https://apnews.com/article/trump-2020-election-false-claims-fraud-georgia-55786848ca20c02cbcf749ede2db8852"
  },
  {
    "text": "Guest column | A self-collected test allowed me to finally get cervical cancer screening - The Washington Post",
    "fullText": "I have a condition called vaginismus that makes traditional cervical cancer screening nearly impossible.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/29/cervical-cancer-self-collection-hpv-test/"
  },
  {
    "text": "Why Private Equity Is Suddenly Awash With Zombie Firms - Forbes",
    "fullText": "Hundreds of private equity firms are drowning in a sea of competition, searching for lifeboats of new capital as they cling to portfolios of nearly unsaleable investments.",
    "link": "https://www.forbes.com/sites/hanktucker/2026/01/29/why-private-equity-is-suddenly-awash-with-zombie-firms/"
  },
  {
    "text": "Indonesian couple caned 140 times for sex outside marriage and drinking alcohol - CBS News",
    "fullText": "The Sharia police chief in Indonesia's Banda Aceh province is unapologetic about the latest canings, imposed for behavior he said, \"tarnishes our name.\"",
    "link": "https://www.cbsnews.com/news/indonesia-aceh-sharia-law-caning-couple-caned-140-times-sex-alcohol/"
  },
  {
    "text": "Deutsche Bank offices raided in money laundering probe - BBC",
    "fullText": "Officials searched offices in Frankfurt and Berlin in relation to \"past business relationships\".",
    "link": "https://www.bbc.com/news/articles/cx20199qzj9o"
  },
  {
    "text": "Trump has sued universities for billions. Here's what the strategy tells us - NPR",
    "fullText": "Each deal between colleges and the administration is unique, but they have common goals: altering the culture at powerful institutions and making their policies more aligned with President Trump's.",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5559293/trump-settlements-colleges-universities"
  },
  {
    "text": "No work, no school, no shopping: Jan. 30 nationwide general strike to protest ICE gains celebrity endorsements - Business Insider",
    "fullText": "Minnesotans stayed home from work and took to the streets to protest ICE on Jan. 23. Now, activists want to take it nationwide.",
    "link": "https://www.businessinsider.com/general-strike-ice-protest-minneapolis-2026-1"
  },
  {
    "text": "China executes 11 members of gang who ran billion-dollar criminal empire in Myanmar - CNN",
    "fullText": "China has executed 11 members of the notorious Ming family criminal gang, who ran mafia-like scam centers in Myanmar and killed workers who tried to escape, Chinese state media reported on Thursday.",
    "link": "https://www.cnn.com/2026/01/29/china/china-scams-myanmar-ming-family-intl-hnk"
  },
  {
    "text": "Panarin out of Rangers lineup for roster management - NHL.com",
    "fullText": "Forward leads New York with 57 points, is in final season of 7-year contract",
    "link": "https://www.nhl.com/news/artemi-panarin-out-of-new-york-rangers-lineup-for-roster-management"
  },
  {
    "text": "China and the UK are attempting to reset their relationship — here's how - CNBC",
    "fullText": "U.K. Prime Minister Sir Keir Starmer said he hopes to build \"more sophisticated\" ties with China as the two nations look to revive their bilateral relationship.",
    "link": "https://www.cnbc.com/2026/01/29/china-uk-starmer-xi-relations-visit-businesses-.html"
  },
  {
    "text": "‘Shrinking’ Star Jason Segel on Michael J. Fox, Harrison Ford and How That Tender Premiere Sets Up an “Electric” Third Season - hollywoodreporter.com",
    "fullText": "The just-renewed Apple comedy returned with a one-hour episode that featured a wedding, guest appearance from Fox and a worrisome final scene. \"The energy of the season [is] of people stepping into the unknown,\" says the co-creator and star.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/shrinking-season-3-jason-segel-michael-j-fox-harrison-ford-1236486633/"
  }
]