[
  {
    "text": "OpenAI’s ChatGPT translator challenges Google Translate - The Verge",
    "fullText": "﻿ChatGPT Translate allows users to direct the style of translated text, such as ‘more fluent’ and ‘academic.’",
    "link": "https://www.theverge.com/news/862448/openai-chatgpt-translate-tool-launch-website"
  },
  {
    "text": "Trump is threatening to attack another country with tremendous oil reserves - CNN",
    "fullText": "The United States is considering whether to strike Iran as turmoil intensifies for the country’s authoritarian regime.",
    "link": "https://www.cnn.com/2026/01/15/business/oil-reserves-trump-iran"
  },
  {
    "text": "Ugandan election 2026: Yoweri Museveni faces Bobi Wine in presidential poll - BBC",
    "fullText": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years.",
    "link": "https://www.bbc.com/news/articles/cx2xn1yvgr4o"
  },
  {
    "text": "Horoscope for Thursday, January 15, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/15/horoscopes-today-thursday-january-15-2026"
  },
  {
    "text": "Russia Is the World’s Worst Patron - Foreign Affairs",
    "fullText": "From Syria to Venezuela, Putin has overpromised and underdelivered.",
    "link": "https://www.foreignaffairs.com/venezuela/russia-worlds-worst-patron"
  },
  {
    "text": "Djokovic, Sinner in same half of Australian Open draw; Alcaraz learns path - ATP Tour",
    "fullText": "Novak Djokovic and Jannik Sinner are in the same half of the Australian Open draw, which was revealed Thursday in Melbourne.",
    "link": "https://www.atptour.com/en/news/australian-open-2026-draw-preview"
  },
  {
    "text": "The famed Rocky statue in Philadelphia is getting a new home atop the Art Museum steps - 6abc Philadelphia",
    "fullText": "Get ready to climb the steps next time you want to pose with the Rocky statue at the Philadelphia Art Museum.",
    "link": "https://6abc.com/post/famed-rocky-statue-philadelphia-is-getting-new-home-atop-art-museum-steps/18405156/"
  },
  {
    "text": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "fullText": "Sweeping cuts to mental health and addiction programs worth more than $2 billion are being reversed. After a political backlash from Republicans and Democrats, the grant money will be restored.",
    "link": "https://www.npr.org/2026/01/14/nx-s1-5677714/trump-administration-mental-health-addiction-grant-cuts-restored"
  },
  {
    "text": "NCAA asks CFTC to suspend prediction markets - ESPN",
    "fullText": "The NCAA asked a federal regulatory body to stop prediction markets from offering trades on college sports until more safeguards are in place.",
    "link": "https://www.espn.com/college-sports/story/_/id/47614688/ncaa-asks-regulators-suspend-collegiate-prediction-markets"
  },
  {
    "text": "US and UK pulling some personnel from Qatar military base - BBC",
    "fullText": null,
    "link": "https://www.bbc.com/news/articles/c701xywwxw8o"
  },
  {
    "text": "Colorado appeals panel appears skeptical of Tina Peters’ sentence - The Colorado Sun",
    "fullText": "The three-judge panel was dismissive of many of the arguments made by Peters' attorneys. But they grilled the state's lawyer over the trial judge reciting Peters' false statements about elections in handing down her sentence.",
    "link": "http://coloradosun.com/2026/01/14/tina-peters-colorado-court-of-appeals-arguments/"
  },
  {
    "text": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "fullText": "WASHINGTON — President Donald Trump has told his national security team that he would want any U.S. military action in Iran to deliver a swift and decisive blow to the regime and not spark a sustained war that dragged on for weeks or months, according to a U.…",
    "link": "https://www.nbcnews.com/politics/white-house/trump-want-military-action-iran-swift-decisive-sources-say-rcna254076"
  },
  {
    "text": "Divisional Round Injury Report: Seahawks vs. 49ers - Seattle Seahawks",
    "fullText": "Details on the Seahawks’ injury situation heading into their divisional round playoff game against the 49ers.",
    "link": "https://www.seahawks.com/news/divisional-round-injury-report-seahawks-vs-49ers"
  },
  {
    "text": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "fullText": "On Jan. 6, there were 211 cases. The outbreak, which began in October, is now at 434.",
    "link": "https://arstechnica.com/health/2026/01/sc-measles-outbreak-has-gone-berserk-124-cases-since-friday-409-quarantined/"
  },
  {
    "text": "Congressional Bill S. 222 Signed into Law - The White House (.gov)",
    "fullText": "On Wednesday, January 14, 2026, the President signed into law: S. 222, the \"Whole Milk for Healthy Kids Act of 2025,\" which modifies the requirements for",
    "link": "https://www.whitehouse.gov/briefings-statements/2026/01/congressional-bill-s-222-signed-into-law/"
  },
  {
    "text": "US announces start of phase two of Trump's Gaza peace plan - BBC",
    "fullText": "It includes the establishment of a technocratic Palestinian government, as well as the reconstruction and demilitarisation of Gaza, US envoy Steve Witkoff says.",
    "link": "https://www.bbc.com/news/articles/cjw1nxe5pvlo"
  },
  {
    "text": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/01/14/live-coverage-spacex-to-launch-midweek-starlink-mission-on-falcon-9-rocket-from-cape-canaveral/"
  }
]