[
  {
    "text": "FCC reportedly looked into Bad Bunny’s halftime show following Republican outrage and found... nothing - Awful Announcing",
    "fullText": "The Federal Communications Commission reportedly investigated Bad Bunny's lyrics during the Super Bowl and found no issues.",
    "link": "https://awfulannouncing.com/pop-culture/fcc-bad-bunny-halftime-show-republican-outrage-no-violations.html"
  },
  {
    "text": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks - NASCAR.com",
    "fullText": "Bookmark this page and return often as links, results and more for 2026 Daytona Speedweeks are added for all three series.",
    "link": "https://www.nascar.com/news-media/2026/02/14/nascar-at-daytona-key-information-links-results-for-2026-speedweeks/"
  },
  {
    "text": "Wild St John’s-Providence brawl ends with six ejections, police on court - New York Post",
    "fullText": "Saturday’s St John’s-Providence game broke into chaos.",
    "link": "https://nypost.com/2026/02/14/sports/wild-st-johns-providence-brawl-ends-with-six-ejections/"
  },
  {
    "text": "‘Rosebush Pruning’ Review: Karim Aïnouz’s Black Comedy Is A Bad-Taste Riot - Deadline",
    "fullText": "‘Rosebush Pruning’ review: Karim Aïnouz’s sexually perverse black comedy is a bad-taste riot – Berlin Film Festival",
    "link": "http://deadline.com/2026/02/rosebush-pruning-review-karim-ainouz-callum-turner-elle-fanning-1236724821/"
  },
  {
    "text": "Newsom says Trump’s attacks are bringing Europe together - Politico",
    "fullText": "It’s the president’s one contribution to the continent, the California governor said.",
    "link": "https://www.politico.com/news/2026/02/14/newsom-trump-munich-europe-00782440"
  },
  {
    "text": "ECB makes euro backstop global to bolster currency's role - CNBC",
    "fullText": "Used ‌when banks can't get funding on the market, the repo line allows lenders to borrow euros from the ECB against collateral, to be repaid with interest.",
    "link": "https://www.cnbc.com/2026/02/14/ecb-makes-euro-backstop-global-to-bolster-currencys-role.html"
  },
  {
    "text": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’ - Variety",
    "fullText": "\"Harry Potter\" star Rupert Grint was asked to speak on the rise of fascism at Berlin Film Festival, saying: \"Obviously, I'm against it.\"",
    "link": "https://variety.com/2026/film/festivals/rupert-grint-rise-of-fascism-obviously-against-it-1236663266/"
  },
  {
    "text": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO - BBC",
    "fullText": "Giving some newborns in Guinea-Bissau an established hepatitis B treatment but not others is \"unethical\", it says.",
    "link": "https://www.bbc.com/news/articles/c78j5k2gk02o"
  },
  {
    "text": "2026 NFL Mock Draft 2.0: Jets pass on QB - New York Post",
    "fullText": "The Jets and Giants land stars from the same school in Steve Serby’s Mock 2.0.",
    "link": "https://nypost.com/2026/02/14/sports/2026-nfl-mock-draft-2-0-jets-pass-on-qb/"
  },
  {
    "text": "TSA agents are working without pay at US airports due to another shutdown - AP News",
    "fullText": "A shutdown of the Department of Homeland Security has gone into effect. That includes the Transportation Security Administration, whose officers are responsible for screening passengers and bags at airports. Experts say mass flight cancellations like those se…",
    "link": "https://apnews.com/article/dhs-shutdown-tsa-travel-airports-delays-ff8b225c6ff8d57172fd301a550057b3"
  },
  {
    "text": "5 ways heartbreak affects the body - CNN",
    "fullText": "Heartbreak isn’t just an emotional experience. It can physically hurt. Discover five ways love affects your body and what an expert says can help.",
    "link": "https://www.cnn.com/2026/02/14/health/love-heartbreak-effect-body-wellness"
  },
  {
    "text": "Meta Adding Facial Recognition to Its Smart Glasses That Identifies People in Real Time, Hoping the Public Is Too Distracted by Political Turmoil to Care - Futurism",
    "fullText": "Emboldened by the success of its smart glasses, Meta is working on a way to release a controversial facial recognition feature to the public.",
    "link": "http://futurism.com/artificial-intelligence/meta-facial-recognition-glasses"
  },
  {
    "text": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’ - MMA Fighting",
    "fullText": "Oliveira and Holloway will rematch for the BMF title at UFC 326",
    "link": "https://www.mmafighting.com/ufc/471571/a-decade-later-charles-oliveiras-injury-suffered-against-max-holloway-remains-a-mystery-nobody-knows-what-actually-happened"
  },
  {
    "text": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "fullText": "The administration’s attacks on Lemon and independent journalists have boosted their online attention and revenue.",
    "link": "https://www.washingtonpost.com/technology/2026/02/14/don-lemon-arrest-trump-administration/"
  },
  {
    "text": "I found the best Presidents Day TV deals on the latest from Samsung, Sony and more - CNN",
    "fullText": "Presidents Day is an excellent time to upgrade your TV, and the deals this year span every popular brand from LG to Samsung.",
    "link": "https://www.cnn.com/cnn-underscored/deals/presidents-day-tv-sales-2026-02-14"
  },
  {
    "text": "It's a dangerous complication of pregnancy — but a new drug holds promise - NPR",
    "fullText": "Researchers celebrate early results of a drug that may become the first treatment for a serious complication of pregnancy called preeclampsia. It's got the potential to save many lives.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5708744/preeclampsia-pregnancy-complication-treatment"
  },
  {
    "text": "Save $100 on Apple Watch Series 11, plus 28 other Apple Presidents Day deals - CNN",
    "fullText": "Apple products like AirPods, iPads and MacBooks are on sale with these Presidents Day weekend deals.",
    "link": "https://www.cnn.com/cnn-underscored/deals/apple-presidents-day-sale-2026-02-14"
  },
  {
    "text": "Harry Styles: ‘I’ve learnt how to slow down’ - The Times",
    "fullText": "In his first newspaper interview since 2019, the pop star as he’s never been seen before: off duty, in Italy — and photographed by Martin Parr",
    "link": "https://www.thetimes.com/culture/music/article/harry-styles-martin-parr-interview-kiss-all-the-time-disco-occasionally-mkdcdzkkj"
  }
]