[
  {
    "text": "Justice Department says Jan. 6 pipe bomb suspect believed election conspiracy theories - Politico",
    "fullText": "The DOJ said in a new filing that the suspect was not “openly political” but believed the 2020 election had been tampered with.",
    "link": "https://www.politico.com/news/2025/12/28/pipe-bomb-justice-department-jan-6-suspect-00707242"
  },
  {
    "text": "Trump and Zelenskyy meeting in Florida to talk Ukraine peace plan - CBS News",
    "fullText": "President Trump met with Ukrainian President Volodymyr Zelenskyy on Sunday after he said he had a \"good and very productive\" call with Russian President Vladimir Putin.",
    "link": "https://www.cbsnews.com/live-updates/trump-zelenskyy-meeting-florida/"
  },
  {
    "text": "LG announces new UltraGear evo gaming monitors with AI upscaling - The Verge",
    "fullText": "Even your gaming monitor isn’t safe from the buzz of AI.",
    "link": "https://www.theverge.com/tech/850572/lg-announces-new-ultragear-evo-gaming-monitors-with-ai-upscaling"
  },
  {
    "text": "Rapid Reactions: Defense Dominates Again In Seahawks’ Week 17 Win At Carolina - Seattle Seahawks",
    "fullText": "The Seahawks Started Slow On Offense, But Rolled To A 27-10 Win To Improve To 13-3",
    "link": "https://www.seahawks.com/news/2025-week-17-rapid-reactions-defense-dominates-again-in-seahawks-week-17-win-at-carolina"
  },
  {
    "text": "Old physics, new materials: The science behind how winter jackets keep you warm - PBS",
    "fullText": "Modern winter jackets are a testament to centuries-old physics and cutting-edge materials science.",
    "link": "https://www.pbs.org/newshour/science/old-physics-new-materials-the-science-behind-how-winter-jackets-keep-you-warm"
  },
  {
    "text": "Rapid Recap: Patriots Pound Jets 42-10, Complete Perfect 8-0 Road Record - New England Patriots",
    "fullText": "The Patriots scored early and often in a Week 16 blowout win over the New York Jets, getting their 13th victory of the 2025 season and completing a perfect 8-0 road record.",
    "link": "https://www.patriots.com/news/rapid-recap-patriots-pound-jets-42-10-complete-perfect-8-0-road-record"
  },
  {
    "text": "Bryce Reeves drops Senate bid in Virginia - Politico",
    "fullText": "Reeves will instead seek reelection to Virginia’s State Senate.",
    "link": "https://www.politico.com/news/2025/12/28/bryce-reeves-drops-out-virginia-senate-00707204"
  },
  {
    "text": "Winter storm snarls thousands of flights during busy holiday weekend. Maps show the latest forecast. - CBS News",
    "fullText": "More than 51 million Americans live in areas under winter storm alerts stretching from northern Minnesota to the Eastern Seaboard.",
    "link": "https://www.cbsnews.com/news/winter-storm-forecast-ice-snow-northeast-great-lakes/"
  },
  {
    "text": "Midair helicopter crash in New Jersey leaves 1 dead and another critically injured - AP News",
    "fullText": "Officials say two helicopters have crashed midair in southern New Jersey on Sunday, killing one person and leaving another critically injured. Hammonton Police Chief Kevin Friel said rescuers responded to a report of an aviation crash at about 11:25 a.m. on S…",
    "link": "https://apnews.com/article/hammonton-new-jersey-helicopter-crash-68717ae773636de9142e03e8b5dbd6f1"
  },
  {
    "text": "‘Super flu’ cases rising across US: What to know - NewsNation",
    "fullText": "The “super flu” is a variant of influenza A H3N2 called subclade K that doctors say is more severe and takes longer to recover from.",
    "link": "https://www.newsnationnow.com/health/super-flu-cases-what-to-know/"
  },
  {
    "text": "Suriname: Nine people, including five children, stabbed to death - BBC",
    "fullText": "Police detained the male suspect after shooting him in the leg, while two others are seriously injured.",
    "link": "https://www.bbc.com/news/articles/cp8966ew7y7o"
  },
  {
    "text": "Shedeur Sanders has a strong first half as Browns lead Steelers – Terry Pluto’s Scribbles - Cleveland.com",
    "fullText": "The Browns got off to a fast start on Sunday against the Steelers.",
    "link": "https://www.cleveland.com/browns/2025/12/sheduer-sanders-has-strong-first-half-as-browns-lead-pittsburgh-terry-plutos-scribbles.html"
  },
  {
    "text": "‘Avatar: Fire And Ash’ Soars To $760M+ Global, Sending Franchise Across $6B; ‘Zootopia 2’ Sails Past $1B Overseas For $1.42B+ WW; ‘Wicked 2’ Tops $500M; ‘Anaconda’ & ‘SpongeBob’ Enjoy Big Debuts – International Box Office - Deadline",
    "fullText": "Avatar: Fire And Ash pushes franchise across $6 billion global box office; Zootopia 2 is the highest-grossing Hollywood animated release ever overseas",
    "link": "http://deadline.com/2025/12/avatar-fire-and-ash-zootopia-global-international-box-office-1236657594/"
  },
  {
    "text": "Rep. Mike Turner defends US strikes against ISIS targets in Nigeria - Politico",
    "fullText": "Turner called the strikes a “continuation” of America's conflict with ISIS.",
    "link": "https://www.politico.com/news/2025/12/28/mike-turner-us-strikes-isis-nigeria-00707090"
  },
  {
    "text": "A weekend of harsh winter weather brings more death and despair to people in Gaza - CNN",
    "fullText": "Fierce rain and bitter cold continued to batter Gaza this weekend, as the number of Palestinians killed by the harsh winter weather continues to rise.",
    "link": "https://www.cnn.com/2025/12/28/middleeast/harsh-winter-weather-flooding-despair-gaza-intl"
  },
  {
    "text": "New York subway ends its MetroCard era and switches fully to tap-and-go fares - AP News",
    "fullText": "The New York City transit system is retiring the MetroCard after more than 30 years. The gold-and-blue swipeable card was introduced in 1994 to replace the subway token, which had been used for half a century. The last sales and refills on MetroCards will be …",
    "link": "https://apnews.com/article/metrocard-retired-omny-pay-nyc-subway-512112eea4d6e082baab299d41e8171a"
  },
  {
    "text": "Nancy Pelosi predicts Dems win House gavel back in ‘26, reflects on career and Jan. 6 attack - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/nancy-pelosi-predicts-dems-win-house-gavel-back/story?id\\\\u003d128684674"
  }
]