[
  {
    "text": "Bill and Hillary Clinton now agree to testify before Congress - Politico",
    "fullText": "It's a stunning change of heart for the former first couple as a contempt vote loomed.",
    "link": "https://www.politico.com/news/2026/02/02/bill-and-hillary-clinton-will-now-testify-before-congress-00761325"
  },
  {
    "text": "Asian Stocks Set to Climb After US Data Lifts Mood: Markets Wrap - Bloomberg.com",
    "fullText": "Asian stocks climbed after their steepest two-day drop since April as markets found footing following sharp swings in gold and silver that sent ripples across assets. The precious metals rose in early trading.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-02/asian-stocks-set-to-climb-after-us-data-lifts-mood-markets-wrap"
  },
  {
    "text": "‘Sherri’ Daytime Talk Show Canceled After Four Seasons - Variety",
    "fullText": "Sherri Shepherd's daytime talk show 'Sherri' has been canceled after four seasons.",
    "link": "https://variety.com/2026/tv/news/sherri-daytime-talk-show-canceled-four-seasons-1236650355/"
  },
  {
    "text": "Nicki Minaj Says It Was the ‘Bullying’ President Trump Faced, Not His Policies, That Made Her Step Into Politics - Yahoo",
    "fullText": "The rapper explained that she felt she could relate to the way the president \"was being treated.\"",
    "link": "https://www.billboard.com/music/music-news/nicki-minaj-relates-president-trump-both-faced-bullying-1236171249/"
  },
  {
    "text": "Photos of the Westminster dog show - AP News",
    "fullText": "NEW YORK (AP) — The Westminster Kennel Club hosted its 150th annual show. This is a photo gallery curated by AP photo editors.",
    "link": "https://apnews.com/photo-gallery/photos-westminster-dog-show-b257b78bab2840863b9978c1cae35d20"
  },
  {
    "text": "Looking back at Catacomb 3D , the game that led to Wolfenstein 3D - Ars Technica",
    "fullText": "Romero, Carmack, and colleagues discuss an oft-forgotten piece of PC gaming history...",
    "link": "https://arstechnica.com/gaming/2026/02/looking-back-at-catacomb-3d-the-game-that-led-to-wolfenstein-3d/"
  },
  {
    "text": "Police assess reports of alleged misconduct after Mandelson emails published - BBC",
    "fullText": "The peer is accused of passing sensitive information to the convicted sex offender while he was business secretary.",
    "link": "https://www.bbc.com/news/articles/cgm4rkn7x7po"
  },
  {
    "text": "Mariners Close To Acquiring Brendan Donovan - MLB Trade Rumors",
    "fullText": "After months and months of rumors, Donovan is finally on the move.",
    "link": "https://www.mlbtraderumors.com/2026/02/mariners-close-to-acquiring-brendan-donovan.html"
  },
  {
    "text": "What Jared Kushner's 'New Gaza' plan includes, and what it leaves out - NPR",
    "fullText": "President Trump's son-in-law Jared Kushner laid out a plan for a \"New Gaza.\" A close look suggests it makes room for fewer Palestinians and less housing.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5694656/jared-kushner-new-gaza-plan"
  },
  {
    "text": "US Attorney General Pam Bondi announces 2 more arrests in the St. Paul church protest - ABC News",
    "fullText": "U.S. Attorney General Pam Bondi has announced two more arrests in the protest at a church in Minnesota against the immigration enforcement crackdown",
    "link": "https://abcnews.go.com/US/wireStory/us-attorney-general-pam-bondi-announces-2-arrests-129785127"
  },
  {
    "text": "The Trump Administration exempts new nuclear reactors from environmental review - NPR",
    "fullText": "The announcement comes just days after NPR revealed the administration had secretly rewritten safety and environmental standards.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5696525/trump-nuclear-safety-regulations-environmental-review"
  },
  {
    "text": "Firefox is adding a switch to turn AI features off - The Verge",
    "fullText": "Mozilla is launching a new option that will allow you to turn off AI-powered features inside Firefox, including abuilt-in chatbot, AI translations, AI tab groups, and more.",
    "link": "https://www.theverge.com/news/872489/mozilla-firefox-ai-features-off-button"
  },
  {
    "text": "Mike Vrabel Seeks to Become Third Buckeye Alumnus to Win Super Bowl As Head Coach or Coordinator - Eleven Warriors",
    "fullText": "By coaching the Patriots in the Super Bowl, Mike Vrabel follows in the footsteps of two incredible fellow Buckeye alumni: Don McCafferty and Dick LeBeau.",
    "link": "https://www.elevenwarriors.com/ohio-state-football/2026/02/161436/mike-vrabel-seeks-to-become-third-buckeye-alumnus-to-win-super-bowl-as-head-coach-or-coordinator"
  },
  {
    "text": "Here are the retailers with the most store openings and closures planned for 2026 - CNBC",
    "fullText": "Stores closures in the U.S. are expected to fall to the lowest level in the past three years, according to an analysis by Coresight Research.",
    "link": "https://www.cnbc.com/2026/02/02/store-openings-and-closures-2026-dollar-general-aldi-gamestop.html"
  },
  {
    "text": "Microsoft Stock (NASDAQ:MSFT) Falters on Hibernation Fix Flop, Unexpected Xbox Permaban - TipRanks",
    "fullText": "Tech giant Microsoft ($MSFT) has not been having a great Monday so far. Reports of a hibernation bug previously thought fixed have emerged to say that the fix did not",
    "link": "https://www.tipranks.com/news/microsoft-stock-nasdaqmsft-falters-on-hibernation-fix-flop-unexpected-xbox-permaban"
  },
  {
    "text": "NASA's IMAP Active Link for Real-Time Data now Available - Space Weather Prediction Center (.gov)",
    "fullText": null,
    "link": "https://www.swpc.noaa.gov/news/nasas-imap-active-link-real-time-data-now-available"
  },
  {
    "text": "Focusing and defocusing light without a lens: First demonstration of the structured Montgomery effect in free space - Phys.org",
    "fullText": "Applied physicists in the Harvard John A. Paulson School of Engineering and Applied Sciences (SEAS) have demonstrated a new way to structure light in custom, repeatable, three-dimensional patterns, all without the use of traditional optical elements like lens…",
    "link": "https://phys.org/news/2026-02-focusing-defocusing-lens-montgomery-effect.html"
  },
  {
    "text": "Seahawks, Patriots to kick off Super Bowl festivities with opening night media blitz - KOMO",
    "fullText": "Patriots and Seahawks to kick off Super Bowl festivities with annual opening night media blitz",
    "link": "https://komonews.com/sports/seahawks/seattle-seahawks-new-england-patriots-super-bowl-opening-night-media-blitz-reporters-interviews-nfl-football-levis-stadium-sam-darnold"
  },
  {
    "text": "Google releases ‘Desktop Camera’ app that’s seemingly for Android PCs - 9to5Google",
    "fullText": "Google has quietly released a new \"Desktop Camera\" app that's seemingly meant for future Android PCs on the new desktop experience.",
    "link": "http://9to5google.com/2026/02/02/google-android-desktop-camera-app/"
  }
]