[
  {
    "text": "Paramount CEO David Ellison Takes Dig At “Monopolistic” Netflix In Open Letter To UK Creatives About Warner Deal - Deadline",
    "fullText": "David Ellison has written to the UK creative community, committing to investment and theatrical windows as Paramount pursues Warner Bros. Discovery.",
    "link": "http://deadline.com/2026/02/paramount-david-ellison-netflix-warner-open-letter-1236709783/"
  },
  {
    "text": "TSMC Plans Major Upgrade of Japan Chip Plant in Win for Takaichi - Bloomberg",
    "fullText": "Taiwan Semiconductor Manufacturing Co. plans to make advanced 3-nanometer chips in Japan, stepping up its semiconductor manufacturing roadmap in the country in a triumph for Prime Minister Sanae Takaichi’s technology ambitions.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-05/tsmc-plans-major-upgrade-of-japan-chip-plant-in-win-for-takaichi"
  },
  {
    "text": "Nintendo Direct Partner Showcase Announced For Today, 5th February 2026 - Nintendo Life",
    "fullText": "Howdy, partners!",
    "link": "https://www.nintendolife.com/news/2026/02/nintendo-direct-partner-showcase-announced-for-today-5th-february-2026"
  },
  {
    "text": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race - BBC",
    "fullText": "The New Start treaty has limited the number of deployed strategic nuclear warheads for both countries.",
    "link": "https://www.bbc.com/news/articles/c4g31n4ey9go"
  },
  {
    "text": "Silver resumes its slide, plunging 11%, after short-lived rebound - CNBC",
    "fullText": "Silver prices slid as much as 16% on Thursday, snapping a two-day rebound as investors continued to unwind positions.",
    "link": "https://www.cnbc.com/2026/02/05/silver-resumes-its-slide-plunging-12percent-after-short-lived-rebound.html"
  },
  {
    "text": "Mars Rover Can't Escape AI Even On A Whole Separate Planet - Jalopnik",
    "fullText": "Driving the rover remotely in real time isn't possible due to the vast distance between the planets.",
    "link": "https://www.jalopnik.com/2092323/mars-rover-escape-ai/"
  },
  {
    "text": "3 takeaways from No. 16 BYU’s loss to Oklahoma State - Deseret News",
    "fullText": "Make that three straight losses for BYU.",
    "link": "https://www.deseret.com/sports/2026/02/04/byu-basketball-loses-at-oklahoma-state-3-takeaways/"
  },
  {
    "text": "A new comet was just discovered. Will it be visible in broad daylight? - The Conversation",
    "fullText": "Comet MAPS has the potential to be one of the ‘Great Comets’ of this century.",
    "link": "https://theconversation.com/a-new-comet-was-just-discovered-will-it-be-visible-in-broad-daylight-274533"
  },
  {
    "text": "Tigers, Framber Valdez Agree To Three-Year Deal - MLB Trade Rumors",
    "fullText": "The Tigers make a major splash late in the offseason, signing Framber Valdez to a short-term deal to pair with Tarik Skubal atop the rotation.",
    "link": "https://www.mlbtraderumors.com/2026/02/tigers-framber-valdez-agree-to-three-year-deal.html"
  },
  {
    "text": "Measles case confirmed in Northern Virginia; find out where the exposure sites are believed to be - WUSA9",
    "fullText": "Virginia health officials confirmed a measles case in an adult, prompting alerts for potential exposure sites in Fairfax County. Stay vigilant for symptoms.",
    "link": "https://www.wusa9.com/article/news/health/measles-case-northern-virginia-exposure-sites/65-329d7f68-e385-4431-9e0e-8639a5b79336"
  },
  {
    "text": "Most Preventable Cancers Are Linked to Just Two Lifestyle Habits - ScienceAlert",
    "fullText": "It's easy to feel powerless against cancer, but a new study has identified several ways that we can reduce the odds of it occurring.",
    "link": "https://www.sciencealert.com/most-preventable-cancers-are-linked-to-just-two-lifestyle-habits"
  },
  {
    "text": "Dems embrace \"law and order\" in ICE shutdown fight - Axios",
    "fullText": "\"This isn't about trying to enact immigration reform,\" one top Democrat said.",
    "link": "https://www.axios.com/2026/02/05/democrats-ice-government-shutdown-law-enforcement"
  },
  {
    "text": "What to know about the congressional fight over ICE restrictions, and another possible government shutdown - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/congressional-fight-ice-restrictions-government-shutdown/story?id\\\\u003d129856318"
  },
  {
    "text": "Exposure to burn injuries played key role in shaping human evolution, study suggests - Phys.org",
    "fullText": "Humans' exposure to high temperature burn injuries may have played an important role in our evolutionary development, shaping how our bodies heal, fight infection, and sometimes fail under extreme injury, according to new research.",
    "link": "https://phys.org/news/2026-02-exposure-injuries-played-key-role.html"
  },
  {
    "text": "Russian-state hackers exploit Office vulnerability to infect computers - Ars Technica",
    "fullText": "The window to patch vulnerabilities is shrinking rapidly.",
    "link": "https://arstechnica.com/security/2026/02/russian-state-hackers-exploit-office-vulnerability-to-infect-computers/"
  },
  {
    "text": "Madison Beer Gets Real About Social Media, Being a Woman in the Industry and Her New Album ‘Locket’ - The Hollywood Reporter",
    "fullText": "The 26-year-old, who has spent nearly all of her young adult in the public eye, is working on giving herself grace: “I'm all about not being too tough on myself.”",
    "link": "http://www.hollywoodreporter.com/music/music-features/madison-beer-locket-interview-1236494172/"
  },
  {
    "text": "Jon Jones addresses his UFC status after 'private conversation' leaked his worrying health issue - Bloody Elbow",
    "fullText": "Jon Jones was not aware his words were being recorded...",
    "link": "https://bloodyelbow.com/2026/02/04/jon-jones-addresses-his-ufc-status-after-private-conversation-leaked-his-worrying-health-issue/"
  },
  {
    "text": "Tony Khan announces new matches, segment for AEW Dynamite - F4W/WON",
    "fullText": "Two new matches have been announced for this week’s AEW Dynamite, along with a Women’s World Championship match set for next week’s show.",
    "link": "https://www.f4wonline.com/news/aew/tony-khan-announces-new-matches-segment-for-aew-dynamite/"
  }
]