[
  {
    "text": "Mother and stepfather arrested for alleged child abuse amid search for missing Oklahoma boy - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/mother-stepfather-arrested-alleged-child-abuse-amid-search/story?id\\\\u003d129064524"
  },
  {
    "text": "Strength training is crucial after menopause. How to make the most of your workouts - AP News",
    "fullText": "Medical experts say strength training keeps bones and muscles healthy after menopause when estrogen loss speeds up a reduction in bone density and contributes to the gradual loss of muscle mass. Strength training also helps women maintain a healthy weight and…",
    "link": "https://apnews.com/article/menopause-perimenopause-exercise-strength-training-b379697dd2290786739ed442d4173cd7"
  },
  {
    "text": "Vonn zooms to 2nd downhill victory before Milan - ESPN",
    "fullText": "Lindsey Vonn won her second World Cup downhill in four races this season, raising expectations in this remarkable comeback at age 41 ahead of the Milan Cortina Olympics.",
    "link": "https://www.espn.com/olympics/skiing/story/_/id/47568851/lindsey-vonn-wins-second-world-cup-downhill-olympic-season"
  },
  {
    "text": "Fernando Mendoza's Hot Aunt Put America In A Trance While Indiana Humiliated Oregon - outkick.com",
    "fullText": "A tradition unlike any other!",
    "link": "https://www.outkick.com/culture/fernando-mendozas-hot-aunt-put-america-trance-while-indiana-humiliated-oregon"
  },
  {
    "text": "The NIH has lost its scientific integrity. So we left - statnews.com",
    "fullText": "“We can no longer lend our credibility to an organization that has lost its integrity,” write four scientists and administrators who recently resigned from the NIH.",
    "link": "https://www.statnews.com/2026/01/10/nih-resign-protest-four-leaders-cite-interference-censorship/"
  },
  {
    "text": "Trump’s plan to strong-arm insurers into lower prices is met with skepticism - Politico",
    "fullText": "There are reasons to be skeptical that voluntary cuts by insurance companies could bring significant, lasting health care savings for Americans.",
    "link": "https://www.politico.com/news/2026/01/10/trumps-plan-to-strong-arm-insurers-into-lower-prices-is-met-with-skepticism-00718333"
  },
  {
    "text": "Trump’s Venezuelan oil rush is doomed from the start - Salon.com",
    "fullText": "One industry expert said Trump's oil dreams are less about economic prudence and more about distracting the public",
    "link": "https://www.salon.com/2026/01/10/trumps-venezuelan-oil-rush-is-doomed-from-the-start/"
  },
  {
    "text": "Russia uses its new ballistic missile in a major attack on Ukraine and a warning to West - AP News",
    "fullText": "Russia has launched a massive overnight attack on Ukraine, using hundreds of drones and dozens of missiles. Officials say at least four people have been killed. For only the second time in the nearly 4-year-old war, it used a powerful, new hypersonic missile …",
    "link": "https://apnews.com/article/russia-ukraine-war-drones-missile-kyiv-56655401d55ab4818800c43b7035b2a9"
  },
  {
    "text": "A blinding parasitic eye disease affects mostly contact lens wearers. Here’s how to avoid it - CNN",
    "fullText": "Acanthamoeba keratitis is a rare but blinding parasitic eye disease. Experts share how to avoid it and treat it.",
    "link": "https://www.cnn.com/2026/01/10/health/acanthamoeba-keratitis-symptoms-treatment-wellness"
  },
  {
    "text": "The Sky Today on Saturday, January 10: Jupiter reaches opposition - Astronomy Magazine",
    "fullText": null,
    "link": "https://www.astronomy.com/observing/the-sky-today-saturday-january-10-2026/"
  },
  {
    "text": "Filipino rescuers detect 'signs of life' in garbage avalanche that killed 4 and left dozens missing - abcnews.go.com",
    "fullText": "A Philippine official says rescuers have detected signs of life in an avalanche of garbage that killed at least four workers and left more than 30 others missing",
    "link": "https://abcnews.go.com/International/wireStory/filipino-rescuers-detect-signs-life-garbage-avalanche-killed-129078989"
  },
  {
    "text": "Horoscope for Saturday, January 10, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/10/horoscopes-today-saturday-january-10-2026"
  },
  {
    "text": "'Out of stock': What went wrong at luxury retailer Saks? - BBC",
    "fullText": "Saks Global, which owns Saks Fifth Avenue and Neiman Marcus, is expected to imminently file for bankruptcy protection, leaving questions about the retailer's future.",
    "link": "https://www.bbc.com/news/articles/czdq1z73pv9o"
  },
  {
    "text": "Judge says Trump administration can’t block child care, other program money for 5 states for now - abcnews.go.com",
    "fullText": "A judge has ruled that President Donald Trump’s administration cannot block child care and other federal social service money from flowing to five states for now",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-trump-administration-block-child-care-program-money-129072240"
  },
  {
    "text": "AFI Awards Lunch: Oscar Frontrunners Celebrate 2025's Top Films, TV Shows - The Hollywood Reporter",
    "fullText": "Carol Burnett toasted the honorees at an event that also paid tribute to Diane Keaton and Rob Reiner.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/afi-awards-lunch-oscar-frontrunners-2025-top-film-tv-shows-1236468931/"
  },
  {
    "text": "South Africa's strained ties with US face new test - war games with China, Iran and Russia - BBC",
    "fullText": "The naval exercises could inflame relations with Donald Trump - who is already at loggerheads with Pretoria.",
    "link": "https://www.bbc.com/news/articles/c62wxezynk2o"
  },
  {
    "text": "Strange cosmic objects spotted by the James Webb Space Telescope may be baby 'platypus' galaxies — or something entirely new - Space",
    "fullText": "\"These nine objects are special.\"",
    "link": "https://www.space.com/astronomy/galaxies/strange-cosmic-objects-spotted-by-the-james-webb-space-telescope-may-be-baby-platypus-galaxies-or-something-entirely-new"
  },
  {
    "text": "Kendall Jenner addresses long-standing rumor about her sexuality - Yahoo",
    "fullText": "When it comes to disclosing details about her romantic relationships, Jenner has famously remained tight-lipped to the public.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/kendall-jenner-addresses-long-standing-rumor-about-her-sexuality-202316784.html"
  },
  {
    "text": "Ikea Smartened Up Some of Its Artsy-Fartsy Lights - Gizmodo",
    "fullText": "The Swedish meatball restaurant now sells RGB donut-shaped lamps and bendy dimmable pendant lamps with smart home functionality.",
    "link": "https://gizmodo.com/ikea-smartened-up-some-of-its-artsy-fartsy-lights-2000708087"
  },
  {
    "text": "How to watch, listen and follow: Carolina vs. Los Angeles Rams in the Wild Card round - Panthers.com",
    "fullText": "The Panthers game will air on FOX at 4:30 p.m. ET.",
    "link": "https://www.panthers.com/news/how-to-watch-listen-and-follow-carolina-vs-los-angeles-rams-in-the-wild-card-round-playoffs"
  }
]