[
  {
    "text": "Trump says he may punish countries with tariffs if they don’t back the US controlling Greenland - AP News",
    "fullText": "U.S. President Donald Trump says he may punish countries with tariffs if they don’t back the U.S. controlling Greenland. Trump didn't provide details Friday. Trump for months has insisted that the U.S. should control Greenland, a semiautonomous territory of N…",
    "link": "https://apnews.com/article/denmark-greenland-us-trump-tariffs-c8c17c89cbc4ca9819eb728102d0a2b3"
  },
  {
    "text": "Trump bought $1M in Netflix, Warner Bros. bonds after merger announcement - The Washington Post",
    "fullText": "The president bought the bonds days after saying he’d be “involved” in deciding whether to approve the $83 billion deal.’",
    "link": "https://www.washingtonpost.com/business/2026/01/16/trump-bought-1m-netflix-warner-bros-bonds-after-merger-announcement/"
  },
  {
    "text": "Judge limits ICE’s crowd control tactics following Minneapolis shooting - Politico",
    "fullText": "The judge’s order prevents federal agents from arresting peaceful protesters.",
    "link": "https://www.politico.com/news/2026/01/16/ice-minneapolis-arrests-judge-protests-00735416"
  },
  {
    "text": "Ole Miss QB Trinidad Chambliss seeks injunction from Mississippi court against NCAA - On3",
    "fullText": "Ole Miss quarterback Trinidad Chambliss is suing the NCAA alleging over the NCAA's refusal to grant Chambliss another year of eligibility.",
    "link": "https://www.on3.com/news/ole-miss-qb-trinidad-chambliss-seeks-injunction-from-mississippi-court-against-ncaa/"
  },
  {
    "text": "Thinking Machines Cofounder’s Office Relationship Preceded His Termination - WIRED",
    "fullText": "Leaders at Mira Murati’s startup believe Barret Zoph engaged in an incident of “serious misconduct.” The details are now coming to light.",
    "link": "https://www.wired.com/story/thinking-machines-lab-cofounder-office-relationship-firing-openai/"
  },
  {
    "text": "Justice Dept. launches criminal investigation of Minnesota governor - The Washington Post",
    "fullText": "The Justice Department has issued subpoenas for Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey as part of an investigation into impeding law enforcement.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/16/trump-minnesota-walz-frey-criminal-investigation/"
  },
  {
    "text": "Billionaire developer Rick Caruso won’t run for California governor or LA mayor - Politico",
    "fullText": "The centrist Democrat seemed primed to return to political life after wildfires tore through the city last year, destroying his Pacific Palisades neighborhood.",
    "link": "https://www.politico.com/news/2026/01/16/rick-caruso-wont-run-for-governor-mayor-00735159"
  },
  {
    "text": "Toddler dies from flu in Virginia - The Washington Post",
    "fullText": "Virginia reported the state’s first pediatric death this flu season.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/16/flu-death-toddler-virginia/"
  },
  {
    "text": "‘The White Lotus’ Season 4 Casts Steve Coogan & Caleb Jonte Edwards - Deadline",
    "fullText": "'The White Lotus' Season 4 has tapped Steve Coogan and Caleb Jonte Edwards for undisclosed roles, Deadline has learned.",
    "link": "http://deadline.com/2026/01/the-white-lotus-season-4-steve-coogan-caleb-jonte-edwards-1236685698/"
  },
  {
    "text": "Rackspace customers grapple with “devastating” email hosting price hike - Ars Technica",
    "fullText": "Reseller says Rackspace plans to charge it 706 percent more.",
    "link": "https://arstechnica.com/information-technology/2026/01/rackspace-raises-email-hosting-prices-by-as-much-as-706-percent/"
  },
  {
    "text": "Some policy experts struggle to make sense of new Trump health plan - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/policy-experts-struggle-make-sense-new-trump-health/story?id\\\\u003d129261245"
  },
  {
    "text": "Rangers to retool roster, may trade popular players, Drury writes - NHL.com",
    "fullText": "GM says team must be ‘honest and realistic’ about our situation",
    "link": "https://www.nhl.com/news/new-york-rangers-gm-drury-team-needs-retool-may-trade-favorite-players"
  },
  {
    "text": "The two things AMD subtly revealed at CES that actually excite me - The Verge",
    "fullText": "AMD’s big CES 2026 announcements might have bored gamers, but we were able to find out about about lower Strix Halo system pricing and modular socketed notebook chips!",
    "link": "https://www.theverge.com/tech/862861/amd-ces-2026-socketed-laptop-chips-strix-halo-price"
  },
  {
    "text": "WEF: Donald Trump set to dominate Davos 2026 - dw.com",
    "fullText": "Davos braces for Trump's return. Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence is expected to raise the stakes at WEF's annual meeting.",
    "link": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182"
  },
  {
    "text": "Trump struck deals with 16 drug companies. But they're still raising prices this year - NPR",
    "fullText": "All 16 drug companies that inked deals with the Trump administration over the past few months still raised some of their prices for 2026.",
    "link": "https://www.npr.org/2026/01/16/nx-s1-5678915/trumprx-pharma-drug-price-deals-list-prices"
  },
  {
    "text": "Scientists Uncover Secrets to Tyrannosaurus Rex’s Lifespan - The Daily Beast",
    "fullText": "Turns out the T. rex was a late bloomer that lived longer than previously thought.",
    "link": "https://www.thedailybeast.com/scientists-uncover-secrets-to-tyrannosaurus-rexs-lifespan/"
  },
  {
    "text": "Matt Damon’s ‘The Rip’ Nearly Sets A Netflix Rotten Tomatoes Record - Forbes",
    "fullText": "The Rip releases today on Netflix starring Matt Damon and Ben Affleck, which has nearly set a record for the service on Rotten Tomatoes.",
    "link": "https://www.forbes.com/sites/paultassi/2026/01/16/matt-damons-the-rip-nearly-sets-a-netflix-rotten-tomatoes-record/"
  },
  {
    "text": "Cardiff University team helps find mysterious iron bar in space - BBC",
    "fullText": "Cardiff astronomers say they don't yet know where iron bar detected inside the Ring Nebula came from.",
    "link": "https://www.bbc.com/news/articles/ckgxlvv0wdko"
  }
]