[
  {
    "text": "Stocks are little changed after S&P 500 posts back-to-back losses: Live updates - CNBC",
    "fullText": "Stocks slipped on Monday as investors sold their tech holdings heading into the end of 2025.",
    "link": "https://www.cnbc.com/2025/12/29/stock-market-today-live-updates.html"
  },
  {
    "text": "2025 was so hot it pushed Earth past critical climate change mark, scientists say - CBS News",
    "fullText": "2025 was the third hottest year on record and pushed Earth past a critical climate change mark, scientists say.",
    "link": "https://www.cbsnews.com/news/climate-change-2025-critical-mark-eclipsed/"
  },
  {
    "text": "China flexes blockade capabilities near Taiwan on second day of military drills - NPR",
    "fullText": "China's People's Liberation Army is staging a second day of large-scale military drills around Taiwan. It's unleashing live-fire exercises as part of what it calls \"Justice Mission 2025.\"",
    "link": "https://www.npr.org/2025/12/30/g-s1-103963/china-flexes-blockade-capabilities-near-taiwan-on-second-day-of-military-drills"
  },
  {
    "text": "Saudi Arabia bombs Yemen port over weapons shipment from UAE and issues warning to Abu Dhabi - AP News",
    "fullText": "Saudi Arabia says it bombed Yemen’s port city of Mukalla over a shipment of weapons for a separatist force there that arrived from the United Arab Emirates. The attack signals a new escalation in tensions between the kingdom and the Southern Transitional Coun…",
    "link": "https://apnews.com/article/saudi-arabia-bomb-yemen-mukalla-weapons-uae-9fc56e4678a12f56d61b1ecf855d4a4e"
  },
  {
    "text": "Court releases transcript from closed hearing for man accused of killing Charlie Kirk - ABC News",
    "fullText": "A Utah judge has ordered the release of a transcript from a closed-door hearing in October over whether the man charged with killing Charlie Kirk must be shackled during court proceedings",
    "link": "https://abcnews.go.com/US/wireStory/judge-orders-release-transcript-closed-hearing-man-accused-128756352"
  },
  {
    "text": "Russian official threatens Zelenskyy as Moscow claims Kyiv attacked Putin residence - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/russian-official-threatens-zelenskyy-moscow-claims-kyiv-attacked/story?id\\\\u003d128774157"
  },
  {
    "text": "Somaliland: Why has Israel recognised the breakaway African state as independent? - BBC",
    "fullText": "Somaliland wants international recognition - here's why, and what could have driven Israel to recognise it now.",
    "link": "https://www.bbc.com/news/articles/c14v4kmg275o"
  },
  {
    "text": "Who is Nick Shirley, the 23-year-old MAGA journalist whose Minnesota fraud story went viral? - CNN",
    "fullText": "One week ago, few knew who 23-year-old Nick Shirley was. But in recent days he has burst into the public sphere, gaining hundreds of thousands of followers and millions of views, amplified by Elon Musk, Vice President JD Vance and FBI Director Kash Patel.",
    "link": "https://www.cnn.com/2025/12/30/media/nick-shirley-minnesota-somali-video"
  },
  {
    "text": "Monday Night Football: Falcons get a dramatic 27-24 win over the Rams - NBC Sports",
    "fullText": "Bijan Robinson 195 yards and scored two touchdowns for Atlanta.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/monday-night-football-falcons-get-a-dramatic-27-24-win-over-the-rams"
  },
  {
    "text": "Stephen Curry passes Kevin Garnett to reach No. 21 on all-time scoring list - NBA",
    "fullText": "Stephen Curry finishes with 27 points on Monday in Brooklyn, passing Kevin Garnett for No. 21 on the career points leaderboard.",
    "link": "https://www.nba.com/news/stephen-curry-passes-kevin-garnett-to-reach-no-21-on-all-time-scoring-list"
  },
  {
    "text": "Trump, top aides asked Netanyahu to change policy in occupied West Bank - Axios",
    "fullText": "Trump asked Netanyahu to avoid provocative steps and \"calm things down,\"",
    "link": "https://www.axios.com/2025/12/30/netanyahu-trump-west-bank-meeting-settlements"
  },
  {
    "text": "Full Moon January 2026: Exactly When To See A ‘Wolf Supermoon’ Rise - Forbes",
    "fullText": "Everything you need to know about January’s full Wolf Supermoon — including exactly when it’s full and the best evening to see it rise in dramatic twilight.",
    "link": "https://www.forbes.com/sites/jamiecartereurope/2025/12/29/full-moon-january-2026-exactly-when-to-see-a-wolf-supermoon-rise/"
  },
  {
    "text": "Nuggets’ Nikola Jokic suffers knee injury, leaves game in Miami - The Denver Post",
    "fullText": "Jokic limped to the locker room with a knee injury as the Nuggets finished a first half in Miami on Monday.",
    "link": "https://www.denverpost.com/2025/12/29/nikola-jokic-knee-injury-updates-nuggets-heat/"
  },
  {
    "text": "Trump says he might sue Fed Chair Jerome Powell for ‘gross incompetence’ - The Washington Post",
    "fullText": "It isn’t clear what specific claims could be brought against Powell or when.",
    "link": "https://www.washingtonpost.com/politics/2025/12/29/trump-powell-gross-incompetence-lawsuit/"
  },
  {
    "text": "'Mighty Ducks' star provides update on homeless Nickelodeon actor Tylor Chase after 36-hour medical hold - Entertainment Weekly",
    "fullText": "'The Mighty Ducks' star Shaun Weiss is providing an update on Tylor Chase, the 'Ned's Declassified School Survival Guide' actor experiencing homelessness and addiction.",
    "link": "https://ew.com/mighty-ducks-star-gives-update-on-homeless-nickelodeon-actor-tylor-chase-11877197"
  },
  {
    "text": "Chappell Roan Deletes Brigitte Bardot Tribute After Discovering Her Far-Right Views: “Very Disappointing” - The Hollywood Reporter",
    "fullText": "The Grammy winner previously named the late French actress in her song \"Red Wine Supernova.\"",
    "link": "http://www.hollywoodreporter.com/music/music-news/chappell-roan-deletes-brigitte-bardot-tribute-far-right-views-1236460412/"
  },
  {
    "text": "Cynthia Erivo's journey from nativity play solo to MBE - BBC",
    "fullText": "The London-born superstar is made an MBE in the New Year's Honours list for her musical and acting work.",
    "link": "https://www.bbc.com/news/articles/cdj8j94w04po"
  }
]