[
  {
    "text": "They quit their day jobs to bet on current events. A look inside the prediction market mania - NPR",
    "fullText": "Prediction market apps are thriving in Trump's second term, with traders betting on migrant deportations to election outcomes. A community of young, mostly male and very online traders are driving the industry's bonanza.",
    "link": "https://www.npr.org/2026/01/17/nx-s1-5672615/kalshi-polymarket-prediction-market-boom-traders-slang-glossary"
  },
  {
    "text": "TCL’s PlayCube projector is more fun than a Rubik’s Cube - The Verge",
    "fullText": "TCL’s PlayCube is very bright for a portable projector with a clever twisting design that doesn’t need a tripod.",
    "link": "https://www.theverge.com/reviews/863910/tcl-playcube-portable-projector-review-battery"
  },
  {
    "text": "Xi’s Enforcers Punished Nearly a Million in 2025—and China’s Leader Wants More - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/china/xis-enforcers-punished-nearly-a-million-in-2025and-chinas-leader-wants-more-019e1c65"
  },
  {
    "text": "Horoscope for Saturday, January 17, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/17/horoscopes-today-saturday-january-17-2026"
  },
  {
    "text": "Trump says he may punish countries with tariffs if they don’t back the US controlling Greenland - AP News",
    "fullText": "U.S. President Donald Trump says he may punish countries with tariffs if they don’t back the U.S. controlling Greenland. Trump didn't provide details Friday. Trump for months has insisted that the U.S. should control Greenland, a semiautonomous territory of N…",
    "link": "https://apnews.com/article/denmark-greenland-us-trump-tariffs-c8c17c89cbc4ca9819eb728102d0a2b3"
  },
  {
    "text": "Trump Purchased Netflix, Warner Bonds in Days After Deal Announcement - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/business/media/trump-purchased-netflix-warner-bonds-in-days-after-deal-announcement-2a5da67f"
  },
  {
    "text": "Jaylon Tyson punctuates career night with game-winning assist in Cavs’ 117-115 comeback over Sixers - Cleveland.com",
    "fullText": "The short-handed Cavs rallied back in the fourth quarter, stunning the Philadelphia 76ers, 117-115, on Friday night.",
    "link": "https://www.cleveland.com/cavs/2026/01/jaylon-tyson-punctuates-career-night-with-game-winning-assist-in-117-115-comeback-over-sixers.html"
  },
  {
    "text": "‘NFL Live’ crew horrified to realize they unanimously picked Texans to beat Patriots - Awful Announcing",
    "fullText": "When ESPN's \"NFL Live\" crew realized they had all selected the Houston Texans to upset the New England Patriots, they were horrified.",
    "link": "https://awfulannouncing.com/espn/nfl-live-horrified-unanimously-picked-texans-beat-patriots.html"
  },
  {
    "text": "Ongoing Southern California immigration raids sparking fear in communities - ABC7 Los Angeles",
    "fullText": "Activists say they are working nonstop to support immigrant communities in Southern California amid ongoing raids.",
    "link": "https://abc7.com/post/ongoing-southern-california-immigration-raids-sparking-fear-communities/18418011/"
  },
  {
    "text": "Justice Dept. launches criminal investigation of Minnesota governor - The Washington Post",
    "fullText": "The Justice Department has issued subpoenas for Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey as part of an investigation into impeding law enforcement.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/16/trump-minnesota-walz-frey-criminal-investigation/"
  },
  {
    "text": "Kianna Underwood, Who Appeared on Nickelodeon’s ‘All That,’ Killed in Brooklyn Hit-and-Run - Variety",
    "fullText": "Kianna Underwood, who appeared on Nickelodeon's \"All That,\" has been identified by media sources as victim of a hit-and-run accident Friday in Brooklyn.",
    "link": "https://variety.com/2026/tv/news/kianna-underwood-dead-nickelodeon-all-that-1236633609/"
  },
  {
    "text": "Toddler dies from flu in Virginia - The Washington Post",
    "fullText": "Virginia reported the state’s first pediatric death this flu season.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/16/flu-death-toddler-virginia/"
  },
  {
    "text": "Blair and Rubio among names on Gaza 'Board of Peace' - BBC",
    "fullText": "The former UK prime minister and US secretary of state will sit on the \"founding executive board\", the White House says.",
    "link": "https://www.bbc.com/news/articles/c07xv92vrz2o"
  },
  {
    "text": "Leon Slater’s WWE SmackDown Appearance Explained Amid TNA Absence - Ringside News",
    "fullText": "Leon Slater shocked fans when he stepped up to answer Carmelo Hayes’ United States Championship open challenge on the January 16 episode of WWE SmackDown.",
    "link": "https://www.ringsidenews.com/leon-slaters-wwe-smackdown-appearance-explained-amid-tna-absence/"
  },
  {
    "text": "Some policy experts struggle to make sense of new Trump health plan - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/policy-experts-struggle-make-sense-new-trump-health/story?id\\\\u003d129261245"
  },
  {
    "text": "Disastrous poll shows Trump’s White House return is a ‘failure’: Americans say he’s ‘gone too far’ - AL.com",
    "fullText": "There were virtually no silver linings for the president in the survey.",
    "link": "https://www.al.com/politics/2026/01/disastrous-poll-shows-trumps-white-house-return-is-a-failure-americans-say-hes-gone-too-far.html"
  },
  {
    "text": "US Invited To Greenland Military Exercises: Danish General To AFP - Barron's",
    "fullText": "",
    "link": "https://www.barrons.com/articles/us-invited-to-greenland-military-exercises-danish-general-to-afp-5a11ae50"
  },
  {
    "text": "Imaging technique captures ultrafast electron and atom dynamics in chemical reactions - Phys.org",
    "fullText": "During chemical reactions, atoms in the reacting substances break their bonds and re-arrange, forming different chemical products. This process entails the movement of both electrons (i.e., negatively charged particles) and nuclei (i.e., the positively charge…",
    "link": "https://phys.org/news/2026-01-imaging-technique-captures-ultrafast-electron.html"
  }
]