[
  {
    "text": "Xi’s Enforcers Punished Nearly a Million in 2025—and China’s Leader Wants More - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/china/xis-enforcers-punished-nearly-a-million-in-2025and-chinas-leader-wants-more-019e1c65"
  },
  {
    "text": "SpaceX launches its 1st national security mission of 2026, sending US spy satellites to orbit - Space",
    "fullText": "The NROL-105 mission lifted off from California on Friday (Jan. 16) at 11:39 p.m. ET.",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/spacex-nrol-105-spy-satellite-mission-launch"
  },
  {
    "text": "Trump says he may punish countries with tariffs if they don’t back the US controlling Greenland - AP News",
    "fullText": "U.S. President Donald Trump says he may punish countries with tariffs if they don’t back the U.S. controlling Greenland. Trump didn't provide details Friday. Trump for months has insisted that the U.S. should control Greenland, a semiautonomous territory of N…",
    "link": "https://apnews.com/article/denmark-greenland-us-trump-tariffs-c8c17c89cbc4ca9819eb728102d0a2b3"
  },
  {
    "text": "Penn State wrestling wins fifth straight match over Iowa, 79th in a row, with a 32-3 victory: Recap - On3",
    "fullText": "Penn State wrestling is back on the mat tonight. The No. 1 Nittany Lions are at No. 4 Iowa. Follow live updates here.",
    "link": "https://www.on3.com/teams/penn-state-nittany-lions/news/live-updates-penn-state-wrestling-at-iowa-score-bout-results-notes-and-more-from-the-top-five-showdown/"
  },
  {
    "text": "Jaylon Tyson punctuates career night with game-winning assist in Cavs’ 117-115 comeback over Sixers - Cleveland.com",
    "fullText": "The short-handed Cavs rallied back in the fourth quarter, stunning the Philadelphia 76ers, 117-115, on Friday night.",
    "link": "https://www.cleveland.com/cavs/2026/01/jaylon-tyson-punctuates-career-night-with-game-winning-assist-in-117-115-comeback-over-sixers.html"
  },
  {
    "text": "Trump thanks Iran for halting executions as allies discourage US from striking - AP News",
    "fullText": "President Donald Trump on Friday thanked the Iranian government for not executing hundreds of political prisoners, seemingly backing away from his suggestion of U.S. military strikes on Iran.",
    "link": "https://apnews.com/live/donald-trump-news-updates-1-16-2026"
  },
  {
    "text": "Ongoing Southern California immigration raids sparking fear in communities - ABC7 Los Angeles",
    "fullText": "Activists say they are working nonstop to support immigrant communities in Southern California amid ongoing raids.",
    "link": "https://abc7.com/post/ongoing-southern-california-immigration-raids-sparking-fear-communities/18418011/"
  },
  {
    "text": "Thinking Machines Cofounder’s Office Relationship Preceded His Termination - WIRED",
    "fullText": "Leaders at Mira Murati’s startup believe Barret Zoph engaged in an incident of “serious misconduct.” The details are now coming to light.",
    "link": "https://www.wired.com/story/thinking-machines-lab-cofounder-office-relationship-firing-openai/"
  },
  {
    "text": "Justice Dept. launches criminal investigation of Minnesota governor - The Washington Post",
    "fullText": "The Justice Department has issued subpoenas for Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey as part of an investigation into impeding law enforcement.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/16/trump-minnesota-walz-frey-criminal-investigation/"
  },
  {
    "text": "Projected Lineup: January 16 vs. Florida | Carolina Hurricanes - NHL.com",
    "fullText": "Carrier out, Gostisbehere doubtful; Bussi to start",
    "link": "https://www.nhl.com/hurricanes/news/projected-lineup-january-16-vs-florida"
  },
  {
    "text": "Toddler dies from flu in Virginia - The Washington Post",
    "fullText": "Virginia reported the state’s first pediatric death this flu season.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/16/flu-death-toddler-virginia/"
  },
  {
    "text": "Some policy experts struggle to make sense of new Trump health plan - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/policy-experts-struggle-make-sense-new-trump-health/story?id\\\\u003d129261245"
  },
  {
    "text": "Here's latest injury update on Seahawks QB Sam Darnold | Notebook - The Seattle Times",
    "fullText": "Seahawks coach Mike Macdonald said the team is “really optimistic\" quarterback Sam Darnold will be able to play in Saturday’s divisional playoff game against the 49ers.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-really-optimistic-qb-sam-darnold-plays-vs-49ers/"
  },
  {
    "text": "Disastrous poll shows Trump’s White House return is a ‘failure’: Americans say he’s ‘gone too far’ - AL.com",
    "fullText": "There were virtually no silver linings for the president in the survey.",
    "link": "https://www.al.com/politics/2026/01/disastrous-poll-shows-trumps-white-house-return-is-a-failure-americans-say-hes-gone-too-far.html"
  },
  {
    "text": "Trump admin gives positive update on visa processing freeze; 15 countries get big relief | Hindustan Times - Hindustan Times",
    "fullText": "The Trump administration has reassured thousands after announcing an indefinite suspension of processing immigrant visas for people from 75 countries",
    "link": "https://www.hindustantimes.com/world-news/us-news/trump-admin-gives-positive-update-on-visa-processing-freeze-15-countries-get-big-relief-101768586404806.html"
  },
  {
    "text": "Imaging technique captures ultrafast electron and atom dynamics in chemical reactions - Phys.org",
    "fullText": "During chemical reactions, atoms in the reacting substances break their bonds and re-arrange, forming different chemical products. This process entails the movement of both electrons (i.e., negatively charged particles) and nuclei (i.e., the positively charge…",
    "link": "https://phys.org/news/2026-01-imaging-technique-captures-ultrafast-electron.html"
  },
  {
    "text": "Scientists Uncover Secrets to Tyrannosaurus Rex’s Lifespan - The Daily Beast",
    "fullText": "Turns out the T. rex was a late bloomer that lived longer than previously thought.",
    "link": "https://www.thedailybeast.com/scientists-uncover-secrets-to-tyrannosaurus-rexs-lifespan/"
  }
]