[
  {
    "text": "Judge blocks Pete Hegseth's censure of Sen. Mark Kelly over troops video, for now - CNBC",
    "fullText": "The order comes days after federal prosecutors in Washington, D.C., tried and failed to get a grand jury to indict Sens. Mark Kelly and Elissa Slotkin.",
    "link": "https://www.cnbc.com/2026/02/12/kelly-hegseth-pentagon-trump-censure.html"
  },
  {
    "text": "Nancy Guthrie disappearance: Investigators find a set of gloves along road as search enters 12th day - Fox News",
    "fullText": "Investigators found a set of gloves amid the investigation into Nancy Guthrie's disappearance. The FBI conducted an \"extensive search\" Wednesday along multiple roadways in the Catalina Foothills area north of Tucson, Arizona, and continues to offer a $50,000 …",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-investigators-find-a-set-of-gloves-along-road-as-search-enters-12th-day"
  },
  {
    "text": "Jessie Diggins collapses in pain after securing bronze in Winter Olympics - NBC News",
    "fullText": "Jessie Diggins of the United States battled through injury to claim bronze Thursday in the women's 10‑kilometer interval start, a race dominated by Sweden's Frida Karlsson as she won her second gold medal at the Winter Olympics.",
    "link": "https://www.nbcnews.com/sports/olympics/jessie-diggins-collapses-bronze-winter-olympics-rcna258725"
  },
  {
    "text": "‘I don’t think he’s funny’: Zion Clark, wrestler born without legs, fires back at UFC heavyweight Valter Walker before fight - MMA Fighting",
    "fullText": "Zion Clark, Valter Walker will compete at Karate Combat on Friday",
    "link": "https://www.mmafighting.com/latest-news/471238/i-dont-think-hes-funny-zion-clark-wrestler-born-without-legs-ready-for-war-against-ufc-heavyweight-valter-walker"
  },
  {
    "text": "January homes sales tank more than 8%, as Realtors say potential buyers are 'struggling' - CNBC",
    "fullText": "Home sales in January fell more than expected as mortgage rates didn't move much and consumer confidence dropped.",
    "link": "https://www.cnbc.com/2026/02/12/january-homes-sales.html"
  },
  {
    "text": "Exclusive | Two U.S. Navy Ships Collide in Waters Near South America - The Wall Street Journal",
    "fullText": "Two personnel report minor injuries after ship-to-ship refueling",
    "link": "https://www.wsj.com/us-news/two-u-s-navy-ships-collide-in-waters-near-south-america-e7480637"
  },
  {
    "text": "EU leaders meet to counter pressure from Russia, China and Trump - AP News",
    "fullText": "European Union leaders are gathering in Belgium as the bloc argues over how to stand up to pressure from the United States, China and Russia. They are meeting Thursday in a Belgian castle in a session meant to shape another summit in late March. German and It…",
    "link": "https://apnews.com/article/europe-eu-trump-china-russia-rethink-6461ea032aa4e3aa8e133bc5080ab922"
  },
  {
    "text": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina - BBC",
    "fullText": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "link": "https://www.bbc.com/news/articles/cy7jdmvn3l0o"
  },
  {
    "text": "Using GLP-1s to maintain a normal weight? There are benefits and risks - NPR",
    "fullText": "Drugs like Zepbound and Wegovy are intended for people who are overweight. Some patients are using them after bariatric surgery to keep pounds from creeping back. Others may just want to lose a few pounds.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5711686/glp1-obesity-normal-weight-loss-bmi"
  },
  {
    "text": "Diablo II: Resurrected finally joins Xbox Game Pass after new DLC drop - TrueAchievements",
    "fullText": "To celebrate Diablo's 30th Anniversary, Blizzard has finally added Diablo II: Resurrected to Xbox Game Pass, as well as released a brand-new DLC pack.",
    "link": "https://www.trueachievements.com/news/diablo-ii-resurrected-xbox-game-pass"
  },
  {
    "text": "Team USA decides on starting goalie for 2026 Winter Olympics opener - New York Post",
    "fullText": "Team USA isn’t overthinking its last line of defense.",
    "link": "https://nypost.com/2026/02/12/sports/team-usa-decides-to-start-connor-hellebuyck-for-2026-winter-olympics-opener/"
  },
  {
    "text": "Watch Live: Minnesota officials testify at Senate hearing on immigration - CBS News",
    "fullText": "The leaders of three major immigration agencies are testifying before the Senate Homeland Security Committee on Thursday.",
    "link": "https://www.cbsnews.com/live-updates/minnesota-immigration-ice-hearing-senate-homeland-security/"
  },
  {
    "text": "‘Wuthering Heights’ and the birth of the toxic boyfriend - The Washington Post",
    "fullText": "A new movie of “Wuthering Heights” by feminist director Emerald Fennell grapples with the Catherine and Heathcliff Problem. Their dysfunction is irresistible.",
    "link": "https://www.washingtonpost.com/style/2026/02/12/wuthering-heights-movie-heathcliff/"
  },
  {
    "text": "The business of not ageing: Why people are spending $1,300 on longevity treatments - BBC",
    "fullText": "The growing longevity industry is selling a big aspiration – the ability to slow your biological clock, but how credible is this?",
    "link": "https://www.bbc.com/worklife/article/20260211-the-business-of-not-ageing"
  },
  {
    "text": "Russia shrugs off Trump’s tariff threats on those who provide oil to Cuba - CNBC",
    "fullText": "The comments came in response to a question about whether Russia was concerned about the Trump administration's tariff threats.",
    "link": "https://www.cnbc.com/2026/02/12/cuba-fuel-shortage-oil-russia-trump-tariffs.html"
  },
  {
    "text": "How the FBI might have gotten inaccessible camera footage from Nancy Guthrie's house - NPR",
    "fullText": "Last week, law enforcement said video footage from Nancy Guthrie's doorbell camera was overwritten. But the FBI has since released footage as Guthrie still has not been found.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5711620/nancy-guthrie-video-footage-fbi"
  },
  {
    "text": "Free speech lawsuits mount after Charlie Kirk assassination - NPR",
    "fullText": "Months after the killing of Charlie Kirk, a growing number of lawsuits by people claim they were illegally punished, fired and even arrested for making negative comments about Kirk.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5667213/free-speech-lawsuits-since-kirk-killing"
  },
  {
    "text": "Mark Zuckerberg is joining Jeff Bezos in Miami’s billionaire bunker: Take a look inside his real estate portfolio - Fortune",
    "fullText": "The Meta CEO has spent a decade accumulating luxury properties, including a secretive ranch with an underground shelter and a Lake Tahoe mountain retreat.",
    "link": "https://fortune.com/2026/02/12/meta-ceo-mark-zuckerberg-billionaire-bunker-indian-creek-island-miami-luxury-homes/"
  }
]