[
  {
    "text": "S&P 500 falls for a second day after AMD earnings, weak jobs data: Live updates - CNBC",
    "fullText": "Tech put on the worst performance of the 11 sectors in the S&P 500, falling more than 2% on Tuesday.",
    "link": "https://www.cnbc.com/2026/02/03/stock-market-today-live-updates.html"
  },
  {
    "text": "Xi Holds Phone Call With Trump, Xinhua Reports - Bloomberg.com",
    "fullText": "US President Donald Trump and President Xi Jinping of China discussed trade and geopolitical flashpoints, including Taiwan, during a Wednesday call ahead of a planned face-to-face meeting later this year.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-04/xi-holds-phone-call-with-trump-xinhua-reports"
  },
  {
    "text": "Live updates: Trump's 'border tsar' Tom Homan gives update from Minneapolis - BBC",
    "fullText": "Tom Homan took over Trump's immigration crackdown in Minnesota after the deaths of Alex Pretti and Renee Good.",
    "link": "https://www.bbc.com/news/live/czej4253kw4t"
  },
  {
    "text": "‘The Muppet Show’ refuses to modernize in its triumphant revival - washingtonpost.com",
    "fullText": "On the 50th anniversary of Jim Henson’s show, the Muppets — with a boost from guest star Sabrina Carpenter — pick up exactly where they left off.",
    "link": "https://www.washingtonpost.com/entertainment/tv/2026/02/04/muppet-show-50th-anniversary-special/"
  },
  {
    "text": "Mike LaFleur: If Cardinals job was easy, it wouldn’t be worth it - NBC Sports",
    "fullText": "Mike LaFleur is the new head coach in Arizona, but he's not new to life in the NFC West.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/mike-lafleur-if-cardinals-job-was-easy-it-wouldnt-be-worth-it"
  },
  {
    "text": "Sixth child in Mass. dies of flu - WCVB",
    "fullText": "To date this season, there have been 193 influenza deaths, including six children.",
    "link": "https://www.wcvb.com/article/massachusetts-sixth-pediatric-flu-death/70244237"
  },
  {
    "text": "Iran Plays Hardball With the U.S. to Throw It Off Balance - The Wall Street Journal",
    "fullText": "Diplomatic and military provocations on display this week point to fraught negotiations ahead",
    "link": "https://www.wsj.com/world/middle-east/iran-plays-hardball-with-the-u-s-to-throw-it-off-balance-6df2a1ad"
  },
  {
    "text": "Ole Miss coach Chris Beard ejected in wild scene - New York Post",
    "fullText": "The Ole Miss coach grew tired of watching what he believed to be a one-sided whistle during an 84-66 road loss to No. 25 Tennessee and finally snapped with 6:15 remaining in the game.",
    "link": "https://nypost.com/2026/02/04/sports/ole-miss-coach-chris-beard-ejected-in-wild-scene/"
  },
  {
    "text": "The last US-Russian nuclear pact is about to expire, ending a half-century of arms control - AP News",
    "fullText": "The last remaining nuclear arms pact between Russia and the United States is set to expire this week, removing any caps on the two largest atomic arsenals for the first time in more than a half-century. The end of the New START Treaty sets the stage for what …",
    "link": "https://apnews.com/article/russia-us-nuclear-weapons-treaty-putin-trump-5b1af24b0b3e65a8acb6ca7153018beb"
  },
  {
    "text": "We Tested 35 Phones for the Best Battery Life. These 2 Brands Topped the Field - CNET",
    "fullText": "Phone battery life has always been important, but which brands consistently offer the longest battery life? After extensive testing, we've found the two leaders.",
    "link": "https://www.cnet.com/tech/mobile/best-phones-for-battery-life-we-tested/"
  },
  {
    "text": "The 60 Greatest Moments in Super Bowl History - Sports Illustrated",
    "fullText": "From the unforgettable helmet catch to Prince lighting up the halftime show, a comprehensive ranking of the most iconic moments from the big game.",
    "link": "https://www.si.com/nfl/the-60-greatest-moments-in-super-bowl-history-digital-cover"
  },
  {
    "text": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "fullText": "Lawyers for the unnamed woman claim she was 'treated like a prostitute' at Jeffrey Epstein's home.",
    "link": "https://www.bbc.com/news/articles/ckgkjj5e28ko"
  },
  {
    "text": "Yum Brands posts mixed quarter, Taco Bell shines - CNBC",
    "fullText": "Taco Bell's same-store sales spiked 7% in the quarter.",
    "link": "https://www.cnbc.com/2026/02/04/yum-brands-yum-q4-2025-earnings.html"
  },
  {
    "text": "So yeah, I vibe-coded a log colorizer—and I feel good about it - Ars Technica",
    "fullText": "Some semi-unhinged musings on where LLMs fit into my life—and how I'll keep using them.",
    "link": "https://arstechnica.com/features/2026/02/so-yeah-i-vibe-coded-a-log-colorizer-and-i-feel-good-about-it/"
  },
  {
    "text": "Ukrainians Defy Russia’s Attempts to Freeze Them Into Submission - Bloomberg.com",
    "fullText": "With the temperature plunging and blackouts persisting, Europe worries how long Ukraine can hold out.",
    "link": "https://www.bloomberg.com/news/features/2026-02-04/ukrainians-defy-russia-s-attempts-to-freeze-them-into-submission"
  },
  {
    "text": "The 10 races that will decide control of the US Senate - CNN",
    "fullText": "In the fight for control of the US Senate, the majority may come down to which factor carries more weight: the map or the environment.",
    "link": "https://www.cnn.com/2026/02/04/politics/senate-races-february-2026"
  },
  {
    "text": "Trump grants tariff breaks to 'politically connected' companies, Senate Dems say - NPR",
    "fullText": "The White House's trade policy has \"opened the door to corruption,\" according to a letter from Ron Wyden and Chris Van Hollen.",
    "link": "https://www.npr.org/2026/02/04/nx-s1-5698264/trump-wyden-van-hollen-tariffs-politically-connected-companies"
  },
  {
    "text": "Ryan Routh, convicted of trying to assassinate Donald Trump, to be sentenced - NPR",
    "fullText": "A Secret Service agent saw Ryan Routh with a rifle at a golf course in Florida and fired on him in 2024 as Trump was golfing. He was found guilty of attempting to assassinate a presidential candidate.",
    "link": "https://www.npr.org/2026/02/04/nx-s1-5693102/ryan-routh-sentence-assassination-attempt-donald-trump"
  }
]