[
  {
    "text": "Builders Push ‘Trump Homes’ to Win Backing for a Million Houses - Bloomberg",
    "fullText": "Builders are working on a plan for a massive program to develop “Trump Homes” that would address the US affordability crisis while allowing private capital to deploy many billions of dollars.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-03/builders-push-trump-homes-to-win-backing-for-a-million-houses"
  },
  {
    "text": "North Carolina teen who killed brother and 4 neighbors in 2022 attack to be sentenced - NBC News",
    "fullText": "Austin Thompson, the North Carolina teenager who killed his brother and four neighbors in a violent 2022 rampage, will be sentenced in a hearing that began Tuesday.",
    "link": "https://www.nbcnews.com/news/us-news/north-carolina-teen-killed-brother-4-neighbors-2022-attack-sentenced-rcna257219"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News - Forbes",
    "fullText": "The Samsung Galaxy S26 Ultra release date has been confirmed, but some of the new specifications reveal disappointing news.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/02/03/samsung-galaxy-s26-ultra-release-date-leak-battery-spec/"
  },
  {
    "text": "Satellite imagery shows where the U.S. military is positioned near Iran - The Washington Post",
    "fullText": "The scale of the buildup seems aimed at readying forces for expansive operations, analysts said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/03/trump-iran-military-equipment-strikes/"
  },
  {
    "text": "Coming to Xbox Game Pass: High on Life 2, Madden NFL 26, Avatar: Frontiers of Pandora, and More - Xbox Wire",
    "fullText": "Coming soon to Xbox Game Pass: High on Life 2, Madden NFL 26, Avatar: Frontiers of Pandora, and more!",
    "link": "https://news.xbox.com/en-us/2026/02/03/xbox-game-pass-february-2026-wave-1/"
  },
  {
    "text": "Google Home finally adds support for buttons - The Verge",
    "fullText": "An update allows programmable switches, also known as buttons, to work in Google’s smart home platform.",
    "link": "https://www.theverge.com/tech/872927/google-home-button-support-arrives"
  },
  {
    "text": "Peter Mandelson lobbied against US bank reforms on behalf of Jeffrey Epstein and Jes Staley - Financial Times",
    "fullText": "Former UK business secretary used talking points in conversations with US official about financial crisis measures",
    "link": "https://www.ft.com/content/e50f2f0a-f1b5-4c6d-b4c0-58435dbc9b63"
  },
  {
    "text": "Pfizer beats quarterly estimates despite Covid product decline, reaffirms modest outlook - CNBC",
    "fullText": "The pharmaceutical giant reaffirmed the modest 2026 outlook that rattled investors in December.",
    "link": "https://www.cnbc.com/2026/02/03/pfizer-pfe-earnings-q4-2025.html"
  },
  {
    "text": "Russia ends 'week-long pause' with major attack on Ukraine energy sites - BBC",
    "fullText": "The attack - which reportedly consisted of more than 70 missiles and 450 drones - comes after a so-called \"energy truce\" expired at the weekend.",
    "link": "https://www.bbc.com/news/articles/cpwng25114ro"
  },
  {
    "text": "PepsiCo earnings beat estimates as drinks sales pick up around the world - CNBC",
    "fullText": "PepsiCo reported fourth-quarter earnings and revenue that topped Wall Street's estimates.",
    "link": "https://www.cnbc.com/2026/02/03/pepsico-pep-q4-2025-earnings.html"
  },
  {
    "text": "As some states try to show ICE the door, others put out the welcome mat - NPR",
    "fullText": "After ICE federal agents killed two U.S. citizens in Minnesota, the divide between states on either side of the immigration enforcement debate is growing wider.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697380/ice-immigrants-minnesota-state-law"
  },
  {
    "text": "Trump prepares to let go of arms control with Russia - Politico",
    "fullText": "Russian and U.S. nuclear arsenals could expand for the first time in three decades.",
    "link": "https://www.politico.com/news/2026/02/03/the-last-us-nuclear-weapons-treaty-with-russia-is-dying-00761240"
  },
  {
    "text": "Record-breaking snow blankets Japan, killing at least 30 people - Al Jazeera",
    "fullText": "Japan deploys troops to help residents and warns people to watch for avalanches and snow falling from roofs.",
    "link": "https://www.aljazeera.com/news/2026/2/3/record-breaking-snow-blankets-japan-killing-at-least-30-people"
  },
  {
    "text": "Instant observations: Dominick Barlow's career-best performance powers an easy Sixers win over Clippers - PhillyVoice",
    "fullText": "The best game of Dominick Barlow's young, promising NBA career lifted the Sixers past the Los Angeles Clippers, who may or may not be on the verge of trading James Harden.",
    "link": "https://www.phillyvoice.com/sixers-vs-clippers-box-score-stats-highlights-joel-embiid-tyrese-maxey-nick-nurse-jared-mccain-dominick-barlow-nba-rumors/"
  },
  {
    "text": "An internal document shows the Vietnamese military preparing for a possible American war - AP News",
    "fullText": "An internal document reveals Vietnam's military is preparing for a possible American war of aggression, viewing the U.S. as a \"belligerent\" power. The document, reported Tuesday, highlights Vietnam's fear of a U.S.-backed uprising similar to past \"color revol…",
    "link": "https://apnews.com/article/vietnam-us-war-planning-china-115c4f9bc69d91e7afe6b4dba7dc460f"
  },
  {
    "text": "Sherri Shepherd’s Daytime Talk Show Canceled, Citing “Evolving Daytime Television Landscape” - The Hollywood Reporter",
    "fullText": "Debmar-Mercury says it will try to explore alternatives for the program on other platforms.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/sherri-shepherd-daytime-talk-show-canceled-tough-tv-market-1236493443/"
  },
  {
    "text": "UIL realignment winners and losers: 11-6A remains the ‘District of Doom’ - Dallas News",
    "fullText": "Every realignment cycle, you have head coaches who breathe a sigh of relief looking at their new district. Others, not so much.",
    "link": "https://www.dallasnews.com/high-school-sports/football/2026/02/02/uil-realignment-winners-and-losers-11-6a-remains-the-district-of-doom/"
  },
  {
    "text": "Lab-grown algae remove microplastics from water - Phys.org",
    "fullText": "A University of Missouri researcher is pioneering an innovative solution to remove tiny bits of plastic pollution from our water. Mizzou's Susie Dai recently applied a revolutionary strain of algae toward capturing and removing harmful microplastics from poll…",
    "link": "https://phys.org/news/2026-02-lab-grown-algae-microplastics.html"
  },
  {
    "text": "Measles case confirmed in UW-Madison student - Channel 3000",
    "fullText": "MADISON, Wis. -- The Wisconsin Department of Health Services (DHS) and Public Health Madison Dane County on Monday confirmed a case of measles in a UW-Madison student.",
    "link": "https://www.channel3000.com/news/measles-case-confirmed-in-uw-madison-student/article_e42d7306-cda6-4d91-b7d3-49364c21bc19.html"
  },
  {
    "text": "Free HIV drugs save lives. Why one state is restricting access for thousands. - The Washington Post",
    "fullText": "An estimated 16,000 HIV and AIDS patients in Florida might lose free medication, health care as the state dramatically rolls back a decades-old program.",
    "link": "https://www.washingtonpost.com/health/2026/02/01/florida-hiv-adap-cuts/"
  }
]