[
  {
    "text": "Verizon Posts Strong Subscriber Gains Under New CEO - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/business/telecom/verizon-vz-q4-earnings-report-2025-70b537de"
  },
  {
    "text": "Rule the Maelstrom with Huron and his crew’s spicy new datasheets - Warhammer Community",
    "fullText": "Rules revealed for the Masters of the Maelstrom.",
    "link": "https://www.warhammer-community.com/articles/2fdhlf7g/rule-the-maelstrom-with-huron-and-his-crews-spicy-new-datasheets"
  },
  {
    "text": "Gold faces more headwinds as U.S. inflation threat remains - KITCO",
    "fullText": "The Kitco News Team brings you the latest news, videos, analysis and opinions regarding Precious Metals, Crypto, Mining, World Markets and Global Economy.",
    "link": "https://www.kitco.com/news/article/2026-01-30/gold-faces-more-headwinds-us-inflation-threat-remains"
  },
  {
    "text": "Twist in Kirk Cousins-Falcons drama with release coming after $180 million bust - nypost.com",
    "fullText": "The Falcons still like Kirk Cousins — just not for anything close to $68 million.",
    "link": "https://nypost.com/2026/01/30/sports/twist-in-kirk-cousins-falcons-drama-with-release-coming-after-180-million-bust/"
  },
  {
    "text": "Ford to record $600 million pretax pension charge in fourth quarter - CNBC",
    "fullText": "Ford will report a pretax charge of $600 million in its fourth quarter results due to adjustments to employee pension plans and other postretirement benefits.",
    "link": "https://www.cnbc.com/2026/01/30/ford-q4-earnings-pension-charge.html"
  },
  {
    "text": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "fullText": "Israel says it will reopen Gaza’s border crossing with Egypt in both directions over the weekend. The move announced on Friday will allow Palestinians to enter and leave the territory after nearly two years of near-complete closure. The Israeli military body …",
    "link": "https://apnews.com/article/israel-palestinians-gaza-rafah-border-crossing-reopening-823d4b0aef641c3f19d4cc7b527325b1"
  },
  {
    "text": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions - The Washington Post",
    "fullText": "Lawmakers called for the Office of the Director of National Intelligence to explain the presence of the nation’s top spy at a domestic law enforcement action in Georgia.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/30/tulsi-gabbard-fulton-county-fbi-raid/"
  },
  {
    "text": "Giving to donor-advised funds surges on expiring tax cuts and a hot stock market - CNBC",
    "fullText": "DAFgiving360 reported donors gave a record $9.9 billion to charities in 2025, up 28% from the prior year.",
    "link": "https://www.cnbc.com/2026/01/30/donor-advised-fund-giving-tax-cuts-stocks-soar.html"
  },
  {
    "text": "Microsoft is experimenting with a top menu bar for Windows 11 - The Verge",
    "fullText": "Microsoft is testing a new top menu bar for Windows 11. The PowerToys team want to build a dock that can provide access to tools and more.",
    "link": "https://www.theverge.com/news/870663/microsoft-windows-11-top-menu-bar-powertoy-experiment"
  },
  {
    "text": "Janet Mills’ first TV ad hits ICE - Politico",
    "fullText": "The ad uses footage of the Maine governor criticizing the agency in a speech this week.",
    "link": "https://www.politico.com/news/2026/01/30/janet-mills-tv-ad-ice-00756765"
  },
  {
    "text": "Live updates: Nor'easter 'bomb cyclone' to blast Carolinas with heavy snow and coastal flooding - FOX Weather",
    "fullText": "Parts of the Carolinas could see their heaviest snowfall in years as a massive nor'easter brings up to a foot of snow and dangerous winds.",
    "link": "https://www.foxweather.com/live-news/live-updates-nor-easter-bomb-cyclone-to-blast-carolinas-with-heavy-snow-and-coastal-flooding"
  },
  {
    "text": "Minnesota Dems are trying to walk a tightrope with Trump - Politico",
    "fullText": "Dems have struck a fragile and uneasy peace with the president. Everyone’s holding their breath.",
    "link": "https://www.politico.com/news/2026/01/30/walz-frey-trump-relationship-00756790"
  },
  {
    "text": "Hong Kong company’s concession to operate Panama Canal ports is ruled unconstitutional - AP News",
    "fullText": "Panama’s president has vowed that critical ports at both ends of the Panama Canal will continue to operate without interruption. President José Raúl Mulino spoke in a recorded message on Friday after the country’s Supreme Court ruled that the concession held …",
    "link": "https://apnews.com/article/panama-canal-ports-us-china-b5fe3cdcc1fce45dbf1b0843a620830a"
  },
  {
    "text": "Horoscope for Friday, January 30, 2026 - chicago.suntimes.com",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/30/horoscopes-today-friday-january-30-2026"
  },
  {
    "text": "UFC 325 loses fight after controversial weigh-in failure - MMA Fighting",
    "fullText": "UFC 325 is down a fight after a strange weigh-in, but Alexander Volkanovski vs. Diego Lopes 2 is on for Saturday.",
    "link": "https://www.mmafighting.com/ufc/468867/ufc-325-weigh-in-results-alexander-volkanovski-diego-lopes-locked-in-for-rematch-1-fight-cancelled-after-scale-controversy"
  },
  {
    "text": "2026 Senior Bowl: Daniel Jeremiah's top 10 standouts from week of practice - NFL.com",
    "fullText": "Which 2026 NFL Draft prospects stood out the most during the week of practices at the Senior Bowl? Daniel Jeremiah highlights 10 players who helped themselves heading into Saturday's all-star game.",
    "link": "https://www.nfl.com/news/2026-senior-bowl-daniel-jeremiah-s-top-10-standouts-from-week-of-practice"
  },
  {
    "text": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke - TMZ",
    "fullText": "\"The Blind Side\" star Quinton Aaron's family is revealing what led to his hospitalization ... they tell us he suffered a spinal stroke.",
    "link": "https://www.tmz.com/2026/01/29/quinton-aaron-suffered-spinal-stroke/"
  }
]