[
  {
    "text": "These services are at risk if the government shuts down again - Axios",
    "fullText": "A partial shutdown is set for midnight Friday if Congress can't reach a funding deal.",
    "link": "https://www.axios.com/2026/01/29/government-shutdown-irs-refund-social-security"
  },
  {
    "text": "Hong Kong company’s concession to operate Panama Canal ports is ruled unconstitutional - AP News",
    "fullText": "Panama’s Supreme Court has ruled that the concession held by a subsidiary of Hong Kong’s CK Hutchison Holdings to operate ports at either end of the Panama Canal is unconstitutional, an outcome that advances a U.S. aim to block any influence by China over the…",
    "link": "https://apnews.com/article/panama-canal-ports-us-china-b5fe3cdcc1fce45dbf1b0843a620830a"
  },
  {
    "text": "Flagg sets NBA single-game scoring record for teenager - theScore.com",
    "fullText": "Cooper Flagg had another signature performance Thursday, posting a career-high 49 points in the Dallas Mavericks' 123-121 loss to the Charlotte Hornets.The 19-year-old's 49-point outburst is the highest-scoring game by a teenager in league history.Flagg also …",
    "link": "https://thescore.com/nba/news/3467422"
  },
  {
    "text": "'The PItt' Season 2: How Tracy Ifeachor's Character Is Written Out - Deadline",
    "fullText": "'The Pitt' explains what Tracy Ifeachor's character Dr. Collins has moved on to do following actor's exit.",
    "link": "http://deadline.com/2026/01/the-pitt-tracy-ifeachor-dr-collins-exit-explained-season-2-1236629934/"
  },
  {
    "text": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody - mprnews.org",
    "fullText": "The children were taken into ICE custody after their mother was detained at a court appointment. School leaders say the mother asked them to bring the kids to the detention center because there were no family members in Minnesota to care for them.",
    "link": "https://www.mprnews.org/story/2026/01/29/2-more-kids-from-liam-ramos-columbia-heights-school-in-ice-custody"
  },
  {
    "text": "2026 Senior Bowl: Daniel Jeremiah's top 10 standouts from week of practice - NFL.com",
    "fullText": "Which 2026 NFL Draft prospects stood out the most during the week of practices at the Senior Bowl? Daniel Jeremiah highlights 10 players who helped themselves heading into Saturday's all-star game.",
    "link": "https://www.nfl.com/news/2026-senior-bowl-daniel-jeremiah-s-top-10-standouts-from-week-of-practice"
  },
  {
    "text": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke - TMZ",
    "fullText": "\"The Blind Side\" star Quinton Aaron's family is revealing what led to his hospitalization ... they tell us he suffered a spinal stroke.",
    "link": "https://www.tmz.com/2026/01/29/quinton-aaron-suffered-spinal-stroke/"
  },
  {
    "text": "Can Silicon Valley make a governor? Matt Mahan is betting yes - Politico",
    "fullText": "For all the region’s financial and cultural heft, the bastion of Big Tech has been a cul-de-sac of political power in California.",
    "link": "https://www.politico.com/news/2026/01/29/can-silicon-valley-make-a-governor-matt-mahan-is-betting-yes-00756444"
  },
  {
    "text": "Your Halo Story | Halo - Official Site (en) - Halo Waypoint",
    "fullText": "<p>I’m obsessed with stories. This comes as a shock to many of you, I know. These days when we hear the term, the immediate association is likely with penwoven narratives underpinning myriad entertainment properties and creative content. Or perhaps some varia…",
    "link": "https://www.halowaypoint.com/news/your-halo-story-chapter-01"
  },
  {
    "text": "The Artificial Intelligence (AI) Stock That Refuses to Stay Down - The Motley Fool",
    "fullText": "This company works closely with AI leader Nvidia.",
    "link": "https://www.fool.com/investing/2026/01/29/the-artificial-intelligence-ai-stock-that-refuses/"
  },
  {
    "text": "Man who squirted apple cider vinegar on Omar is charged with assaulting and intimidating her - AP News",
    "fullText": "The Justice Department has charged a man who squirted apple cider vinegar on Democratic U.S. Rep. Ilhan Omar at an event in Minneapolis. The man arrested for Tuesday’s attack, Anthony Kazmierczak, faces a charge of forcibly assaulting, opposing, impeding and …",
    "link": "https://apnews.com/article/ihan-omar-vinegar-attack-minneapolis-385a30eaf6acc40d6ba5c6c45c09304d"
  },
  {
    "text": "Massachusetts on \"razor's edge\" with weekend storm. Maps show best chance for snow, high winds. - CBS News",
    "fullText": "It does not appear that the storm will track close enough to New England to deliver what could have been, a devastating and destructive blow.",
    "link": "https://www.cbsnews.com/boston/news/massachusetts-snow-map-boston-storm-bombogenesis/"
  },
  {
    "text": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "fullText": "\"It is amazing to see that we are gradually moving towards combining these breakthrough observations across multiple frequencies and completing the picture of the jet launching region.\"",
    "link": "https://www.space.com/astronomy/black-holes/astronomers-watch-1st-black-hole-ever-imaged-launch-a-3-000-light-year-long-cosmic-jet-from-its-glowing-shadow"
  },
  {
    "text": "Halley wasn't the first to figure out the famous comet. An 11th-century monk did it first, new research suggests. - Live Science",
    "fullText": "An 11th-century monk saw the famous \"Halley's comet\" first as a child and later as an adult, new research finds.",
    "link": "https://www.livescience.com/archaeology/halley-wasnt-the-first-to-figure-out-the-famous-comet-an-11th-century-monk-did-it-first-new-research-suggests"
  },
  {
    "text": "Trump says Putin will not attack Ukraine cities during cold week - BBC",
    "fullText": "Ukraine's Air Force said regions near the front line had been targeted by drones and a ballistic missile overnight.",
    "link": "https://www.bbc.com/news/articles/c4g4yj92kwro"
  },
  {
    "text": "Landmark crypto bill clears Senate hurdle but Democrats withhold support over lack of 'gryfto' rules to prevent Trump family conflicts of interest - Fortune",
    "fullText": "The blockchain industry has raised millions in fresh funding to advance its political agenda in Washington, D.C.",
    "link": "https://fortune.com/2026/01/29/clarity-act-gryfto-crypto-senate-agriculture-committee-booker-trump-banking/"
  },
  {
    "text": "Trump’s wide ambitions for Board of Peace spark new support for the United Nations - AP News",
    "fullText": "President Donald Trump’s latest attempt to sidestep the United Nations through his new Board of Peace appears to have inadvertently backfired. Major world powers have rejected U.S. aspirations for the board to have a larger international mandate beyond the Ga…",
    "link": "https://apnews.com/article/board-peace-trump-un-security-council-china-df62e5087f3e8097f856c637a75cbc51"
  },
  {
    "text": "ESPN drops top 50 NFL free agents of 2026, 4 of top 21 are Packers - Acme Packing Company",
    "fullText": "Assume that the Green Bay Packers will end up with four ‘27 compensatory draft picks from their ‘26 free agency losses.",
    "link": "https://www.acmepackingcompany.com/green-bay-packers-free-agency/78932/espn-drops-top-50-nfl-free-agents-of-2026-4-of-top-21-are-packers"
  }
]