[
  {
    "text": "Eli Lilly blows past quarterly estimates, posts strong outlook as Zepbound and Mounjaro sales soar - CNBC",
    "fullText": "Eli Lilly's full-year guidance comes in stark contrast to the outlook of Novo Nordisk, which warned it sees sales and profit declining as much as 13% this year.",
    "link": "https://www.cnbc.com/2026/02/04/eli-lilly-lly-earnings-q4-2025.html"
  },
  {
    "text": "Ryan Routh, convicted of trying to assassinate Donald Trump, to be sentenced - NPR",
    "fullText": "A Secret Service agent saw Ryan Routh with a rifle at a golf course in Florida and fired on him in 2024 as Trump was golfing. He was found guilty of attempting to assassinate a presidential candidate.",
    "link": "https://www.npr.org/2026/02/04/nx-s1-5693102/ryan-routh-sentence-assassination-attempt-donald-trump"
  },
  {
    "text": "Amazon Fallout Countdown Turns Out Not to Be Fallout 3 or Fallout: New Vegas Remastered — Here's What It Revealed - IGN",
    "fullText": "The Amazon Fallout TV countdown that some had hoped would announce a Fallout 3 or Fallout: New Vegas remaster turned out to be neither. Here's what actually unlocked.",
    "link": "https://www.ign.com/articles/amazon-fallout-countdown-turns-out-not-to-be-fallout-3-or-fallout-new-vegas-remastered-heres-what-it-revealed"
  },
  {
    "text": "Bitcoin-Led Crypto Rout Erases Nearly Half a Trillion in a Week - Bloomberg.com",
    "fullText": "Almost half a trillion dollars has been wiped off cryptocurrencies in less than a week as a selloff led by Bitcoin accelerated.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-04/bitcoin-led-crypto-rout-erases-nearly-half-a-trillion-in-a-week"
  },
  {
    "text": "House Democrats help Mike Johnson end government shutdown, fund DHS and ICE - Axios",
    "fullText": "Many Democrats felt considerable apprehension about the optics of voting for even short-term DHS funding",
    "link": "https://www.axios.com/2026/02/03/government-shutdown-ice-dhs-vote-congress"
  },
  {
    "text": "Iran risks Trump's ire with new diplomatic demands, provocations - Axios",
    "fullText": "The demands risk pushing Trump closer to military action.",
    "link": "https://www.axios.com/2026/02/03/iran-us-nuclear-negotiations-format"
  },
  {
    "text": "Chris Beard got ejected at Tennessee trying to do what Rick Barnes once did - On3",
    "fullText": "Ole Miss coach Chris Beard said his ejection in the second half at Tennessee was similar to what Rick Barnes did in the past.",
    "link": "https://www.on3.com/teams/tennessee-volunteers/news/chris-beard-ejection-tennessee-rick-barnes-fight-players-program-ole-miss/"
  },
  {
    "text": "Trump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way - CNN",
    "fullText": "A wide array of election experts say President Donald Trump’s call for Republicans to “nationalize the voting” is an alarming and potentially dangerous escalation of his continued efforts to transform how US elections are administered.",
    "link": "https://www.cnn.com/2026/02/03/politics/trump-nationalize-elections-constitution-clause"
  },
  {
    "text": "4 takeaways as Celtics beat Mavericks with new-look lineup after trade - MassLive",
    "fullText": "The Celtics won their third straight game by double digits on Tuesday night in Dallas.",
    "link": "https://www.masslive.com/celtics/2026/02/4-takeaways-as-celtics-beat-mavericks-with-new-look-lineup-after-trade.html"
  },
  {
    "text": "Judge limits federal officers’ use of crowd control munitions at Portland ICE building - Oregon Public Broadcasting - OPB",
    "fullText": "The decision Tuesday blocks federal officers from directing or using “chemical or projectile munitions,” including pepper balls and tear gas “unless the specific target of such a weapon or device poses an imminent threat of physical harm to a law enforcement …",
    "link": "https://www.opb.org/article/2026/02/03/judge-limits-federal-officer-use-of-force-portland-ice-protesters/"
  },
  {
    "text": "New WWE NXT Champion Crowned - WrestleTalk",
    "fullText": "The new WWE NXT Champion has now officially been crowned after Oba Femi vacated the championship back at New Year's Evil.",
    "link": "https://wrestletalk.com/news/new-wwe-nxt-champion-crowned-2/"
  },
  {
    "text": "Hall of Fame voter Tony Dungy declines to comment on whether he voted for Bill Belichick - NBC Sports",
    "fullText": "The Bill Belichick snub has sparked an effort to determine which of the 50 Hall of Fame voters failed to put him on their ballot.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/hall-of-fame-voter-tony-dungy-declines-to-comment-on-whether-he-voted-for-bill-belichick"
  },
  {
    "text": "Nintendo Expands Switch Online's Game Boy Library With Two More Titles - Nintendo Life",
    "fullText": "Available now",
    "link": "https://www.nintendolife.com/news/2026/02/nintendo-expands-switch-onlines-game-boy-library-with-two-more-titles"
  },
  {
    "text": "Windows 11 builds 26300.7733 (Dev) and 26220.7752 (Beta) arrive with built-in Sysmon - Neowin",
    "fullText": null,
    "link": "https://www.neowin.net/news/windows-11-builds-263007733-dev-and-262207752-beta-arrive-with-built-in-sysmon/"
  },
  {
    "text": "X offices raided in France as prosecutors investigate child abuse images and deepfakes - AP News",
    "fullText": "French prosecutors have raided the offices of social media platform X as part of a preliminary investigation into allegations that include spreading child sexual abuse images and deepfakes. They have also summoned owner Elon Musk for questioning. The investig…",
    "link": "https://apnews.com/article/france-x-investigation-seach-elon-musk-1116be84d84201011219086ecfd4e0bc"
  },
  {
    "text": "Banco Santander Strikes $12.3 Billion Deal for Webster Financial in U.S. Expansion - The Wall Street Journal",
    "fullText": "Spanish banking giant to gain a stronger foothold in the Northeast",
    "link": "https://www.wsj.com/finance/banking/banco-santander-to-buy-webster-financial-in-12-3-billion-deal-723470ac"
  },
  {
    "text": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sun-releases-4-strong-solar-flares-expect/story?id\\\\u003d129814702"
  }
]