[
  {
    "text": "Republicans are freaking out about Hispanic voters after a Texas upset - Politico",
    "fullText": "Democrats flipped a deep-red state senate district over the weekend that has the party worried about November.",
    "link": "https://www.politico.com/news/2026/02/03/republicans-hispanic-voters-texas-special-00763560"
  },
  {
    "text": "Iran’s killing of protesters reached level rarely seen, emergent count shows - The Washington Post",
    "fullText": "Even in the scale of global attacks on civilians and crackdowns on dissent, the magnitude of Iran’s violence against protesters stands out.",
    "link": "https://www.washingtonpost.com/world/2026/02/03/iran-protests-deaths-crackdown/"
  },
  {
    "text": "U.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups - The Wall Street Journal",
    "fullText": "Iranian gunboats try to stop a U.S.-flagged ship and a drone flies close to an aircraft carrier",
    "link": "https://www.wsj.com/world/middle-east/iranian-gunboats-tried-to-stop-u-s-flagged-tanker-7332152a"
  },
  {
    "text": "Andrew moves out of Royal Lodge home - BBC",
    "fullText": "The former prince left Royal Lodge on Monday night and is living in a temporary property on the Sandringham Estate.",
    "link": "https://www.bbc.com/news/articles/c8e5zgprgn1o"
  },
  {
    "text": "Gabbard says Trump asked her to attend FBI raid at Georgia elections hub - Axios",
    "fullText": "Her presence alarmed Democratic lawmakers, but Tulsi Gabbard insists she acted \"well within my statutory authorities.\"",
    "link": "https://www.axios.com/2026/02/03/gabbard-trump-request-fbi-elections-raid-georgia"
  },
  {
    "text": "Judge restricts federal use of tear gas, munitions at Portland ICE protests - OregonLive.com",
    "fullText": "The temporary order lasts 14 days. A hearing is set for March 2 to extend the order.",
    "link": "https://www.oregonlive.com/crime/2026/02/judge-restricts-federal-officers-use-of-force-at-portland-ice-protests.html"
  },
  {
    "text": "AMD Reports Fourth Quarter and Full Year 2025 Financial Results - AMD",
    "fullText": "SANTA CLARA, Calif., Feb. 03, 2026 (GLOBE NEWSWIRE) -- AMD (NASDAQ:AMD) today announced financial results for the fourth quarter and full year…...",
    "link": "https://ir.amd.com/news-events/press-releases/detail/1276/amd-reports-fourth-quarter-and-full-year-2025-financial-results"
  },
  {
    "text": "Ricky Martin Writes Open Letter to Bad Bunny After Grammy Victory: ‘You Won by Staying True to Puerto Rico’ - Yahoo",
    "fullText": "Ricky Martin writes open letter to Bad Bunny after historic Grammy win: 'You won by being true to Puerto Rico'",
    "link": "http://www.billboard.com/music/latin/ricky-martin-bad-bunny-open-letter-grammys-puerto-rico-1236171992/"
  },
  {
    "text": "With caviar McNuggets and heart-shaped pizza, fast food chains hope to win Valentine's diners - AP News",
    "fullText": "It’s a tale as old as time, or at least as old as TikTok: chicken nuggets lovingly topped with a dab of caviar. McDonald’s is embracing the trend this Valentine’s Day with a limited-time McNugget Caviar kit. The free kit, which will be available on McNuggetCa…",
    "link": "https://apnews.com/article/mcdonalds-caviar-mcnuggets-fast-food-valentines-day-87a2002409008e376dc56f307b20f751"
  },
  {
    "text": "SpaceX grounds its Falcon 9 rocket after a problem with its upper stage. Will the Crew-12 astronaut mission be affected? - Space",
    "fullText": "Crew-12 is currently scheduled to launch atop a Falcon 9 on Feb. 11.",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/spacex-grounds-its-falcon-9-rocket-after-a-problem-with-its-upper-stage-will-the-crew-12-astronaut-mission-be-affected"
  },
  {
    "text": "Chipotle stock sinks as restaurant chain reports falling traffic, weak guidance - CNBC",
    "fullText": null,
    "link": "https://www.cnbc.com/2026/02/03/chipotle-cmg-q4-2025-earnings.html"
  },
  {
    "text": "How to Watch the 2026 Pro Bowl Games - Tampa Bay Buccaneers",
    "fullText": "How to watch Antoine Winfield Jr. and Tristan Wirfs at the 2026 Pro Bowl Games on Feb. 3",
    "link": "https://www.buccaneers.com/news/how-to-watch-2026-pro-bowl-games-winfield-wirfs"
  },
  {
    "text": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sun-releases-4-strong-solar-flares-expect/story?id\\\\u003d129814702"
  },
  {
    "text": "This 3D Printer Just Broke My Tests, Because the Future Is Here - CNET",
    "fullText": "I've never seen a 3D printer complete my tests as well as the Bambu Lab H2C.",
    "link": "https://www.cnet.com/tech/computing/bambu-lab-3d-printer-broke-cnet-tests/"
  },
  {
    "text": "A new generation revives 'The Muppet Show' and it's as delightful as ever - NPR",
    "fullText": "This isn't the first reincarnation of Jim Henson's crew, but it's one of the best in a very long time. Seth Rogen is an executive producer, and Maya Rudolph and Sabrina Carpenter guest star.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697369/the-muppet-show-review"
  },
  {
    "text": "Did we just see a black hole explode? Physicists think so—and it could explain (almost) everything - Phys.org",
    "fullText": "In 2023, a subatomic particle called a neutrino crashed into Earth with such a high amount of energy that it should have been impossible. In fact, there are no known sources anywhere in the universe capable of producing such energy—100,000 times more than the…",
    "link": "https://phys.org/news/2026-02-black-hole-physicists.html"
  },
  {
    "text": "Did Pfizer's Obesity Shot Do Well Enough To Catch Lilly? - Investor's Business Daily",
    "fullText": "An analyst says Eli Lilly's Zepbound still looks like the heavyweight in obesity.",
    "link": "https://www.investors.com/news/technology/pfizer-stock-pfizer-earnings-q4-2025/"
  },
  {
    "text": "Iran wants to change venue and format of nuclear talks with U.S. - Axios",
    "fullText": "The demands risk pushing Trump closer to military action.",
    "link": "https://www.axios.com/2026/02/03/iran-us-nuclear-negotiations-format"
  },
  {
    "text": "Gemini app Tools menu adds ‘Labs’ section, Personal Intelligence toggle - 9to5Google",
    "fullText": "As the Gemini app picks up more features, Google is improving organization of the Tools menu on the web with Experimental Labs.",
    "link": "http://9to5google.com/2026/02/03/gemini-tools-menu-labs/"
  }
]