[
  {
    "text": "John Cena, Will Ospreay, Omos, Mercedes Mone, More React To AJ Styles’ WWE Retirement - Fightful",
    "fullText": "The wrestling world reacts to AJ Styles retiring from WWE at Royal Rumble.",
    "link": "https://www.fightful.com/wrestling/john-cena-will-ospreay-omos-mercedes-mone-more-react-to-aj-styles-wwe-retirement/"
  },
  {
    "text": "USA Olympics Legend Airlifted From Course After Crash in Last Race Before 2026 Games - The Daily Beast",
    "fullText": "Babbel forgoes flashcards and memorization in favor of real-world conversations.",
    "link": "https://www.thedailybeast.com/save-up-to-50-on-a-lifetime-subscription-to-the-babbel-language-learning-app/"
  },
  {
    "text": "Yamal 10, De Jong 9 | Elche 1-3 Barcelona: Player Ratings - Barca Universal",
    "fullText": "If Barcelona’s game against Real Sociedad was frustrating in terms of the team not converting chances, last night’s clash against Elche trumped it with some margin. The Catalans took to the field away against Eder Sarabia’s men and had enough chances to have …",
    "link": "https://barcauniversal.com/yamal-10-de-jong-9-elche-1-3-barcelona-player-ratings/"
  },
  {
    "text": "Partial government shutdown begins as funding lapses despite Senate deal - CBS News",
    "fullText": "The Senate passed a deal on a package of spending bills late Friday, sending it to the House, though funding for dozens of government agencies has still lapsed.",
    "link": "https://www.cbsnews.com/live-updates/government-shutdown-deadline-senate-funding-deal/"
  },
  {
    "text": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct - CNN",
    "fullText": "Chicago Mayor Brandon Johnson on Saturday signed an executive order directing city police to investigate and document alleged misconduct by federal immigration officers with an eye toward prosecution.",
    "link": "https://www.cnn.com/2026/01/31/us/chicago-ice-misconduct-executive-order"
  },
  {
    "text": "Trump vows not to help blue cities with riots, instructs ICE and Border Patrol to protect federal property - Fox News",
    "fullText": "President Donald Trump instructed ICE and Border Patrol to be \"very forceful\" protecting federal property during anti-immigration riots, and warned of consequences for attacks.",
    "link": "https://www.foxnews.com/politics/trump-vows-not-help-blue-cities-riots-instructs-ice-border-patrol-protect-federal-property"
  },
  {
    "text": "New Samsung Galaxy S26 Ultra Leak Confirms Disappointing News - Forbes",
    "fullText": "The Samsung Galaxy S26 Ultra release date has been confirmed, but some of the new specifications reveal disappointing news.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/01/31/samsung-galaxy-s26-ultra-release-date-leak-battery-spec/"
  },
  {
    "text": "This Wild Encounter Between A Boomer And A Millennial Has Gone Viral, And People Have LOTS To Say - BuzzFeed",
    "fullText": "\"Not all heroes wear capes; some wear AirPods.\"",
    "link": "https://www.buzzfeed.com/kristatorres/entitled-boomer-reddit"
  },
  {
    "text": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach - NPR",
    "fullText": "An ICE unit from the US Department of Homeland Security is playing a role providing security at the Winter Games.  At past Olympics, their involvement would have been unremarkable. But after the violence in Minneapolis, many Italians protesting in Milan say I…",
    "link": "https://www.npr.org/2026/01/31/nx-s1-5695197/as-winter-olympics-milan-protesters-call-for-ice-agents-to-leave-italy"
  },
  {
    "text": "Justin Jefferson: I definitely feel like we would have done better with Sam Darnold - NBC Sports",
    "fullText": "“It’s definitely tough. It's tough to watch. I love that he’s in the Super Bowl. I’m happy for him, I want nothing but the best for him,\" Jefferson said of Darnold.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/justin-jefferson-i-definitely-feel-like-we-would-have-done-better-with-sam-darnold"
  },
  {
    "text": "Another winter storm threatens to drop more snow as dangerous cold lingers - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/winter-storm-threatens-drop-snow-dangerous-cold-lingers/story?id\\\\u003d129734353"
  },
  {
    "text": "Starbucks feeling the heat as more chains vie for US coffee drinkers - AP News",
    "fullText": "Starbucks revolutionized the United States' coffee culture. But it’s facing unprecedented competition. And that will make it harder to win back customers it's lost to perennial rival Dunkin' and fast-growing drive-thru chains like Dutch Bros and 7 Brew. Seatt…",
    "link": "https://apnews.com/article/starbucks-coffee-menu-open-drivethru-dunkin-7f47a4e35e411a0e61c2bf2e551d1de7"
  },
  {
    "text": "Fans fear UFC title contender’s career is ‘over’ after he’s spotted nursing injuries at an event - Bloody Elbow",
    "fullText": "A fighter's return timeline looks to have been pushed back.",
    "link": "https://bloodyelbow.com/2026/01/31/fans-fear-ufc-title-contenders-career-is-over-after-hes-spotted-nursing-injuries-at-an-event/"
  },
  {
    "text": "WWE Hall Of Famer Returning At Royal Rumble 2026 - WrestleTalk",
    "fullText": "A WWE Hall of Famer is set to make their return in the 2026 Royal Rumble match coming up in just a few hours.",
    "link": "https://wrestletalk.com/news/wwe-hall-of-famer-returning-royal-rumble-2026/"
  },
  {
    "text": "Trump is pressuring Cuba. It’s putting Mexico in a tough spot. - Politico",
    "fullText": "As the White House ramps up pressure on Havana, Mexico President Claudia Sheinbaum is weighing how far to bend without triggering retaliation from Washington.",
    "link": "https://www.politico.com/news/2026/01/31/trump-is-pressuring-cuba-its-putting-mexico-in-a-tough-spot-00758516"
  },
  {
    "text": "Box Office: ‘Iron Lung’ Sinks the Competition With $8.9 Million; ‘Send Help’ Survives in Second Place - Variety",
    "fullText": "Mark 'Markiplier' Fischbach's indie horror 'Iron Lung' opened at No.1 on Friday.",
    "link": "https://variety.com/2026/film/box-office/box-office-iron-lung-send-help-melania-1236644154/"
  },
  {
    "text": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story. - CBS News",
    "fullText": "\"I was there. I saw everything,\" Jose Huerta Chuma, who remains in hiding, told CBS News.",
    "link": "https://www.cbsnews.com/news/jose-huerta-chuma-alex-pretti-minneapolis-shooting/"
  },
  {
    "text": "What South Carolina’s soaring measles outbreak means for the rest of the U.S. - The Washington Post",
    "fullText": "More than 840 measles infections have been reported in South Carolina, surpassing the tally in Texas last year. Public health experts say it shows the risks when vaccination coverage falls.",
    "link": "https://www.washingtonpost.com/health/2026/01/31/south-carolina-measles/"
  },
  {
    "text": "My 5 Favorite Ultra-High-Yield Dividend Stocks to Buy for 2026 - The Motley Fool",
    "fullText": "These monster dividend stocks yielding up to 7.7% are solid buys to generate steady income in 2026.",
    "link": "https://www.fool.com/investing/2026/01/31/my-5-favorite-ultra-high-yield-dividend-stocks-to/"
  }
]