[
  {
    "text": "S&P 500 is little changed as traders assess earnings, latest inflation data: Live updates - CNBC",
    "fullText": "Stocks were relatively unchanged as investors absorbed the latest inflation reading and studied the first earnings reports trickling in for the fourth quarter.",
    "link": "https://www.cnbc.com/2026/01/12/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump administration to end temporary protected status for Somalis - NBC News",
    "fullText": "WASHINGTON — The Trump administration is ending temporary protected status for Somali immigrants, White House press secretary Karoline Leavitt confirmed in a post Tuesday on X.U.S.",
    "link": "https://www.nbcnews.com/politics/immigration/trump-administration-end-temporary-protected-status-somalis-us-rcna253798"
  },
  {
    "text": "JPMorgan Chase says banks could fight Trump credit card rate cap: 'Everything's on the table' - CNBC",
    "fullText": "Banks say a proposed 10% cap on credit card interest rates would result in fewer credit card accounts for Americans and a hit to the U.S. economy.",
    "link": "https://www.cnbc.com/2026/01/13/trump-credit-card-rate-cap-jpmorgan-chase-banks-fight.html"
  },
  {
    "text": "January Update 1.11.0 - arcraiders.com",
    "fullText": null,
    "link": "https://arcraiders.com/news/patch-notes-1-11-0"
  },
  {
    "text": "Today is the Smithsonian's deadline to give thousands of documents to the White House - NPR",
    "fullText": "The White House says the Smithsonian Institution must submit materials about current and upcoming exhibitions and events for a review that will determine whether they express \"improper ideology.\"",
    "link": "https://www.npr.org/2026/01/13/nx-s1-5672645/smithsonian-deadline-white-house"
  },
  {
    "text": "'My daughters are fans of Venus, so it was tough' - BBC",
    "fullText": "Tatjana Maria beats Venus Williams in straight sets in the first round at the Hobart Internationa.",
    "link": "https://www.bbc.com/sport/tennis/articles/cvgx5ggkey7o"
  },
  {
    "text": "As Canada tries to reduce its dependence on the US, its leader will visit China to rebuild ties - AP News",
    "fullText": "Canadian Prime Minister Mark Carney is visiting China this week to mend relations with the world's second-largest economy. It's the first visit by a Canadian leader in eight years. Carney aims to double non-U.S. exports over the next decade to reduce Canada’s…",
    "link": "https://apnews.com/article/china-canada-carney-trump-us-tariffs-economy-c8227349417cd2fdd134e8a4894bc1e5"
  },
  {
    "text": "Trump ‘immediately’ imposes 25% tariffs on countries that do business with Iran. That could include China - CNN",
    "fullText": "President Donald Trump said on Monday that countries that do business with Iran will face a new 25% tariff. The announcement appears to mean goods from China, a major trading partner of both Iran and the United States, would become significantly more expensiv…",
    "link": "https://www.cnn.com/2026/01/12/business/tariffs-trump-iran"
  },
  {
    "text": "2026 Golden Globes full coverage: List of winners as 'One Battle After Another' and 'Hamnet' take home top film nods; 'Adolescence' recognized for TV with 4 wins - Yahoo",
    "fullText": "The show was hosted by Nikki Glaser for the second year in a row.",
    "link": "https://www.yahoo.com/entertainment/celebrity/live/2026-golden-globes-live-updates-full-list-of-winners-as-one-battle-after-another-and-hamnet-take-home-top-film-nods-adolescence-recognized-for-tv-with-4-wins-000306961.html"
  },
  {
    "text": "Trump Boasts He’s Taking Greenland ‘One Way or the Other’ - The Daily Beast",
    "fullText": "The president has clarified he is interested in “acquiring, not leasing” the autonomous territory.",
    "link": "https://www.thedailybeast.com/trump-confirms-hes-taking-greenland-one-way-or-the-other/"
  },
  {
    "text": "Former Rep. Mary Peltola jumps into Alaska Senate race - Politico",
    "fullText": "The former Alaska congressmember will likely face off against Sen. Dan Sullivan (R-Alaska), and is a recruitment coup for national Democrats.",
    "link": "https://www.politico.com/news/2026/01/12/peltola-alaska-senate-2026-midterms-00721596"
  },
  {
    "text": "Dell tested NVIDIA N1X laptop just two months ago - VideoCardz.com",
    "fullText": "New NVIDIA N1X laptop spotted, so is it still coming? Watching NVIDIA CES keynotes reminds me of Knives Out movies. You are trying to solve the riddle of",
    "link": "https://videocardz.com/newz/dell-tested-nvidia-n1x-laptop-just-two-months-ago"
  },
  {
    "text": "This Dead Star With a Glowing Shock Wave Shouldn’t Exist - Gizmodo",
    "fullText": "The recent discovery has left astronomers dumbfounded.",
    "link": "https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244"
  },
  {
    "text": "AI can now 'see' optical illusions. What does it tell us about our own brains? - BBC",
    "fullText": "Our eyes can frequently play tricks on us, but scientists have discovered that some artificial intelligence can fall for the same illusions.",
    "link": "https://www.bbc.com/future/article/20251218-how-ai-is-shedding-new-light-on-optical-illusions"
  },
  {
    "text": "Exercise is as effective as medication in treating depression, study finds - NPR",
    "fullText": "New research shows exercise is as effective as medication at reducing symptoms of depression. And you don't need to run a marathon to see benefits. So how much is enough?",
    "link": "https://www.npr.org/2026/01/12/nx-s1-5667599/exercise-is-as-effective-as-medication-in-treating-depression-study-finds"
  },
  {
    "text": "Cuban leader says ‘no one dictates what we do’ as Trump tells regime to make a deal - CNN",
    "fullText": "Cuba’s leader has pushed back on US President Donald Trump’s demand that the Caribbean nation “make a deal” with Washington, as Trump said Havana would be cut off from the Venezuelan oil and money that it’s relied on for decades.",
    "link": "https://www.cnn.com/2026/01/12/americas/cuba-push-back-trump-oil-deal-intl-hnk"
  },
  {
    "text": "Samsung Galaxy S27 Ultra camera details surface for the first time - SamMobile",
    "fullText": "The first set of information about the Galaxy S27 series has started to emerge. The Galaxy S26 Ultra won't bring any major camera hardware improvements, but it looks like the Galaxy S27 Ultra will. It could use a newer sensor for the primary camera, and its n…",
    "link": "https://www.sammobile.com/news/galaxy-s27-ultra-camera-details-surface-for-the-first-time/"
  },
  {
    "text": "NFL Divisional Round: Biggest immediate question for advancing/eliminated playoff teams - NFL.com",
    "fullText": "In this edition of The First Read, Jeffri Chadiha reveals the most pressing question for each of the NFL teams that advanced to the Divisional Round and each of the squads that lost on Wild Card Weekend.",
    "link": "https://www.nfl.com/news/nfl-divisional-round-biggest-immediate-question-for-advancing-eliminated-playoff-teams-x3405"
  }
]