[
  {
    "text": "Celebrities wear pins protesting ICE at the Golden Globes - AP News",
    "fullText": "Some celebrities have donned anti-ICE pins at the Golden Globes ceremony in tribute to Renee Good, who was shot and killed by an Immigration and Customs Enforcement officer in Minneapolis this week. The pins display slogans like “BE GOOD” and “ICE OUT.” Mark …",
    "link": "https://apnews.com/article/golden-globes-pins-ice-protests-f1ec739a6536fe2be811e00500714395"
  },
  {
    "text": "Autism advocates celebrate release of ‘magical’ first-ever Barbie on the spectrum - CNN",
    "fullText": "The new doll carries a pink fidget spinner that actually spins, wears pink noise-cancelling headphones to reduce sensory overload and holds a pink tablet that represents her augmentative and alternative communication, or AAC, device.",
    "link": "https://www.cnn.com/2026/01/12/health/autism-barbie-doll-wellness"
  },
  {
    "text": "Goodwill shopper sparks outrage after sharing photos of local store's shelves: 'Is this normal?' - Yahoo",
    "fullText": "\"They never clean, they never organize.\"",
    "link": "https://www.yahoo.com/lifestyle/articles/goodwill-shopper-sparks-outrage-sharing-021500709.html"
  },
  {
    "text": "U-Haul drives into crowd at Los Angeles anti-Iranian regime protest - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/haul-drives-crowd-los-angeles-anti-iranian-regime/story?id\\\\u003d129112878"
  },
  {
    "text": "Golden Globes 2026: Jennifer Lawrence dons see-through gown with embroidered florals - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Style/golden-globes-2026-jennifer-lawrence-dons-gown-embroidered/story?id\\\\u003d129112873"
  },
  {
    "text": "Australia social media ban: Meta blocks 550,000 accounts under new law - BBC",
    "fullText": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
    "link": "https://www.bbc.com/news/articles/cpqye2yygl4o"
  },
  {
    "text": "Person with measles traveled through Maryland, Virginia last week, health officials say - WTOP",
    "fullText": "The Maryland Department of Health said the person traveled on trains from Jan. 7-8.",
    "link": "https://wtop.com/local/2026/01/person-with-measles-traveled-through-maryland-last-week-state-health-officials-say/"
  },
  {
    "text": "“The ultimate cheater of all time” – Former Bulls center recalls Michael Jordan cheating on Dunkin’ Donuts bets - Basketball Network",
    "fullText": null,
    "link": "https://www.basketballnetwork.net/off-the-court/former-bulls-center-recalls-michael-jordan-cheating-on-dunkin-donuts-bets"
  },
  {
    "text": "Super Mario Bros. Wonder - Nintendo Switch 2 Edition + Meetup In Bellabel Park Has Been Rated - Nintendo Life",
    "fullText": "Get ready for a 2026 release",
    "link": "https://www.nintendolife.com/news/2026/01/super-mario-bros-wonder-nintendo-switch-2-edition-plus-meetup-in-bellabel-park-has-been-rated"
  },
  {
    "text": "Missing Oklahoma boy found safe after mother, stepfather arrested for alleged child abuse: officials - ABC7 Chicago",
    "fullText": "A missing 12-year-old boy in Oklahoma has been found after his mother and stepfather were arrested for alleged child abuse, officials said.",
    "link": "https://abcnews.go.com/US/mother-stepfather-arrested-alleged-child-abuse-amid-search/story?id=129064524"
  },
  {
    "text": "LSU Takes Down No. 2 Texas, 70-65, In Sold Out PMAC - lsusports.net",
    "fullText": "LSU Takes Down No. 2 Texas, 70-65, In Sold Out PMAC",
    "link": "https://lsusports.net/news/2026/01/11/lsu-takes-down-texas-70-65/"
  },
  {
    "text": "A Cooler Week Ahead - KSAT",
    "fullText": "A light freeze affects the Hill Country, southern Edwards Plateau, and Rio Grande Plains. Temperatures will rise to the mid 50s and 60s under partly sunny skies, with a chance of spotty showers on Monday expanding southeast by Tuesday.",
    "link": "https://www.ksat.com/weather/2026/01/11/light-freeze-for-some-warmer-days-ahead/"
  },
  {
    "text": "Alnylam charts ambitious five-year plan as sales of key drug miss expectations - statnews.com",
    "fullText": "Gene-silencing company Alnylam charts ambitious five-year plan as sales of key drug miss expectations.",
    "link": "https://www.statnews.com/2026/01/11/alnylam-five-year-plan-amvuttra-investors-jpm-2026/"
  },
  {
    "text": "Anthropic joins OpenAI's push into health care with new Claude tools - NBC News",
    "fullText": "Anthropic announced a new suite of health care and life sciences features Sunday, enabling users of its Claude artificial intelligence platform to share access to their health records to better understand their medical information",
    "link": "https://www.nbcnews.com/tech/tech-news/anthropic-health-care-rcna252872"
  },
  {
    "text": "UK can legally stop shadow fleet tankers, ministers believe - BBC",
    "fullText": "Existing law could be used to approve the use of military force to stop sanction-busting ships operated by Russia and Iran.",
    "link": "https://www.bbc.com/news/articles/cy8pn7jgy3no"
  },
  {
    "text": "Thousands of tourists stranded in Lapland as cold grounds flights - BBC",
    "fullText": "All flights out of Kittila airport in northern Finland were cancelled on Sunday with temperatures falling as low as -38C.",
    "link": "https://www.bbc.com/news/articles/c74vnxlvl40o"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "President Oaks Dedicates the Burley Idaho Temple - newsroom.churchofjesuschrist.org",
    "fullText": "President Dallin H. Oaks of The Church of Jesus Christ of Latter-day Saints dedicated the Burley Idaho Temple on Sunday, January 11, 2025 — his first temple dedication as Church president.",
    "link": "https://newsroom.churchofjesuschrist.org/article/president-oaks-dedicates-burley-idaho-temple"
  },
  {
    "text": "Largest nursing strike in New York City history looming as contract negotiations continue - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/largest-nursing-strike-new-york-city-history-looming/story?id\\\\u003d129100789"
  }
]