[
  {
    "text": "NFL Divisional Round: Biggest immediate question for advancing/eliminated playoff teams - NFL.com",
    "fullText": "In this edition of The First Read, Jeffri Chadiha reveals the most pressing question for each of the NFL teams that advanced to the Divisional Round and each of the squads that lost on Wild Card Weekend.",
    "link": "https://www.nfl.com/news/nfl-divisional-round-biggest-immediate-question-for-advancing-eliminated-playoff-teams-x3405"
  },
  {
    "text": "Autism advocates celebrate release of ‘magical’ first-ever Barbie on the spectrum - CNN",
    "fullText": "The new doll carries a pink fidget spinner that actually spins, wears pink noise-cancelling headphones to reduce sensory overload and holds a pink tablet that represents her augmentative and alternative communication, or AAC, device.",
    "link": "https://www.cnn.com/2026/01/12/health/autism-barbie-doll-wellness"
  },
  {
    "text": "Buffalo Bills to play at Denver Broncos in Divisional Round on Saturday - BuffaloBills.com",
    "fullText": "Buffalo will travel to face Denver Broncos in the AFC Divisional Round on Saturday, Jan. 17",
    "link": "https://www.buffalobills.com/news/buffalo-bills-to-play-at-denver-broncos-in-divisional-round-on-saturday"
  },
  {
    "text": "‘Good Hang With Amy Poehler’ Wins the First Golden Globe for Best Podcast - Golden Globes",
    "fullText": "Amy Poehler isn’t just a “Good Hang” – she’s the best one of the year. The “Parks and Recreation” and “Saturday Night Live” star took home the Golden Globe for Best Podcast, inaugurating the awards ceremony’s newest category.   The win represents a crowning m…",
    "link": "https://goldenglobes.com/articles/good-hang-with-amy-poehler-wins-the-first-golden-globe-for-best-podcast/"
  },
  {
    "text": "Trump says he's \"inclined to keep Exxon out\" of Venezuela after CEO's remarks - Axios",
    "fullText": "The oil giant's CEO called the South American country \"uninvestable.\"",
    "link": "https://www.axios.com/2026/01/12/trump-exxon-venezuela-oil"
  },
  {
    "text": "First Nintendo Direct of 2026 Reportedly Leaked (Including New 3D Mario Game) - ComicBook.com",
    "fullText": "The first Nintendo Direct of 2026 is reportedly happening very soon, and will include the reveal of a new 3D Mario game.",
    "link": "http://comicbook.com/gaming/news/first-nintendo-direct-of-2026-reportedly-leaked-including-new-3d-mario-game/"
  },
  {
    "text": "Goodwill shopper sparks outrage after sharing photos of local store's shelves: 'Is this normal?' - Yahoo",
    "fullText": "\"They never clean, they never organize.\"",
    "link": "https://www.yahoo.com/lifestyle/articles/goodwill-shopper-sparks-outrage-sharing-021500709.html"
  },
  {
    "text": "Knicks 123-114 Trail Blazers (Jan 11, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810406"
  },
  {
    "text": "Golden Globes 2026: Jennifer Lawrence dons see-through gown with embroidered florals - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Style/golden-globes-2026-jennifer-lawrence-dons-gown-embroidered/story?id\\\\u003d129112873"
  },
  {
    "text": "Chaos erupts as U-Haul drives into crowd during anti-Iranian regime rally in Westwood - ABC7 Los Angeles",
    "fullText": "Chaos erupted after a U-Haul drove into a crowd during an anti-Iranian regime rally near the federal building in Westwood on Sunday afternoon.",
    "link": "https://abc7.com/post/haul-drives-crowd-during-anti-iranian-regime-rally-westwood-lapd-says/18388519/"
  },
  {
    "text": "Australia social media ban: Meta blocks 550,000 accounts under new law - BBC",
    "fullText": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
    "link": "https://www.bbc.com/news/articles/cpqye2yygl4o"
  },
  {
    "text": "Person with measles traveled through Maryland, Virginia last week, health officials say - WTOP",
    "fullText": "The Maryland Department of Health said the person traveled on trains from Jan. 7-8.",
    "link": "https://wtop.com/local/2026/01/person-with-measles-traveled-through-maryland-last-week-state-health-officials-say/"
  },
  {
    "text": "Missing Oklahoma boy found safe after mother, stepfather arrested for alleged child abuse: officials - ABC7 Chicago",
    "fullText": "A missing 12-year-old boy in Oklahoma has been found after his mother and stepfather were arrested for alleged child abuse, officials said.",
    "link": "https://abcnews.go.com/US/mother-stepfather-arrested-alleged-child-abuse-amid-search/story?id=129064524"
  },
  {
    "text": "LSU Takes Down No. 2 Texas, 70-65, In Sold Out PMAC - lsusports.net",
    "fullText": "LSU Takes Down No. 2 Texas, 70-65, In Sold Out PMAC",
    "link": "https://lsusports.net/news/2026/01/11/lsu-takes-down-texas-70-65/"
  },
  {
    "text": "A Cooler Week Ahead - KSAT",
    "fullText": "A light freeze affects the Hill Country, southern Edwards Plateau, and Rio Grande Plains. Temperatures will rise to the mid 50s and 60s under partly sunny skies, with a chance of spotty showers on Monday expanding southeast by Tuesday.",
    "link": "https://www.ksat.com/weather/2026/01/11/light-freeze-for-some-warmer-days-ahead/"
  },
  {
    "text": "Alnylam charts ambitious five-year plan as sales of key drug miss expectations - statnews.com",
    "fullText": "Gene-silencing company Alnylam charts ambitious five-year plan as sales of key drug miss expectations.",
    "link": "https://www.statnews.com/2026/01/11/alnylam-five-year-plan-amvuttra-investors-jpm-2026/"
  },
  {
    "text": "Anthropic rolls out new healthcare and life science features for Claude - Fortune",
    "fullText": "Anthropic's expansion of Claude's healthcare and life science capabilities comes one week after OpenAI debuted new health features for ChatGPT.",
    "link": "https://fortune.com/2026/01/11/anthropic-unveils-claude-for-healthcare-and-expands-life-science-features-partners-with-healthex-to-let-users-connect-medical-records/"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "President Oaks Dedicates the Burley Idaho Temple - newsroom.churchofjesuschrist.org",
    "fullText": "President Dallin H. Oaks of The Church of Jesus Christ of Latter-day Saints dedicated the Burley Idaho Temple on Sunday, January 11, 2025 — his first temple dedication as Church president.",
    "link": "https://newsroom.churchofjesuschrist.org/article/president-oaks-dedicates-burley-idaho-temple"
  }
]