[
  {
    "text": "The first features from our cutest drop yet - Minecraft",
    "fullText": "Baby farm mobs are first to waddle into Minecraft with a whole new look. Befriend these tiny rascals, hear their sweet sounds, and craft them name tags in Java snapshot and Bedrock beta/preview!",
    "link": "https://www.minecraft.net/en-us/article/first-features-minecraft-cutest-drop-yet"
  },
  {
    "text": "In Maduro’s capture, Russia sees a great-power rival act with impunity - The Washington Post",
    "fullText": "The U.S. intervention in Venezuela distracts attention from Ukraine and signals a new era of great-power politics in which Russia can seek its own sphere of dominance.",
    "link": "https://www.washingtonpost.com/world/2026/01/07/russia-venezuela-great-power-politics/"
  },
  {
    "text": "EXCLUSIVE: Hollywood Legend Jeff Bridges Lists Malibu Land for $4.4 Million—After Beloved Family Home Burned in Wildfires - Yahoo",
    "fullText": "Bridges' longtime Malibu home, which was passed to him by his parents, was destroyed in the California wildfires.",
    "link": "https://www.yahoo.com/entertainment/celebrity/articles/exclusive-hollywood-legend-jeff-bridges-151218014.html"
  },
  {
    "text": "Nick Reiner to be arraigned on murder charges after his parents were stabbed to death - NBC News",
    "fullText": "Nick Reiner, the son of Rob Reiner and Michele Singer Reiner, is set to be arraigned Wednesday on charges that he fatally stabbed his parents in their Southern California home last month.",
    "link": "https://www.nbcnews.com/news/us-news/nick-reiner-court-hearing-michele-rob-reiner-death-rcna252673"
  },
  {
    "text": "Top 5 storylines for Bills at Jaguars | AFC Wild Card Round - Buffalo Bills Home | Buffalo Bills - buffalobills.com",
    "fullText": "Josh Allen's playoff numbers, a best-on-best matchup, the reason behind the Jaguars win streak + more.",
    "link": "https://www.buffalobills.com/news/top-5-storylines-for-bills-at-jaguars-afc-wild-card-round"
  },
  {
    "text": "Musk’s Grok AI Generated Thousands of Undressed Images Per Hour on X - Bloomberg.com",
    "fullText": "Elon Musk’s X has become a top site for images of people that have been non-consensually undressed by AI, according to a third-party analysis, with thousands of instances each hour over a day earlier this week.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-07/musk-s-grok-ai-generated-thousands-of-undressed-images-per-hour-on-x"
  },
  {
    "text": "Trump triggers a renaissance for grand juries - Politico",
    "fullText": "Grand juries have increasingly become a headache for prosecutors trying to advance controversial Trump policies.",
    "link": "https://www.politico.com/news/2026/01/07/trump-grand-juries-letitia-james-comey-indictments-00713579"
  },
  {
    "text": "Pro-Trump influencers take a victory lap amid fallout from viral video alleging fraud - NPR",
    "fullText": "The swift policy and political repercussions the video helped propel illustrate the symbiotic relationship between online content creators and the Trump administration's policy goals.",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5668189/nick-shirley-tim-walz-influencers-trump"
  },
  {
    "text": "Trump Goon Melts Down After Latest Kennedy Center Boycott - The Daily Beast",
    "fullText": "More than 10 artists have now refused to perform at the rebranded venue.",
    "link": "https://www.thedailybeast.com/trump-goon-melts-down-after-latest-kennedy-center-boycott/"
  },
  {
    "text": "What to know about the 2026 Golden Globes: How to watch, who's hosting and more - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/how-to-watch-2026-golden-globes/story?id\\\\u003d128916300"
  },
  {
    "text": "Century-old tumours could reveal why more young people are getting bowel cancer - BBC",
    "fullText": "Bowel cancer in people under the age of 50 is increasing worldwide and scientists are striving to find out why.",
    "link": "https://www.bbc.com/news/articles/cvgxpv9k822o"
  },
  {
    "text": "Murphy's buzzer beater waved off, Auburn falls 90-88 to Texas A&M - Auburn Tigers",
    "fullText": "KeShawn Murphy hit a 35-foot shot at the buzzer and Auburn celebrated what it thought was a wild comeback win, but after a video review, the officials waved off the bucket.",
    "link": "https://auburntigers.com/news/2026/01/6/murphys-buzzer-beater-waved-off-auburn-falls-90-88-to-texas-aandm"
  },
  {
    "text": "Longhorns great Shipley severely burned on ranch - ESPN",
    "fullText": "Former Texas Longhorns star Jordan Shipley is in critical but stable condition after suffering \"severe\" burns in an accident on his ranch in Texas on Tuesday, his family said.",
    "link": "https://www.espn.com/college-football/story/_/id/47535704/ex-texas-wr-jordan-shipley-critical-stable-condition"
  },
  {
    "text": "Chris Mason: UK grapples with new era of US unpredictability - BBC",
    "fullText": "This week has seen two case studies in how Europe is trying to bind the US into its future, writes the BBC's political editor.",
    "link": "https://www.bbc.com/news/articles/cpqyleye482o"
  },
  {
    "text": "Brown University gunman recorded videos saying attack was planned for months - BBC",
    "fullText": "The gunman showed no remorse and grumbled about an injury he sustained in the attacks, said investigators.",
    "link": "https://www.bbc.com/news/articles/c86v3g9z572o"
  },
  {
    "text": "Trump administration tells 5 states their child care funds have been frozen - Axios",
    "fullText": "The suspension of the funds could hurt low-income families in those states, depending on how long it lasts, advocates say.",
    "link": "https://www.axios.com/2026/01/07/trump-child-care-states-funding"
  },
  {
    "text": "Miami 'confident' DT Moten will play vs. Ole Miss - ESPN",
    "fullText": "Two days before the Hurricanes play their third College Football Playoff game, Miami defensive coordinator Corey Hetherman said Tuesday that he's \"very confident\" starting defensive tackle Ahmad Moten Sr. will play against Ole Miss in the Fiesta Bowl.",
    "link": "https://www.espn.com/college-football/story/_/id/47533299/miami-confident-dt-ahmad-moten-sr-play-cfp-semifinal"
  },
  {
    "text": "New census of sun's neighbors reveals best potential real estate for life - Phys.org",
    "fullText": "A new study led by a Georgia State University astronomy graduate student is a major step forward in the search for stars that could host Earth-like planets that may prove to be good havens for life to develop. Sebastián Carrazco-Gaxiola shared the results at …",
    "link": "https://phys.org/news/2026-01-census-sun-neighbors-reveals-potential.html"
  },
  {
    "text": "Trump’s plan to own the Western Hemisphere and Greenland is not what Americans want - CNN",
    "fullText": "President Donald Trump’s decision to remove the head of a sovereign country over the weekend was a hugely significant operation. But it was perhaps even more significant as a statement of intent.",
    "link": "https://www.cnn.com/2026/01/06/politics/trump-western-hemisphere-americans-polling"
  }
]