[
  {
    "text": "7 dogs competing for Westminster’s show big prize Tuesday night - AP News",
    "fullText": "The Westminster Kennel Club is getting ready to crown its top dog. After two days, 2,500 dogs and more than 200 breeds, it will come down to seven canines vying Tuesday night for U.S. show dogs’ most coveted prize. Six finalists already have been chosen. Ther…",
    "link": "https://apnews.com/article/westminster-dog-show-best-show-finals-6ec7cec14b26143d2e527338c2e54f0b"
  },
  {
    "text": "Democrats just handed RFK Jr. billions more than he asked for. It was a big risk. - Politico",
    "fullText": "Lawmakers rejected huge health cuts President Donald Trump requested. Kennedy’s diverting the funds to pet projects and red states.",
    "link": "https://www.politico.com/news/2026/02/03/democrats-handed-rfk-jr-billions-more-than-he-asked-for-00763792"
  },
  {
    "text": "X offices raided in France as UK opens fresh investigation into Grok - BBC",
    "fullText": "Elon Musk's X and Grok platforms are facing increased scrutiny from authorities on both sides of the channel.",
    "link": "https://www.bbc.com/news/articles/ce3ex92557jo"
  },
  {
    "text": "Evacuation order issued in area of Canby for 'hazardous materials emergency' - KATU",
    "fullText": "Officials in Clackamas County have issued a Level 3 (Go Now!) evacuation order in Canby because of a \"hazardous materials emergency.\"",
    "link": "https://katu.com/news/local/level-3-go-now-evacuation-order-issued-in-area-of-canby-for-hazardous-materials-emergency"
  },
  {
    "text": "Judge limits feds’ use of weapons against anti-ICE protesters in Portland - Politico",
    "fullText": "It’s a win for plaintiffs, including one known as the “Portland Chicken,” in a lawsuit claiming the Trump administration is trampling the First Amendment.",
    "link": "https://www.politico.com/news/2026/02/03/dhs-anti-ice-protests-portland-00763668"
  },
  {
    "text": "Trump says states are agents of federal government in elections - CNN",
    "fullText": "President Donald Trump on Tuesday claimed that “a state is an agent for the federal government in elections,” as he defended his call for Republicans to nationalize elections.",
    "link": "https://www.cnn.com/2026/02/03/politics/trump-nationalize-elections-states"
  },
  {
    "text": "'Years in the making' - are Arsenal ready to shed 'nearly men' tag after beating Chelsea in EFL Cup semi-final - BBC",
    "fullText": "Arsenal have moved a step closer to winning their first major silverware since 2020 by beating Chelsea 4-2 on aggregate in the Carabao Cup semi-final.",
    "link": "https://www.bbc.com/sport/football/articles/ckgv072m7pro"
  },
  {
    "text": "Iran’s killing of protesters reached level rarely seen, emergent count shows - The Washington Post",
    "fullText": "Even in the scale of global attacks on civilians and crackdowns on dissent, the magnitude of Iran’s violence against protesters stands out.",
    "link": "https://www.washingtonpost.com/world/2026/02/03/iran-protests-deaths-crackdown/"
  },
  {
    "text": "The four best Super Bowl TV deals we found - The Verge",
    "fullText": "There are countless TV deals at any given moment, but if you’re serious about quality, these 4K TV deals stand out from the rest for the Super Bowl.",
    "link": "https://www.theverge.com/gadgets/873160/super-bowl-4k-oled-big-tv-deal-sale"
  },
  {
    "text": "Netflix Attacked For Having “Wokest Content In The History Of The World” By MAGA Senators At WB Deal Hearing - Deadline",
    "fullText": "Unsurprisingly, Netflix was lambasted today at a Senate hearing for allegedly having “the wokest content in the history of the world.\"",
    "link": "http://deadline.com/2026/02/netflix-wb-senate-hearing-woke-content-1236707763/"
  },
  {
    "text": "Ricky Martin Writes Open Letter to Bad Bunny After Grammy Victory: ‘You Won by Staying True to Puerto Rico’ - Yahoo",
    "fullText": "Ricky Martin writes open letter to Bad Bunny after historic Grammy win: 'You won by being true to Puerto Rico'",
    "link": "http://www.billboard.com/music/latin/ricky-martin-bad-bunny-open-letter-grammys-puerto-rico-1236171992/"
  },
  {
    "text": "Chappell Roan bringing Pink Pony Club to Fortnite Festival - Polygon",
    "fullText": "Epic is adding Grammy Award-winning pop star Chappell Roan to Fortnite alongside her iconic outfits and songs as the next Fortnite Festival Icon.",
    "link": "https://www.polygon.com/chappell-roan-fortnite-festival-release-date-skins-emotes-jam-tracks/"
  },
  {
    "text": "With caviar McNuggets and heart-shaped pizza, fast food chains hope to win Valentine's diners - AP News",
    "fullText": "It’s a tale as old as time, or at least as old as TikTok: chicken nuggets lovingly topped with a dab of caviar. McDonald’s is embracing the trend this Valentine’s Day with a limited-time McNugget Caviar kit. The free kit, which will be available on McNuggetCa…",
    "link": "https://apnews.com/article/mcdonalds-caviar-mcnuggets-fast-food-valentines-day-87a2002409008e376dc56f307b20f751"
  },
  {
    "text": "Chipotle stock sinks as restaurant chain reports falling traffic, weak guidance - CNBC",
    "fullText": "Chipotle stock has fallen about 33% over the last year, dragging the company's market value down to about $51 billion.",
    "link": "https://www.cnbc.com/2026/02/03/chipotle-cmg-q4-2025-earnings.html"
  },
  {
    "text": "Lorde Posts 'Ice Out' and Donates $204,000 From Minneapolis Merch - Variety",
    "fullText": null,
    "link": "https://variety.com/2026/music/news/lorde-posts-ice-out-donates-from-minneapolis-merch-sales-1236651196/"
  },
  {
    "text": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sun-releases-4-strong-solar-flares-expect/story?id\\\\u003d129814702"
  },
  {
    "text": "DeSantis, MLB commissioner say Rays ‘belong in Tampa Bay’ - Tampa Bay Times",
    "fullText": "The governor and MLB commissioner Rob Manfred spoke at a news conference at Hillsborough College on Tuesday.",
    "link": "https://www.tampabay.com/sports/rays/2026/02/03/governor-desantis-tampa-bay-rays-hillsborough-college-stadium/"
  },
  {
    "text": "Bahama Breeze is closing all of its restaurants - CNN",
    "fullText": null,
    "link": "https://www.cnn.com/2026/02/03/food/bahama-breeze-closures-darden"
  },
  {
    "text": "A new generation revives 'The Muppet Show' and it's as delightful as ever - NPR",
    "fullText": "This isn't the first reincarnation of Jim Henson's crew, but it's one of the best in a very long time. Seth Rogen is an executive producer, and Maya Rudolph and Sabrina Carpenter guest star.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697369/the-muppet-show-review"
  },
  {
    "text": "Sen. Warner calls Gabbard to testify after Georgia election office raid, Trump FBI call - CNBC",
    "fullText": "President Donald Trump, in an interview with former FBI deputy director and podcaster Dan Bongino, recently called on members of the Republican Party to \"take over the voting.\"",
    "link": "https://www.cnbc.com/2026/02/03/gabbard-trump-georgia-election-fbi-warner.html"
  }
]