[
  {
    "text": "Trump tariffs live updates: Trump announces tariffs on European countries until deal is reached for 'purchase of Greenland'; Danish PM says Europe 'will not be blackmailed' - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-trump-announces-tariffs-on-european-countries-until-deal-is-reached-for-purchase-of-greenland-danish-pm-says-europe-will-not-be-blackmailed-152657328.html"
  },
  {
    "text": "Wildfires race across Chile, leaving 18 dead and forcing thousands to flee - AP News",
    "fullText": "Authorities in Chile say that wildfires raging across central and southern areas of the country have left at least 18 people dead. The flames have scorched thousands of acres of forest and destroyed scores of homes. The South American country is sweltering un…",
    "link": "https://apnews.com/article/chile-wildfires-heat-wave-boric-biobio-emergency-c70c05758271270353606fa409fb504d"
  },
  {
    "text": "‘60 Minutes’ To Air ‘Inside CECOT’ Segment On Trump Deportations That Was Pulled From December Broadcast - Deadline",
    "fullText": null,
    "link": "https://deadline.com/2026/01/60-minutes-segment-trump-venezuela-migrants-1236689342/"
  },
  {
    "text": "Desmond Scott Unpacks New Kitchen Amid Ugly Divorce From Kristy Scott - TMZ",
    "fullText": "Desmond Scott is getting whisked away following his split from estranged wife Kristy Scott ... after being spotted mid-makeout last week, he posted a video Sunday showing him appearing to set up a new kitchen.",
    "link": "https://www.tmz.com/2026/01/18/desmond-scott-unpacks-kitchen-amid-divorce/"
  },
  {
    "text": "Footage of ZeniMax’s Cancelled Project Blackbird Surfaces Online - Insider Gaming",
    "fullText": "Two minutes of in-engine footage of ZeniMax Online Studio's cancelled Project Blackbird has leaked online.",
    "link": "https://insider-gaming.com/blackbrird-footage-leaked/"
  },
  {
    "text": "A Democratic governor’s blueprint for surviving Trump - Politico",
    "fullText": "Phil Murphy, who leaves office Tuesday, has benefited from his relationship with the administration while avoiding the president’s public attacks.",
    "link": "https://www.politico.com/news/2026/01/18/a-democratic-governors-blueprint-for-surviving-trump-00734703"
  },
  {
    "text": "Center left wins Portugal presidential election first round, setting up showdown with far right - politico.eu",
    "fullText": "António José Seguro will face far-right leader André Ventura in a runoff ballot Feb. 8.",
    "link": "https://www.politico.eu/article/far-right-wins-portugal-presidential-election-first-round-exit-poll-says/"
  },
  {
    "text": "Trump's voice in a new Fannie Mae ad is generated by artificial intelligence, with his permission - AP News",
    "fullText": "What sounds like President Donald Trump narrating a new Fannie Mae ad actually is an AI-cloned voice reading text, according to a disclaimer in the video. The ad comes as the Trump administration is making a big push to make housing affordable and the preside…",
    "link": "https://apnews.com/article/trump-voice-ai-housing-fannie-ad-davos-7a792aed20c56bcc3f7b53733ec331ad"
  },
  {
    "text": "ReactOS For \"Open-Source Windows\" Achieves Massive Networking Performance Boost - Phoronix",
    "fullText": "ReactOS as the long-in-development 'open-source Windows' project has been on quite a roll recently",
    "link": "https://www.phoronix.com/news/ReactOS-Async-Net-Connect"
  },
  {
    "text": "Oregon man buys four 'refurbished' video game consoles from Temu and opens them up to see if they're legit - supercarblondie.com",
    "fullText": "This Oregon man got his hands on four refurbished video game consoles from Temu to have a closer look at whether or not they were worth the investment",
    "link": "https://supercarblondie.com/are-refurbished-video-game-consoles-temu-legit/"
  },
  {
    "text": "The Weekender: Outrageous Get-In Prices For The National Championship, Trinidad Chambliss Sues The NCAA and A Point Shaving Scandal Rocks College Basketball - Eleven Warriors",
    "fullText": "National championship ticket prices reached record highs, Trinidad Chambliss sued the NCAA while seeking a sixth-year of eligibility and a point-shaving scandal rocked college basketball.",
    "link": "https://www.elevenwarriors.com/college-sports/2026/01/161228/the-weekender-outrageous-get-in-prices-for-the-national-championship-trinidad-chambliss-sues-the-ncaa-and-a-point"
  },
  {
    "text": "Jeff Ulbrich staying on as Falcons defensive coordinator - NFL.com",
    "fullText": "Jeff Ulbrich will stay on and continue to serve as defensive coordinator for the Atlanta Falcons, NFL Network Insider Ian Rapoport reported on NFL GameDay Morning.",
    "link": "https://www.nfl.com/news/jeff-ulbrich-staying-on-as-falcons-defensive-coordinator"
  },
  {
    "text": "Minneapolis Mayor Jacob Frey says federal agents are an \"occupying force\" - CBS News",
    "fullText": "Minneapolis Mayor Jacob Frey criticized the administration's immigration operations, calling the surge of federal agents an \"occupying force that has quite literally invaded our city.\"",
    "link": "https://www.cbsnews.com/news/jacob-frey-minneapolis-mayor-face-the-nation-federal-agents/"
  },
  {
    "text": "John Harbaugh Had The Giants Rework Their Org Chart For Him - Defector",
    "fullText": "News broke Wednesday that John Harbaugh would be hired as the next head coach of the New York Giants, but then the deal continued to be, as they say, hammered out. There must have been a lot of hammers banging away at that thing, because the team’s official a…",
    "link": "https://defector.com/john-harbaugh-had-the-giants-rework-their-org-chart-for-him"
  },
  {
    "text": "Why is flu season so bad this year? - Live Science",
    "fullText": "Flu season in the U.S. is particularly bad this year, and a new branch of the flu family tree may be to blame.",
    "link": "https://www.livescience.com/health/flu/why-is-flu-season-so-bad-this-year"
  },
  {
    "text": "Rockstar gives terminally ill fan early access to GTA 6 - Eurogamer",
    "fullText": "Rockstar has helped a terminally ill fan play GTA 6 ahead of its November release date.",
    "link": "https://www.eurogamer.net/rockstar-gives-terminally-ill-fan-early-access-to-gta-6"
  },
  {
    "text": "'The Fall and Rise of Reggie Dinkins' Review: Tracy Morgan NBC Comedy - The Hollywood Reporter",
    "fullText": "Tina Fey and Robert Carlock (co-creator with Sam Means) are among executive producers of the comedy about a disgraced football star hoping a documentary will change his life.",
    "link": "http://www.hollywoodreporter.com/tv/tv-reviews/the-fall-and-rise-of-reggie-dinkins-review-tracy-morgan-nbc-1236477044/"
  }
]