[
  {
    "text": "Spadaro: A six-pack of storylines to follow at Bills - Philadelphia Eagles",
    "fullText": "How will the Eagles contend with the NFL's reigning MVP? What insight do new Eagles who played Buffalo earlier this year offer? How will the weather factor into the game plan?",
    "link": "https://www.philadelphiaeagles.com/news/eagles-bills-game-previews-dave-spadaro-week-17-storylines-nfl"
  },
  {
    "text": "Why Netanyahu’s visit to Mar-a-Lago is the opening act to Israeli Prime Minister’s reelection bid - CNN",
    "fullText": "When Israeli Prime Minister Benjamin Netanyahu meets US President Donald Trump at Mar-a-Lago this week, the encounter will mark more than a diplomatic reunion.",
    "link": "https://www.cnn.com/2025/12/28/middleeast/netanyahu-visit-trump-reelection-intl"
  },
  {
    "text": "Bucks 112-103 Bulls (Dec 27, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810292"
  },
  {
    "text": "Wordle today: The answer and hints for December 28, 2025 - Mashable",
    "fullText": "Here are some tips and tricks to help you find the answer to \"Wordle\" #1652.",
    "link": "https://mashable.com/article/wordle-today-answer-december-28-2025"
  },
  {
    "text": "ECHL, players reach tentative CBA deal, end strike - ESPN",
    "fullText": "The ECHL and the Professional Hockey Players' Association have reached tentative approval on a new collective bargaining agreement to end a strike that lasted two days.",
    "link": "https://www.espn.com/nhl/story/_/id/47430746/echl-players-tentatively-agree-new-cba-end-2-day-strike"
  },
  {
    "text": "Indonesian rescuers search for Spanish soccer coach and 3 children after tour boat sinks - CNN",
    "fullText": "Indonesian rescuers searched for a Spanish soccer coach and his three children on Saturday after a tour boat carrying 11 people sank overnight near Padar Island, a popular destination within Komodo National Park, officials said.",
    "link": "https://www.cnn.com/2025/12/27/asia/spanish-family-boat-sinks-indonesia-intl-hnk"
  },
  {
    "text": "Scoop: Nvidia deal a big win for Groq employees and investors - Axios",
    "fullText": "Social media has been full of questions about what the unusual arrangement means for Groq employees.",
    "link": "https://www.axios.com/2025/12/28/nvidia-groq-shareholders"
  },
  {
    "text": "Newark Airport passenger may have exposed others to measles, New Jersey Health Department says - ABC7 New York",
    "fullText": "New Jersey's Health Department says someone with the disease passed through the airport on Friday, December 19.",
    "link": "https://abc7ny.com/post/newark-airport-passenger-may-have-exposed-others-measles-new-jersey-health-department-says/18325181/"
  },
  {
    "text": "Ana De Armas Shows Off Ripped Abs in Tiny Workout Ensemble - TMZ",
    "fullText": "Ana de Armas might not be a real \"Ballerina,\" but she's certainly got the physique of one ... just check out her slender frame in this form-fitting workout ensemble.",
    "link": "https://www.tmz.com/2025/12/27/ana-de-armas-flaunts-stomach-workout-ensemble/"
  },
  {
    "text": "Dark Energy may be changing and with it the fate of the Universe - BBC",
    "fullText": "A mysterious force called Dark Energy might be changing, in a way that challenges our current understanding of the nature of time and space.",
    "link": "https://www.bbc.com/news/articles/c17xe5kl78vo"
  },
  {
    "text": "Atlus Looks Forward To Persona's 30th Anniversary In 2026, Acknowledges Support For Persona 4 Revival - Nintendo Life",
    "fullText": "It can’t wait to make “another announcement”",
    "link": "https://www.nintendolife.com/news/2025/12/atlus-looks-forward-to-personas-30th-anniversary-in-2026-acknowledges-support-for-persona-4-revival"
  },
  {
    "text": "Jeffrey R. Holland, next in line to lead Church of Jesus Christ of Latter-day Saints, dies at 85 - NPR",
    "fullText": "Jeffrey R. Holland led the Quorum of the Twelve Apostles, a key governing body. He was next in line to become the church's president.",
    "link": "https://www.npr.org/2025/12/27/nx-s1-5659302/jeffrey-r-holland-church-of-jesus-christ-of-latter-day-saints-obit"
  },
  {
    "text": "Ex-Reality Star Arrested for Child, Animal Sex Crimes Had Animals Seized - TMZ",
    "fullText": "Former 'Neighbors With Benefits' reality star Tony McCollister had his animals seized during investigation for two different sex crimes.",
    "link": "https://www.tmz.com/2025/12/27/ex-reality-star-arrested-sex-crimes-animals-seized/"
  },
  {
    "text": "War-torn Myanmar votes in widely criticised 'sham' election - BBC",
    "fullText": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.",
    "link": "https://www.bbc.com/news/articles/cy7vly6gm76o"
  },
  {
    "text": "Samsung will debut two new wireless speakers at CES 2026 - The Verge",
    "fullText": "Samsung’s new wireless speakers from designer Erwan Bouroullec are designed to enhance the home design aesthetic.",
    "link": "https://www.theverge.com/news/850481/two-new-wireless-samsung-speakers-for-2026-lean-into-aesthetics"
  },
  {
    "text": "Oklahoma man charged in fatal shooting of neighbor while firing at target in his backyard - NBC News",
    "fullText": "An Oklahoma man has been charged with first-degree manslaughter after allegedly shooting a woman a few blocks from his home while firing at a target in his backyard",
    "link": "https://www.nbcnews.com/news/us-news/oklahoma-man-fatally-shooting-woman-target-practicing-backyard-rcna251138"
  },
  {
    "text": "PG&E outage: More than 6,000 S.F. customers without power for hours - San Francisco Chronicle",
    "fullText": "More than 6,000 Pacific Gas and Electric customers in the Richmond, Sunset and other SF neighborhoods regained power after a three-hour outage Saturday.",
    "link": "https://www.sfchronicle.com/sf/article/pge-outage-21264014.php"
  },
  {
    "text": "SpaceX scrubs launch Italian Earth observation satellite due to ground systems issue - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2025/12/27/live-coverage-spacex-to-launch-italian-earth-observation-satellite-on-final-falcon-9-flight-of-2025/"
  },
  {
    "text": "Stunning James Webb Space Telescope Images of 2025 - ABC News",
    "fullText": "From dwarf galazies, dust shells, and star clusters to nebulas, galaxies, and supernovas, the James Webb Space Telescope (JWST) revealed amazing images of the universe in 2025.",
    "link": "https://abcnews.go.com/International/photos/stunning-james-webb-space-telescope-images-2025-128724956"
  },
  {
    "text": "Search ongoing for Texas teen missing since Christmas Eve - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/search-ongoing-texas-teen-missing-christmas-eve/story?id\\\\u003d128724275"
  }
]