[
  {
    "text": "Fact Sheet: President Donald J. Trump Launches the Great American Recovery Initiative to Address the Addiction Crisis - The White House (.gov)",
    "fullText": "LAUNCHING THE GREAT AMERICAN RECOVERY INITIATIVE: Today, President Donald J. Trump signed an Executive Order creating the White House Great American",
    "link": "https://www.whitehouse.gov/fact-sheets/2026/01/fact-sheet-president-donald-j-trump-launches-the-great-american-recovery-initiative-to-address-the-addiction-crisis/"
  },
  {
    "text": "People complaining about Windows 11 hasn’t stopped it from hitting 1 billion users - Ars Technica",
    "fullText": "Windows 11 clears a milestone as Windows 10 continues its slow fade.",
    "link": "https://arstechnica.com/gadgets/2026/01/windows-11-has-hit-1-billion-users-just-a-hair-faster-than-windows-10-did/"
  },
  {
    "text": "Eagles hire Packers QB coach Sean Mannion as new OC - ESPN",
    "fullText": "The Eagles are hiring Packers quarterbacks coach Sean Mannion as their offensive coordinator.",
    "link": "https://www.espn.com/nfl/story/_/id/47770736/eagles-hire-packers-qb-coach-sean-mannion-new-oc"
  },
  {
    "text": "Saks to close most of its Off 5th and Last Call discount stores - CNN",
    "fullText": "The parent company of Saks Off 5th and Last Call will close most locations to focus on its luxury retail stores after filing for bankruptcy this month.",
    "link": "https://www.cnn.com/2026/01/29/business/saks-discount-stores-closures"
  },
  {
    "text": "Elon Musk’s SpaceX Is Said to Consider Merger With Tesla or xAI - Bloomberg",
    "fullText": "SpaceX is considering a potential merger with Tesla Inc., as well as an alternative combination with artificial intelligence firm xAI, according to people familiar with the matter, a sign billionaire Elon Musk is weighing how to consolidate his empire.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-29/elon-musk-s-spacex-is-said-to-consider-merger-with-tesla-or-xai"
  },
  {
    "text": "Beyond the brand names: Everything you need to know about Ozempic and other GPL-1 medications - New York Post",
    "fullText": "Get the skinny on Ozempic, Wegovy and more.",
    "link": "https://nypost.com/health/types-of-glp-1-drugs-guide/"
  },
  {
    "text": "Oscar Season’s Messy Side Comes for ‘Marty Supreme’ - hollywoodreporter.com",
    "fullText": "The nine-time Oscar nominee has faced resurfaced allegations regarding its director’s conduct on a previous movie, sharp criticism from the family who inspired its main character — and suspicions of a smear campaign.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/marty-supreme-safdie-oscars-1236488756/"
  },
  {
    "text": "Trump admin sues woman who failed to self deport for nearly $1 million - Politico",
    "fullText": "The new lawsuit is part of a wave of litigation seeking fines for undocumented immigrants for failing to depart the country.",
    "link": "https://www.politico.com/news/2026/01/29/immigration-deportation-lawsuits-00755663"
  },
  {
    "text": "Exclusive | A Secret FBI Bust Nabbed an Alleged Drug Lord—and Rocked Ties With Mexico - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/americas/a-secret-fbi-bust-nabbed-an-alleged-drug-lordand-rocked-relations-with-mexico-a19d4dd6"
  },
  {
    "text": "Why Democrats won't rush to force Noem impeachment vote - Axios",
    "fullText": "\"We don't want a show vote. We want a successful vote,\" House Democratic Leader Hakeem Jeffries said.",
    "link": "https://www.axios.com/2026/01/29/kristi-noem-impeachment-democrats-hakeem-jeffries"
  },
  {
    "text": "Google gives Pixel Tablet another two years of Android OS updates - 9to5Google",
    "fullText": "Google’s mostly-forgotten Pixel Tablet is getting a new lease on life, as the company is giving its one and only...",
    "link": "http://9to5google.com/2026/01/29/google-gives-pixel-tablet-another-two-years-of-android-os-updates/"
  },
  {
    "text": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate - MMA Fighting",
    "fullText": "Watch Khamzat Chimaev get in the face of fiery fighter.",
    "link": "https://www.mmafighting.com/ufc/468742/video-khamzat-chimaev-confronts-fighter-after-near-brawl-with-teammate"
  },
  {
    "text": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "fullText": "Federal officials have a plan that could curb billions of dollars in overpayments to Medicare Advantage plans. But will they follow through on it?",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691896/medicare-advantage-health-insurance-trump-oz-cms-upcoding"
  },
  {
    "text": "Handling of Pretti investigation has some prosecutors on verge of quitting - The Washington Post",
    "fullText": "Federal prosecutors in Minneapolis, deeply frustrated by the response to the shootings of Renée Good and Alex Pretti, have suggested they could resign en masse.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/29/minneapolis-shootings-prosecutor-resignations/"
  },
  {
    "text": "NASCAR National Series News & Notes – Bowman Gray Stadium - Jayski's NASCAR Silly Season Site",
    "fullText": "",
    "link": "https://www.jayski.com/2026/01/29/nascar-national-series-news-notes-bowman-gray-stadium-2/"
  },
  {
    "text": "Former NBC producer tells her own story about Matt Lauer in 'Unspeakable Things' - NPR",
    "fullText": "Brooke Nevils was working for NBC at the Sochi Olympics when, she says, she was sexually assaulted by Today Show host Matt Lauer — a claim he denies. Nevils' new memoir is Unspeakable Things.",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691662/brooke-nevils-matt-lauers-unspeakable-things"
  },
  {
    "text": "Minnesota chief federal judge cancels contempt hearing requiring ICE director’s appearance, lambasts agency - Star Tribune",
    "fullText": "U.S. Chief District Judge Patrick Schiltz had more sharp words for ICE in his order canceling a hearing requiring the agency’s director to appear.",
    "link": "https://www.startribune.com/minnesota-chief-federal-judge-cancels-contempt-hearing-requiring-ice-directors-appearance-lambasts-agency/601572718"
  },
  {
    "text": "An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account - WIRED",
    "fullText": "AI chat toy company Bondu left its web console almost entirely unprotected. Researchers who accessed it found nearly all the conversations children had with the company's stuffed animals.",
    "link": "https://www.wired.com/story/an-ai-toy-exposed-50000-logs-of-its-chats-with-kids-to-anyone-with-a-gmail-account/"
  },
  {
    "text": "Jeannie Mai Compares Jeezy Divorce to \"Experiencing Death Alive\" - E! News",
    "fullText": "After Jeannie Mai and Jeezy finalized their divorce, The Real alum detailed her experience amid their legal proceedings: \"It's one of the greatest pains that any human has to endure.\"",
    "link": "https://www.eonline.com/news/1427900/jeannie-mai-on-jeezy-divorce-aftermath"
  }
]