[
  {
    "text": "‘Stranger Things’ Crashes Netflix As Series Finale Debuts - Deadline",
    "fullText": "While many are tuning in to watch the Time's Square Ball drop, the real New Year's Eve party appears to be happening at Netflix.",
    "link": "http://deadline.com/2025/12/stranger-things-crashes-netflix-series-finale-1236659463/"
  },
  {
    "text": "Photos of New Year’s celebrations across the globe - AP News",
    "fullText": "___",
    "link": "https://apnews.com/photo-gallery/new-year-eve-2026-celebration-photos-990cefb87073dc84d362839d810c2919"
  },
  {
    "text": "Ex-champ Joshua out of hospital after car crash - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/boxing/story/_/id/47466722/ex-champ-anthony-joshua-released-hospital-car-crash"
  },
  {
    "text": "US military strikes three more alleged drug boats, killing 3 and possibly leaving survivors - Politico",
    "fullText": "The U.S. Southern Command did not reveal where Tuesday's attacks occurred, but said the Coast Guard was activated for a search and rescue operation.",
    "link": "https://www.politico.com/news/2025/12/31/us-military-strikes-three-more-alleged-drug-boats-killing-3-and-possibly-leaving-survivors-00708795"
  },
  {
    "text": "Exclusive | U.S. Finds Ukraine Didn’t Target Putin in Drone Strike - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/national-security/u-s-finds-ukraine-didnt-target-putin-in-drone-strike-615ce4be"
  },
  {
    "text": "David Beckham Leaves Brooklyn Out of 2025 Instagram Tribute Amid Family Feud - TMZ",
    "fullText": "Brooklyn Beckham is once again at the center of the Beckham family drama ... this time thanks to a glaring absence from dad David Beckham's 2025 Instagram recap.",
    "link": "https://www.tmz.com/2025/12/31/david-beckham-leaves-brooklyn-out-of-year-recap/"
  },
  {
    "text": "The Most Anticipated Movies of 2026 - The Hollywood Reporter",
    "fullText": "Along with a new ‘Dune’ and ‘Spider-Man’, 2026 will have nostalgia plays like ‘Devil Wears Prada’ and ‘Practical Magic’ sequels as well as films from Alejandro G. Iñárritu, Christopher Nolan and Greta Gerwig.",
    "link": "http://www.hollywoodreporter.com/lists/2026-new-movie-releases/"
  },
  {
    "text": "Packers claim CB Trevon Diggs off waivers - NBC Sports",
    "fullText": "The Cowboys waived Diggs on Tuesday for \"a culmination of multiple factors.\"",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/packers-claim-cb-trevon-diggs-off-waivers"
  },
  {
    "text": "5 key takeaways from Jack Smith's deposition on the Trump probes - Axios",
    "fullText": "Smith denied \"any characterization that our work was in any way meant to hamper him in the Presidential election.\"",
    "link": "https://www.axios.com/2025/12/31/trump-jack-smith-election-transcript-testimony-fbi"
  },
  {
    "text": "Body found confirmed to be missing 19-year-old Camila Mendoza Olmos, death ruled suicide - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/body-located-amid-search-missing-texas-teen-sheriff/story?id\\\\u003d128793412"
  },
  {
    "text": "Superbug hits 28 states, including Alabama: Where the deadly fungus is spreading - AL.com",
    "fullText": "A superbug that’s resistant to antibiotics is quickly spreading through the United States.",
    "link": "https://www.al.com/news/2025/12/superbug-hits-28-states-including-alabama-where-the-deadly-fungus-is-spreading.html"
  },
  {
    "text": "Sprinkles Cupcakes founder confirms bakery chain is closing permanently - CBS News",
    "fullText": "The chain started in Beverly Hills in 2005.",
    "link": "https://www.cbsnews.com/losangeles/news/sprinkles-cupcake-chain-closing/"
  },
  {
    "text": "More than 2,000 measles cases reported in the US this year as ongoing outbreaks threaten elimination status - CNN",
    "fullText": "The United States has reported more than 2,000 measles cases this year, federal data shows, a higher annual total than the country has seen in decades.",
    "link": "https://www.cnn.com/2025/12/31/health/measles-cases-outbreaks-continue"
  },
  {
    "text": "So Long, Warren. Buffett Leaves Astonishing Gains As He Steps Down As CEO. - Investor's Business Daily",
    "fullText": "Warren Buffett steps away as CEO of Berkshire Hathaway, leaving behind a stock near all-time highs and with a market capitalization of more than $1 trillion.",
    "link": "https://www.investors.com/news/warren-buffett-berkshire-hathaway-brkb-stock/"
  },
  {
    "text": "Trump administration forces coal power plant in northwestern Colorado to continue operating - The Colorado Sun",
    "fullText": "Craig Unit 1 was scheduled to close Wednesday, but federal energy officials claim there is a power emergency",
    "link": "http://coloradosun.com/2025/12/31/craig-station-emergency-order-coal-power-colorado-trump/"
  },
  {
    "text": "These bipartisan bills were noncontroversial — until Trump vetoed them - AP News",
    "fullText": "President Donald Trump has issued the first vetoes of his second term, rejecting two bipartisan natural resources bills. The Tuesday vetoes had the effect of punishing backers of the bills who had opposed the president’s positions on other issues. Trump vetoe…",
    "link": "https://apnews.com/article/trump-vetoes-boebert-miccosukee-tribe-alligator-alcatraz-ac59b3ab03fb6f3b09d65b0223f1b495"
  },
  {
    "text": "Snap bans on candy, soda to start in five US states, limiting food-aid purchases - BBC",
    "fullText": "West Virginia, Utah, Indiana, Iowa and Nebraska will have new rules for shopping with government food benefits.",
    "link": "https://www.bbc.com/news/articles/c0jvp5qdw0no"
  },
  {
    "text": "What to know about Zohran Mamdani's historic inauguration as New York City mayor - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/zohran-mamdanis-historic-inauguration-new-york-city-mayor/story?id\\\\u003d128784385"
  }
]