[
  {
    "text": "House passes DHS funding bill despite Democratic opposition over ICE - The Washington Post",
    "fullText": "Lawmakers are still on track to prevent another government shutdown at the end of the month.",
    "link": "https://www.washingtonpost.com/politics/2026/01/22/homeland-security-funding-ice-opposition/"
  },
  {
    "text": "Trump sues JPMorgan, Jamie Dimon over cutting off banking access - The Washington Post",
    "fullText": "President Donald Trump filed suit against JPMorgan Chase and its CEO, Jamie Dimon, saying the bank abruptly closed his accounts.",
    "link": "https://www.washingtonpost.com/business/2026/01/22/trump-lawsuit-jpmorganchase-dimon/"
  },
  {
    "text": "After ‘good’ Trump meeting, Zelensky pushes Europe hard to do more - The Washington Post",
    "fullText": "President Trump and White House envoy Steve Witkoff have said a deal to resolve nearly four years of war between Russia and Ukraine is close.",
    "link": "https://www.washingtonpost.com/world/2026/01/22/trump-zelensky-davos-ukraine-russia/"
  },
  {
    "text": "Maps show where winter storm threatens to bring heavy snow, ice, brutal cold this weekend - CBS News",
    "fullText": "Heavy snow, ice and brutal cold are expected to make this winter storm a potentially life-threatening weather event for 35 states.",
    "link": "https://www.cbsnews.com/news/maps-winter-storm-snow-cold-weekend/"
  },
  {
    "text": "US officially exits World Health Organization, accusing agency of straying 'from its core mission' - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/us-officially-exits-world-health-organization-accusing-agency/story?id\\\\u003d129455089"
  },
  {
    "text": "Exclusive | Capital One Strikes $5.15 Billion Deal for Fintech Brex - The Wall Street Journal",
    "fullText": "Deal gives credit-card issuer access to technology used by thousands of companies for corporate credit cards",
    "link": "https://www.wsj.com/finance/banking/capital-one-to-buy-fintech-brex-e2dacc67"
  },
  {
    "text": "Epic and Google have a secret $800 million Unreal Engine and services deal - The Verge",
    "fullText": "Antitrust settlement talks have revealed a deal between Epic and Google over the Unreal Engine and unspecified services, which could impact the judge’s decision.",
    "link": "https://www.theverge.com/policy/866140/epic-google-fortnite-android-unreal-deal-antitrust-settlement"
  },
  {
    "text": "Dow climbs 300 points, rebounds from Greenland tariff turmoil in two-day rally: Live updates - CNBC",
    "fullText": "Stocks rose on Thursday, extending their gains from the previous session after easing geopolitical fears sparked a broad-based market rally.",
    "link": "https://www.cnbc.com/2026/01/21/stock-market-today-live-updates.html"
  },
  {
    "text": "5,500-year-old DNA shows syphilis was rooted in the Americas, before Columbus - The Washington Post",
    "fullText": "Analysis of a shin bone found in a rock cave in Colombia suggests the sexually transmitted disease is much older than previously believed.",
    "link": "https://www.washingtonpost.com/health/2026/01/22/std-syphilis-origins-dna-sexual-health/"
  },
  {
    "text": "Veteran Detroit Lions OT ‘reports as retired,’ plans to transition to coaching - mlive.com",
    "fullText": "“It’s time for me to ‘report’ as retired. (Sorry I had to do it one last time!).”",
    "link": "https://www.mlive.com/lions/2026/01/veteran-detroit-lions-ot-reports-as-retired-plans-to-transition-to-coaching.html"
  },
  {
    "text": "Businesses close, Minnesotans to stay home Friday in protest of ICE - Star Tribune",
    "fullText": "From restaurants to schools and more, hundreds of locals plan to participate in the “ICE Out! Statewide shutdown” on Jan. 23 to show community unity against federal immigration action in the Twin Cities.",
    "link": "https://www.startribune.com/ice-out-statewide-shutdown-minnesota-business-school-closed-protest-economic-blackout-immigration/601567509"
  },
  {
    "text": "Our most anticipated films of Sundance 2026 - AV Club",
    "fullText": "From a timely immigration doc to the greatest party of Black luminaries ever held, Sundance 2026 closes out its stint in Utah with a bang.",
    "link": "https://www.avclub.com/sundance-2026-most-anticipated"
  },
  {
    "text": "The Texas snow and ice forecast is changing. Here’s an update. - expressnews.com",
    "fullText": "Models show the arctic cold front is trending slower than previously expected, which could have a big effect on how much snow and ice will fall.",
    "link": "https://www.expressnews.com/san-antonio-weather/article/cold-arctic-snow-texas-ice-storm-freeze-21309181.php"
  },
  {
    "text": "Mexican authorities arrest alleged crime figure ‘El Botox’ in killing of lime growers’ leader - AP News",
    "fullText": "Mexican authorities have arrested an alleged organized crime figure in Michoacan linked to the killing of a lime growers' leader. Security Secretary Omar García Harfuch said the man known as “El Botox” was arrested for extorting lime growers and various homic…",
    "link": "https://apnews.com/article/mexico-michoacan-sheinbaum-limes-botox-536262256e71ef85b2841035dede8d31"
  },
  {
    "text": "US optimistic on end to war as Zelensky says Ukraine to talk to US and Russia - BBC",
    "fullText": "The meeting came as US envoy Steve Witkoff headed to Moscow for a meeting with Russia's Vladimir Putin.",
    "link": "https://www.bbc.com/news/articles/c4g44r22j5jo"
  },
  {
    "text": "A vaccine trial is called 'unethical' and a 'unique' opportunity. Is it on or off? - NPR",
    "fullText": "The U.S. is giving $1.6 million to researchers to study how the hepatitis B vaccine affects newborns in Guinea-Bissau. Local officials say the trial is suspended. U.S. officials say that's inaccurate.",
    "link": "https://www.npr.org/2026/01/22/g-s1-106571/vaccine-trial-hepatitis-b-guinea-bissau"
  },
  {
    "text": "FTX Exec Caroline Ellison Is Now a Free Woman - Business Insider",
    "fullText": "Caroline Ellison, the former Alameda Research CEO, was freed this week after spending about 14 months of her two-year sentence in federal custody.",
    "link": "https://www.businessinsider.com/ftx-exec-caroline-ellison-prison-release-2026-1"
  },
  {
    "text": "Top CDC vaccine adviser questions need for polio shot, other longstanding recommendations - statnews.com",
    "fullText": "The chair of a federal vaccine advisory panel charted a new course for the committee in a podcast released Thursday, questioning longstanding recommendations.",
    "link": "https://www.statnews.com/2026/01/22/vaccine-policy-adviser-kirk-milhoan-individual-rights-trump-public-health/"
  },
  {
    "text": "Harry Styles Announces 2026 Tour Dates, Including 30 Nights in New York City - Variety",
    "fullText": "Harry Styles has announced dates for his hotly anticipated tour in support of his forthcoming fourth solo album 'Kiss All the Time. Disco, Occasionally.'",
    "link": "https://variety.com/2026/music/news/harry-styles-2026-tour-dates-1236638023/"
  },
  {
    "text": "Star Wars: Maul – Shadow Lord Teaser Trailer and First Poster Arrive - StarWars.com",
    "fullText": "Executive producers break down new characters and locations from the animated series, which premieres on Disney+ April 6, 2026, with the full cast announcement and a first look at the story to come.",
    "link": "https://www.starwars.com/news/star-wars-maul-shadow-lord-first-trailer-poster-art"
  }
]