[
  {
    "text": "Bangladesh dynastic heir defeats Islamist challengers in post-uprising election - Financial Times",
    "fullText": "Country holds first poll after 2024 youth-led revolution that ousted longtime leader Sheikh Hasina",
    "link": "https://www.ft.com/content/3b3ca149-4f17-44e9-a3f1-c1285f577876"
  },
  {
    "text": "Trump’s campaign against ‘left-wing’ media finds a new target: Apple News - The Washington Post",
    "fullText": "Federal Trade Commission Chairman Andrew Ferguson wrote a letter to Apple that warned the company its choice of articles in Apple News could violate the law.",
    "link": "https://www.washingtonpost.com/technology/2026/02/12/apple-news-bias-ftc-ferguson-letter/"
  },
  {
    "text": "‘Did you see Guiliano’s tackle?’ - Eric Garcia talks red card controversy after Barcelona vs Atletico - Barca Blaugranes",
    "fullText": "Somehow…there was only one sending off.",
    "link": "https://www.barcablaugranes.com/barcelona-copa-del-rey/112646/did-you-see-guilianos-tackle-eric-garcia-talks-red-card-controversy-after-barcelona-vs-atletico"
  },
  {
    "text": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "fullText": "The Trump administration had removed the LGBTQ+ symbol, citing a policy limiting what can be displayed on federal property.",
    "link": "https://www.washingtonpost.com/nation/2026/02/12/pride-flag-stonewall-inn-trump/"
  },
  {
    "text": "Japan says it seized Chinese vessel amid tensions with Beijing - BBC",
    "fullText": "The fishing boat tried to flee when ordered to stop for an inspection inside Japan's territorial waters, authorities say.",
    "link": "https://www.bbc.com/news/articles/c2e4791re38o"
  },
  {
    "text": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece - CBS News",
    "fullText": "The Justice Department alleges that CBP officer and supervisor Andres Wilkinson had been living in Laredo, Texas, with a woman who had overstayed her visa and is now in the U.S. illegally.",
    "link": "https://www.cbsnews.com/news/cbp-officer-federal-charges-allegations-harbored-unauthorized-immigrant-girlfriend-niece/"
  },
  {
    "text": "A Pilot Fired Over Kristi Noem’s Missing Blanket and the Constant Chaos Inside DHS - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/policy/chaos-kristi-noem-homeland-security-f095ac95"
  },
  {
    "text": "Seahawks' Julian Love sets record straight on how much they knew was coming from Patriots offense in Super Bowl LX - NFL.com",
    "fullText": "With NFL Films capturing some prophetic words from Julian Love during Super Bowl LX, many were led to believe the Seahawks D knew just what was coming from the Patriots offense. The standout safety explained just how much they knew on Thursday's The Insid",
    "link": "https://www.nfl.com/news/seahawks-julian-love-sets-record-straight-on-how-much-they-knew-was-coming-from-patriots-offense-in-super-bowl-lx"
  },
  {
    "text": "Judge dismisses California deportation case for Mexican father of 3 US Marines - AP News",
    "fullText": "An immigration judge has dismissed the deportation case against a landscaper who was arrested in California last year. Now the father of three U.S. Marines is on a path toward legal permanent residency in the U.S. The June detention of Narciso Barranco, who c…",
    "link": "https://apnews.com/article/narciso-barranco-immigration-case-dismissed-california-7aaa4c33945c868b1369949302cb296b"
  },
  {
    "text": "Former McKinsey partner to lead Australian opposition party - Financial Times",
    "fullText": "Angus Taylor pledges more conservative agenda after Liberals ditch first female leader",
    "link": "https://www.ft.com/content/c60bca86-5c26-4faf-baa0-33adb4b36703"
  },
  {
    "text": "When Amazon badly needed a ride, Europe’s Ariane 6 rocket delivered - Ars Technica",
    "fullText": "This was the first launch of the Ariane 64, the most powerful rocket in European space history.",
    "link": "https://arstechnica.com/space/2026/02/when-amazon-badly-needed-a-ride-europes-ariane-6-rocket-delivered/"
  },
  {
    "text": "Saturn’s Rings Came From a Two-Moon Collision About 100 Million Years Ago, Study Says - Gizmodo",
    "fullText": "The collision could also be responsible for Saturn’s iconic rings, researchers say.",
    "link": "https://gizmodo.com/saturns-rings-came-from-a-two-moon-collision-about-100-million-years-ago-study-says-2000721450"
  },
  {
    "text": "‘Marathon’ Announces Free Open Beta Release Date, And It’s A Bit Late - Forbes",
    "fullText": "Bungie has announced the dates for Marathon's free open beta preview test, and it's going to be pretty late in the game.",
    "link": "https://www.forbes.com/sites/paultassi/2026/02/12/marathon-announces-free-open-beta-release-date-and-its-a-bit-late/"
  },
  {
    "text": "Ambassador Greer Oversees Signing of U.S.-Taiwan Agreement on Reciprocal Trade - United States Trade Representative (.gov)",
    "fullText": "WASHINGTON — Today, Ambassador Jamieson Greer attended the signing of an Agreement on Reciprocal Trade between the United States of America and Taiwan, under the auspices of the American Institute in Taiwan and the Taipei Economic and Cultural Representative …",
    "link": "https://ustr.gov/about/policy-offices/press-office/press-releases/2026/february/ambassador-greer-oversees-signing-us-taiwan-agreement-reciprocal-trade"
  },
  {
    "text": "Lego Star Wars ‘The Mandalorian and Grogu’ sets just launched, and we got a first look - CNN",
    "fullText": "Today, Lego revealed five new Star Wars sets themed around the movie “The Mandalorian and Grogu.”",
    "link": "https://www.cnn.com/cnn-underscored/home/lego-star-wars-sets-launch"
  },
  {
    "text": "NASA telescope spots the building blocks for life spewing out of comet 3I/ATLAS - Live Science",
    "fullText": "NASA's SPHEREx space telescope detected organic molecules coming off comet 3I/ATLAS as the interstellar visitor made its closest approach to Earth in December.",
    "link": "https://www.livescience.com/space/comets/nasa-telescope-spots-the-building-blocks-for-life-spewing-out-of-comet-3i-atlas"
  },
  {
    "text": "Leclerc leads Norris on second day of Bahrain testing - Formula 1",
    "fullText": "Charles Leclerc topped the timesheets as the second day of pre-season testing at the Bahrain International Circuit came to a close – the Ferrari driver leading the way from McLaren’s Lando Norris and Haas’ Ollie Bearman.",
    "link": "https://www.formula1.com/en/latest/article/leclerc-leads-norris-and-bearman-on-second-day-of-bahrain-testing.6zednZ3STVzCXDyqsPRUFy"
  },
  {
    "text": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "fullText": "\"This is very serious, and we're not going to let it go,\" said one House Democrat.",
    "link": "https://www.axios.com/2026/02/12/pam-bondi-trump-spying-congress-doj-epstein"
  },
  {
    "text": "Colorectal cancer is rising in younger adults. Here's who is most at risk and symptoms to watch for - AP News",
    "fullText": "The death of “Dawson’s Creek” actor James Van Der Beek highlights a rising trend in colorectal cancer among young adults. While overall colorectal cancer rates have inched down in recent years, rates for those under 50 have risen. It is now the top cancer kil…",
    "link": "https://apnews.com/article/colon-cancer-young-adults-boseman-van-der-beek-7200285f2060145b8369de9ed8db9c17"
  }
]