[
  {
    "text": "Israel identifies remains of last Gaza hostage - BBC",
    "fullText": "The Israeli military had been searching for Ran Gvili since the ceasefire with Hamas began in October.",
    "link": "https://www.bbc.com/news/articles/c5ydvz7nz4mo"
  },
  {
    "text": "Trump sends Tom Homan to Minnesota to manage ICE after Alex Pretti killing - CNBC",
    "fullText": "The killing of ICU nurse Alex Pretti by federal agents in Minneapolis, like the fatal shooting of Renee Good by an ICE officer, was caught on video.",
    "link": "https://www.cnbc.com/2026/01/26/trump-tom-homan-minnesota-alex-pretti-ice.html"
  },
  {
    "text": "Daniel Jeremiah 2026 NFL mock draft 1.0: Raiders pick QB at No. 1; Jets among 3 teams to go WR - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Daniel Jeremiah sees the Raiders selecting a new franchise cornerstone, while the Jets are among four teams to pick a wide receiver. Check out his full first-round projection, 1-32.",
    "link": "https://www.nfl.com/news/daniel-jeremiah-2026-nfl-mock-draft-1-0"
  },
  {
    "text": "Philip Rivers withdraws from consideration for the Bills’ head coaching job - NBC Sports",
    "fullText": "Rivers interviewed with the team last week, but will not make the jump to a coaching job right now.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/philip-rivers-withdraws-from-consideration-for-bills-head-coaching-job"
  },
  {
    "text": "U.S. carrier strike group enters Middle East region after Iran commander warns U.S. its forces have \"finger on the trigger\" - CBS News",
    "fullText": "The USS Abraham Lincoln aircraft carrier strike group has crossed into Central Command, the Middle East region that includes Iran, a U.S. official told CBS News.",
    "link": "https://www.cbsnews.com/news/us-carrier-strike-group-middle-east-region-iran/"
  },
  {
    "text": "Senators call for Alex Pretti death investigation. And, winter storm recovery efforts - NPR",
    "fullText": "Minneapolis strikes and protests continue after ICE's fatal shooting of Alex Pretti. And, states work to recover from a massive winter storm that has left widespread power outages and flight chaos.",
    "link": "https://www.npr.org/2026/01/26/g-s1-107331/up-first-newsletter-alex-pretti-minneapolis-senate-dhs-funding-icy-weather"
  },
  {
    "text": "Former Home Secretary Suella Braverman becomes latest Tory defect to Reform UK saying 'it feels like I've come home' - lbc.co.uk",
    "fullText": "She becomes the latest in a slew of Conservatives to join Nigel Farage's party.",
    "link": "https://www.lbc.co.uk/article/suella-braverman-defects-reform-uk-5HjdRKY_2/"
  },
  {
    "text": "Former astronaut on lunar spacesuits: “I don’t think they’re great right now” - Ars Technica",
    "fullText": "These are just the difficulties of designing a spacesuit for the lunar environment.\"",
    "link": "https://arstechnica.com/space/2026/01/former-astronaut-on-lunar-spacesuits-i-dont-think-theyre-great-right-now/"
  },
  {
    "text": "Paddy Pimblett health update provided by his wife after he was hospitalized following UFC 324 - Bloody Elbow",
    "fullText": "Paddy Pimblett's wife, Laura, has insisted her husband is 'absolutely fine' despite being transported to hospital after UFC 324.",
    "link": "https://bloodyelbow.com/2026/01/26/paddy-pimblett-health-update-provided-by-his-wife-after-he-was-hospitalized-following-ufc-324/"
  },
  {
    "text": "Storm dies down in Upstate NY, but how long will bitter cold last? - syracuse.com",
    "fullText": "Temperatures will be well below normal through the weekend.",
    "link": "https://www.syracuse.com/weather/2026/01/storm-winds-down-in-upstate-ny-but-how-long-will-bitter-cold-last.html"
  },
  {
    "text": "Stock futures are little changed as traders get set for a big week of trading: Live updates - CNBC",
    "fullText": "Stock futures were relatively unchanged on Monday as traders braced for a big week, with key earnings reports and a U.S. monetary policy meeting.",
    "link": "https://www.cnbc.com/2026/01/25/stock-market-today-live-updates.html"
  },
  {
    "text": "Scientists just got the clearest picture of the dark universe yet: 'Now the dream has come true' - Space",
    "fullText": "\"These results from the Dark Energy Survey shine new light on our understanding of the universe and its expansion.\"",
    "link": "https://www.space.com/astronomy/dark-universe/scientists-just-got-the-clearest-picture-of-the-dark-universe-yet-now-the-dream-has-come-true"
  },
  {
    "text": "Is your penis really an indicator of longevity? Bryan Johnson thinks so — the real experts weigh in - New York Post",
    "fullText": "Are these biohackers playing the long game — or overextending themselves for a pipe dream?",
    "link": "https://nypost.com/2026/01/26/health/is-your-penis-an-indicator-of-longevity-experts-weigh-in/"
  },
  {
    "text": "Town-by-town totals: How much snow has fallen in Mass. so far? - boston25news.com",
    "fullText": "A massive, long-duration winter storm continues on Monday that will dump up to two feet of snow in some areas.",
    "link": "https://www.boston25news.com/news/local/town-by-town-totals-how-much-snow-has-fallen-mass-so-far/RT35L262E5HQPMDUW2GOIDXEYI/"
  },
  {
    "text": "How $16B in earmarks evaded conservative ire — and helped clinch a funding deal - Politico",
    "fullText": "Republican leaders have agreed to earmarks for thousands of pet projects in specific congressional districts.",
    "link": "https://www.politico.com/news/2026/01/26/earmarks-conservatives-government-funding-00745730"
  },
  {
    "text": "Natural gas prices hit $6 for first time since 2022 as massive winter storm sweeps U.S. - CNBC",
    "fullText": "U.S. natural gas prices surged above $6 for the first time since late 2022 on Monday as a massive winter storm sweeps across the country.",
    "link": "https://www.cnbc.com/2026/01/26/us-natural-gas-prices-snow-ice-winter-storm-fern.html"
  },
  {
    "text": "Lifetime alcohol use linked to higher risk of colorectal cancer, new study finds - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/lifetime-alcohol-linked-higher-risk-colorectal-cancer-new/story?id\\\\u003d129547475"
  },
  {
    "text": "Intel Panther Lake Is the Answer to Apple Silicon We’ve All Been Waiting for - WIRED",
    "fullText": "I’ve tested two laptops powered by Panther Lake—pitting them head-to-head against laptops with Apple Silicon—and Intel has finally scored a much-needed win with the Core Ultra Series 3.",
    "link": "https://www.wired.com/story/intel-panther-lake-core-ultra-series-3-review/"
  }
]