[
  {
    "text": "2026 Winter Olympics live updates: U.S. speed skating stars Bowe and Jackson sprint for women's 1000m gold - NBC Olympics",
    "fullText": "Visit NBCOlympics.com for Winter Olympics live streams, highlights, schedules, results, news, athlete bios and more from Milan Cortina 2026.",
    "link": "https://www.nbcolympics.com/news/live/2026-winter-olympics-live-updates-feb-9-highlights-scores-results"
  },
  {
    "text": "An unexpected theme of this year's Super Bowl ads: tech glitches - Business Insider",
    "fullText": "Tech didn't just star in Super Bowl ads this year — it stumbled. While the stakes are high for advertisers, some glitches aren't always a bad thing.",
    "link": "https://www.businessinsider.com/super-bowl-2026-advertisers-tech-glitches-salesforce-ai-kalshi-2026-2"
  },
  {
    "text": "New video footage released from day of the fatal Brown University shooting - NBC News",
    "fullText": "PROVIDENCE, R.I. — New video footage from the day of the Brown University shooting that killed two students and injured nine others was released Monday, with city officials saying they had redacted the most graphic, violent images to avoid harming victims and…",
    "link": "https://www.nbcnews.com/news/us-news/new-video-footage-released-day-fatal-brown-university-shooting-rcna258166"
  },
  {
    "text": "Trump leaves Republicans guessing on midterms plans as outlook darkens - The Washington Post",
    "fullText": "The president is said to be eager to increase his involvement but has yet to approve a spending plan for his $300 million-plus war chest.",
    "link": "https://www.washingtonpost.com/politics/2026/02/09/trump-midterm-plans/"
  },
  {
    "text": "Column | Want to lose weight? Here’s why exercise probably won’t help. - The Washington Post",
    "fullText": "The benefits of exercise are numerous, but losing weight isn’t one of them. Here are some better motivations to add regular exercise to your routine.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/09/exercise-weight-loss/"
  },
  {
    "text": "NBC camera operator nails perfect shot of Charlie Puth during national anthem - Awful Announcing",
    "fullText": "An NBC camera operator nailed a perfect shot of Charlie Puth during the national anthem as fighter jets conducted a flyover at Levi's Stadium.",
    "link": "https://awfulannouncing.com/nbc/camera-operator-nails-perfect-shot-charlie-puth-national-anthem.html"
  },
  {
    "text": "Exclusive | Kroger Names an Ex-Walmart Executive as Its Next CEO - The Wall Street Journal",
    "fullText": "Greg Foran takes over big grocer as it deals with cash-strapped shoppers and seeks to expand its footprint",
    "link": "https://www.wsj.com/business/retail/kroger-ceo-greg-foran-walmart-c4885390"
  },
  {
    "text": "Bonobos are capable of pretend play, just like human children - cnn.com",
    "fullText": "Children love to play pretend, holding imaginary tea parties, educating classrooms of teddies or running their own grocery stores.  Now, a new study suggests that such make-believe play is not a uniquely human talent, but a skill that great apes also possess.",
    "link": "https://www.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli"
  },
  {
    "text": "Capitol agenda: Republicans prepare DHS punt - Politico",
    "fullText": "It's highly unlikely all sides can agree to a full-year Department of Homeland Security revamp by Friday at midnight.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/dhs-shutdown-funding-bill-continuing-resolution-00771028"
  },
  {
    "text": "The latest on the search for Nancy Guthrie. And, takeaways from Super Bowl 60 - NPR",
    "fullText": "The search for Nancy Guthrie enters a second week. And, the Seattle Seahawks win Super Bowl 60, beating the New England Patriots 29-13. Here are the highlights from the big game.",
    "link": "https://www.npr.org/2026/02/09/g-s1-109304/up-first-newsletter-nancy-guthrie-ghislane-maxwell-super-bowl-60-state-department"
  },
  {
    "text": "She's not old enough for a driver's license. But at 15, she's the youngest U.S. Olympian. - NBC News",
    "fullText": "To understand how the freestyle skier Abby Winterberger became, at just 15 years old, the youngest member of Team USA at the Milan Cortina Winter Olympics, it’s necessary to understand her fearlessness",
    "link": "https://www.nbcnews.com/sports/olympics/not-old-enough-drivers-license-15-youngest-us-olympian-rcna257416"
  },
  {
    "text": "Eileen Gu and Mathilde Gremaud face off again in Olympics freeski slopestyle final - AP News",
    "fullText": "Mathilde Gremaud has successfully defended her Olympic freeski slopestyle title and denied Eileen Gu a gold medal for a second straight Winter Games. Gremaud won Monday’s final with a score of 86.96 from her best of three jumps. Gu again took silver behind he…",
    "link": "https://apnews.com/article/eileen-gu-gremaud-slopestyle-freeski-olympics-14d8453ead1902113b0c6c0a4a36c21e"
  },
  {
    "text": "New York GOP’s midterm problem: No money, no bench — and Trump - Politico",
    "fullText": "The hard-knock life of a blue-state Republican looks even worse this midterm.",
    "link": "https://www.politico.com/news/2026/02/09/new-york-gop-midterm-problem-00769887"
  },
  {
    "text": "Eritrea accuses Ethiopia of fabricating report its troops had crossed the border - BBC",
    "fullText": "Ethiopia had alleged that Eritrean soldiers were on its territory and supporting rebels in the north.",
    "link": "https://www.bbc.com/news/articles/cn87lzrj1l7o"
  },
  {
    "text": "A 'Shark Tank' alum needed cash to pay tariffs. This shadowy lending world was ready - NPR",
    "fullText": "How about $350,000 within hours? The pitches flood small businesses: \"No hidden fees, No BS.\" These financial lifelines are barely regulated and can turn into trip wires.",
    "link": "https://www.npr.org/2026/02/09/nx-s1-5628425/shark-tank-tariffs-loans-cash-advance"
  },
  {
    "text": "Inside the ‘Cigar SCIF:' How Tom Cole pulled off a House appropriations miracle - Politico",
    "fullText": "From his clubby Capitol office, the 76-year-old Appropriations chair managed demanding colleagues and political headwinds — and pulled off a seemingly impressive feat.",
    "link": "https://www.politico.com/news/2026/02/09/tom-cole-house-appropriations-profile-00770360"
  },
  {
    "text": "Green Day pulls its political punches in Super Bowl performance - cnn.com",
    "fullText": "The 1994 version of Billie Joe Armstrong would never.",
    "link": "https://www.cnn.com/2026/02/08/sport/green-day-super-bowl-performance"
  }
]