[
  {
    "text": "Record scratch—Google’s Lyria 3 AI music model is coming to Gemini today - Ars Technica",
    "fullText": "With a simple prompt, you can generate 30 seconds of something like music.",
    "link": "https://arstechnica.com/google/2026/02/gemini-can-now-generate-ai-music-for-you-no-lyrics-required/"
  },
  {
    "text": "Takaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development - Associated Press News",
    "fullText": "Japanese Prime Minister Sanae Takaichi says she hopes to deepen her relationship with U.S. President Donald Trump. She wants to strengthen cooperation between the two countries in rare earths development and other areas of economic security when she visits Wa…",
    "link": "https://apnews.com/article/japan-takaichi-us-china-trump-defense-aa82f8a3b5a7120575072f390f30fb97"
  },
  {
    "text": "Google’s Pixel 10a arrives on March 5 for $499 with specs and design of yesteryear - Ars Technica",
    "fullText": "Google's new budget phone is here, but don't expect a big upgrade.",
    "link": "https://arstechnica.com/gadgets/2026/02/googles-pixel-10a-arrives-on-march-5-for-499-with-specs-and-design-of-yesteryear/"
  },
  {
    "text": "Toyota’s C-HR electric hatchback starts at $38,135 - The Verge",
    "fullText": "Toyota revealed new details about the upcoming C-HR electric hatchback, which will go on sale for $38,135 in March 2026.",
    "link": "https://www.theverge.com/transportation/880395/toyota-chr-ev-price-range-specs"
  },
  {
    "text": "New Hampshire’s GOP Gov. Kelly Ayotte draws her first major challenger - Politico",
    "fullText": "Democrat Cinde Warmington launched another bid for the governor’s office after running unsuccessfully in 2024.",
    "link": "https://www.politico.com/news/2026/02/18/new-hampshire-kelly-ayotte-cinde-warmington-00785878"
  },
  {
    "text": "'Difficult' Russia-Ukraine peace talks end without breakthrough - BBC",
    "fullText": "The second day of negotiations between Ukraine and Russia ended after just two hours.",
    "link": "https://www.bbc.com/news/articles/c0k1xj0d708o"
  },
  {
    "text": "Stock futures rise ahead of Fed minutes as Nvidia shares gain: Live updates - CNBC",
    "fullText": "The major averages posted slim gains on Tuesday, kicking off a holiday-shortened week.",
    "link": "https://www.cnbc.com/2026/02/17/stock-market-today-live-updates.html"
  },
  {
    "text": "Democratic-led cities move to block ICE, setting up clash with Trump - The Washington Post",
    "fullText": "In New York, Philadelphia and elsewhere, elected Democrats are taking steps to try to limit immigration crackdowns like the one winding down in Minneapolis.",
    "link": "https://www.washingtonpost.com/nation/2026/02/18/philadelphia-new-york-blue-cities-fight-ice/"
  },
  {
    "text": "Friedrich Merz says fighter jet project fails to meet Germany’s needs - Financial Times",
    "fullText": "Chancellor’s comments contradict Emmanuel Macron and hint at probable unravelling of the Future Combat Air System",
    "link": "https://www.ft.com/content/255d40ef-9809-4855-a8c1-0413f479f582"
  },
  {
    "text": "Winter Olympics 2026: Team GB's curling semi-final hopes alive after sensational win over US - BBC",
    "fullText": "Rebecca Morrison executes a sensational double takeout with her final stone as Team GB steal two in the final end to beat the United States 8-7.",
    "link": "https://www.bbc.com/sport/articles/c0q3nejy1pjo"
  },
  {
    "text": "Unprecedented ‘Jobless Boom’ Tests Limits of US Economic Expansion - Bloomberg.com",
    "fullText": "Uneven growth puts the outlook on a fragile footing.",
    "link": "https://www.bloomberg.com/news/features/2026-02-18/us-economy-expansion-forecast-even-with-weak-jobs-data"
  },
  {
    "text": "The Justice Department is not acting like it used to, criminal defense lawyers note - NPR",
    "fullText": "Criminal defense lawyers are tracking when the Justice Department appears to rely on irregular charging practices, including aggressive legal theories and possible political retribution.",
    "link": "https://www.npr.org/2026/02/18/g-s1-110397/justice-department-tracker-abnormal-criminal-charges"
  },
  {
    "text": "This form of mental exercise may cut dementia risk for decades - NPR",
    "fullText": "A study finds that people who did one specific form of brain training in the 1990s were less likely to be diagnosed with dementia over the next 20 years.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5716010/brain-training-exercise-cut-dementia-risk-decades"
  },
  {
    "text": "Surprise 4-legged Olympic competitor wows cross-country fans - NPR",
    "fullText": "Nazgul sprints on the course at a cross-country ski race, crossing the finish line in an unsanctioned quest for glory.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5718025/surprise-four-legged-olympic-competitor-wows-cross-country-fans"
  },
  {
    "text": "Robert Pattinson says a therapist once asked him if he was on drugs because they 'couldn't understand' him - ew.com",
    "fullText": "Robert Pattinson recalls that a therapist once thought he was on drugs, because they couldn't understand what he was saying.",
    "link": "https://ew.com/robert-pattinson-says-therapist-thought-he-was-on-drugs-11908451"
  },
  {
    "text": "Michigan State 82-59 UCLA (Feb 17, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401825521"
  },
  {
    "text": "Tom Noonan Dies: ‘Manhunter’ Villain and Sundance-Winning Indie Director Was 74 - Phrasemaker",
    "fullText": "Tom Noonan, the distinctive character actor, playwright and filmmaker best known for his haunting turn in “Manhunter” and his Sundance-winning indie “What Happened Was…,” has died.",
    "link": "https://thephrasemaker.com/2026/02/18/tom-noonan-dies-manhunter-villain-and-sundance-winning-indie-director-was-74/"
  },
  {
    "text": "NJ investigating bird flu outbreak after dozens of geese found dead in Gloucester County - 6abc Philadelphia",
    "fullText": "Large numbers of dead or dying geese have been found at parks across the state, including Gloucester County.",
    "link": "https://6abc.com/post/nj-investigating-bird-flu-outbreak-dozens-geese-found-dead-gloucester-county/18614420/"
  }
]