[
  {
    "text": "Stock Market Today: Dow Futures Inch Lower; Oil Prices Rise — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on business and markets, including the Dow, the S&P 500 and the Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-19-2026"
  },
  {
    "text": "Blood tests show potential for predicting start of Alzheimer’s symptoms - The Washington Post",
    "fullText": null,
    "link": "https://www.washingtonpost.com/health/2026/02/19/alzheimers-tests-symptom-onset-predictions/"
  },
  {
    "text": "Column | 8 science-backed habits for a healthier heart - The Washington Post",
    "fullText": "People who focus on these things not only have better cardiovascular health, but are also protected against conditions such as diabetes, dementia and cancer.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/19/habits-for-heart-health/"
  },
  {
    "text": "The biggest app in the whole wide world - The Verge",
    "fullText": "Out of the millions of apps in the Apple App Store, only a few hundred have ever topped its free charts. Developers have learned the tricks to get there.",
    "link": "https://www.theverge.com/tech/876196/top-app-store-apps-developers"
  },
  {
    "text": "Canadians kind of hate America now. Our new poll shows just how much. - Politico",
    "fullText": "It’s not just about the trade war. Nearly half of America’s neighbors to the north now think the U.S. is a bigger threat to world peace than Russia.",
    "link": "https://www.politico.com/news/2026/02/19/5-charts-show-just-how-badly-the-us-has-torpedoed-its-relationship-with-canada-00787084"
  },
  {
    "text": "Former South Korean President Yoon receives life sentence for imposing martial law - Associated Press News",
    "fullText": "Former South Korean President Yoon Suk Yeol has been sentenced to life in prison for his brief imposition of martial law to suppress the opposition. The Seoul Central District Court on Thursday found Yoon guilty of mobilizing military and police forces in an …",
    "link": "https://apnews.com/article/south-korea-yoon-suk-yeol-martial-law-verdict-rebellion-5d5f5c3a82590dc805b41b905f5bbca1"
  },
  {
    "text": "Hubert David Post-State Press Conference Full Transcript - 247Sports",
    "fullText": "After the 5882 loss to North Carolina State Hubert David met with the press to discuss the game",
    "link": "https://247sports.com/college/north-carolina/article/unc-mens-basketball-274733131/"
  },
  {
    "text": "8 dead in Tahoe avalanche; victims include Sugar Bowl ski team moms - San Francisco Chronicle",
    "fullText": "Eight people were killed in a Tahoe backcountry avalanche. Among the victims were mothers of Sugar Bowl youth team skiers, officials said.",
    "link": "https://www.sfchronicle.com/california/article/tahoe-avalanche-skiers-dead-21360546.php"
  },
  {
    "text": "Vivo V70 is officially here with impressive Zeiss cameras: you're invited to the flagship party! - PhoneArena",
    "fullText": "Spending a ton of cash on Ultras and Pros is not the only way to enjoy mobile photography.",
    "link": "https://www.phonearena.com/news/vivo-v70-is-officially-here_id178311"
  },
  {
    "text": "February 18, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "fullText": "Today Illinois governor J.B.",
    "link": "https://heathercoxrichardson.substack.com/p/february-18-2026"
  },
  {
    "text": "As Israel takes steps to claim land in West Bank, U.S. stands by - The Washington Post",
    "fullText": "Despite Trump’s opposition to annexation, Israel has moved to expand control over the West Bank — to the condemnation of Britain and others at a U.N. Security Council meeting.",
    "link": "https://www.washingtonpost.com/world/2026/02/18/israel-west-bank-annexation-trump-land-registration/"
  },
  {
    "text": "José María Balcázar becomes Peru’s eighth president in a decade - Associated Press News",
    "fullText": "José María Balcázar has become Peru's new interim president, replacing another interim leader who was removed over corruption allegations just four months into his term. Balcázar was elected late Wednesday with a majority in the 130-member legislature, defeat…",
    "link": "https://apnews.com/article/peru-president-congress-interim-election-c6f1e2d6c061ea8ba1cb0f4f467609bc"
  },
  {
    "text": "Quick hits: No. 8 Illini put on a show in 101-65 laugher over USC - 247Sports",
    "fullText": "Seven Illini scored in double figures in the Illinis third Big Ten win of 26 points",
    "link": "https://247sports.com/college/illinois/article/illinois-fighting-illini-basketball-usc-trojans-quick-hits-recap-274866164/"
  },
  {
    "text": "3 takeaways from BYU’s loss at No. 4 Arizona - Deseret News",
    "fullText": "The Cougars couldn’t topple No. 4 Arizona, with the shorthanded Wildcats scoring a 75-68 victory Wednesday night at McKale Center in Tucson.",
    "link": "https://www.deseret.com/sports/2026/02/18/byu-basketball-loses-against-arizona-mckale-center-3-takeaways/"
  },
  {
    "text": "Bowser declares Potomac sewage spill an emergency, seeks federal aid for cleanup - The Washington Post",
    "fullText": "The administration of D.C. Mayor Muriel E. Bowser hopes the move will free up federal funds to reimburse local authorities for repair and recovery costs.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/02/18/potomac-sewage-spill-emergency-dc-order/"
  },
  {
    "text": "Trump administration gives ICE broader powers to detain legal refugees, citing security concerns - CBS News",
    "fullText": "The Trump administration has given ICE the authority to detain refugees who entered the U.S. lawfully but don't have green cards yet, part of a bid to scrutinize the legal immigration system, according to a government memo obtained by CBS News.",
    "link": "https://www.cbsnews.com/news/trump-administration-gives-ice-broader-powers-to-detain-legal-refugees-citing-security-concerns/"
  },
  {
    "text": "Takaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development - Associated Press News",
    "fullText": "Japanese Prime Minister Sanae Takaichi says she hopes to deepen her relationship with U.S. President Donald Trump. She wants to strengthen cooperation between the two countries in rare earths development and other areas of economic security when she visits Wa…",
    "link": "https://apnews.com/article/japan-takaichi-us-china-trump-defense-aa82f8a3b5a7120575072f390f30fb97"
  },
  {
    "text": "Jordan Stolz pursues 1500m gold, sprint sweep as speed skating continues in Milan - NBC Olympics",
    "fullText": "With a win in the 1500m Thursday, Jordan Stolz could become just the second American to take gold thrice at a single Winter Games.",
    "link": "https://www.nbcolympics.com/news/jordan-stolz-pursues-1500m-gold-sprint-sweep-speed-skating-continues-milan"
  },
  {
    "text": "Boeing defense headquarters to return to St. Louis after leaving the area in 2017 - STLPR",
    "fullText": "Boeing announced on Wednesday that its security headquarters will return to the St. Louis region from Arlington, Virginia, after moving away in 2017.",
    "link": "https://www.stlpr.org/economy-business/2026-02-18/boeing-defense-headquarters-return-st-louis"
  },
  {
    "text": "Minnesota weather: 2 to 3 feet of snow on North Shore; significant accumulations in the Twin Cities - MPR News",
    "fullText": "Prolific snowfall totals fell along Lake Superior’s North Shore region. Highs winds gusted to over 60 mph.",
    "link": "https://www.mprnews.org/story/2026/02/18/2-to-3-feet-of-snow-on-north-shore-significant-accumulations-in-the-twin-cities"
  }
]