[
  {
    "text": "All flights at El Paso airport in Texas halted for 10 days for 'security reasons,' FAA says - NBC News",
    "fullText": "All flights to and from El Paso International Airport in Texas have been halted for “special security reasons,” the Federal Aviation Administration said early Wednesday.",
    "link": "https://www.nbcnews.com/news/us-news/flights-el-paso-airport-texas-halted-10-days-security-reasons-faa-rcna258497"
  },
  {
    "text": "Purdue sees huge lead escape, then escapes with key win at Nebraska - On3",
    "fullText": "LINCOLN, Neb. —",
    "link": "https://www.on3.com/teams/purdue-boilermakers/news/after-road-meltdown-purdue-survives-nebraska-in-overtime/"
  },
  {
    "text": "Shootings at school and home in northeastern British Columbia leave 10 dead including shooter - AP News",
    "fullText": "A school shooting in British Columbia has left seven people dead, with two more found dead at a nearby home. Authorities say the suspected shooter, a woman, also died. The Royal Canadian Mounted Police report over 25 people injured, with two in critical condi…",
    "link": "https://apnews.com/article/canada-shooting-british-columbia-66b021ac7c75e857885b81dc78a29d05"
  },
  {
    "text": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs - CNN",
    "fullText": "Speaker Mike Johnson failed to reinstate a ban on lawmakers’ ability to challenge President Donald Trump’s tariffs when three Republicans crossed party lines to vote with Democrats.",
    "link": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans"
  },
  {
    "text": "Sam Darnold has message for Jets fans after winning Super Bowl 2026 with Seahawks - New York Post",
    "fullText": "Sam Darnold took a moment to thank the Jets fans who have continued to support him after his career got off to an up-and-down start before he became a Super Bowl champion with the Seahawks on Sunda…",
    "link": "https://nypost.com/2026/02/10/sports/sam-darnold-has-message-for-jets-fans-after-winning-super-bowl-2026/"
  },
  {
    "text": "China consumer inflation rises less than expected in January as producer price deflation persists - CNBC",
    "fullText": "China's consumer inflation rose less than expected in January while the deflation in producer prices persisted.",
    "link": "https://www.cnbc.com/2026/02/11/china-inflation-january-cpi-ppi-deflation.html"
  },
  {
    "text": "Out-of-state person with measles visited N.J. hospital, health department says - NJ.com",
    "fullText": "Those exposed to the virus could start experiencing symptoms as late as Feb. 28.",
    "link": "https://www.nj.com/middlesex/2026/02/out-of-state-person-with-measles-visited-nj-hospital-health-departments-says.html"
  },
  {
    "text": "Shasta County outbreak drives Calif.'s first measles surge since 2020 - SFGATE",
    "fullText": "On Monday, the California Department of Public Health issued a warning about the surge in measles cases across the state.",
    "link": "https://www.sfgate.com/bayarea/article/shasta-county-outbreak-california-measles-21346144.php"
  },
  {
    "text": "New video shows Mike Perry and Eddie Alvarez getting into wild brawl at BKFC event; Alvarez adds ‘It was deserved’ - MMA Fighting",
    "fullText": "Mike Perry got involved in a wild brawl at BKFC KnuckleMania VI with past opponent Eddie Alvarez",
    "link": "https://www.mmafighting.com/bkfc/471347/new-video-shows-mike-perry-and-eddie-alvarez-getting-into-wild-brawl-at-bkfc-event-alvarez-adds-it-was-deserved"
  },
  {
    "text": "Asia markets mostly rise as investors shrug off weak U.S. retail sales, assess China inflation - CNBC",
    "fullText": "Stocks in Asia moved higher Wednesday, extending recent gains despite softer-than-expected U.S. retail sales and growing unease over AI on Wall Street.",
    "link": "https://www.cnbc.com/2026/02/11/asia-markets-live-today-wednesday-china-inflation-kospi-hang-seng-china-inflation.html"
  },
  {
    "text": "The Swamp: What Kennedy Center Boss Really Knew About Trump’s Shutdown - The Daily Beast",
    "fullText": "The Kennedy Center’s imminent closure takes a surprise new twist, our must-read newsletter reveals.",
    "link": "https://www.thedailybeast.com/the-swamp-what-kennedy-center-boss-really-knew-about-trumps-shutdown/"
  },
  {
    "text": "Google says the Android 17 Beta is coming soon - 9to5Google",
    "fullText": "Following the release of Android 16 QPR3 Beta 2.1 earlier today, Google has revealed that Android 17 Beta 1 is coming soon.",
    "link": "http://9to5google.com/2026/02/10/android-17-beta-coming-soon/"
  },
  {
    "text": "Democratic governors pledge to boycott White House events after a Trump snub - Politico",
    "fullText": "Press secretary Karoline Leavitt said the president enjoys discretion over whom to invite to events at the White House.",
    "link": "https://www.politico.com/news/2026/02/10/democratic-governors-trump-meeting-00774814"
  },
  {
    "text": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed - NBC News",
    "fullText": "Minnesota gubernatorial candidate Jeff Johnson announced Monday that he was suspending his campaign after his daughter was found fatally stabbed",
    "link": "https://www.nbcnews.com/news/us-news/minnesota-gubernatorial-candidate-suspends-campaign-daughter-found-fat-rcna258320"
  },
  {
    "text": "Exclusive: Trump says he opposes Israeli annexation steps in West Bank - Axios",
    "fullText": "\"We have enough things to think about now. We don't need to be dealing with the West Bank.\"",
    "link": "https://www.axios.com/2026/02/10/trump-israel-annex-west-bank-opposes-netanyahu"
  },
  {
    "text": "Pakistan-Afghanistan border closures paralyze trade along a key route - NPR",
    "fullText": "Trucks have been stuck at the closed border since October. Both countries are facing economic losses with no end in sight. The Taliban also banned all Pakistani pharmaceutical imports to Afghanistan.",
    "link": "https://www.npr.org/2026/02/10/g-s1-107945/pakistan-afghanistan-border-closed-trade-taliban"
  },
  {
    "text": "iPhone 18 Pro: Three new design updates are coming this year - 9to5Mac",
    "fullText": "iPhone 18 Pro and Pro Max will reportedly bring three new design changes for users. Here’s what the latest rumors say.",
    "link": "https://9to5mac.com/2026/02/10/iphone-18-pro-three-new-design-updates-are-coming-this-year/"
  }
]