[
  {
    "text": "With Lamar Jackson Inactive, It’s Backup Battle in Lambeau - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "In a must-win game for the Ravens against the Packers, it will be Tyler Huntley vs. Malik Willis.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-inactive-ravens-packers-tyler-huntley-malik-willis-2025"
  },
  {
    "text": "War-torn Myanmar votes in widely criticised 'sham' election - BBC",
    "fullText": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.",
    "link": "https://www.bbc.com/news/articles/cy7vly6gm76o"
  },
  {
    "text": "Sources: DE Crosby expected to need surgery - ESPN",
    "fullText": "Raiders star Maxx Crosby is expected to need left knee surgery that would sideline the Pro Bowl pass rusher for at least the better part of the offseason, sources told ESPN.",
    "link": "https://www.espn.com/nfl/story/_/id/47427162/sources-raiders-star-maxx-crosby-expected-need-knee-surgery"
  },
  {
    "text": "Chargers vs. Texans live updates: Score, highlights, key moments for Saturday game - CBS Sports",
    "fullText": "Houston is headed to the playoffs and still has an outside shot at winning the AFC South crown",
    "link": "https://www.cbssports.com/nfl/news/chargers-vs-texans-live-updates-score-highlights-key-moments/live/"
  },
  {
    "text": "Influencer Melissa Mae Carlton Shares ‘Medical Update’ After Youngest Daughter’s Death, 1 Year After Older Daughter Died of Sepsis - Yahoo News Canada",
    "fullText": "“We are exhausted and shaken after a day filled with trauma and heartbreak,” Melissa wrote while sharing the tragic news of her youngest daughter Molly’s...",
    "link": "https://people.com/influencer-melissa-mae-carlton-shares-update-on-youngest-daughter-death-1-year-after-older-daughter-died-11876632"
  },
  {
    "text": "Kennedy Center vows to sue musician who canceled performance over Trump name change - NPR",
    "fullText": "The Kennedy Center is planning legal action after jazz musician Chuck Redd canceled an annual holiday concert. Redd pulled out after President Trump's name appeared on the building.",
    "link": "https://www.npr.org/2025/12/27/g-s1-103808/kennedy-center-lawsuit-chuck-redd-cancellation-trump"
  },
  {
    "text": "Russia strikes Ukraine's capital and kills at least 1 person a day before Zelenskyy-Trump meeting - AP News",
    "fullText": "Russia struck Ukraine's capital with missiles and drones in an attack that killed at least one person. The barrage came a day before the leaders of Ukraine and the United States meet. Ukrainian President Volodymyr Zelenskyy said the attack “really shows that …",
    "link": "https://apnews.com/article/russia-ukraine-war-kyiv-strikes-67c576b92273cc0953de64590572e159"
  },
  {
    "text": "Harry Styles breaks music hiatus with surprise YouTube release - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/harry-styles-breaks-music-hiatus-surprise-youtube-release/story?id\\\\u003d128723085"
  },
  {
    "text": "Kyle Whittingham’s strange departure from Utah — and his arrival at Michigan - Deseret News",
    "fullText": "After ‘stepping down’ from his long-held post with the Utes, the Utah legend took the head coaching job at a legendary football school. What gives?",
    "link": "https://www.deseret.com/sports/2025/12/27/utah-coach-kyle-whittingham-puzzling-departure-from-utah/"
  },
  {
    "text": "Zelenskyy focuses on security guarantees ahead of Trump visit - Politico",
    "fullText": "The presidents will meet Sunday in Florida for peace talks.",
    "link": "https://www.politico.com/news/2025/12/27/zelenskyy-security-trump-florida-00706926"
  },
  {
    "text": "Report: BioShock 4 Brief Glimpse Into the Characters and Setting - MP1st",
    "fullText": "Meet the potential new villain and hero of BioShock 4. We break down the game's assets, the possible return of ADAM, and additional details.",
    "link": "https://mp1st.com/news/bioshock-4-glimpse-into-characters-setting"
  },
  {
    "text": "7.0-magnitude earthquake rattles Taiwan - DW",
    "fullText": "The quake struck off Taiwan's northeastern coast, and shook buildings in the capital, Taipei.",
    "link": "https://www.dw.com/en/70-magnitude-earthquake-rattles-taiwan/a-75317087"
  },
  {
    "text": "Thailand and Cambodia sign a new ceasefire agreement to end border fighting - AP News",
    "fullText": "Thailand and Cambodia have signed a ceasefire agreement to end weeks of fighting over border disputes. The agreement, effective Saturday at noon, halts military movements and airspace violations. Thailand had conducted airstrikes in Cambodia as recently as Sa…",
    "link": "https://apnews.com/article/thailand-cambodia-border-fighting-ceasefire-0019310e1c062cd211f9f5398b3bc463"
  },
  {
    "text": "Jeffrey R. Holland, next in line to lead Church of Jesus Christ of Latter-day Saints, dies at 85 - AP News",
    "fullText": "Jeffrey R. Holland, a senior official in the Church of Jesus Christ of Latter-day Saints, has died at 85. The church announced his death on Saturday from complications from kidney disease. Holland led the Quorum of the Twelve Apostles, a key governing body. H…",
    "link": "https://apnews.com/article/jeffrey-holland-dead-mormons-f6c339ddc9688a5dd3523ce79ee8544b"
  },
  {
    "text": "New York state has set a record for flu cases ahead of peak season - Gothamist",
    "fullText": "Officials reported 71,123 new cases and it's just going to get worse, doctors say.",
    "link": "https://gothamist.com/news/new-york-state-has-set-a-record-for-flu-cases-ahead-of-peak-season"
  },
  {
    "text": "Father tracks kidnapped daughter using phone's parental controls, authorities say - NBC News",
    "fullText": "The father of a teenage girl who deputies say was kidnapped on Christmas Day found her using his phone’s parental controls, according to authorities in Texas",
    "link": "https://www.nbcnews.com/news/us-news/father-tracks-kidnapped-daughter-using-phones-parental-controls-rcna251115"
  },
  {
    "text": "The #1 issue Trump says will dominate in 2026 - NJ.com",
    "fullText": "The president has turned his focus to the issue in recent rallies and his address to the nation.",
    "link": "https://www.nj.com/politics/2025/12/the-1-issue-trump-says-will-dominate-in-2026.html"
  },
  {
    "text": "Major weather changes coming to Denver after Saturday - CBS News",
    "fullText": "Get ready for some major changes in our weather. Not only will the Denver metro area see some snow, but temperatures will plummet overnight, making Sunday a First Alert Weather Day.",
    "link": "https://www.cbsnews.com/colorado/news/major-weather-changes-denver-weekend/"
  },
  {
    "text": "Scientists identify new human ancestors, now we know what they looked like - Earth.com",
    "fullText": "Scientists used mtDNA to confirm what many researchers had long suspected: the Chinese “dragon man” Harbin skull belonged to a Denisovan.",
    "link": "https://www.earth.com/news/denisovan-dragon-man-fossil-harbin-skull-human-ancestor-appearance/"
  }
]