[
  {
    "text": "Asian Stocks to Fall as Tech-Led Drop Gains Pace: Markets Wrap - Bloomberg.com",
    "fullText": "A slump in technology stocks snowballed into Asia as mounting anxiety over frothy valuations and massive artificial intelligence spending drove investors to trim exposure.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-04/asian-stocks-to-fall-as-tech-led-drop-gains-pace-markets-wrap"
  },
  {
    "text": "Ryan Preece wins Cook Out Clash at Bowman Gray amid winter weather - NASCAR.com",
    "fullText": "Ryan Preece won the 2026 Cook Out Clash at Bowman Gray Stadium, overcoming winter weather in a Wednesday night feature.",
    "link": "https://www.nascar.com/news-media/2026/02/04/cook-out-clash-recap-2026-ryan-preece-wins-bowman-gray/"
  },
  {
    "text": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/housecleaner-multiple-illnesses-tied-las-vegas-house-bio/story?id\\\\u003d129865238"
  },
  {
    "text": "3 takeaways from No. 16 BYU’s loss to Oklahoma State - Deseret News",
    "fullText": "Make that three straight losses for BYU.",
    "link": "https://www.deseret.com/sports/2026/02/04/byu-basketball-loses-at-oklahoma-state-3-takeaways/"
  },
  {
    "text": "Tigers, Framber Valdez Agree To Three-Year Deal - MLB Trade Rumors",
    "fullText": "The Tigers make a major splash late in the offseason, signing Framber Valdez to a short-term deal to pair with Tarik Skubal atop the rotation.",
    "link": "https://www.mlbtraderumors.com/2026/02/tigers-framber-valdez-agree-to-three-year-deal.html"
  },
  {
    "text": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - AP News",
    "fullText": "A judge says U.S. immigration agents in Oregon must stop arresting people without warrants unless they are likely to escape. U.S. District Judge Mustafa Kasubhai issued the preliminary injunction Wednesday. The ruling came in response to a lawsuit filed by a …",
    "link": "https://apnews.com/article/immigration-warrantless-arrests-ice-oregon-lawsuit-f21f3856e3c60e283e7be4bac1f04272"
  },
  {
    "text": "Most Preventable Cancers Are Linked to Just Two Lifestyle Habits - ScienceAlert",
    "fullText": "It's easy to feel powerless against cancer, but a new study has identified several ways that we can reduce the odds of it occurring.",
    "link": "https://www.sciencealert.com/most-preventable-cancers-are-linked-to-just-two-lifestyle-habits"
  },
  {
    "text": "Dems embrace \"law and order\" in ICE shutdown fight - Axios",
    "fullText": "\"This isn't about trying to enact immigration reform,\" one top Democrat said.",
    "link": "https://www.axios.com/2026/02/05/democrats-ice-government-shutdown-law-enforcement"
  },
  {
    "text": "System76's COSMIC Desktop Planning Vulkan Renderer, Improved Gaming Experience - Phoronix",
    "fullText": "Following December's release of COSMIC Epoch 1 along with the Pop!_OS 24.04 release by System76, today they shared more of their feature plans for the next two major COSMIC desktop updates.",
    "link": "https://www.phoronix.com/news/COSMIC-Desktop-Features-Coming"
  },
  {
    "text": "Exposure to burn injuries played key role in shaping human evolution, study suggests - Phys.org",
    "fullText": "Humans' exposure to high temperature burn injuries may have played an important role in our evolutionary development, shaping how our bodies heal, fight infection, and sometimes fail under extreme injury, according to new research.",
    "link": "https://phys.org/news/2026-02-exposure-injuries-played-key-role.html"
  },
  {
    "text": "South Korea's Kospi leads declines in Asia, tracking Wall Street tech sell-off; Topix retreats from record - CNBC",
    "fullText": "In Asia, investors are keeping an eye on tech and tech-related stocks in the region for any spillover.",
    "link": "https://www.cnbc.com/2026/02/05/asia-markets-live-nikkei-kospi-hang-seng-oil-saas.html"
  },
  {
    "text": "Don’t mention ‘Article 5,’ Finland warns US on Ukraine - Politico",
    "fullText": "Some NATO countries worry using any version of the term “Article 5” for Ukraine defense could weaken its deterrence.",
    "link": "https://www.politico.com/news/2026/02/04/dont-mention-article-5-finland-warns-us-on-ukraine-00766043"
  },
  {
    "text": "Alphabet won’t talk about the Google-Apple AI deal, even to investors - TechCrunch",
    "fullText": "Alphabet CEO skipped an analyst's question about Apple on the company's earnings call.",
    "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/"
  },
  {
    "text": "Russian-state hackers exploit Office vulnerability to infect computers - Ars Technica",
    "fullText": "The window to patch vulnerabilities is shrinking rapidly.",
    "link": "https://arstechnica.com/security/2026/02/russian-state-hackers-exploit-office-vulnerability-to-infect-computers/"
  },
  {
    "text": "Tony Khan announces new matches, segment for AEW Dynamite - F4W/WON",
    "fullText": "Two new matches have been announced for this week’s AEW Dynamite, along with a Women’s World Championship match set for next week’s show.",
    "link": "https://www.f4wonline.com/news/aew/tony-khan-announces-new-matches-segment-for-aew-dynamite/"
  },
  {
    "text": "Glimpsing the quantum vacuum: Particle spin correlations offer insight into how visible matter emerges from 'nothing' - Phys.org",
    "fullText": "Scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have uncovered experimental evidence that particles of matter emerging from energetic subatomic smashups retain a key feature of virtual particles that exist only fleetingly in…",
    "link": "https://phys.org/news/2026-02-glimpsing-quantum-vacuum-particle-insight.html"
  },
  {
    "text": "E.l.f. Beauty posts earnings beat, raises full-year guidance - CNBC",
    "fullText": "E.l.f. Beauty said its acquisition of Hailey Bieber's skin-care company, Rhode, contributed $128 million to the company's net third-quarter sales growth.",
    "link": "https://www.cnbc.com/2026/02/04/elf-beauty-elf-q3-2026.html"
  },
  {
    "text": "Measles exposure in Milbank, Brookings - KELOLAND.com",
    "fullText": "SIOUX FALLS, S.D. (KELO) – The Department of Health is notifying the public of potential measles exposures in Milbank and Brookings. A Grant County resident with a confirmed measles infection visited several locations while infectious. The places the infected…",
    "link": "https://www.keloland.com/news/local-news/measles-exposure-in-milbank-brookings/"
  },
  {
    "text": "After crushing protests, Iran's supreme leader now tries to avert a U.S. attack - PBS",
    "fullText": "The ferocious suppression of the protests is a sign of how deep a threat Khamenei and Iran’s leadership see in the widespread popular anger.",
    "link": "https://www.pbs.org/newshour/world/after-crushing-protests-irans-supreme-leader-now-tries-to-avert-a-u-s-attack"
  }
]