[
  {
    "text": "Fed minutes show officials were in tight split over December rate cut - CNBC",
    "fullText": null,
    "link": "https://www.cnbc.com/2025/12/30/fed-minutes-december-2025.html"
  },
  {
    "text": "\"Super flu\" surge: What to know about spiking flu cases and the surging \"Super K\" variant - Axios",
    "fullText": "The flu is back and joins COVID and norovirus as diseases hitting the US this month.",
    "link": "https://www.axios.com/2025/12/30/superflu-symptoms-2025-flu-h3n2"
  },
  {
    "text": "NASA’s New Chief Finds Loophole for Texas Shuttle Switcheroo - Gizmodo",
    "fullText": "“One way or another, we’re going to make sure Johnson Space Center gets its historic spacecraft right where it belongs.”",
    "link": "https://gizmodo.com/nasas-new-chief-finds-loophole-for-texas-shuttle-switcheroo-2000704289"
  },
  {
    "text": "Artemis 2 moon astronauts rehearse for launch day (photos) - Space",
    "fullText": "NASA's first crewed lunar mission in more than 50 years moved one step closer to liftoff recently with a full launch day dress rehearsal in Florida.",
    "link": "https://www.space.com/space-exploration/artemis/artemis-2-moon-astronauts-rehearse-for-launch-day-photos"
  },
  {
    "text": "An escalation in Yemen threatens to reignite civil war and widen tensions in the Gulf - NPR",
    "fullText": "Saudi Arabia bombed Yemen's port city of Mukalla, targeting a shipment of weapons from the United Arab Emirates for separatist forces. The UAE later said it would withdraw its forces from Yemen.",
    "link": "https://www.npr.org/2025/12/30/g-s1-103991/yemen-conflict"
  },
  {
    "text": "US Homeland Security investigates daycares in Minneapolis - BBC",
    "fullText": "In a recent viral video, right-wing YouTuber Nick Shirley alleged some centres in the Minnesota city were committing fraud.",
    "link": "https://www.bbc.com/news/articles/c75xnndvlyko"
  },
  {
    "text": "As Measles Cases Top 2,000, the U.S. Is on Brink of Losing Its Elimination Status - Gizmodo",
    "fullText": "At least three people have died from the vaccine-preventable infection, while hundreds have been hospitalized.",
    "link": "https://gizmodo.com/as-measles-cases-top-2000-the-u-s-is-on-brink-of-losing-its-elimination-status-2000704258"
  },
  {
    "text": "Stefon Diggs, Patriots wide receiver, denies charges of strangulation, assault and battery in Dedham, Massachusetts - CBS News",
    "fullText": "Stefon Diggs, a star wide receiver with the New England Patriots, is facing criminal charges after an incident in Massachusetts earlier this month.",
    "link": "https://www.cbsnews.com/boston/news/stefon-diggs-charges-dedham-massachusetts-new-england-patriots/"
  },
  {
    "text": "Kyle Shanahan makes a big move in coach of the year odds - NBC Sports",
    "fullText": "For much of the season, some have asked why 49ers coach Kyle Shanahan isn't getting more traction for coach of the year.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/kyle-shanahan-makes-a-big-move-in-coach-of-the-year-odds"
  },
  {
    "text": "Protests spread across Iran for third day after currency hits record low - BBC",
    "fullText": "The Iranian rial hit a record low against the US dollar on Sunday, prompting shopkeepers in Tehran to stage protests, which have quickly spread.",
    "link": "https://www.bbc.com/news/articles/cqj2llkjv8vo"
  },
  {
    "text": "What being around death taught this hospital chaplain about life - NPR",
    "fullText": "J.S. Park helps patients and their families cope with death every day as a hospital chaplain. He explains what to expect as a person is dying, and how to reckon with uncomfortable feelings about death.",
    "link": "https://www.npr.org/2025/12/30/nx-s1-5637461/death-anxiety-grief-mortality"
  },
  {
    "text": "British-Egyptian dissident appears to endorse 'smear campaign' claims - BBC",
    "fullText": "Alaa Abd El Fattah has faced backlash over old social media posts where he called for the killing of Zionists.",
    "link": "https://www.bbc.com/news/articles/c3dm9944glpo"
  },
  {
    "text": "Kennedy Center renaming prompts new round of cancellations from artists - AP News",
    "fullText": "More artists have canceled performances at the Kennedy Center after President Donald Trump's name was added to the facility. Jazz supergroup The Cookers announced their withdrawal from a New Year's Eve concert. They didn't mention the renaming but emphasized …",
    "link": "https://apnews.com/article/kennedy-center-new-years-eve-canceled-db4bc44f0d95cb40f794f2cb737562a3"
  },
  {
    "text": "Israel says it will bar aid groups, including Doctors Without Borders, from Gaza - NPR",
    "fullText": "Israel accused Doctors Without Borders, one of the largest health organizations operating in Gaza, of failing to clarify the roles of some staff that Israel accused of cooperation with militants.",
    "link": "https://www.npr.org/2025/12/30/g-s1-103986/israel-gaza-aid-ngos"
  },
  {
    "text": "Stock Market Today: Silver Prices Jump; Dow Creeps Lower — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-12-30-2025"
  },
  {
    "text": "NFL Week 18 playoff scenarios - NBC Sports",
    "fullText": "The 2025 NFL regular season comes to an end on Sunday, and two playoff berths are still to be determined, with the AFC North and NFC South on the line.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/nfl-week-18-playoff-scenarios"
  },
  {
    "text": "Ahead of alleged Jan. 6 pipe bomber's Tuesday court appearance, attorneys urge judge to release him before trial - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/ahead-alleged-jan-6-pipe-bombers-tuesday-court/story?id\\\\u003d128777530"
  },
  {
    "text": "Galaxy S26 Ultra leak shows off new camera bump that’s sure to be annoying [Gallery] - 9to5Google",
    "fullText": "While the launch date is a fair bit later this year, leaks continue to detail Samsung’s plans for the upcoming...",
    "link": "http://9to5google.com/2025/12/30/samsung-galaxy-s26-ultra-camera-bump-hardware-leak/"
  },
  {
    "text": "How Nashville’s Music Row Went MAGA in 2025 - Rolling Stone",
    "fullText": "Nashville's mainstream country music industry went all in on Trump and the MAGA movement in 2025.",
    "link": "http://www.rollingstone.com/music/music-features/country-music-nashville-goes-maga-trump-essay-1235476378/"
  }
]