[
  {
    "text": "ICE and Homeland Security officials testify before Congress - BBC",
    "fullText": "Homeland Security officials, including the heads of ICE, US Customs and Border Protection, testify before a congressional committee.",
    "link": "https://www.bbc.com/news/live/cp820yqn6e2t"
  },
  {
    "text": "'The Mummy' Release Date Set With Brendan Fraser & Rachel Weisz Back - Deadline",
    "fullText": "Brendan Fraser and Rachel Weisz are coming back to The Mummy franchise, with the next movie installment getting a release date of May 19, 2028.",
    "link": "http://deadline.com/2026/02/the-mummy-release-date-brendan-fraser-rachel-weisz-1236714578/"
  },
  {
    "text": "Swedish siblings win gold in Olympics mixed doubles curling - ESPN",
    "fullText": "Sweden's brother-and-sister team of Isabella and Rasmus Wranå won gold in mixed doubles curling at the Milan Cortina Olympics, beating the United States in the final on Tuesday night.",
    "link": "https://www.espn.com/olympics/story/_/id/47888870/swedish-siblings-win-gold-olympics-mixed-doubles-curling"
  },
  {
    "text": "Annual governors gathering with White House unraveling after Trump excludes Democrats - AP News",
    "fullText": "The National Governors Association annual conference is unraveling after President Donald Trump did not invite some Democrats to events. The bipartisan governors' group said it will not hold a formal meeting with President Donald Trump after the White House o…",
    "link": "https://apnews.com/article/trump-kevin-stitt-governors-meeting-washington-ee4e696534082638795e1804d71f4966"
  },
  {
    "text": "Windows’ original Secure Boot certificates expire in June—here’s what you need to do - Ars Technica",
    "fullText": null,
    "link": "https://arstechnica.com/gadgets/2026/02/microsoft-sounds-the-alarm-about-secure-boot-certificates-expiring-later-this-year/"
  },
  {
    "text": "Goldman’s Solomon Says Software Selloff Has Been ‘Too Broad’ - Bloomberg.com",
    "fullText": "Last week’s steep drop in software stocks on concern about competition from artificial intelligence was likely overdone and the US economy remains poised for strong growth this year, according to Goldman Sachs Group Inc.’s chief executive officer.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-10/goldman-s-solomon-says-software-selloff-has-been-too-broad"
  },
  {
    "text": "Earth’s core may contain as much as 45 oceans’ worth of hydrogen, scientists find - cnn.com",
    "fullText": "As much as 45 oceans’ worth of hydrogen may be in Earth’s core, scientists reported, suggesting most of Earth’s water was acquired during the planet’s formation.",
    "link": "https://www.cnn.com/2026/02/10/science/hydrogen-oceans-earth-core"
  },
  {
    "text": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed - NBC News",
    "fullText": "Minnesota gubernatorial candidate Jeff Johnson announced Monday that he is suspending his campaign after his daughter was found fatally stabbed",
    "link": "https://www.nbcnews.com/news/us-news/minnesota-gubernatorial-candidate-suspends-campaign-daughter-found-fat-rcna258320"
  },
  {
    "text": "How this French building behemoth wants to solve the U.S. housing dilemma - CNBC",
    "fullText": "Saint-Gobain is focusing on speed and affordability in construction through materials, assembly and other tools, according to North America CEO Mark Rayfield.",
    "link": "https://www.cnbc.com/2026/02/10/saint-gobain-us-housing-dilemma.html"
  },
  {
    "text": "Donovan Mitchell, James Harden clutch late as Cavs punctuate road trip with 119-117 win over Nuggets - Cleveland.com",
    "fullText": "Going into the game, Cavs coach Kenny Atkinson knew what Cleveland was up against.",
    "link": "https://www.cleveland.com/cavs/2026/02/donovan-mitchell-james-harden-come-through-in-clutch-as-cavs-punctuate-road-trip-with-119-117-win-over-nuggets.html"
  },
  {
    "text": "Ryan Coogler Goes Deep on Shattering Oscar Records, Losing Chadwick and Battling Imposter Syndrome - The Hollywood Reporter",
    "fullText": "The ‘Sinners' director silenced skeptics by scoring big at the box office and making the most nominated film ever. After a decade of hitmaking, is he finally ready to admit that this is where he deserves to be?",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/ryan-coogler-interview-sinners-oscars-chadwick-boseman-1236500968/"
  },
  {
    "text": "YouTube rolls out an AI playlist generator for Premium users - TechCrunch",
    "fullText": "YouTube Music is rolling out a new AI-powered playlist-generation feature that allows Premium users on iOS and Android to use text prompts to create playlists.",
    "link": "https://techcrunch.com/2026/02/10/youtube-rolls-out-an-ai-playlist-generator-for-premium-users/"
  },
  {
    "text": "U.S. government borrowed $43.5 billion a week in the first four months of the fiscal year - Fortune",
    "fullText": "The CBO's latest reporting showed for the first four months of FY26, the U.S. government operated at a deficit, and so needed to borrow, $696 billion.",
    "link": "https://fortune.com/2026/02/10/government-borrowing-cbo-report-deicit-lending-interest/"
  },
  {
    "text": "Opinion | We may be doing breast cancer screening all wrong - The Washington Post",
    "fullText": "This test may be crucial for breast cancer screening. It’s not a mammogram.",
    "link": "https://www.washingtonpost.com/opinions/2026/02/10/breast-cancer-screening-mammograms/"
  },
  {
    "text": "AMA joins effort to launch vaccine science review amid CDC turmoil - The Washington Post",
    "fullText": "The American Medical Association and a partner group are taking on a new role in reviewing vaccine safety and effectiveness as the CDC’s review process faces criticism.",
    "link": "https://www.washingtonpost.com/health/2026/02/10/new-vaccine-review-system-launched/"
  },
  {
    "text": "National Cancer Institute studying ivermectin’s ‘ability to kill cancer cells,’ alarming career scientists - statnews.com",
    "fullText": "The National Cancer Institute is studying ivermectin as a potential cancer treatment, according to its top official, alarming career scientists.",
    "link": "https://www.statnews.com/2026/02/10/ivermectin-for-cancer-national-cancer-institute-preclinical-study/"
  },
  {
    "text": "Exynos 2700 To Enter Mass Production In H2 2026, Analyst Says SoC’s Adoption In Galaxy S27 Will Increase Drastically - Wccftech",
    "fullText": "An analyst believes that the Exynos 2700 will enter full-scale mass production in the second half of 2026 and will be utilized in increased Galaxy S27 shipments",
    "link": "https://wccftech.com/exynos-2700-enter-mass-production-h2-2026-increased-adopting-in-galaxy-s27/"
  },
  {
    "text": "Netanyahu wants Trump to demand more from Iran. The leaders will meet this week - AP News",
    "fullText": "Prime Minister Benjamin Netanyahu is heading to Washington to encourage President Donald Trump to expand the scope of high-stakes nuclear talks with Iran. The negotiations resumed last week against the backdrop of an American military buildup in the Middle Ea…",
    "link": "https://apnews.com/article/israel-us-iran-trump-netanyahu-negotiations-5fab7bc1bd473f09a4d3967d1ef53aa6"
  }
]