[
  {
    "text": "Nikola Jokić exits Monday game with left knee injury - NBA",
    "fullText": "Nikola Jokić limps off the court in Miami on Monday night after appearing to hurt his left knee just before halftime.",
    "link": "https://www.nba.com/news/nuggets-star-nikola-jokic-hurts-left-knee-exits-at-halftime-in-miami"
  },
  {
    "text": "Falcons vs. Rams live updates, score as Matthew Stafford chases MVP - CBS Sports",
    "fullText": "Atlanta won its third straight game, while Los Angeles has lost back-to-back contests",
    "link": "https://www.cbssports.com/nfl/news/falcons-vs-rams-live-updates-score-higlights-mnf/live/"
  },
  {
    "text": "Bangladesh's first female prime minister Khaleda Zia dies aged 80 - BBC",
    "fullText": "Zia became the country's first female leader in 1991 after its first democratic election in 20 years.",
    "link": "https://www.bbc.com/news/articles/cm2v256vdkyo"
  },
  {
    "text": "Trump says he might sue Fed Chair Jerome Powell for ‘gross incompetence’ - The Washington Post",
    "fullText": "It isn’t clear what specific claims could be brought against Powell or when.",
    "link": "https://www.washingtonpost.com/politics/2025/12/29/trump-powell-gross-incompetence-lawsuit/"
  },
  {
    "text": "How a viral video prompted investigations into alleged fraud at day care centers in Minnesota - CBS News",
    "fullText": "While many of the Minnesota day care centers in the video were cited and fined for safety violations, investigators previously found no evidence of fraud.",
    "link": "https://www.cbsnews.com/news/minnesota-fraud-nick-shirley-video-day-care-investigation/"
  },
  {
    "text": "Trump threatens strikes against Iran if it restarts nuclear programme - Financial Times",
    "fullText": "US president warns Hamas it has a ‘very short period of time to disarm’ after talks with Israeli leader Benjamin Netanyahu",
    "link": "https://www.ft.com/content/657e3d1f-59da-4b31-ab7a-ac870f43f678"
  },
  {
    "text": "Takeaways from Trump and Netanyahu’s meeting in Florida - CNN",
    "fullText": "President Donald Trump’s Monday meeting in Florida at Mar-a-Lago with Israeli Prime Minister Benjamin Netanyahu generated plenty of warm words — but no clear progress in their peace plan for Gaza.",
    "link": "https://www.cnn.com/2025/12/29/politics/trump-netanyahu-meeting-takeaways"
  },
  {
    "text": "Trump administration rolls out rural health funding, with strings attached - PBS",
    "fullText": "While every state applied for money from the Rural Health Transformation Program, it won't be distributed equally. And critics worry that the funding might be pulled back if a state's policies don't match up with the administration's.",
    "link": "https://www.pbs.org/newshour/health/trump-administration-rolls-out-rural-health-funding-with-strings-attached"
  },
  {
    "text": "Trump says U.S. destroyed loading dock in Venezuela - The Washington Post",
    "fullText": "Trump would not say whether the military or the CIA conducted the strike in Venezuela amid escalating U.S. pressure on Nicolás Maduro.",
    "link": "https://www.washingtonpost.com/politics/2025/12/29/trump-venezuela-strike-comment/"
  },
  {
    "text": "News & Notes: Lamar Jackson's Status Undetermined, But There's Optimism - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Harbaugh has ‘no headspace’ for head coach battle narrative. Ravens’ plan was to ‘ramp up’ Derrick Henry’s usage. Harbaugh pinpoints problems with Ravens’ pass defense in Green Bay.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-back-contusion-undetermined-optimism-john-harbaugh-mike-tomlin-ravens-defense-derrick-henry"
  },
  {
    "text": "Israeli recognition of Somaliland prompts global outcry, emergency U.N. meeting - The Washington Post",
    "fullText": "Israel’s diplomatic move makes it an outlier in the international community.",
    "link": "https://www.washingtonpost.com/world/2025/12/29/israel-somaliland-recognition-palestine-trump/"
  },
  {
    "text": "Samsung’s New Wi-Fi Speaker Has Big Monolith Energy - Gizmodo",
    "fullText": "Playing the theme to '2001: A Space Odyssey' on this thing might feel a little too on-the-nose.",
    "link": "https://gizmodo.com/samsungs-new-wi-fi-speaker-has-big-monolith-energy-2000703920"
  },
  {
    "text": "Transcript from Charlie Kirk shooting suspect hearing for must be released, judge orders - PBS",
    "fullText": "State District Judge Tony Graf said Monday the transcript must be posted on the court docket by the end of the day.",
    "link": "https://www.pbs.org/newshour/nation/transcript-from-charlie-kirk-shooting-suspect-hearing-for-must-be-released-judge-orders"
  },
  {
    "text": "Chappell Roan Removes Brigitte Bardot Tribute After Learning About ‘All That Insane Shit’ - Rolling Stone",
    "fullText": "Chappell Roan removed her tribute to Brigitte Bardot after learning about the French icon's history of controversial statements.",
    "link": "http://www.rollingstone.com/music/music-news/chappell-roan-removes-brigitte-bardot-tribute-controversies-1235491761/"
  },
  {
    "text": "Flu cases on the rise amid holiday travel, gatherings, latest CDC data shows - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/flu-cases-rise-amid-holiday-travel-gatherings-latest/story?id\\\\u003d128761006"
  }
]