[
  {
    "text": "News & Notes: Lamar Jackson's Status Undetermined, But There's Optimism - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Harbaugh has ‘no headspace’ for head coach battle narrative. Ravens’ plan was to ‘ramp up’ Derrick Henry’s usage. Harbaugh pinpoints problems with Ravens’ pass defense in Green Bay.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-back-contusion-undetermined-optimism-john-harbaugh-mike-tomlin-ravens-defense-derrick-henry"
  },
  {
    "text": "Here’s what to know about a viral YouTube video about fraud in Minnesota - MPR News",
    "fullText": "University of Minnesota media law professor Jane Kirtley says the new viral video is flashy, but absent of facts to back up its claims — and its lack of transparency could be considered deceptive.",
    "link": "https://www.mprnews.org/story/2025/12/29/youtuber-nick-shirley-accuses-somaliowned-day-care-centers-of-fraud"
  },
  {
    "text": "Trump says US 'knocked out' a 'big facility' in Venezuela - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-us-knocked-big-facility-venezuela/story?id\\\\u003d128750795"
  },
  {
    "text": "Silver Prices Surge, Then Slump. How ‘Index Rebalancing’ Could Lead to More Wild Swings. - Barron's",
    "fullText": "",
    "link": "https://www.barrons.com/articles/silver-price-buy-sell-gold-precious-metals-67d23a96"
  },
  {
    "text": "Early Week 18 bets: Ravens-Steelers to be a slugfest, Drake Maye for MVP - ESPN",
    "fullText": "Which lines offered value once odds came out? Here are games we are eyeing for bets going into Week 18.",
    "link": "https://www.espn.com/espn/betting/story/_/id/47445480/2025-nfl-week-18-betting-odds-props-early-pick-predictions-first-bet"
  },
  {
    "text": "Good 'Karma': Taylor Swift surprises Arrowhead Stadium employee with hefty Christmas tip - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/good-karma-taylor-swift-surprises-arrowhead-stadium-employee/story?id\\\\u003d128756922"
  },
  {
    "text": "Flu season 2025: Subclade K variant known as 'Super K' showing fast flu symptoms amid holiday gatherings - 6abc Philadelphia",
    "fullText": "This flu season seems to be getting worse by the day, according to health officials. The bulk of this year's cases are being linked to a new variant known as subclade K.",
    "link": "https://6abc.com/post/flu-season-2025-subclade-variant-known-super-showing-fast-symptoms-amid-holiday-gatherings/18330848/"
  },
  {
    "text": "Trump threatens to 'knock the hell' out of Iran if they build weapons - CNBC",
    "fullText": "President Donald Trump threatened further military action against Iran during a Monday meeting at Mar-a-Lago with Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.cnbc.com/2025/12/29/trump-iran.html"
  },
  {
    "text": "Somaliland: Why has Israel recognised the breakaway African state as independent? - BBC",
    "fullText": "Somaliland wants international recognition - here's why, and what could have driven Israel to recognise it now.",
    "link": "https://www.bbc.com/news/articles/c14v4kmg275o"
  },
  {
    "text": "Chappell Roan Backtracks on Brigitte Bardot Praise Over Far-Right Views - Variety",
    "fullText": "Chappell Roan, who name-dropped Brigitte Bardot in 'Red Wine Supernova,' first praised the late actress, then backtracked after learning of her views.",
    "link": "https://variety.com/2025/music/news/chappell-roan-brigitte-bardot-far-right-views-1236619338/"
  },
  {
    "text": "Leonardo’s wood charring method predates Japanese practice - Ars Technica",
    "fullText": "Yakisugi, a Japanese technique of burning wood surfaces, creates a protective carbonized layer...",
    "link": "https://arstechnica.com/science/2025/12/did-one-line-in-a-leonardo-codex-anticipate-yakisugi/"
  },
  {
    "text": "US offers Ukraine a 15-year security guarantee as part of peace plan, Zelenskyy says - AP News",
    "fullText": "The United States is offering Ukraine security guarantees for 15 years as part of a proposed peace plan. That's according to Ukrainian President Volodymyr Zelenskyy. He expressed a preference for a longer commitment to deter Russian aggression. U.S. President…",
    "link": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-peace-b784a9af1803995bfb7152eceb5477f1"
  },
  {
    "text": "Stock Market Today: Dow, Nasdaq Slip; Silver and Gold Futures Slide — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-12-29-2025"
  },
  {
    "text": "Andy Reid: I plan on coming back if Chiefs will have me - NBC Sports",
    "fullText": "Reid is finishing his 13th season as the head coach in Kansas City.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/andy-reid-i-plan-on-coming-back-if-chiefs-will-have-me"
  },
  {
    "text": "More than 75% of US adults may meet criteria for obesity under new definition: Study - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/75-us-adults-meet-criteria-obesity-new-definition/story?id\\\\u003d128747616"
  },
  {
    "text": "US pledges $2bn for humanitarian aid, but tells UN 'adapt or die' - BBC",
    "fullText": "The pledge was welcomed by the UN, but comes after previous major cuts to US funding for humanitarian operations.",
    "link": "https://www.bbc.com/news/articles/cdj8jr37y98o"
  },
  {
    "text": "Diddy’s Sons Justin and Christian Announce Docuseries Slated for 2026 - Variety",
    "fullText": "Sean 'Diddy' Combs' sons Justin and Christian will share their perspective in the fallout from their father's federal trial.",
    "link": "https://variety.com/2025/tv/news/diddy-sons-justin-christian-announce-docuseries-2026-1236619224/"
  },
  {
    "text": "Ukraine denies drone attack on Putin's residence - BBC",
    "fullText": "Russia has accused Ukraine of targeting a presidential residence, which President Zelensky called \"typical Russian lies\".",
    "link": "https://www.bbc.com/news/articles/c4g4g5lgngvo"
  },
  {
    "text": "CMS Announces $50 Billion in Awards to Strengthen Rural Health in All 50 States - Centers for Medicare & Medicaid Services | CMS (.gov)",
    "fullText": "CMS Announces $50 Billion in Awards to Strengthen Rural Health in All 50 States",
    "link": "https://www.cms.gov/newsroom/press-releases/cms-announces-50-billion-awards-strengthen-rural-health-all-50-states"
  },
  {
    "text": "Lululemon founder calls for board overhaul at struggling fitness brand - Financial Times",
    "fullText": "Company defends record and its ‘highly engaged and experienced board’ after Chip Wilson nominates 3 directors",
    "link": "https://www.ft.com/content/e46824b3-e80f-4c63-9ab0-69aad4f651dd"
  }
]