[
  {
    "text": "Seahawks win NFC West, earn NFC’s top seed in playoffs after handling 49ers - The Seattle Times",
    "fullText": "The Seahawks showed why they might be back at Levi's Stadium next month for the Super Bowl after beating the 49ers 13-3 to win the NFC West title and top seed in the NFC.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-win-nfc-west-earn-nfcs-top-seed-in-playoffs-after-handling-49ers/"
  },
  {
    "text": "Horoscope for Sunday, January 04, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/04/horoscopes-today-sunday-january-04-2026"
  },
  {
    "text": "NFC playoff picture update following Week 18 Saturday games - Bleeding Green Nation",
    "fullText": "The road to the Super Bowl in the NFC is currently set to go through Seattle.",
    "link": "https://www.bleedinggreennation.com/philadelphia-eagles-nfl-playoffs/167775/nfc-playoff-picture-update-following-week-18-saturday-games"
  },
  {
    "text": "Here's what the smartest people in foreign policy, business, and economics are saying about Trump's raid on Venezuela - Business Insider",
    "fullText": "Financial firms are planning trips to Venezuela to scout out new investment opportunities. Bill Ackman praised the move as \"good for America.\"",
    "link": "https://www.businessinsider.com/economists-foreign-policy-experts-react-donald-trump-raid-venezuela-maduro-2026-1"
  },
  {
    "text": "North Korea launches ballistic missiles toward sea ahead of South Korean leader's visit to China - AP News",
    "fullText": "South Korea says North Korea has launched ballistic missiles toward the sea. South Korea’s Joint Chiefs of Staff says it detected several ballistic missile launches from North Korea’s capital region Sunday morning, hours before South Korea’s president left fo…",
    "link": "https://apnews.com/article/south-north-korea-missile-76a8850484c5f969e56b797246877c61"
  },
  {
    "text": "Powerball winning numbers for Saturday, January 3, 2026 - USA Today",
    "fullText": "Who will win Powerball's first drawing of the year with a jackpot worth $64 million?",
    "link": "https://www.usatoday.com/story/money/lottery/2026/01/03/powerball-winning-numbers-saturday-january-3-2026/88000303007/"
  },
  {
    "text": "Box Office: ‘Avatar 3’ Flies Past $1B, Sleeper Hit ‘The Housemaid’ Delivers Sydney Sweeney a Win - The Hollywood Reporter",
    "fullText": "James Cameron's threequel achieved the milestone Saturday at the New Year weekend box office. Other holiday victors include sleeper hit 'The Housemaid' and Timothée Chalamet's 'Marty Supreme.'",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/box-office-avatar-3-billion-the-housemaid-win-1236463156/"
  },
  {
    "text": "Leonardo DiCaprio To Miss Palm Springs Fest After Venezuela Strike - Deadline",
    "fullText": "Leonardo DiCaprio will be forced to miss his Palm Springs Film Festival honor due to air restrictions resulting from the U.S. attack on Venezuela.",
    "link": "http://deadline.com/2026/01/leonardo-dicaprio-palm-springs-film-festival-venezuela-1236660972/"
  },
  {
    "text": "Live storm updates: North Bay freeway, businesses flooded following storm - ABC7 San Francisco",
    "fullText": "The Bay Area is recovering after a Level 2 storm brought rain and gusty winds to the area Friday night.",
    "link": "https://abc7news.com/live-updates/san-francisco-bay-area-storm-updates-parts-north-inundated-waters-leaving-cars-people-stranded/18343129/"
  },
  {
    "text": "Who is María Corina Machado, Venezuela's Nobel Peace Prize winning opposition leader? - NPR",
    "fullText": "The United States has captured Venezuelan President Nicolás Maduro. Opposition leader María Corina Machado has been one of his biggest critics.",
    "link": "https://www.npr.org/2026/01/03/g-s1-104412/venezuela-nicolas-maduro-maria-corina-machado-opposition"
  },
  {
    "text": "Rapid Reactions: Panthers fall to Bucs, division decided Sunday - Panthers.com",
    "fullText": "With both teams now 8-9, the division will be decided by the Falcons-Saints game Sunday, and the Panthers are hoping Atlanta can help.",
    "link": "https://www.panthers.com/news/rapid-reactions-panthers-fall-to-bucs-division-decided-sunday"
  },
  {
    "text": "Swiss launch criminal investigation over deadly fire at ski resort bar - Al Jazeera",
    "fullText": "The managers are suspected of committing homicide, causing bodily harm and arson by negligence.",
    "link": "https://www.aljazeera.com/news/2026/1/3/swiss-launch-criminal-investigation-over-deadly-fire-at-ski-resort-bar"
  },
  {
    "text": "Iran's leader says rioters 'must be put in their place' as protest death toll rises to at least 10 - PBS",
    "fullText": "Iran's supreme leader insisted Saturday that “rioters must be put in their place” after a week of protests that have shaken the Islamic Republic, likely giving security forces a green light to aggressively put down the demonstrations.",
    "link": "https://www.pbs.org/newshour/world/irans-leader-says-rioters-must-be-put-in-their-place-as-protest-death-toll-rises-to-at-least-10"
  },
  {
    "text": "Buffett leaves, and Berkshire investors waste no time reacting - thestreet.com",
    "fullText": "Buffett is out, Greg Abel is in as Berkshire investors start to flinch.",
    "link": "https://www.thestreet.com/markets/buffett-leaves-and-berkshire-investors-waste-no-time-reacting"
  },
  {
    "text": "Measles exposure found in NC - WRAL",
    "fullText": "A person carrying measles traveled through Gaston County while infectious, according to the North Carolina Department of Health and Human Services.",
    "link": "https://www.wral.com/news/state/gaston-county-measles-north-carolina-january-2026/"
  },
  {
    "text": "Important Travel Update for San Juan Disembarkation. - Virgin Voyages",
    "fullText": "Virgin Voyages is sharing the following update regarding travel disruptions currently impacting Sailors traveling into and out of San Juan.",
    "link": "https://www.virginvoyages.com/ahoy/stories/san-juan-disembarkation-travel-update"
  }
]