[
  {
    "text": "Watch Live: Trump speaks after U.S. carried out Venezuelan strikes, Maduro capture - CBS News",
    "fullText": "President Trump said the U.S. would \"run the country\" of Venezuela until \"a safe, proper and judicious transition,\" following the U.S. military operation that captured Nicolás Maduro.",
    "link": "https://www.cbsnews.com/news/nicolas-maduro-captured-venezuela-attack-trump-fox/"
  },
  {
    "text": "Ohio police search for suspect after dentist, wife found murdered at home - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/ohio-police-search-suspect-after-dentist-wife-found/story?id\\\\u003d128829216"
  },
  {
    "text": "Important Travel Update for San Juan Disembarkation. - Virgin Voyages",
    "fullText": "Virgin Voyages is issuing the following update regarding travel disruptions affecting sailors disembarking in San Juan today.",
    "link": "https://www.virginvoyages.com/ahoy/stories/san-juan-disembarkation-travel-update"
  },
  {
    "text": "Earthquake with a preliminary magnitude of 6.5 rattles southern and central Mexico - ABC News",
    "fullText": "A strong earthquake rattled southern and central Mexico, interrupting President Claudia Sheinbaum’s first press briefing of the new year as seismic alarms sounded",
    "link": "https://abcnews.go.com/International/wireStory/earthquake-preliminary-magnitude-65-rattles-southern-central-mexico-128845093"
  },
  {
    "text": "A new mom battling postpartum depression skipped a routine appointment. An unrelated visit led to an unexpected diagnosis. - CBS News",
    "fullText": "Postpartum depression and a busy home life kept Ameilia Boodoosingh Gopie from her regular appointments.",
    "link": "https://www.cbsnews.com/news/breast-cancer-surprise-diagnosis-new-mom-postpartum-depression/"
  },
  {
    "text": "The largest sun of 2026 rises today as Earth draws closest to our parent star - Space",
    "fullText": "Earth reaches its closest point to the sun in its 2026 orbit on Jan. 3.",
    "link": "https://www.space.com/stargazing/the-largest-sun-of-2026-rises-today-as-earth-draws-closest-to-our-parent-star"
  },
  {
    "text": "Tesla sales hit lowest point since 2022 after Musk backlash and end of tax credit - Axios",
    "fullText": "Vehicle sales are critical to funding CEO Elon Musk's AI ambitions.",
    "link": "https://www.axios.com/2026/01/02/tesla-sales-ev-elon-musk"
  },
  {
    "text": "Victoria Jones, daughter of Tommy Lee Jones, found dead in hotel on New Year's Day - NBC News",
    "fullText": "The daughter of Academy Award-winning actor Tommy Lee Jones has died, her family acknowledged in a statement on Friday night.",
    "link": "https://www.nbcnews.com/pop-culture/celebrity/victoria-jones-daughter-tommy-lee-jones-found-dead-hotel-new-years-day-rcna251896"
  },
  {
    "text": "Yemen clashes bring Saudi and UAE-backed forces into confrontation - BBC",
    "fullText": "It comes after clashes and an independence bid in southern Yemen bring Saudi and UAE-backed forces into confrontation.",
    "link": "https://www.bbc.com/news/articles/cjrz34qdr9no"
  },
  {
    "text": "Panthers could be first team since merger to make playoffs with no wins as favorites - NBC Sports",
    "fullText": "The Panthers can make the playoffs in 2025, either by beating the Buccaneers on Saturday or by watching the Falcons beat the Saints on Sunday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/panthers-could-be-first-team-since-merger-to-make-playoffs-with-no-wins-as-favorites"
  },
  {
    "text": "What weather forecast for 49ers-Seahawks on Saturday has in store for Brock Purdy - San Francisco Chronicle",
    "fullText": "In what figures to be a welcome forecast for the San Francisco 49ers and quarterback Brock Purdy, the weather in Santa Clara on Saturday might not be too messy.",
    "link": "https://www.sfchronicle.com/sports/49ers/article/weather-forecast-49ers-vs-seahawks-brock-purdy-21273692.php"
  },
  {
    "text": "DHS hypes worksite enforcement as fraud allegations rip through Minnesota - Axios",
    "fullText": "Sec. Noem says there's \"more coming\" as ICE focuses on businesses.",
    "link": "https://www.axios.com/2026/01/02/dhs-noem-minnesota-fraud"
  },
  {
    "text": "As Ohio teen dies, flu cases rise in the Valley - WFMJ.com",
    "fullText": "Mahoning County reported 34 people hospitalized for the flu. Trumbull County had 17 hospitalizations, and Columbiana County had four.",
    "link": "https://www.wfmj.com/story/53350181/as-ohio-teen-dies-flu-cases-rise-in-the-valley"
  },
  {
    "text": "Is Trump taking too much aspirin? Here's what experts say - NPR",
    "fullText": "Trump takes four times the recommended dose of aspirin for cardiac prevention. Even low-dose aspirin is no longer recommended for people over 60 who don't have heart disease.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/02/nx-s1-5665112/trump-aspirin-325-81-mg-low-dose-cardiac-stroke-heart-attack-bleeding"
  },
  {
    "text": "The latest numbers as flu cases continue to climb across Texas - ABC13 Houston",
    "fullText": "ABC13 is continuing to monitor flu cases as they climb nationwide and here in Houston.",
    "link": "https://abc13.com/post/latest-numbers-flu-cases-continue-climb-texas/18343679/"
  },
  {
    "text": "The year's first meteor shower and supermoon to overlap in the sky - PBS",
    "fullText": "The Quadrantid meteor shower peaks Friday night into Saturday morning, but fewer than 10 meteors will be visible per hour due to light from Saturday's supermoon.",
    "link": "https://www.pbs.org/newshour/science/the-years-first-meteor-shower-and-supermoon-to-overlap-in-the-sky"
  },
  {
    "text": "Today's NYT Connections Hints, Answers and Help for Jan. 3, #937 - CNET",
    "fullText": "Here's today's Connections answer and hints for groups. These clues will help you solve New York Times' popular puzzle game, Connections, every day!",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-jan-3-937/"
  },
  {
    "text": "South Carolina measles outbreak grows to 185 cases amid vaccination worries - Al Jazeera",
    "fullText": "The outbreak comes after the US charted its highest number of annual measles cases in more than three decades in 2025.",
    "link": "https://www.aljazeera.com/news/2026/1/2/south-carolina-measles-outbreak-grows-to-185-cases-amid-vaccination-worries"
  },
  {
    "text": "Researchers spot Saturn-sized planet in the “Einstein desert” - Ars Technica",
    "fullText": "Rogue, free-floating planets appear to have two distinct origins.",
    "link": "https://arstechnica.com/science/2026/01/researchers-spot-saturn-sized-planet-in-the-einstein-desert/"
  },
  {
    "text": "Study identifies our likely earliest ancestor after split from chimp - Haaretz",
    "fullText": "Sahelanthropus tchadensis was small and it looked like a chimp but new analysis of old bones, helped by feeling them, finds a feature no ape ever had",
    "link": "https://www.haaretz.com/archaeology/2026-01-02/ty-article-magazine/study-identifies-our-likely-earliest-ancestor-after-split-from-chimp/0000019b-7976-d487-a3bf-f97f82410000"
  }
]