[
  {
    "text": "At least 8 killed as huge explosion rips through fireworks shop in China ahead of Lunar New Year - the-sun.com",
    "fullText": "",
    "link": "https://www.the-sun.com/news/15947090/8-killed-explosion-fireworks-china-lunar-new-year/"
  },
  {
    "text": "Concerns over autocracy in the U.S. continue to grow - NPR",
    "fullText": "Is America still a democracy? Scholars tell NPR that after the last year under President Trump, the country has slid closer to autocracy or may already be there.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5705955/us-autocracy-concerns-grow"
  },
  {
    "text": "India hosts a high-stakes AI summit, drawing 20 leaders and top tech CEOs - AP News",
    "fullText": "India is hosting a major AI summit in New Delhi this week, as it pushes to shape global rules and show its own AI ambitions. The five-day meeting begins Monday and brings leaders and tech chiefs together in what organizers call the first big AI summit in the …",
    "link": "https://apnews.com/article/india-ai-modi-macron-lula-f32aa15263349dadad1840dadc75ca83"
  },
  {
    "text": "North Korea opens a housing district for families of its soldiers killed in Russia-Ukraine war - AP News",
    "fullText": "North Korea says it completed a housing district in Pyongyang for families of soldiers killed while fighting alongside Russian forces in Ukraine. It's the latest effort by leader Kim Jong Un to honor the war dead. State media photos showed Kim Jong Un walking…",
    "link": "https://apnews.com/article/north-korea-ukraine-war-dead-kim-jong-un-b589285d79f66900fbc30f9243383cfe"
  },
  {
    "text": "Bloodstained Director Shutaro Iida Passes Away at 52 as Sequel Production Enters Its Final Stages - Noisy Pixel",
    "fullText": "ArtPlay announces the passing of Bloodstained director Shutaro Iida at 52 as Bloodstained: The Scarlet Engagement nears completion.",
    "link": "https://noisypixel.net/bloodstained-director-shutaro-iida-passes-away/"
  },
  {
    "text": "Asia stocks muted in holiday-thinned trade, Japan dips on dismal GDP - Investing.com",
    "fullText": "Asia stocks muted in holiday-thinned trade, Japan dips on dismal GDP",
    "link": "https://www.investing.com/news/stock-market-news/asia-stocks-muted-on-holidaythinned-trade-japan-dips-on-dismal-gdp-4507345"
  },
  {
    "text": "Measles exposure reported at Philadelphia International Airport - 6abc Philadelphia",
    "fullText": "The Philadelphia Department of Public Health is warning travelers about a measles exposure at Philadelphia International Airport.",
    "link": "https://6abc.com/post/measles-exposure-reported-philadelphia-international-airport/18605914/"
  },
  {
    "text": "Player Grades: Mirkovic stars, Boswell makes big impact in return to lead Illini past Indiana - 247Sports",
    "fullText": "Grading Illinois player performances from the Illinis 7151 home win over Indiana on Sunday",
    "link": "https://247sports.com/college/illinois/longformarticle/illinois-fighting-illini-basketball-player-grades-indiana-david-mirkovic-kylan-boswell-274496854/"
  },
  {
    "text": "2026 Milano Cortina Olympics qualification playoff games preview - NHL.com",
    "fullText": "No. 5 Switzerland against No. 12 Italy, No. 8 Czechia vs. No. 9 Denmark among Tuesday matchups",
    "link": "https://www.nhl.com/news/2026-milano-cortina-olympics-qualification-playoff-games-preview"
  },
  {
    "text": "Isaacman planning to meet with head of Roscosmos - SpaceNews",
    "fullText": "NASA Administrator Jared Isaacman said he is interested in meeting with his Russian counterpart and attending an upcoming Soyuz launch.",
    "link": "http://spacenews.com/isaacman-planning-to-meet-with-head-of-roscosmos/"
  },
  {
    "text": "Tom Lee Says AI Killed Software And Job Losses Are 'Soon To Follow' - Yahoo Finance",
    "fullText": "Fundstrat’s Tom Lee warned AI is destroying the $450 billion software sector and job losses will follow, predicting a dovish Fed under Kevin Warsh will cut...",
    "link": "https://finance.yahoo.com/news/tom-lee-says-ai-killed-230155251.html"
  },
  {
    "text": "Iran says potential energy, mining and aircraft deals are on the table in talks with the U.S. - CNBC",
    "fullText": "Iran is pursuing a nuclear agreement with the U.S. that delivers economic benefits for both sides, an Iranian diplomat was reported as saying on Sunday.",
    "link": "https://www.cnbc.com/2026/02/15/iran-energy-mining-aircraft-us-talks.html"
  },
  {
    "text": "Scottie Scheffler Caps Off Unconscious Final Round At Pebble Beach With Picture-Perfect Eagle - OutKick",
    "fullText": "Nobody makes the game of golf look easier than Mr. Scheffler.",
    "link": "https://www.outkick.com/sports/scottie-scheffler-pebble-beach-eagle-18-video"
  },
  {
    "text": "Bondi criticised after saying all Epstein files have been released - BBC",
    "fullText": "Lawmakers, including those who wrote the law requiring their publication, argue the release is insufficient.",
    "link": "https://www.bbc.com/news/articles/cz7genjx9njo"
  },
  {
    "text": "What is the dart frog toxin allegedly used to kill Alexei Navalny? - BBC",
    "fullText": "The toxin, epibatidine, can be found in frogs in the wild in South America or manufactured in a lab.",
    "link": "https://www.bbc.com/news/articles/cm289we7jzdo"
  },
  {
    "text": "China Built A Shape-Shifting Robot That Can Grow Like A Human - bgr.com",
    "fullText": "A new robot out of China can change its shape by inflating or deflating, and its creators hope it can be put to use for search and rescue operations.",
    "link": "https://www.bgr.com/2098835/china-shape-shifting-robot-human-inspired-growth/"
  },
  {
    "text": "3 Doors Down Were Post-Grunge Hitmakers. But the Band Couldn’t Outrun Tragedy - Rolling Stone",
    "fullText": "Brad Arnold, singer of 3 Doors Down who died this month at 47, is remembered by friends as a unifier, despite politics that could be seen as divisive.",
    "link": "http://www.rollingstone.com/music/music-features/3-doors-down-brad-arnold-tragedy-politics-1235517117/"
  },
  {
    "text": "Strong correlations and superconductivity observed in a supermoiré lattice - Phys.org",
    "fullText": null,
    "link": "https://phys.org/news/2026-02-strong-superconductivity-supermoir-lattice.html"
  },
  {
    "text": "Massive demonstrations held to oppose Iran's government - Politico",
    "fullText": "About 250,000 people demonstrated in Munich on Saturday.",
    "link": "https://www.politico.com/news/2026/02/15/massive-demonstrations-held-to-oppose-irans-government-00782529"
  }
]