[
  {
    "text": "Buffalo Bills at Jacksonville Jaguars | Where to watch, stream and listen | AFC Wild Card Round - BuffaloBills.com",
    "fullText": "TV Channel, Streaming and Radio for Bills at Jaguars",
    "link": "https://www.buffalobills.com/news/buffalo-bills-at-jacksonville-jaguars-where-to-watch-stream-and-listen-afc-wild-card-round"
  },
  {
    "text": "Thousands of tourists stranded in northern Finland as deep freeze halts flights - AP News",
    "fullText": "Thousands of tourists are stranded in northern Finland after flights at Kittilä airport were canceled due to severe cold. The temperature dropped to minus 37 degrees Celsius, or minus 34 Fahrenheit, on Sunday morning, making de-icing of aircraft difficult. Th…",
    "link": "https://apnews.com/article/finland-flights-canceled-europe-cold-weather-c95ec0c51effea12b378e1af7408b754"
  },
  {
    "text": "Portsmouth 1-4 Arsenal (Jan 11, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Portsmouth vs. Arsenal English Fa Cup game from January 11, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/762502"
  },
  {
    "text": "‘We hope they will give us heat:’ Bitter winter cold bites for Kyiv’s residents as Russia steps up attacks - CNN",
    "fullText": "Ukraine battled Sunday to restore power to tens of thousands of people left without heating in bitterly cold temperatures, after a week of intense Russian attacks that have brought the country’s energy infrastructure to its knees.",
    "link": "https://www.cnn.com/2026/01/11/europe/ukraine-energy-attacks-restore-power-intl"
  },
  {
    "text": "With YouTube and TikTok, dentists are trying to get Gen Z to show up - The Washington Post",
    "fullText": "Young adults are the most likely age group to skip dental care, with a recent study finding that one in three didn’t see a dentist during the previous year.",
    "link": "https://www.washingtonpost.com/nation/2026/01/11/dentists-gen-z-skipping-dental-care/"
  },
  {
    "text": "Donald Trump won't take Greenland by force, Lord Mandelson says - BBC",
    "fullText": "The former UK ambassador to the US tells the BBC the president's advisers would likely warn him against the move.",
    "link": "https://www.bbc.com/news/articles/cp9j1d3zgvgo"
  },
  {
    "text": "Google’s AI Inbox could be a glimpse of Gmail’s future - The Verge",
    "fullText": "We’ve tried Google’s AI Inbox, and while it has some promise, if you have a good email management system already, it may not change that.",
    "link": "https://www.theverge.com/tech/859864/google-gmail-ai-inbox-hands-on"
  },
  {
    "text": "Sen. Rand Paul warns bombing Iran 'not the answer' to protests against regime - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/sen-rand-paul-warns-bombing-iran-answer-protests/story?id\\\\u003d129100786"
  },
  {
    "text": "Walmart teams up with Google's Gemini to make it easier for shoppers to find and buy products - CNBC",
    "fullText": "The retail giant also has a similar deal with OpenAI's ChatGPT and has its own AI-powered chatbot, Sparky.",
    "link": "https://www.cnbc.com/2026/01/11/walmart-partners-with-google-gemini-on-shopping-tool.html"
  },
  {
    "text": "Walmart Expanding Drone Delivery to Hundreds More Stores - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/articles/walmart-expanding-drone-delivery-to-hundreds-more-stores-696165f7"
  },
  {
    "text": "Bob Weir, Grateful Dead Co-Founder and Guitarist, Dead at 78 - Rolling Stone",
    "fullText": "Bob Weir, the singer-guitarist who co-founded the Grateful Dead and later found success with Dead & Company, has died at age 78.",
    "link": "http://www.rollingstone.com/music/music-news/bob-weir-grateful-dead-dead-obituary-1234810106/"
  },
  {
    "text": "From Merrill Lynch to wok station: the daughter of San Francisco's Chinese food dynasty who defied her parents—by working alongside them - Fortune",
    "fullText": "House of Nanking's Kathy Fang talked to Fortune about her new cookbook, quitting corporate life, and when her dad embarrassed her in front of Keanu Reeves.",
    "link": "https://fortune.com/2026/01/11/house-of-nanking-cookbook-kathy-fang-interview-keanu-reeves-san-francisco-chinatown/"
  },
  {
    "text": "Erich von Däniken, Swiss writer who spawned alien archaeology, dies at 90 - abcnews.go.com",
    "fullText": "His books, mixing fact and fiction, brought him both fame and scorn.",
    "link": "https://abcnews.go.com/Technology/wireStory/erich-von-dniken-swiss-writer-spawned-alien-archaeology-129100696"
  },
  {
    "text": "It's One Of The Fastest-Growing Snacks In The Nation. It Also Comes With A Concerning Risk. - HuffPost",
    "fullText": "Food journalist Elizabeth Dunn tells the hosts of HuffPost's \"Am I Doing It Wrong?\" podcast why they should consider steering clear of this beloved food.",
    "link": "https://www.huffpost.com/entry/protein-rich-snack-meat-sticks-carcinogen_l_6961173ee4b0120ab25d18a4"
  },
  {
    "text": "Bride and groom killed by gas explosion day after Pakistan wedding - BBC",
    "fullText": "Eight people were killed after a gas cylinder exploded at a house the morning after the wedding celebration.",
    "link": "https://www.bbc.com/news/articles/c4gr7nlx421o"
  },
  {
    "text": "DuckDuckGo vs. Google: The Search Engine Choice That Says Everything About You - PCMag",
    "fullText": "One prioritizes convenience and personalization. The other puts privacy first. Which one should you use? We help you decide.",
    "link": "https://www.pcmag.com/comparisons/duckduckgo-vs-google-the-search-engine-choice-that-says-everything-about"
  },
  {
    "text": "How ICE raids in Minnesota connect to a years-old fraud scandal - NBC News",
    "fullText": "The Trump administration is using a years-old scandal first prosecuted under the Biden administration to justify its immigration crackdown in Minnesota.",
    "link": "https://www.nbcnews.com/tech/internet/ice-raids-minnesota-connect-years-old-fraud-scandal-rcna253151"
  },
  {
    "text": "Venezuela's exiles in Chile caught between hope and uncertainty - NPR",
    "fullText": "Initial joy among Venezuela's diaspora in Chile has given way to caution, as questions grow over what Maduro's capture means for the country — and for those who fled it.",
    "link": "https://www.npr.org/2026/01/11/nx-s1-5666843/venezuelas-exiles-in-chile-caught-between-hope-and-uncertainty"
  },
  {
    "text": "Ben Johnson says \"F—- the Packers,\" Bears heard the \"noise\" coming out of Green Bay - NBC Sports",
    "fullText": "Johnson said the Packers were talking trash during the week and that the Bears' players and coaches were aware of it.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/ben-johnson-says-f-the-packers-bears-heard-the-noise-coming-out-of-green-bay"
  }
]