[
  {
    "text": "Kane gets 500th NHL goal, becomes 5th U.S.-born player to reach milestone - NHL.com",
    "fullText": "37-year-old scores twice for Red Wings in win against Canucks",
    "link": "https://www.nhl.com/news/red-wings-patrick-kane-scores-500th-nhl-goal"
  },
  {
    "text": "2 shot by federal agent after 'targeted' stop, Portland mayor asks ICE to halt operations - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/2-shot-federal-agents-portland-sources/story?id\\\\u003d129038573"
  },
  {
    "text": "Stock futures are little changed ahead of jobs report, potential tariff ruling: Live updates - CNBC",
    "fullText": "Traders looked ahead to December's nonfarm payrolls report and awaited a potential Supreme Court ruling on Trump's tariffs.",
    "link": "https://www.cnbc.com/2026/01/08/stock-market-today-live-updates.html"
  },
  {
    "text": "Sarah Jessica Parker, Helen Mirren honored at Golden Eve celebration - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/sarah-jessica-parker-dame-helen-mirren-honored-golden-eve/story?id\\\\u003d128960856"
  },
  {
    "text": "Google Fi starts selling its first 5G tablet - 9to5Google",
    "fullText": "Following phones and watches, the Google Fi store is getting its first tablet with the Samsung Galaxy Tab A11+ 5G....",
    "link": "http://9to5google.com/2026/01/08/google-fi-store-tablet/"
  },
  {
    "text": "Doctors says ‘The Pitt’ reflects the gritty realities of medicine today - NPR",
    "fullText": "The Pitt is back for a new run, evoking the tensions health care providers face in the U.S. today. Here's what one doctor says to watch out for this season.",
    "link": "https://www.npr.org/2026/01/08/nx-s1-5671156/pitt-season-2-tv-show-medicine"
  },
  {
    "text": "Sources: 9 MLB teams end deals with Main Street Sports Group - ESPN",
    "fullText": "Sources told ESPN that nine Major League Baseball teams have terminated their contracts with Main Street Sports Group, the RSN operator that again finds itself in deep financial trouble.",
    "link": "https://www.espn.com/mlb/story/_/id/47552639/sources-9-mlb-teams-end-deals-main-street-sports-group"
  },
  {
    "text": "Past/Present: Witten to join OU coaching staff - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "Jason Witten is expected to reunite with DeMarco Murray on the OU coaching staff.",
    "link": "https://www.dallascowboys.com/news/past-present-witten-to-join-ou-coaching-staff"
  },
  {
    "text": "First galaxy-wide wobbling black hole jet discovered in a disk galaxy - Phys.org",
    "fullText": "Astronomers using W. M. Keck Observatory on Maunakea, Hawaiʻi Island have uncovered the largest and most extended stream of super-heated gas ever observed flowing from a nearby galaxy, providing the clearest evidence yet that a supermassive black hole can dra…",
    "link": "https://phys.org/news/2026-01-galaxy-wide-black-hole-jet.html"
  },
  {
    "text": "A letter from Owner and Chairman Arthur M. Blank - Atlanta Falcons",
    "fullText": "",
    "link": "https://www.atlantafalcons.com/news/letter-owner-chairman-arthur-blank-greg-beadles-rich-mckay"
  },
  {
    "text": "Trump blasts 5 Republicans for war powers vote - PBS",
    "fullText": "President Donald Trump called their vote “stupidity” in a post to Truth social on Thursday.",
    "link": "https://www.pbs.org/newshour/politics/trump-blasts-5-republicans-for-war-powers-vote"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Establishes New Department of Justice Division for National Fraud Enforcement - The White House (.gov)",
    "fullText": "FIGHTING CRIMINAL FRAUD NATIONWIDE: Today, the Trump Administration is announcing the upcoming creation of the Department of Justice’s new division for",
    "link": "https://www.whitehouse.gov/fact-sheets/2026/01/fact-sheet-president-donald-j-trump-establishes-new-department-of-justice-division-for-national-fraud-enforcement/"
  },
  {
    "text": "‘Cloud-9’ celestial object could solve dark matter mystery - CNN",
    "fullText": "A newly discovered celestial object may be a starless cloud that could change how astronomers understand dark matter.",
    "link": "https://www.cnn.com/2026/01/08/science/cloud-9-new-celestial-object"
  },
  {
    "text": "The Official Website of Governor Phil Murphy - NJ.gov",
    "fullText": "The official website of the 56th Governor of New Jersey State, Phil Murphy.",
    "link": "https://www.nj.gov/governor/news/news/562026/approved/20260108a.shtml"
  },
  {
    "text": "Uvalde officer trial: Judge tosses testimony of key prosecution witness - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/uvalde-officer-trial-judge-tosses-testimony-key-prosecution/story?id\\\\u003d129016362"
  },
  {
    "text": "Former GLP-1 users regain lost weight after about 18 months, study says - The Washington Post",
    "fullText": "Those quitting Ozempic, Wegovy and other drugs regained weight four times faster than those using just diet and exercise, still key components in weight maintenance.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/08/ozempic-wegovy-weight-regain-glp1/"
  }
]