[
  {
    "text": "Inside Alts: Private equity management fees hit new low in 2025 - CNBC",
    "fullText": "Managers have been offering discounts amid difficulty fundraising, and capital is increasingly going to bigger funds, dragging down the mean.",
    "link": "https://www.cnbc.com/2026/01/06/private-equity-management-fees-new-low.html"
  },
  {
    "text": "Republican Rep. Doug LaMalfa dies at 65, GOP says - CNBC",
    "fullText": "LaMalfa's death is a critical shift in the balance of power in the U.S. House of Representatives, tightening Republicans' razor-thin majority.",
    "link": "https://www.cnbc.com/2026/01/06/doug-lamalfa-dies-congress-california.html"
  },
  {
    "text": "Trump admin freezes child care funds for Colorado and four other states - Axios",
    "fullText": "The move hits programs that support child care, job training and basic assistance for thousands of Colorado families.",
    "link": "https://www.axios.com/local/denver/2026/01/05/trump-colorado-child-care-funding"
  },
  {
    "text": "Game Pass Adds All These Games In January 2026 - GameSpot",
    "fullText": null,
    "link": "https://www.gamespot.com/gallery/game-pass-adds-all-these-games-in-january-2026/2900-7386/"
  },
  {
    "text": "Ford reports best annual U.S. vehicle sales since 2019 - CNBC",
    "fullText": "Ford reported sales of 2.2 million vehicles in 2025, including a 2.7% uptick to more than 545,200 units during the fourth quarter.",
    "link": "https://www.cnbc.com/2026/01/06/ford-f-2025-annual-sales.html"
  },
  {
    "text": "I tested Apple’s hands-free Home Key — and it’s a big upgrade - The Verge",
    "fullText": "Aqara’s new U400 smart lock is the first to use Apple’s UWB-based hands-free unlocking, and it works every time, even with full hands.",
    "link": "https://www.theverge.com/tech/854757/aqara-u400-apple-home-key-hands-free-uwb"
  },
  {
    "text": "Pope Leo XIV closes 2025 Holy Year with critique of consumerism and xenophobia - NBC News",
    "fullText": "Pope Leo XIV on Tuesday closed out the Vatican’s 2025 Holy Year by denouncing today’s consumerist and anti-foreigner sentiment, capping a Jubilee that saw some 33 million pilgrims flock to Rome and a historic transition to the first American pontiff",
    "link": "https://www.nbcnews.com/world/pope-leo-xiv/pope-leo-xiv-closes-2025-holy-year-critique-consumerism-xenophobia-rcna252520"
  },
  {
    "text": "Ashley Tisdale says she quit her 'toxic mom group' - BBC",
    "fullText": "The High School Musical actress says she left the group of new mothers after being \"brought to tears\".",
    "link": "https://www.bbc.com/news/articles/c4g09l286e2o"
  },
  {
    "text": "Epstein files: 2 million records in various stages of review, DOJ says - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/epstein-files-2-million-records-stages-review-doj/story?id\\\\u003d128935822"
  },
  {
    "text": "China bans certain rare earths and other exports to Japan for military purposes over Takaichi’s comments - CNN",
    "fullText": "China has banned exports of some rare earth elements and other items to Japan that could be used for military purposes, straining already tense relations between the two countries following the Japanese prime minister’s recent remarks on Taiwan.",
    "link": "https://www.cnn.com/2026/01/06/business/china-japan-export-controls-intl-hnk"
  },
  {
    "text": "Liam Rosenior: Why Chelsea chose 41-year-old Englishman as manager - BBC",
    "fullText": "After Chelsea give Liam Rosenior his first Premier League managerial job, BBC Sport looks at why they have appointed him.",
    "link": "https://www.bbc.com/sport/football/articles/c5y5gn3130lo"
  },
  {
    "text": "2025 Final Grades for AFC Teams: Ravens and Chiefs Fall From Grace - Sports Illustrated",
    "fullText": "Baltimore and Kansas City receive failing grades, with both teams falling short of their lofty preseason expectations.",
    "link": "https://www.si.com/nfl/2025-final-grades-afc-teams-ravens-chiefs-fall-from-grace"
  },
  {
    "text": "Joe Schoen: Goal is a turnaround like Bears, Patriots had in 2025 - NBC Sports",
    "fullText": "The Bears and Patriots both hired new coaches without hiring new General Managers in 2025 and both of the teams made the playoffs, so it's no surprise that Joe Schoen chose to highlight their success in his Monday press conference.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/joe-schoen-goal-would-be-turnaround-like-bears-patriots-had-in-2025"
  },
  {
    "text": "First Call: Stunning stat about Steelers-Ravens final kick; Russell Wilson’s potentially costly comment - TribLIVE.com",
    "fullText": "Tuesday&rsquo;s &ldquo;First Call&rdquo; has some trash talk from Le&rsquo;Veon Bell toward a current Steelers defensive back. A former Pitt standout thinks the Steelers have little hope in their next game against Houston. Russell Wilson may have cost his cur…",
    "link": "https://triblive.com/sports/first-call-stunning-stat-about-steelers-ravens-final-kick-russell-wilsons-potentially-costly-comment/"
  },
  {
    "text": "ADHD drugs work, but not the way experts thought - The Washington Post",
    "fullText": "New brain research could reshape our understanding of ADHD and the most common drugs that treat it.",
    "link": "https://www.washingtonpost.com/health/2026/01/06/adhd-ritalin-sleep-children/"
  },
  {
    "text": "Can China and South Korea reset complex ties after Xi-Lee summit? - Al Jazeera",
    "fullText": "Analysts say both countries increasingly rely on each other for economic and security reasons amid geopolitical churn.",
    "link": "https://www.aljazeera.com/news/2026/1/6/can-china-and-south-korea-reset-complex-ties-after-xi-lee-summit"
  },
  {
    "text": "Study Raises Serious Questions About The Benefits of Intermittent Fasting - ScienceAlert",
    "fullText": "The notion behind intermittent fasting is simple: eat less for a time, improve your metabolism.",
    "link": "https://www.sciencealert.com/study-raises-serious-questions-about-the-benefits-of-intermittent-fasting"
  },
  {
    "text": "Macron hosts Ukraine and allies to try to cement security guarantees - BBC",
    "fullText": "The talks are held as Russia continues attacking Ukraine's energy sector and under the shadow of US threats to annex Greenland.",
    "link": "https://www.bbc.com/news/articles/c74vx4n003xo"
  },
  {
    "text": "Trump administration's capture of Maduro raises unease about the international legal framework - AP News",
    "fullText": "The capture of Nicolás Maduro by U.S. forces has sparked global controversy. President Trump insists the operation was legal, citing an \"armed conflict\" with Venezuelan drug cartels. The move aligns with Trump's strategy to restore U.S. dominance in the Weste…",
    "link": "https://apnews.com/article/trump-maduro-venezuela-law-un-2e400f5753570b70487fd3d3fa50261e"
  }
]