[
  {
    "text": "S&P 500 closes higher on first trading day of 2026 as chip stocks offer small boost to the market - CNBC",
    "fullText": "The S&P 500 closed slightly higher on Friday, the first trading day of 2026, as gains in semiconductor names kept the index afloat.",
    "link": "https://www.cnbc.com/2026/01/02/stock-market-today-live-updates.html"
  },
  {
    "text": "Elon Musk's Grok under fire for generating explicit AI images of minors - Axios",
    "fullText": "One user asked Grok to remove clothing from an image of a 14-year-old \"Stranger Things\" actress.",
    "link": "https://www.axios.com/2026/01/02/elon-musk-grok-ai-child-abuse-images-stranger-things"
  },
  {
    "text": "Tom Brady's Firecracker New Girlfriend Stuns America, Kay Adams Takes A Bath & Lane Kiffin Is Just The Worst - OutKick",
    "fullText": "Also, Sean McDonough deserves a round of applause after last night.",
    "link": "https://www.outkick.com/culture/tom-bradys-firecracker-new-girlfriend-stuns-america-kay-adams-takes-bath-lane-kiffin-just-worst"
  },
  {
    "text": "New York reports record-breaking number of flu hospitalizations in a single week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-york-reports-record-breaking-number-flu-hospitalizations/story?id\\\\u003d128849108"
  },
  {
    "text": "Playoff Quarterfinal at the Capital One Orange Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Capital One Orange Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Orange-recap.aspx"
  },
  {
    "text": "Tesla loses title as world's biggest electric vehicle maker as sales fall for second year in a row - AP News",
    "fullText": "Tesla lost its crown as the world’s bestselling electric vehicle maker on Friday as a customer revolt over Elon Musk’s right-wing politics, expiring U.S. tax breaks to buyers and stiff overseas competition pushed sales down for a second year in a row. Tesla s…",
    "link": "https://apnews.com/article/tesla-sales-musk-trump-deliveries-robotaxi-6d60715babde97b3b1a8e2416f4065ca"
  },
  {
    "text": "Mamdani brings the campaign mobilization to City Hall - City & State New York",
    "fullText": null,
    "link": "https://www.cityandstateny.com/politics/2026/01/mamdani-brings-campaign-mobilization-city-hall/410434/"
  },
  {
    "text": "2026 is the year humanity will finally go back to the moon - Space",
    "fullText": "It's happening. We are going.",
    "link": "https://www.space.com/space-exploration/artemis/2026-is-the-year-humanity-will-finally-go-back-to-the-moon"
  },
  {
    "text": "Will Smith sued by former tour member for wrongful termination, sexual harassment - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/smith-sued-former-tour-member-wrongful-termination-sexual/story?id\\\\u003d128844691"
  },
  {
    "text": "Stephen Schwartz Pulls Out of Kennedy Center’s 2026 Lineup: ‘There’s No Way I Would Set Foot in It Now’ - Variety",
    "fullText": "Stephen Schwartz, famous for 'Wicked' and 'Godspell,' said the Kennedy Center has become politicized and 'there's no way I would set foot in it now.\"",
    "link": "https://variety.com/2026/music/news/stephen-schwartz-kennedy-center-pulls-out-1236622379/"
  },
  {
    "text": "David Sacks sees 2 cities replacing NYC and SF as finance and tech capitals - Business Insider",
    "fullText": "Ultrawealthy tech investors like David Sacks and Peter Thiel are weighing their options ahead of California's proposed billionaire wealth tax.",
    "link": "https://www.businessinsider.com/david-sacks-new-york-san-francisco-vs-miami-austin-2026-1"
  },
  {
    "text": "Look up tonight: Quadrantid meteor shower will peak, joined by 1st supermoon of 2026 - LiveNOW from FOX",
    "fullText": "This year's first supermoon is called the Super Wolf Moon.",
    "link": "https://www.livenowfox.com/news/look-up-tonight-quadrantid-meteor-shower-will-peak-joined-1st-supermoon-2026"
  },
  {
    "text": "Sparklers may have led to deadly New Year's Swiss resort bar fire, investigators say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/sparkling-candles-led-deadly-new-years-swiss-resort/story?id\\\\u003d128846606"
  },
  {
    "text": "The 1st full moon of 2026 rises tonight! Here's what to expect from January's supermoon Wolf Moon - Space",
    "fullText": "The first full moon of 2026 has arrived.",
    "link": "https://www.space.com/stargazing/the-1st-full-moon-of-2026-rises-tonight-heres-what-to-expect-from-januarys-supermoon-wolf-moon"
  },
  {
    "text": "Two of the Middle East’s most powerful countries are facing off in Yemen. Here’s what to know - CNN",
    "fullText": "A decade after Saudi Arabia and the United Arab Emirates led a joint military campaign to curb Iran’s influence in Yemen, the two allies now find themselves pitted against each other there.",
    "link": "https://www.cnn.com/2026/01/02/middleeast/yemen-saudi-uae-conflict-explainer-intl"
  },
  {
    "text": "Catholic influencer Paul Kim’s son dies aged five after severe case of the flu - The Independent",
    "fullText": "Kim said the boy suffered sepsis and seizures",
    "link": "https://www.the-independent.com/life-style/paul-kim-son-dead-flu-b2893561.html"
  }
]