[
  {
    "text": "Who dies in the Stranger Things 5 finale? All deaths in order (and how they died) - Bam Smack Pow",
    "fullText": "After a wait of nearly ten years, the end has come. The Stranger Things Season 5 finale is here, but did it feature any crushing deaths? It's time to find out.",
    "link": "https://bamsmackpow.com/who-dies-in-stranger-things-season-5-episode-8-finale-deaths-order-live-vecna-still-danger-steve-karen-dustin-ted"
  },
  {
    "text": "Duke 42-39 Arizona State (Dec 31, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778329"
  },
  {
    "text": "Ex-champ Joshua out of hospital after car crash - ESPN",
    "fullText": "Two-time former heavyweight champion Anthony Joshua was released from the hospital after being under observation for minor injuries.",
    "link": "https://www.espn.com/boxing/story/_/id/47466722/ex-champ-anthony-joshua-released-hospital-car-crash"
  },
  {
    "text": "Alleged drug smugglers jumped overboard in latest boat strikes, U.S. military says - CBS News",
    "fullText": "Three people were killed Tuesday when the first boat was hit, while individuals in two other boats jumped overboard, according to U.S. Southern Command.",
    "link": "https://www.cbsnews.com/news/alleged-drug-smugglers-jumped-overboard-latest-boat-strikes-pacific-us-military/"
  },
  {
    "text": "Chief Justice says Constitution remains 'firm and unshaken' with major Supreme Court rulings ahead - AP News",
    "fullText": "Chief Justice John Roberts says that the Constitution remains a sturdy pillar for the country, a message that comes after a tumultuous year in the nation’s judicial system with pivotal Supreme Court decisions on the horizon. Roberts released his annual letter…",
    "link": "https://apnews.com/article/supreme-court-john-roberts-trump-judges-caad1b61e25a15315b667de3fbe1fabe"
  },
  {
    "text": "Exclusive | U.S. Finds Ukraine Didn’t Target Putin in Drone Strike - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/national-security/u-s-finds-ukraine-didnt-target-putin-in-drone-strike-615ce4be"
  },
  {
    "text": "J.J. McCarthy back at practice, iffy for Vikings' finale - ESPN",
    "fullText": "Vikings quarterback J.J. McCarthy practiced Wednesday for the first time since he was diagnosed with a hairline fracture in his right hand.",
    "link": "https://www.espn.com/nfl/story/_/id/47466266/jj-mccarthy-back-practice-iffy-vikings-finale"
  },
  {
    "text": "David Beckham Leaves Brooklyn Out of 2025 Instagram Tribute Amid Family Feud - TMZ",
    "fullText": "Brooklyn Beckham is once again at the center of the Beckham family drama ... this time thanks to a glaring absence from dad David Beckham's 2025 Instagram recap.",
    "link": "https://www.tmz.com/2025/12/31/david-beckham-leaves-brooklyn-out-of-year-recap/"
  },
  {
    "text": "San Antonio teen who vanished Christmas Eve found dead by suicide in nearby field after days-long search - Fox News",
    "fullText": "Authorities confirmed missing San Antonio teen Camila Mendoza Olmos, 19, who vanished Christmas Eve, died by suicide after her body was found near her house.",
    "link": "https://www.foxnews.com/us/san-antonio-teen-vanished-christmas-eve-found-dead-suicide-nearby-field-days-long-search"
  },
  {
    "text": "Trump media firm to issue new cryptocurrency to shareholders - BBC",
    "fullText": "The digital token will add to the Trump family's crypto ventures, which have brought in millions of dollars and raised questions on conflicts of interest.",
    "link": "https://www.bbc.com/news/articles/cx2ky3mn7j5o"
  },
  {
    "text": "ACA subsidies that lower monthly insurance premiums for millions of Americans set to expire - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/aca-subsidies-lower-monthly-insurance-premiums-millions-americans/story?id\\\\u003d128804401"
  },
  {
    "text": "Hundreds of Coloradans hospitalized with flu as numbers explode into record territory - Colorado Public Radio",
    "fullText": "Nearly 800 people in the state are hospitalized with influenza.",
    "link": "https://www.cpr.org/2025/12/31/colorado-hospitalizations-flu/"
  },
  {
    "text": "Treasury Targets Oil Traders Engaged in Sanctions Evasion for Maduro Regime - U.S. Department of the Treasury (.gov)",
    "fullText": "WASHINGTON — Today, the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) sanctioned four companies for operating in Venezuela’s oil sector and identified four associated oil tankers as blocked property.  These vessels, some of which a…",
    "link": "https://home.treasury.gov/news/press-releases/sb0348"
  },
  {
    "text": "What to know about Zohran Mamdani's historic inauguration as New York City mayor - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/zohran-mamdanis-historic-inauguration-new-york-city-mayor/story?id\\\\u003d128784385"
  },
  {
    "text": "Pats' Barmore facing assault and battery charge - ESPN",
    "fullText": "Patriots defensive tackle Christian Barmore is facing a misdemeanor charge of assault and battery on a household/family member stemming from an August incident, according to court documents.",
    "link": "https://www.espn.com/nfl/story/_/id/47463660/patriots-christian-barmore-facing-assault-battery-charge"
  },
  {
    "text": "Jennifer Lopez Hits the Stage for Her Las Vegas Residency, Plus Ryan Seacrest, Rita Ora, Mariah Carey and More - People.com",
    "fullText": "Jennifer Lopez hits the stage for her Las Vegas residency, plus Ryan Seacrest, Rita Ora, Mariah Carey and more. From Los Angeles to New York City, and everywhere in between, see what your favorite stars are up to.",
    "link": "https://people.com/star-tracks-wednesday-december-31-2025-new-celebrity-photos-updated-daily-11877777"
  },
  {
    "text": "USPS Postmark Rules Change: What You Need to Know - AARP",
    "fullText": "USPS now dates mail when it’s processed, not dropped off. Learn how this affects tax returns, health appeals, ballots and more.",
    "link": "https://www.aarp.org/government-elections/usps-postmark-changes/"
  },
  {
    "text": "Photos show the year in politics as Trump brought change to America in 2025 - CBS News",
    "fullText": "In 2025, President Trump returned to power and instituted change in Washington. Here's a roundup of photos of key moments throughout the year.",
    "link": "https://www.cbsnews.com/news/2025-year-politics-photos/"
  }
]