[
  {
    "text": "These 12 cities will be hit hard by a bomb cyclone this weekend - The Washington Post",
    "fullText": "A powerful nor’easter will deliver a dangerous combination of heavy snow, frigid temperatures, strong winds and coastal flooding from the Southeast to New England.",
    "link": "https://www.washingtonpost.com/weather/2026/01/30/snow-storm-forecast-cities-east-coast-noreaster-bomb-cylone/"
  },
  {
    "text": "Vikings fire G.M. Kwesi Adofo-Mensah - NBC Sports",
    "fullText": "Rob Brzezinski will lead the front office through the 2026 draft.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/vikings-fire-g-m-kwesi-adofo-mensah"
  },
  {
    "text": "The Sundance Film Festival’s big moments and breakout movies - AP News",
    "fullText": "The last Sundance Film Festival in Utah is drawing to a close this weekend. The Park City gathering has been a nostalgic farewell, as it moves to Boulder, Colorado in 2027. A Wednesday night screening of “Little Miss Sunshine” was especially emotional, with f…",
    "link": "https://apnews.com/article/sundance-film-festival-2026-breakouts-moments-deals-f630b9ee4a706fc78f421f94a7ee9783"
  },
  {
    "text": "FBI now leading investigation into fatal shooting of Alex Pretti - CBS News",
    "fullText": "Immigration and Customs Enforcement's Homeland Security Investigations branch had been leading the investigation into the fatal shooting of Alex Pretti in Minneapolis.",
    "link": "https://www.cbsnews.com/news/alex-pretti-shooting-fbi-investigation/"
  },
  {
    "text": "South Africa expels Israel's top diplomat in a move that could prompt a strong reaction from the US - AP News",
    "fullText": "South Africa has declared Israel’s deputy ambassador persona non grata and ordered him to leave the country within 72 hours. The South African Foreign Ministry said it was expelling Ariel Seidman, the chargé d’affaires at the Israeli Embassy, because of repea…",
    "link": "https://apnews.com/article/south-africa-israel-diplomat-expelled-45ce43a54676b1400fabf2ef02e4f7ca"
  },
  {
    "text": "Ongoing WWE SmackDown results (spoilers) for January 30th 2026 from Riyadh, Saudi Arabia - NoDQ.com",
    "fullText": "The latest WWE and AEW backstage wrestling news, rumors, opinions, and special features.",
    "link": "https://nodq.com/news/86507/"
  },
  {
    "text": "Eli Lilly plans $3.5 billion manufacturing plant in Pennsylvania to make next-generation obesity injections - CNBC",
    "fullText": "The plant will help make Lilly's experimental drug called retatrutide, which has shown the highest weight loss seen to date in a late-stage trial.",
    "link": "https://www.cnbc.com/2026/01/30/eli-lilly-3point5-billion-pennsylvania-plant-obesity-drugs.html"
  },
  {
    "text": "Ariana Grande Says She’s “Thankful” After Vogue Accidentally Gives Her Six Fingers - AOL.com",
    "fullText": "Pop superstar Ariana Grande is taking a major Photoshop fail in stride—and with her signature sense of humor intact. The 32-year-old singer recently discover...",
    "link": "https://socialitelife.com/ariana-grande-says-shes-thankful-after-vogue-accidentally-gives-her-six-fingers/"
  },
  {
    "text": "Senate leaders scramble to save bipartisan deal and avoid a partial shutdown - AP News",
    "fullText": "Senate leaders were scrambling on Friday to save a bipartisan spending deal and prevent a partial government shutdown this weekend as some Republicans pushed back on a rare deal between President Donald Trump and Democrats. Democrats who are demanding new res…",
    "link": "https://apnews.com/article/congress-budget-immigration-trump-homeland-security-39fd7917e39aaf9e4e78e89f3449a587"
  },
  {
    "text": "Can Apple's New AirTag Track How Many Fans Tim Cook Just Lost? - CNET",
    "fullText": "Apple releases the second-gen AirTag and Creator Studio subscription in the middle of a tricky public relations week for CEO Tim Cook.",
    "link": "https://www.cnet.com/tech/mobile/can-apples-new-airtag-track-how-many-fans-tim-cook-just-lost/"
  },
  {
    "text": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "fullText": "Israel says it will reopen Gaza’s border crossing with Egypt in both directions over the weekend. The move announced on Friday will allow Palestinians to enter and leave the territory after nearly two years of near-complete closure. The Israeli military body …",
    "link": "https://apnews.com/article/israel-palestinians-gaza-rafah-border-crossing-reopening-823d4b0aef641c3f19d4cc7b527325b1"
  },
  {
    "text": "Watch awkward Chinese humanoid robot lay it all down on the dance floor - Live Science",
    "fullText": "The model demonstrated remarkable precision, stability and speed across a highly complex dance routine.",
    "link": "https://www.livescience.com/technology/robotics/watch-chinese-humanoid-robot-adam-u-ultra-dance-without-missing-a-beat-in-eerie-new-video"
  },
  {
    "text": "Eric Edholm 2026 NFL mock draft 1.0: Two receivers in top five; Patriots, Seahawks bolster elite defenses - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Eric Edholm has a pair of wide receivers coming off the board in the top five picks. Plus, the Super Bowl LX teams add more talent to their elite defenses. Check out the full first-round projection, 1-32.",
    "link": "https://www.nfl.com/news/eric-edholm-2026-nfl-mock-draft-1-0-two-receivers-in-top-five-patriots-seahawks-bolster-elite-defenses"
  },
  {
    "text": "Picking the Most Logical Destinations for Five Major MLB Trade Candidates - Sports Illustrated",
    "fullText": "Tarik Skubal is just one of several big names who could move before Opening Day.",
    "link": "https://www.si.com/mlb/most-logical-destinations-five-mlb-trade-candidates"
  },
  {
    "text": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions - The Washington Post",
    "fullText": "Lawmakers called for the Office of the Director of National Intelligence to explain the presence of the nation’s top spy at a domestic law enforcement action in Georgia.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/30/tulsi-gabbard-fulton-county-fbi-raid/"
  },
  {
    "text": "Shark kills 13-year-old boy at popular beach in Brazil: \"Ate almost his entire leg\" - CBS News",
    "fullText": "Dozens of beaches along the turquoise coastlines of Pernambuco have been issued with shark warnings, authorities said.",
    "link": "https://www.cbsnews.com/news/shark-kills-boy-brazil-beach-warning-signs/"
  },
  {
    "text": "MSF statement on sharing staff information and humanitarian operations in Palestine - MSF - Médecins Sans Frontières",
    "fullText": "Following many months of unsuccessful engagement with Israeli authorities, and in the absence of securing assurances to ensure the safety of our staff or the independent management of our operations, MSF has concluded that it will not share a list of its Pale…",
    "link": "https://www.msf.org/msf-statement-sharing-staff-information-and-humanitarian-operations-palestine"
  },
  {
    "text": "Trump Immediately Blows Up His Border Czar’s Bid to Calm ICE Backlash - The Daily Beast",
    "fullText": "Trump contradicts Tom Homan plan to calm tensions straight away.",
    "link": "https://www.thedailybeast.com/donald-trump-immediately-blows-up-border-czar-tom-homans-bid-to-calm-ice-backlash-in-minneapolis-minnesota/"
  },
  {
    "text": "ExxonMobil Announces 2025 Results - Exxon Mobil Corporation",
    "fullText": "SPRING, Texas – January 30, 2026 – Exxon Mobil Corporation today announced fourth-quarter 2025 earnings of $6.5 billion, or $1.53 per share. Earnings excluding identified items were $7.3 billion, or $1.71 per share. Cash flow from operating activities was $12…",
    "link": "https://corporate.exxonmobil.com/news/news-releases/2026/0130-exxonmobil-announces-2025-results"
  },
  {
    "text": "Verizon Delivers on 2025 Financial Guidance with Highest Quarterly Net Adds Since 2019 - Verizon",
    "fullText": "More than 1 million total net additions across mobility and broadband, highest reported quarterly net additions since 2019, with 616,000 postpaid phone net additions.",
    "link": "https://www.verizon.com/about/news/verizon-delivers-2025-financial-guidance-highest-quarterly-net-adds"
  }
]