[
  {
    "text": "French farmers force their way through Paris with tractors to protest free trade deal - abcnews.go.com",
    "fullText": "Dozens of angry farmers demonstrated in front of France’s lower house of parliament",
    "link": "https://abcnews.go.com/Business/wireStory/french-farmers-force-paris-tractors-protest-free-trade-129010284"
  },
  {
    "text": "Eric Schmidt will massively invest in private telescopes, including Hubble replacement - Ars Technica",
    "fullText": "“This is a very significant contribution to the astronomical community.\"",
    "link": "https://arstechnica.com/space/2026/01/eric-schmidt-will-massively-invest-in-private-telescopes-including-hubble-replacement/"
  },
  {
    "text": "Developer_Direct Returns January 22: Watch Fable, Forza Horizon 6, and Beast of Reincarnation Gameplay, Direct from the Studios - Xbox Wire",
    "fullText": "We're kicking off 2026 with the fourth installment of Developer_Direct on January 22 – bringing you new gameplay and insights for Fable, Forza Horizon 6, and Beast of Reincarnation.",
    "link": "https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/"
  },
  {
    "text": "CES 2026: Hyundai Motor Group leverages Group capabilities to lead the AI Robotics industry - hyundai.com",
    "fullText": "At the CES 2026, Hyundai presented its vision for the future where AI robotics empowers \npeople and production.",
    "link": "https://www.hyundai.com/worldwide/en/brand-journal/mobility-solution/ces-2026-robotics-mediaday"
  },
  {
    "text": "Performance of premium and budget TV brands is closer than ever - The Verge",
    "fullText": "What once used to be a a wide separation between the first and second tier brands, has now shrunk to where Hisense and TCL stand with LG, Sony, and Samsung.",
    "link": "https://www.theverge.com/tech/857325/the-gap-between-premium-and-budget-tv-brands-is-quickly-closing"
  },
  {
    "text": "HSBC settles French dividend trade probe for €300mn - Financial Times",
    "fullText": "Move follows investigation into bank’s handling of trades between 2014 and 2019",
    "link": "https://www.ft.com/content/8ea9effd-551c-45cf-a2b1-1d0cae95bf76"
  },
  {
    "text": "Workers' rights reforms will cost billions less after concessions, analysis shows - BBC",
    "fullText": "Firms implementing the new employment terms are expected to face lower additional costs after the legislation was watered down.",
    "link": "https://www.bbc.com/news/articles/c5yv6n536vno"
  },
  {
    "text": "House to vote on renewing ACA subsidies as a potential deal takes shape in the Senate - NPR",
    "fullText": "While the three-year extension for Affordable Care Act subsidies is expected to pass the House, it may not go far in the Senate. But a bipartisan group of senators say they are close on a compromise.",
    "link": "https://www.npr.org/2026/01/08/nx-s1-5662625/house-vote-affordable-care-act-subsidies"
  },
  {
    "text": "Vera C. Rubin Observatory discovers enormous, record-breaking asteroid in first 7 nights of observations - Live Science",
    "fullText": "In its preliminary data release, taken from just seven nights of observations, the powerful Vera C. Rubin Observatory has discovered an enormous, fast-spinning asteroid that sets a new record.",
    "link": "https://www.livescience.com/space/astronomy/vera-c-rubin-observatory-discovers-enormous-record-breaking-asteroid-in-first-7-nights-of-observations"
  },
  {
    "text": "‘His & Hers’ Review: Tessa Thompson and Jon Bernthal Generate Minimal Heat in Netflix’s Disappointing Mystery - The Hollywood Reporter",
    "fullText": null,
    "link": "http://www.hollywoodreporter.com/tv/tv-reviews/his-and-hers-review-tessa-thompson-jon-bernthal-netflix-1236466860/"
  },
  {
    "text": "Warriors 120-113 Bucks (Jan 7, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810381"
  },
  {
    "text": "Former Democratic House Majority Leader Steny Hoyer to announce retirement after more than 40 years in Congress - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/former-democratic-house-majority-leader-steny-hoyer-announce/story?id\\\\u003d129006345"
  },
  {
    "text": "BYU 104-76 Arizona State (Jan 7, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401827606"
  },
  {
    "text": "UConn 103-98 Providence (Jan 7, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401822889"
  },
  {
    "text": "Kentucky Falls to Missouri on Wednesday - UK Athletics",
    "fullText": "Kentucky Falls to Missouri on Wednesday",
    "link": "https://ukathletics.com/news/2026/01/07/kentucky-falls-to-missouri-on-wednesday/"
  },
  {
    "text": "'Tangled' Live-Action Casts Milo Manheim and Teagan Croft As Leads - TODAY.com",
    "fullText": "Disney announced that they have found their lead stars for the live-action version of “Tangled.”",
    "link": "https://www.today.com/popculture/movies/tangled-live-action-milo-manheim-teagan-croft-cast-rcna252916"
  },
  {
    "text": "People coming off weight-loss injections risk fast weight gain - BBC",
    "fullText": "Overweight people shed large amounts on jabs but gain 0.8 kg a month on average once off them, study shows.",
    "link": "https://www.bbc.com/news/articles/c050ljnrv2qo"
  },
  {
    "text": "Exercise Treats Depression as Well as Therapy or Meds, Review Finds - Gizmodo",
    "fullText": "More research is needed to understand the long-term benefits of exercise on depression, however.",
    "link": "https://gizmodo.com/exercise-treats-depression-as-well-as-therapy-or-meds-review-finds-2000706970"
  },
  {
    "text": "All the Head-Turning Security Tech I Saw at CES 2026 - CNET",
    "fullText": "CES brought a crowd of security companies, all vying to impress with new cameras, sensors and locks. But here's what really caught my attention.",
    "link": "https://www.cnet.com/home/security/all-the-head-turning-security-tech-i-saw-at-ces-2026/"
  },
  {
    "text": "Withdrawal from Wasteful, Ineffective, or Harmful International Organizations - U.S. Department of State (.gov)",
    "fullText": "Today, in furtherance of Executive Order 14199, President Trump announced the withdrawal of the United States from 66 international organizations identified as part of the Trump Administration’s review of wasteful, ineffective, and harmful international organ…",
    "link": "https://www.state.gov/releases/office-of-the-spokesperson/2026/01/withdrawal-from-wasteful-ineffective-or-harmful-international-organizations"
  }
]