[
  {
    "text": "Packers vs. Bears | How to watch, stream & listen | 2025 NFC Wild Card playoff - Green Bay Packers – packers.com",
    "fullText": "NFC North rivals will meet Saturday, Jan. 10 at 7 p.m. CT on Prime Video",
    "link": "https://www.packers.com/news/packers-vs-bears-how-to-watch-stream-listen-nfc-wild-card-2025-playoff"
  },
  {
    "text": "Gisele Bundchen’s Family Thinks Her Wedding to ‘Penniless’ Joaquim Valente Was ‘a Mistake’ - Yahoo",
    "fullText": "Gisele Bündchen and her Brazilian jiu-jitsu instructor baby daddy Joaquim Valente may still be in the honeymoon phase after tying the knot in Florida December 3, but her family is not so pleased, according to Page Six. “Her family warned her that marrying a p…",
    "link": "https://nationalenquirer.com/gisele-bundchens-family-thinks-her-wedding-to-penniless-joaquim-valente-was-a-mistake/"
  },
  {
    "text": "Rams-Panthers game includes threat of thunderstorms - NBC Sports",
    "fullText": "The calendar says January.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/rams-panthers-game-includes-threat-of-thunderstorms"
  },
  {
    "text": "Commanders name David Blough offensive coordinator - Washington Commanders",
    "fullText": "Blough is entering his third season with the organization. He was the assistant quarterbacks coach in 2024-25 and handled increased responsibilities in the quarterback room following quarterbacks coach Tavita Pritchard departing the organization for Stanf",
    "link": "https://www.commanders.com/news/commanders-name-david-blough-offensive-coordinator"
  },
  {
    "text": "Intel Panther Lake: Mobile Graphics, Entry-Level Desktop Performance - Digital Foundry",
    "fullText": "2026 looks set to deliver a laptop/handheld battle royale.",
    "link": "https://www.digitalfoundry.net/news/2026/01/intel-panther-lake-mobile-graphics-entry-level-desktop-performance"
  },
  {
    "text": "Samsung Confirms New Options For Android Users After Gmail Issues - Forbes",
    "fullText": "Decision time for Android users as Google’s AI completely takes over your smartphone.",
    "link": "https://www.forbes.com/sites/zakdoffman/2026/01/10/samsung-confirms-new-options-for-android-users-after-gmail-issues/"
  },
  {
    "text": "Strength training is crucial after menopause. How to make the most of your workouts - AP News",
    "fullText": "Medical experts say strength training keeps bones and muscles healthy after menopause when estrogen loss speeds up a reduction in bone density and contributes to the gradual loss of muscle mass. Strength training also helps women maintain a healthy weight and…",
    "link": "https://apnews.com/article/menopause-perimenopause-exercise-strength-training-b379697dd2290786739ed442d4173cd7"
  },
  {
    "text": "Gen Z and social media are helping men’s makeup go mainstream. The beauty industry is trying to capitalize - CNBC",
    "fullText": "Men’s makeup is shedding stigma as TikTok and Gen Z drives growth, retailers rethink displays and brands chase one of beauty’s last untapped markets.",
    "link": "https://www.cnbc.com/2026/01/10/mens-makeup-gen-z-tiktok-instagram-ulta-sephora.html"
  },
  {
    "text": "Vonn zooms to 2nd downhill victory before Milan - ESPN",
    "fullText": "Lindsey Vonn won her second World Cup downhill in four races this season, raising expectations in this remarkable comeback at age 41 ahead of the Milan Cortina Olympics.",
    "link": "https://www.espn.com/olympics/skiing/story/_/id/47568851/lindsey-vonn-wins-second-world-cup-downhill-olympic-season"
  },
  {
    "text": "ISS astronaut medical evacuation latest news: SpaceX readies Dragon spacecraft for Crew-11 return to Earth - Space",
    "fullText": "Saturday, Jan. 10, 2026: Updates on NASA's astronaut medical evacuation from the International Space Station.",
    "link": "https://www.space.com/live/astronaut-medical-evacuation-on-iss-jan-10-2026"
  },
  {
    "text": "The NIH has lost its scientific integrity. So we left - statnews.com",
    "fullText": "“We can no longer lend our credibility to an organization that has lost its integrity,” write four scientists and administrators who recently resigned from the NIH.",
    "link": "https://www.statnews.com/2026/01/10/nih-resign-protest-four-leaders-cite-interference-censorship/"
  },
  {
    "text": "Samsung's Galaxy S26 series release date may have just been etched in stone - PhoneArena",
    "fullText": "It's a little later than we all expected a while ago, but mostly in line with the most recent speculation.",
    "link": "https://www.phonearena.com/news/samsung-galaxy-s26-series-release-date-rumored-almost-guaranteed_id177214"
  },
  {
    "text": "A blinding parasitic eye disease affects mostly contact lens wearers. Here’s how to avoid it - CNN",
    "fullText": "Acanthamoeba keratitis is a rare but blinding parasitic eye disease. Experts share how to avoid it and treat it.",
    "link": "https://www.cnn.com/2026/01/10/health/acanthamoeba-keratitis-symptoms-treatment-wellness"
  },
  {
    "text": "Horoscope for Saturday, January 10, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/10/horoscopes-today-saturday-january-10-2026"
  },
  {
    "text": "LDWF declares emergency after chronic wasting disease detected in Concordia Parish deer - WBRZ",
    "fullText": "CONCORDIA PARISH - Parts of Pointe Coupee Parish are affected by a declaration of emergency from the Louisiana Department of Wildlife and Fisheries regarding a deer being detected with chronic wasting disease.",
    "link": "https://www.wbrz.com/news/ldwf-declares-emergency-after-chronic-wasting-disease-detected-in-concordia-parish-deer/"
  },
  {
    "text": "So are we in an AI bubble? Here are clues to look for. : Planet Money - NPR",
    "fullText": "Are we in an AI bubble? That’s the $35 trillion dollar question right now as the stock market soars higher and higher. The problem is that bubbles are famously hard to spot. But some economists say they may have found some telltale clues.On our latest: How do…",
    "link": "https://www.npr.org/2026/01/09/nx-s1-5672643/market-ai-what-is-a-bubble"
  },
  {
    "text": "AFI Awards Draws Biggest Star Turnout Ever; Campaigns Heat Up With Oscar Voting Imminent – Notes On The Season - Deadline",
    "fullText": "The Notes On The Season column covers the AFI Awards, and the last moments of campaigning before ballots are in Oscar voters hands.",
    "link": "http://deadline.com/2026/01/afi-awards-draws-biggest-star-turnout-ever-notes-on-season-1236677706/"
  },
  {
    "text": "Multiple small avalanches release in Juneau after city issues evacuation advisory - KTOO",
    "fullText": "Some residents have chosen to evacuate and others remain at home after city issues avalanche evacuation advisory. Several small avalanches have released in the usual paths across downtown and Thane.",
    "link": "https://www.ktoo.org/2026/01/09/multiple-small-avalanches-release-in-juneau-after-city-issues-evacuation-advisory/"
  }
]