[
  {
    "text": "Ranking the Xenoblade Chronicles games, from best to worst - Nintendo Everything",
    "fullText": "Today, we're taking on the difficult task of ranking every single game in the Xenoblade Chronicles series from best to \"least best\".",
    "link": "https://nintendoeverything.com/best-xenoblade-chronicles-games-ranked/"
  },
  {
    "text": "Natalie Portman, Seth Rogen debut new movies at Sundance Film Festival - AP News",
    "fullText": "The Sundance Film Festival hosted the world premieres of two comedies on Saturday. Olivia Wilde's “The Invite” debuted at the Eccles Theater in Park City, Utah. It marks her third directorial effort and is a return to her comedic roots. The film, written by W…",
    "link": "https://apnews.com/article/sundance-film-festival-natalie-portman-jenna-ortega-21902c93b05e371e0033d1ced2c3b964"
  },
  {
    "text": "LIVE: Houston and southeast Texas under ice and winter storm warnings, ABC13 Weather Alert activated - abc13.com",
    "fullText": "An ABC13 Weather Alert is active across Houston and Southeast Texas as icy accumulations are expected through the weekend, and travel disruptions and local power outages are possible. Follow live updates on ABC13.com.",
    "link": "https://abc13.com/live-updates/abc13-weather-alert-ice-winter-storm-warnings-issued-houston-most-southeast-texas/18465916/"
  },
  {
    "text": "AJ Styles and Shinsuke Nakamura had a moment after their final match - Cageside Seats",
    "fullText": "A touching spot at Saturday Night’s Main Event.",
    "link": "https://www.cagesideseats.com/wwe/413173/aj-styles-shinsuke-nakamura-moment-final-match-wwe-saturday-nights-main-event"
  },
  {
    "text": "StormTracker8: Snow and sleet tonight, freezing rain all day Sunday - wric.com",
    "fullText": null,
    "link": "https://www.wric.com/weather/daily-forecast/stormtracker8-winter-storm-to-arrive-this-afternoon-bringing-snow-ice/"
  },
  {
    "text": "Player Grades: Illini supporting cast shows up in clutch to make most of Wagler's epic Purdue performance - 247Sports",
    "fullText": "Grading Illinois basketball player performances from Saturdays 8882 win at No 4 Purdue",
    "link": "https://247sports.com/college/illinois/longformarticle/illinois-fighting-illini-basketball-player-grades-purdue-boilermakers-keaton-wagler-272230785/"
  },
  {
    "text": "Surging Cavs continue vaulting up the standings with 119-105 win over Magic - cleveland.com",
    "fullText": "Cleveland has won five of its last six games — a recent surge that has vaulted them up the Eastern Conference standings.",
    "link": "https://www.cleveland.com/cavs/2026/01/surging-cavs-continue-vaulting-up-the-standings-with-119-105-win-over-magic.html"
  },
  {
    "text": "Let public buy war bonds to raise £20bn for defence, say Lib Dems - BBC",
    "fullText": "Liberal Democrat leader Sir Ed Davey says the bonds would \"give ordinary people the opportunity to contribute to Britain's security\".",
    "link": "https://www.bbc.com/news/articles/cq5y7edg169o"
  },
  {
    "text": "Immigrant families protest inside Texas facility housing 5-year-old boy, father detained in Minnesota - texastribune.org",
    "fullText": "Liam Conejo Ramos and his father were detained in Minnesota in an incident that’s further inflamed tensions over the Trump administration’s hardline immigration enforcement.",
    "link": "http://www.texastribune.org/2026/01/24/immigration-facility-protest-texas-liam-conejo-ramos/"
  },
  {
    "text": "Five ways weight-loss jabs are changing spending habits - BBC",
    "fullText": "With GLP-1 drugs rising in popularity, how are businesses adapting to a new type of consumer?",
    "link": "https://www.bbc.com/news/articles/cj6wy85l3x5o"
  },
  {
    "text": "As we return to a pre-WW2 order, the middle powers face a challenge - BBC",
    "fullText": "With economic stagnation and extremes of inequality comes corrosion of trust in democratic institutions. So Trump may be a symptom, not a cause, of what Carney called a \"rupture\" with the post-WW2 order.",
    "link": "https://www.bbc.com/news/articles/c99kkerr93ko"
  },
  {
    "text": "How Tennessee basketball altered Alabama travel plans due to winter weather - On3",
    "fullText": "Tennessee basketball changed travel plans following its game at Alabama on Saturday due to winter weather and will not return to Knoxville.",
    "link": "https://www.on3.com/teams/tennessee-volunteers/news/tennessee-basketball-alabama-travel-weather-georgia/"
  },
  {
    "text": "Takeaways from the first Texas Senate Democratic primary debate - CNN",
    "fullText": "The first debate in the Texas Senate Democratic primary on Saturday revealed few policy differences between US Rep. Jasmine Crockett and state Rep. James Talarico. The contrast was instead between their styles and the approaches each would take to try to flip…",
    "link": "https://www.cnn.com/2026/01/24/politics/takeaways-from-the-first-debate-in-the-texas-senate-democratic-primary-race"
  },
  {
    "text": "UFC 324 results: Gaethje beats Pimbett for interim lightweight title - ESPN",
    "fullText": "ESPN MMA contributors break down all the action from UFC 324 at T-Mobile Arena in Las Vegas.",
    "link": "https://www.espn.com/mma/story/_/id/47684180/ufc-324-live-results-analysis-justin-gaethje-vs-paddy-pimblett"
  },
  {
    "text": "How much snow are Boston and Massachusetts getting this weekend? - CBS News",
    "fullText": "A major winter storm is heading to Massachusetts on Sunday. Here's how much snow you should expect to get in your area.",
    "link": "https://www.cbsnews.com/boston/news/how-much-snow-boston-massachusetts-storm-weekend-winter/"
  },
  {
    "text": "Stream live on WCNC+ | Ice storm coverage in Charlotte, across Carolinas - wcnc.com",
    "fullText": "Stream live ice storm updates on WCNC+. Download on your TV and watch for free.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/stream-live-ice-storm-coverage-wcnc-brad-panovich-charlotte-north-carolina-winter-weather/275-b7205542-1cc2-4c9c-8844-7858e6c88e9d"
  },
  {
    "text": "New Jersey Transit announces suspension plans for Sunday amid winter storm - abc7ny.com",
    "fullText": "With a winter storm expected to impact New Jersey, NJ Transit announced it will temporarily suspend most service systemwide to keep riders and employees safe.",
    "link": "https://abc7ny.com/post/new-jersey-transit-announces-suspension-plans-sunday-amid-winter-storm/18464897/"
  },
  {
    "text": "Trump backed down from NATO tariffs over Greenland but may cross a 'red line' on U.S. military bases there - Fortune",
    "fullText": "“Yeah,” Trump told the New York Post. “We’ll have everything we want. We have some interesting talks going on.”",
    "link": "https://fortune.com/2026/01/24/trump-nato-tariffs-greenland-sovereignty-red-line-denmark-us-military-bases/"
  },
  {
    "text": "Top African Health Official Blasts Trump Administration's Plans for Human Experimentation in Africa - Futurism",
    "fullText": "In a press conference, the director-general of the Africa CDC addressed plans for a controversial hepatitis B vaccine trial.",
    "link": "http://futurism.com/health-medicine/vaccines-africa-trump"
  },
  {
    "text": "NASA Scientist Looked Into 50-Year-Old Moon Dirt, Here’s What He Found - The Daily Galaxy",
    "fullText": "What if the key to Earth’s oceans had been hidden on the Moon all along? A surprising lunar discovery is turning old theories upside down.",
    "link": "https://dailygalaxy.com/2026/01/nasa-looked-into-moon-dirt-what-he-found/"
  }
]