[
  {
    "text": "How this French building behemoth wants to solve the U.S. housing dilemma - CNBC",
    "fullText": "Saint-Gobain is focusing on speed and affordability in construction through materials, assembly and other tools, according to North America CEO Mark Rayfield.",
    "link": "https://www.cnbc.com/2026/02/10/saint-gobain-us-housing-dilemma.html"
  },
  {
    "text": "Democrats add five red-leaning House seats to their battleground map - Politico",
    "fullText": "The DCCC is targeting new seats in Colorado, Minnesota, Montana, South Carolina and Virginia.",
    "link": "https://www.politico.com/live-updates/2026/02/10/congress/house-democrats-battleground-list-new-seats-00772976"
  },
  {
    "text": "An ape, a tea party — and the ability to imagine - NPR",
    "fullText": "The ability to imagine — to play pretend — has long been thought to be unique to humans. A new study suggests one of our closest living relatives can do it too.",
    "link": "https://www.npr.org/2026/02/10/nx-s1-5707560/apes-imagination-research-bonobos-cognition"
  },
  {
    "text": "US figure skater Amber Glenn resolves copyright issue with a Canadian music artist at the Olympics - AP News",
    "fullText": "U.S. figure skater Amber Glenn says she has resolved copyright concerns with Canadian artist Seb McKinnon over her free skate music. McKinnon, who produces music as CLANN, expressed surprise on social media after Glenn used his song “The Return” during the Ol…",
    "link": "https://apnews.com/article/milan-cortina-olympics-figure-skating-music-glenn-7fef2709962cd814f427474c6bf2a1c9"
  },
  {
    "text": "Spotify Stock Jumps On Improved Profitability, User Growth - Investor's Business Daily",
    "fullText": "The streaming music leader beat estimates for subscribers and total users in Q4.",
    "link": "https://www.investors.com/news/technology/spotify-stock-spot-q4-2025-earnings/"
  },
  {
    "text": "CVS tops quarterly estimates, reaffirms profit outlook as turnaround plan takes effect - CNBC",
    "fullText": "The results signal steady progress in the health-care giant's aggressive turnaround plan under CEO David Joyner, who stepped into the role in late 2024.",
    "link": "https://www.cnbc.com/2026/02/10/cvs-health-earnings-q4-2025.html"
  },
  {
    "text": "Opinion | We may be doing breast cancer screening all wrong - The Washington Post",
    "fullText": "This test may be crucial for breast cancer screening. It’s not a mammogram.",
    "link": "https://www.washingtonpost.com/opinions/2026/02/10/breast-cancer-screening-mammograms/"
  },
  {
    "text": "Putin thinks he can outsmart the US during Ukraine peace talks, a European intelligence chief says - AP News",
    "fullText": "A senior European intelligence chief says Russia cannot launch an attack on NATO this year or next but is planning to increase its forces significantly along the alliance’s eastern flank, depending on the outcome of the war in Ukraine. The head of Estonia’s f…",
    "link": "https://apnews.com/article/russia-ukraine-war-talks-united-states-estonia-b3fadd771c01be2240a1f72f76202769"
  },
  {
    "text": "AMA joins effort to launch vaccine science review amid CDC turmoil - The Washington Post",
    "fullText": "The American Medical Association and a partner group are taking on a new role in reviewing vaccine safety and effectiveness as the CDC’s review process faces criticism.",
    "link": "https://www.washingtonpost.com/health/2026/02/10/new-vaccine-review-system-launched/"
  },
  {
    "text": "Ohio GOP leader says no to Trump election plan - Ohio Capital Journal",
    "fullText": "Ohio's Republican legislative leader is rejecting President Donald Trump's push to federalize elections. House Speaker Matt Huffman, known as the most effective lawmaker in the state, categorically shut down any effort by the president to take over Ohio's ele…",
    "link": "https://ohiocapitaljournal.com/2026/02/10/ohio-gop-leader-says-no-to-trump-election-plan/"
  },
  {
    "text": "How the Trump administration skirts — and defies — court rulings on ICE detentions - Politico",
    "fullText": "A POLITICO review of hundreds of cases brought by ICE detainees shows a pattern of noncompliance that has frustrated judges across the country.",
    "link": "https://www.politico.com/news/2026/02/10/ice-immigration-detention-court-orders-00771727"
  },
  {
    "text": "‘We’re hooping on vibes’: Cavs have different energy, new belief with James Harden on roster - Cleveland.com",
    "fullText": "Despite trailing for nearly 43 minutes, on the road, boisterous building, at the end of an exhausting 12-day, five-city trip, against the championship hopeful Denver Nuggets, the revamped Cavs snatched away one of their most impressive wins.",
    "link": "https://www.cleveland.com/cavs/2026/02/were-hooping-on-vibes-cavs-have-different-energy-new-belief-with-james-harden-on-roster.html"
  },
  {
    "text": "Office Hours: Is Trump Really, Truly, Finally Losing His Mind? - Robert Reich | Substack",
    "fullText": null,
    "link": "https://robertreich.substack.com/p/office-hours-is-trump-really-truly"
  },
  {
    "text": "2025 Corruption Index flags drops in Western nations - dw.com",
    "fullText": "Once seen as anti-graft strongholds, the US, UK, Canada and Sweden are slipping into decline due to a lack of political leadership, Transparency International's Corruption Perception Index has revealed.",
    "link": "https://www.dw.com/en/2025-corruption-index-flags-drops-in-western-nations/a-75838368"
  },
  {
    "text": "Tesla goes through another head of North American sales - Electrek",
    "fullText": null,
    "link": "http://electrek.co/2026/02/09/tesla-goes-through-another-head-of-north-american-sales/"
  },
  {
    "text": "Rivian launching Apple Watch app with remote controls and Gen 1 digital key feature - 9to5Mac",
    "fullText": "Back in December, Rivian released support for using an Apple Watch as a digital key. Next, the EV maker is...",
    "link": "https://9to5mac.com/2026/02/09/rivian-launching-apple-watch-app-with-remote-controls-and-gen-1-digital-key-feature/"
  },
  {
    "text": "Over 50 cases of measles confirmed at Ave Maria University - WINK News",
    "fullText": "AVE MARIA, Fla.—Over 50 cases of Measles have been reported at Ave Maria University, according to the Florida Department of Health's latest update.",
    "link": "https://www.winknews.com/news/collier/over-50-cases-of-measles-confirmed-at-ave-maria-university/article_298f2922-a5b2-4b67-a0cd-24009dc56801.html"
  }
]