[
  {
    "text": "Big Tech sees over $1 trillion wiped from stocks as fears of AI bubble ignite sell-off - CNBC",
    "fullText": "Fears over AI spending have sparked a sell-off among tech stocks.",
    "link": "https://www.cnbc.com/2026/02/06/ai-sell-off-stocks-amazon-oracle.html"
  },
  {
    "text": "US and Russia agree to reestablish military dialogue after Ukraine talks - AP News",
    "fullText": "The U.S. and Russia have agreed to reestablish high-level, military-to-military dialogue for the first time in more than four years. The step is another sign of warming relations between the two countries since President Donald Trump took office and sought to…",
    "link": "https://apnews.com/article/russia-ukraine-talks-peace-abu-dhabi-witkoff-31ccc70ae7599507bc5a98a6cd87e2aa"
  },
  {
    "text": "'The hostility has been relentless': How Wuthering Heights became this year's most divisive film - BBC",
    "fullText": "Ever since it was announced, Emerald Fennell's version of the torrid Brontë classic has been the subject of furious online discourse over everything from its casting to its costumes.",
    "link": "https://www.bbc.com/culture/article/20260205-how-wuthering-heights-became-this-years-most-divisive-film"
  },
  {
    "text": "Every major galaxy is speeding away from us, except one — and we finally know why - Live Science",
    "fullText": "A vast, flat sheet of dark matter may solve the long-standing mystery of why our neighboring galaxy Andromeda is speeding toward us while our other neighbors are moving away from us.",
    "link": "https://www.livescience.com/space/cosmology/every-major-galaxy-is-speeding-away-from-the-milky-way-except-one-and-we-finally-know-why"
  },
  {
    "text": "House Republicans prepare full-court press for voting restrictions - Politico",
    "fullText": "The SAVE America Act, up for a vote next week in the House, has been a rare rallying point for a divided GOP.",
    "link": "https://www.politico.com/news/2026/02/06/house-save-act-vote-filibuster-00768499"
  },
  {
    "text": "Horoscope for Friday, February 06, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/06/horoscopes-today-friday-february-06-2026"
  },
  {
    "text": "Penguins Grades: The Rookies, the Refs, and Overcoming Real Issues - Pittsburgh Hockey Now",
    "fullText": "BUFFALO, N.Y. — And the rookies shall lead them. The Pittsburgh Penguins‘ inauspicious start became an energetic attack. Avery Hayes, […]",
    "link": "https://pittsburghhockeynow.com/pittsburgh-penguins-rookies-avery-hayes-ben-kindel-game-analysis-ben-kindel/"
  },
  {
    "text": "The Real Risks of the Saudi-UAE Feud - Foreign Affairs",
    "fullText": "Regional rivalry will raise tensions far beyond the Gulf.",
    "link": "https://www.foreignaffairs.com/united-states/real-risks-saudi-uae-feud"
  },
  {
    "text": "A full breakdown of the top prospects at the World Baseball Classic - mlb.com",
    "fullText": "The full rosters for the 2026 World Baseball Classic were revealed Thursday on MLB Network, so let's take a deeper dive into the top young talent who will be representing their roots on the world stage in a few weeks.\nThere will be 30 prospects from organizat…",
    "link": "https://www.mlb.com/news/world-baseball-classic-top-prospects-2026"
  },
  {
    "text": "Statins don’t cause most of the side effects on package warnings, study finds - statnews.com",
    "fullText": "Many people who should be taking statins avoid them for fear of side effects. A large new study says most of those side effects don't actually show up.",
    "link": "https://www.statnews.com/2026/02/05/statin-side-effects-evidence-lacking-lancet-study-says/"
  },
  {
    "text": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years - Variety",
    "fullText": "\"Moulin Rouge! The Musical\" is closing after seven years on Broadway.",
    "link": "https://variety.com/2026/legit/news/moulin-rouge-musical-close-broadway-1236653932/"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "A 'crazy' dice proof leads to a new understanding of a fundamental law of physics - Phys.org",
    "fullText": "Right now, molecules in the air are moving around you in chaotic and unpredictable ways. To make sense of such systems, physicists use a law known as the Boltzmann distribution, which, rather than describe exactly where each particle is, describes the chance …",
    "link": "https://phys.org/news/2026-02-crazy-dice-proof-fundamental-law.html"
  },
  {
    "text": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "fullText": "The New START deal was the last vestige of arms control between the world’s largest superpowers.",
    "link": "https://www.politico.com/news/2026/02/05/trump-nuclear-arms-treaty-russia-00767497"
  },
  {
    "text": "Donald Trump endorses Japan’s Sanae Takaichi ahead of general election - Financial Times",
    "fullText": "US president says prime minister deserves ‘powerful recognition’ in snap poll",
    "link": "https://www.ft.com/content/c8fa222b-d4e5-4678-9450-68ce5fb53516"
  },
  {
    "text": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo",
    "fullText": "A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.",
    "link": "https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421"
  },
  {
    "text": "Team USA opens Olympic women's hockey play with dominant victory over Czechia - NBC Olympics",
    "fullText": "USA opened Olympic women's hockey play with a dominant 5-1 victory over Czechia.",
    "link": "https://www.nbcolympics.com/news/team-usa-opens-olympic-womens-hockey-play-dominant-victory-over-czechia"
  },
  {
    "text": "What to Expect From the iPhone 18 Pro After the Latest Rumor Reversal - MacRumors",
    "fullText": "While the iPhone 18 Pro and iPhone 18 Pro Max are not expected to launch for another seven months or so, there are already plenty of rumors about the...",
    "link": "https://www.macrumors.com/2026/02/05/iphone-18-pro-rumors-features/"
  }
]