[
  {
    "text": "Chargers RB Hampton plans to return vs. Patriots - ESPN",
    "fullText": "Chargers running back Omarion Hampton said he plans to play in Sunday's playoff game against the Patriots.",
    "link": "https://www.espn.com/nfl/story/_/id/47562782/chargers-rb-omarion-hampton-ankle-play-vs-patriots"
  },
  {
    "text": "Free-agent outfielder Max Kepler suspended 80 games for PEDs - MLB.com",
    "fullText": "The Office of the Commissioner of Baseball announced Friday that free-agent outfielder Max Kepler has received an 80-game suspension after testing positive for Epitrenbolone, a performance enhancing substance, in violation of Major League Baseball’s Joint Dru…",
    "link": "https://www.mlb.com/news/max-kepler-suspended"
  },
  {
    "text": "When does the Nasa Moon mission launch and who are the Artemis II crew? - BBC",
    "fullText": "The first crewed Moon mission in 50 years could launch in February, preparing the way for a future landing.",
    "link": "https://www.bbc.com/news/articles/c0q4w3l0wdvo"
  },
  {
    "text": "Expert Predictions: Wild Card Picks for Chargers at Patriots - Official website of the New England Patriots",
    "fullText": "Experts share their picks for the Patriots Wild Card matchup against the Los Angeles Chargers.",
    "link": "https://www.patriots.com/news/expert-predictions-wild-card-picks-for-chargers-at-patriots"
  },
  {
    "text": "Producers Guild Awards Nominations: Season's Heavy Hitters & One Big Surprise Vying For Top Film Prize - Deadline",
    "fullText": "The Producers Guild of America has announced the nominees for its 2026 PGA Awards for movies and television.",
    "link": "http://deadline.com/2026/01/pga-awards-producers-guild-nominations-2026-list-1236676986/"
  },
  {
    "text": "NASA chief reviews Orion heat shield, expresses “full confidence” in it for Artemis II - Ars Technica",
    "fullText": "That level of openness and transparency is exactly what should be expected of NASA.\"",
    "link": "https://arstechnica.com/space/2026/01/nasa-chief-reviews-orion-heat-shield-expresses-full-confidence-in-it-for-artemis-ii/"
  },
  {
    "text": "Secretary Bessent Announces Initiatives to Combat Rampant Fraud in Minnesota - U.S. Department of the Treasury (.gov)",
    "fullText": "Actions Increase Transparency, Seek Accountability for Taxpayer DollarsWASHINGTON— In Minnesota, Secretary of the Treasury Scott Bessent announced several initiatives to combat rampant government benefits fraud in Minnesota, which has wasted billions of taxpa…",
    "link": "https://home.treasury.gov/news/press-releases/sb0354"
  },
  {
    "text": "Chinese, Russian and Iranian warships arrive for drills in South Africa - Al Jazeera",
    "fullText": "Naval exercises come as tensions run high after US military intervention in Venezuela, seizures of several oil tankers.",
    "link": "https://www.aljazeera.com/news/2026/1/9/chinese-russian-and-iranian-warships-arrive-for-drills-in-south-africa"
  },
  {
    "text": "Amazon Pharmacy starts offering Novo Nordisk's Wegovy weight-loss pill - CNBC",
    "fullText": "Eligible customers with insurance can pay as little as $25 for a one-month supply of the drug, while cash-paying options start at $149 a month, Amazon said.",
    "link": "https://www.cnbc.com/2026/01/09/amazon-pharmacy-starts-offering-novo-nordisks-wegovy-weight-loss-pill.html"
  },
  {
    "text": "Mortgage rates drop to lowest level in nearly 3 years as Trump orders buying of $200 billion in mortgage bonds - CNBC",
    "fullText": "President Donald Trump posted on social media Thursday that he is instructing mortgage giants Fannie Mae and Freddie Mac to buy $200 billion in mortgage bonds.",
    "link": "https://www.cnbc.com/2026/01/09/heres-whats-happening-now-with-mortgage-rates-.html"
  },
  {
    "text": "Baltimore Ravens’ choice of Lamar Jackson over John Harbaugh sets off NFL domino effect - Andscape",
    "fullText": "In one of the NFL’s worst-kept secrets, the Miami Dolphins are in the mix to hire Super Bowl-winning head coach John Harbaugh. Franchise owner Stephen M. Ross, a University of Michigan alumnus and major university benefactor, became familiar with the perennia…",
    "link": "https://andscape.com/features/baltimore-ravens-choice-of-lamar-jackson-over-john-harbaugh-sets-off-nfl-domino-effect/"
  },
  {
    "text": "Winter storm slams UK and France as cold snap spreads across Europe - AP News",
    "fullText": "Thousands of homes and businesses across northern France and southern England are without power and residents faced widespread travel delays after a storm swept in off the Atlantic. The low-pressure system named Storm Goretti brought high winds, rain and snow…",
    "link": "https://apnews.com/article/britain-france-goretti-storm-d9d2d60fcc34a7a3be8033c5d739e843"
  },
  {
    "text": "Megyn Kelly derides CBS anchor Tony Dokoupil for crying on TV: 'What is that?' - Entertainment Weekly",
    "fullText": null,
    "link": "https://ew.com/megyn-kelly-mocks-tony-dokoupil-crying-live-tv-cbs-11882202"
  },
  {
    "text": "Gov. Newsom’s last state budget: Here’s what we know - CalMatters",
    "fullText": "Newsom's administration forecast a \"modest\" $2.9 billion shortfall in the coming year, down sharply thanks to continuing windfalls from tech and AI stocks.",
    "link": "https://calmatters.org/politics/2026/01/california-newsom-last-state-budget/"
  },
  {
    "text": "DHS Launches Landmark USCIS Fraud Investigation in Minnesota - USCIS (.gov)",
    "fullText": "The Department of Homeland Security and U.S. Citizenship and Immigration Services have launched Operation PARRIS in Minnesota, a sweeping initiative reexamining thousands of refugee cases through new background checks and intensive verification of refugee cla…",
    "link": "https://www.uscis.gov/newsroom/news-releases/dhs-launches-landmark-uscis-fraud-investigation-in-minnesota"
  },
  {
    "text": "Scientists Find Drinking This Juice Lowers Blood Pressure in as Little as 2 Weeks - Prevention",
    "fullText": "Beet juice lowers blood pressure in older adults if you sip it daily, according to one study. Here, experts explain the connection, plus if you should try it.",
    "link": "https://www.prevention.com/health/a69955662/beet-juice-lowers-blood-pressure-study/"
  },
  {
    "text": "Google: Don't Turn Your Content Into Bite-Sized Chunks - Search Engine Roundtable",
    "fullText": "Google's Danny Sullivan said on the Search Off the Record podcast that was published yesterday that Google does not want you to turn your content into bite-sized chunks to rank well in  LLMs. He said,",
    "link": "https://www.seroundtable.com/google-content-bite-sized-chunks-40728.html"
  },
  {
    "text": "iPhone Fold to Pave Way for Thinner, Brighter Display on iPhone Air 2 - MacRumors",
    "fullText": "The iPhone Fold will be the first Apple device to adopt a Samsung-made OLED technology called CoE (Color Filter on Encapsulation), which could make...",
    "link": "https://www.macrumors.com/2026/01/09/iphone-fold-iphone-air-2-thinner-display/"
  },
  {
    "text": "Scientists find new clues to why female fertility declines with age - The Washington Post",
    "fullText": "New studies are shedding light on one of the biggest mysteries of human reproduction and what can be done to combat it.",
    "link": "https://www.washingtonpost.com/health/2026/01/09/ivf-fertility-aging-eggs/"
  }
]