[
  {
    "text": "Stock Market Today: Dow Jumps After U.S. Captures Venezuela’s Maduro - The Wall Street Journal",
    "fullText": "Live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-01-05-2026"
  },
  {
    "text": "Germany news: Berlin still shivering amid power outage - DW",
    "fullText": "Authorities say left-wing extremists likely carried out an arson attack that has left many Berliners without power. And alcohol can be purchased more cheaply in Germany than almost anywhere else in the EU. DW has more",
    "link": "https://www.dw.com/en/germany-news-berlin-still-shivering-amid-power-outage/live-75390211"
  },
  {
    "text": "GM posts 5.5% U.S. sales gain in 2025, Stellantis' Jeep marks first increase in seven years - CNBC",
    "fullText": "GM posts 5.5% U.S. sales gain in 2025, Stellantis' Jeep ends\nannual declines",
    "link": "https://www.cnbc.com/2026/01/05/gm-posts-5point5percent-us-sales-gain-in-2025-while-jeep-ends-annual-declines.html"
  },
  {
    "text": "NASA’s Hubble Examines Cloud-9, First of New Type of Object - NASA Science (.gov)",
    "fullText": "A team using Hubble uncovered a new type of astronomical object — a starless, gas-rich, dark-matter cloud, a remnant of early galaxy formation.",
    "link": "https://science.nasa.gov/missions/hubble/nasas-hubble-examines-cloud-9-first-of-new-type-of-object/"
  },
  {
    "text": "Wegovy obesity pill now available at pharmacies : Shots - Health News - NPR",
    "fullText": "Drugmaker Novo Nordisk said the prescription medicine can be found at a range of pharmacies, including CVS and Costco, as well as some telehealth providers.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/05/nx-s1-5667020/wegovy-pill-obesity-weight-loss"
  },
  {
    "text": "Flu season surged in the US over the holiday and already rivals last winter’s harsh epidemic - AP News",
    "fullText": "U.S. flu infections are still surging, and health officials are calling it a severe season that is likely to get worse. New government data posted Monday shows that by some measures this season is already surpassing the flu epidemic of last winter. That was o…",
    "link": "https://apnews.com/article/us-flu-cases-cdc-subclade-k-29cc5a68eb100585c8e0dbd2ec47b3eb"
  },
  {
    "text": "Qualcomm’s next-gen Snapdragon X2 laptops are here — and they brought a new friend - The Verge",
    "fullText": "Qualcomm has announced the Snapdragon X2 Plus, and says both it and the Snapdragon X2 Elite should be in PCs by end of Q1 2026.",
    "link": "https://www.theverge.com/tech/853851/qualcomm-snapdragon-x2-plus-elite-laptops-price-ces-2026"
  },
  {
    "text": "Walz, Democrats' 2024 VP pick, drops bid for third term as Minnesota governor; Klobuchar considers - AP News",
    "fullText": "Minnesota Gov. Tim Walz is ending his bid for a third term as governor amid President Donald Trump’s relentless focus on a fraud investigation into child care programs in the state. Less than four months after announcing his reelection campaign, Walz said Mon…",
    "link": "https://apnews.com/article/tim-walz-minnesota-governor-not-running-fb037492e59e1e376f3be0559c235aec"
  },
  {
    "text": "‘Mayor of Kingstown’ to End With Season 5 at Paramount+ - The Hollywood Reporter",
    "fullText": "Taylor Sheridan has eight more episodes to wrap up Jeremy Renner’s arc.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/mayor-of-kingstown-renewed-season-5-final-paramount-1236464407/"
  },
  {
    "text": "Holocaust survivor Eva Schloss, the stepsister of Anne Frank, dies at 96 - NPR",
    "fullText": "Schloss, who was friends with Frank in Amsterdam and whose mother later married Frank's father, was a tireless educator about the Holocaust and was honorary president of The Anne Frank Trust UK.",
    "link": "https://www.npr.org/2026/01/05/g-s1-104538/eva-schloss-dies-holocaust-survivor-anne-frank-stepsister-auschwitz"
  },
  {
    "text": "Raiders relieve Pete Carroll of duties as head coach - Raiders.com",
    "fullText": "",
    "link": "https://www.raiders.com/news/raiders-relieve-pete-carroll-of-duties-as-head-coach"
  },
  {
    "text": "The Golden Globes are this week. Here's what to know about the first major show of awards season - AP News",
    "fullText": "The Golden Globes kick off Hollywood’s awards season on Sunday. This year’s 83rd edition of the show is hosted for the second year by comedian Nikki Glaser. It airs live at 8 p.m. Eastern on CBS and streams live on Paramount+. Acting nominees include Timothée…",
    "link": "https://apnews.com/article/golden-globes-2026-what-to-know-5c67be217f15e16da1b97c5d18fb8197"
  },
  {
    "text": "Zip-tied leader Nicolás Maduro arrives at NYC court: live updates - USA Today",
    "fullText": "Captured Venezuelan President Nicolás Maduro and his wife Cilia Flores pleaded \"not guilty\" to narco-terrorism charges in Manhattan federal court.",
    "link": "https://www.usatoday.com/story/news/world/2026/01/05/us-venezuela-strikes-nicolas-maduro-live-updates/88022326007/"
  },
  {
    "text": "New federal screening guidance expands cervical cancer testing with an at-home HPV option - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-federal-screening-guidance-expands-cervical-cancer-testing/story?id\\\\u003d128891185"
  },
  {
    "text": "Hegseth goes after Mark Kelly's rank over \"seditious\" video - Axios",
    "fullText": "The potential demotion is a serious escalation, typically reserved for significant misconduct, and could drastically affect Kelly's pension.",
    "link": "https://www.axios.com/2026/01/05/hegseth-mark-kellys-rank-seditious-video"
  },
  {
    "text": "Secretary-General's remarks to the Security Council - on Venezuela - Welcome to the United Nations",
    "fullText": "",
    "link": "https://www.un.org/sg/en/content/sg/2026-01-05"
  },
  {
    "text": "Committee Releases Conferenced CJS, E&W, and Interior Bills - House Committee on Appropriations (.gov)",
    "fullText": "Washington, D.C. – Continuing its work to advance regular order and deliver results for the American people, the House Appropriations Committee today released the Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropria…",
    "link": "http://appropriations.house.gov/news/press-releases/committee-releases-conferenced-cjs-ew-and-interior-bills"
  },
  {
    "text": "Amazon revamps Fire TV, launches its own ‘Artline’ televisions with frames at CES - TechCrunch",
    "fullText": "Fire TV's new interface focuses on your content and offers easier, speedier navigation, Amazon says.",
    "link": "https://techcrunch.com/2026/01/05/amazon-revamps-fire-tv-launches-its-own-artline-televisions-with-frames/"
  },
  {
    "text": "Mike Tomlin said what? Some quotes from coach’s press conference after Steelers win - TribLIVE.com",
    "fullText": null,
    "link": "https://triblive.com/sports/mike-tomlin-said-what-some-quotes-from-coachs-press-conference-after-steelers-win/"
  }
]