[
  {
    "text": "Nuggets to reevaluate Gordon (hamstring) in 4 to 6 weeks - ESPN",
    "fullText": "Denver Nuggets forward Aaron Gordon will be reevaluated in four to six weeks with a right hamstring strain, the team announced Thursday.",
    "link": "https://www.espn.com/nba/story/_/id/47770248/nuggets-re-evaluate-gordon-hamstring-4-6-weeks"
  },
  {
    "text": "S&P 500 closes lower as Microsoft tanks, software shares slide: Live updates - CNBC",
    "fullText": "\"Magnificent Seven\" companies Meta Platforms, Microsoft and Tesla posted earnings results after Wednesday's close.",
    "link": "https://www.cnbc.com/2026/01/28/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump admin sues woman who failed to self deport for nearly $1 million - Politico",
    "fullText": "The new lawsuit is part of a wave of litigation seeking fines for undocumented immigrants for failing to depart the country.",
    "link": "https://www.politico.com/news/2026/01/29/immigration-deportation-lawsuits-00755663"
  },
  {
    "text": "‘White Lotus’ Season 4 Casts Helena Bonham Carter, Chris Messina, Marissa Long - Variety",
    "fullText": "Helena Bonham Carter, Chris Messina, and Marissa Long are all set to star in The White Lotus season 4",
    "link": "https://variety.com/2026/tv/news/white-lotus-season-4-helena-bonham-carter-chris-messina-1236644735/"
  },
  {
    "text": "Klobuchar will run for Minnesota governor after Walz ends bid. Democratic senator is a Trump critic - AP News",
    "fullText": "Amy Klobuchar says she's running for governor of Minnesota. The Democratic senator is promising to take on President Donald Trump’s administration and unify the state. She announced her candidacy in a video Thursday. Klobuchar's decision gives Democrats a hig…",
    "link": "https://apnews.com/article/klobuchar-minnesota-governor-walz-trump-deec28156a6ed2aca6b12971824d6e3e"
  },
  {
    "text": "Google gives Pixel Tablet another two years of Android OS updates - 9to5Google",
    "fullText": "Google’s mostly-forgotten Pixel Tablet is getting a new lease on life, as the company is giving its one and only...",
    "link": "http://9to5google.com/2026/01/29/google-gives-pixel-tablet-another-two-years-of-android-os-updates/"
  },
  {
    "text": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate - MMA Fighting",
    "fullText": "Watch Khamzat Chimaev get in the face of fiery fighter.",
    "link": "https://www.mmafighting.com/ufc/468742/video-khamzat-chimaev-confronts-fighter-after-near-brawl-with-teammate"
  },
  {
    "text": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "fullText": "Federal officials have a plan that could curb billions of dollars in overpayments to Medicare Advantage plans. But will they follow through on it?",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691896/medicare-advantage-health-insurance-trump-oz-cms-upcoding"
  },
  {
    "text": "Handling of Pretti investigation has some prosecutors on verge of quitting - The Washington Post",
    "fullText": "Federal prosecutors in Minneapolis, deeply frustrated by the response to the shootings of Renée Good and Alex Pretti, have suggested they could resign en masse.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/29/minneapolis-shootings-prosecutor-resignations/"
  },
  {
    "text": "Trump says he’ll announce his Fed pick next week. Here’s who’s in the lead, according to prediction markets. - MarketWatch",
    "fullText": "",
    "link": "https://www.marketwatch.com/story/trump-says-hell-announce-his-fed-pick-next-week-heres-whos-in-the-lead-according-to-prediction-markets-ba80c732"
  },
  {
    "text": "Federal Reserve live coverage: Fed holds interest rates steady amid political pressure - Yahoo Finance",
    "fullText": "The Federal Reserve kept interest rates unchanged for its first policy meeting of 2026.",
    "link": "https://finance.yahoo.com/news/live/federal-reserve-live-coverage-fed-holds-interest-rates-steady-amid-political-pressure-141347391.html"
  },
  {
    "text": "Japan’s Sanae Takaichi is proving a surprisingly popular prime minister - The Washington Post",
    "fullText": "The unconventional leader — for starters, she’s a woman — has called an early election for Feb. 8 in an effort to win a broad public mandate for change.",
    "link": "https://www.washingtonpost.com/world/2026/01/29/japan-election-sanae-takaichi-popular/"
  },
  {
    "text": "Seahawks could make Super Bowl a nightmare for Pats QB Drake Maye - Seattle Sports",
    "fullText": "There's a weakness with the New England Patriots that Michael Bumpus says the Seattle Seahawks can use to impact Drake Maye in the Super Bowl.",
    "link": "https://sports.mynorthwest.com/nfl/seattle-seahawks/seattle-seahawks-super-bowl-nightmare-drake-maye/1837467"
  },
  {
    "text": "NFL news roundup: Patriots HC Mike Vrabel says there's 'not much' concern over Drake Maye's shoulder - NFL.com",
    "fullText": "NFL.com keeps you up to date with all of the latest league news from around the NFL. Visit NFL.com's transaction hub for a daily breakdown.",
    "link": "https://www.nfl.com/news/nfl-news-roundup-latest-league-updates-from-thursday-jan-29"
  },
  {
    "text": "An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account - WIRED",
    "fullText": "AI chat toy company Bondu left its web console almost entirely unprotected. Researchers who accessed it found nearly all the conversations children had with the company's stuffed animals.",
    "link": "https://www.wired.com/story/an-ai-toy-exposed-50000-logs-of-its-chats-with-kids-to-anyone-with-a-gmail-account/"
  },
  {
    "text": "Odessa A’zion Is Down to Play Crazy - hollywoodreporter.com",
    "fullText": "In 'I Love LA,' she’s a manic TikTok striver. In 'Marty Supreme,' she’s a combustible climber keeping up with Timothée Chalamet. In reality, Hollywood’s newest It Girl is a baggy jeans-wearing homebody with three roommates, seven pets and a complicated family…",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/odessa-azion-interview-marty-surpreme-i-love-la-1236487185/"
  },
  {
    "text": "Heidi Klum Stands On Railroad Tracks Wearing Just A Fur Coat, Cignetti's Headset Auction Prices Rises & MEAT! - OutKick",
    "fullText": "Heidi Klum isn't afraid of some cold winter weather. She just keeps producing content.",
    "link": "https://www.outkick.com/culture/heidi-klum-stands-railroad-tracks-wearing-just-fur-coat-cignettis-headset-auction-prices-rises-meat"
  },
  {
    "text": "Ukraine receives 1,000 bodies in latest soldier swap with Russia - BBC",
    "fullText": "Russia received 38 soldiers' bodies in exchange as part of an agreement between the warring countries.",
    "link": "https://www.bbc.com/news/articles/cp9jl8vxdy9o"
  },
  {
    "text": "Guest column | A self-collected test allowed me to finally get cervical cancer screening - The Washington Post",
    "fullText": "I have a condition called vaginismus that makes traditional cervical cancer screening nearly impossible.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/29/cervical-cancer-self-collection-hpv-test/"
  }
]