[
  {
    "text": "Republican senators join calls for fuller investigation into Minneapolis killing - BBC",
    "fullText": "Trump says his administration is \"reviewing everything\" after the fatal shooting of Alex Pretti as one Republican governor says \"enough is enough\".",
    "link": "https://www.bbc.com/news/live/c3ve67195gyt"
  },
  {
    "text": "Stock futures are little changed as traders get set for a big week of trading: Live updates - CNBC",
    "fullText": "Stock futures were relatively unchanged on Monday as traders braced for a big week, with key earnings reports and a U.S. monetary policy meeting.",
    "link": "https://www.cnbc.com/2026/01/25/stock-market-today-live-updates.html"
  },
  {
    "text": "Gunmen open fire at soccer field in central Mexico, killing 11 and wounding 12 - AP News",
    "fullText": "Authorities say gunmen opened fire at a soccer field in central Mexico, killing at least 11 people and wounding 12 others. The attack happened Sunday at the end of a match in Salamanca. Ten people died at the scene, and another died at a hospital. A woman and…",
    "link": "https://apnews.com/article/mexico-cartel-salamanca-guanajuato-sheinbaum-f25805cde730397abafeb73ac451c49f"
  },
  {
    "text": "Dr. William Foege, leader in smallpox eradication, dies - ABC News",
    "fullText": "The 6-foot-7 inch Foege literally stood out in the field of public health.",
    "link": "https://abcnews.go.com/Health/wireStory/dr-william-foege-leader-smallpox-eradication-dies-129543666"
  },
  {
    "text": "Dangerous winter storm arrives in NYC, Tri-State Area with heavy snow, sleet - CBS News",
    "fullText": "The monster winter storm that New York City and the Tri-State Area have been bracing for arrived Sunday, bringing heavy snow, sleet and frigid temperatures.",
    "link": "https://www.cbsnews.com/newyork/live-updates/winter-storm-nyc-weather-how-much-snow-new-jersey-connecticut/"
  },
  {
    "text": "Iran Is Selling More Oil but Making Less Money - The Wall Street Journal",
    "fullText": "Middlemen and buyers take advantage of embattled regime’s limited options for unloading crude",
    "link": "https://www.wsj.com/world/middle-east/iran-is-selling-more-oil-but-making-less-money-841985ea"
  },
  {
    "text": "Snow piles up in Connecticut as winter storm rages on: Recap - ctinsider.com",
    "fullText": "The massive winter storm has continued to churn through Connecticut, bringing more than a foot of snow to the state by Sunday night.",
    "link": "https://www.ctinsider.com/weather/article/ct-sunday-weather-snow-storm-live-updates-21311636.php"
  },
  {
    "text": "Japan returns pandas to China amid strained ties - BBC",
    "fullText": "The twin cubs' departure will leave Japan without any pandas for the first time since 1972.",
    "link": "https://www.bbc.com/news/articles/c8d0l778dero"
  },
  {
    "text": "Alex Kemp explains officiating error on Jarrett Stidham fumble - NBC Sports",
    "fullText": "The first half of Sunday's AFC Championship included an officiating error that robbed the Patriots of a defensive touchdown.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/alex-kemp-explains-officiating-error-on-jarrett-stidham-fumble"
  },
  {
    "text": "Japan Government Bond Yields, Stocks Fall After Yen’s Rebound - The Wall Street Journal",
    "fullText": "The yen’s moves eased concerns about higher import costs and reduced expectations of a near-term interest-rate increase",
    "link": "https://www.wsj.com/finance/japan-government-bond-yields-stocks-fall-after-yens-rebound-8c6a1914"
  },
  {
    "text": "Yen Extends Gains Amid Threat of Intervention: Markets Wrap - Bloomberg.com",
    "fullText": "The dollar fell against all of its major peers after a rate check Friday by the Federal Reserve Bank of New York spurred speculation the US may assist Japan in efforts to boost the yen. Gold rose above $5,000 for the first time and US stock futures dropped wi…",
    "link": "https://www.bloomberg.com/news/articles/2026-01-25/yen-extends-gains-amid-threat-of-intervention-markets-wrap"
  },
  {
    "text": "Carney says Canada not pursuing free trade deal with China as Trump threatens 100% tariffs - CNBC",
    "fullText": "Trump's rhetoric on Truth Social contrasts with what he said after the agreement between Ottawa and Beijing: \"If you can get a deal with China, you should do that.\"",
    "link": "https://www.cnbc.com/2026/01/26/canada-china-trade-deal-tariffs-trump.html"
  },
  {
    "text": "Democrats vow to oppose homeland security funds after Minnesota shooting as shutdown risk grows - AP News",
    "fullText": "Democratic senators are vowing to oppose a funding bill for the Department of Homeland Security following the shooting death of a man in Minnesota. And that opposition increases the prospect of a partial government shutdown by week's end. Six of the 12 annual…",
    "link": "https://apnews.com/article/senate-democrats-homeland-security-funding-government-shutdown-f727fa0f3865990f191d4d5770e04752"
  },
  {
    "text": "Minneapolis becomes ground zero in Trump's immigration crackdown: Arrests, protests and 2 fatal shootings by agents - CBS News",
    "fullText": "The fatal shooting of Alex Pretti by Border Patrol agents has further inflamed tensions in Minneapolis, a city at the center of America's immigration debate in recent months. Here's a look at how it started.",
    "link": "https://www.cbsnews.com/news/minneapolis-trump-immigration-ice-border-patrol-arrests-protests-shootings/"
  },
  {
    "text": "Odds of a government shutdown surge to 80% - Seeking Alpha",
    "fullText": "Prediction markets surge to 80% odds of a US government shutdown by Jan 31 as Democrats block $1.2T DHS funding; track key votes and updates now.",
    "link": "https://seekingalpha.com/news/4542297-odds-of-a-government-shutdown-surge-to-80"
  },
  {
    "text": "A major winter storm has hit the D.C. region. Here’s what to know - wamu.org",
    "fullText": "Snow, extreme cold, and sleet will disrupt travel, business, and services in the D.C. area Sunday and throughout the week.",
    "link": "https://wamu.org/story/26/01/25/major-winter-storm-has-hit-the-dc-region/"
  },
  {
    "text": "Winter storm leaves hundreds of thousands of customers without power across the South - PBS",
    "fullText": "A massive winter storm dumped sleet, freezing rain and snow across much of the U.S. on Sunday, leaving hundreds of thousands of homes and businesses in the Southeast without electricity.",
    "link": "https://www.pbs.org/newshour/nation/winter-storm-leaves-hundreds-of-thousands-of-customers-without-power-across-the-south"
  },
  {
    "text": "Georgia ice storm causing thousands of power outages in metro Atlanta - wabe.org",
    "fullText": "Freezing rain and sleet is falling in North Georgia on Sunday morning, and power outages and flight cancellations are mounting as a winter storm finally arrived in the region.",
    "link": "https://www.wabe.org/ice-storm-arrives-in-georgia-bringing-thousands-of-power-outages-in-metro-atlanta/"
  }
]