[
  {
    "text": "Clintons to sit for depositions in House panel's Epstein inquiry later this month, Comer says - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/clintons-agree-give-depositions-house-oversight-committee-epstein/story?id\\\\u003d129785193"
  },
  {
    "text": "Nintendo shares sink 10% as gaming giant faces memory shortage concerns - CNBC",
    "fullText": "Nintendo is facing pressure this year from a shortage in memory chips — a key component in its gaming consoles — that has resulted in surging prices.",
    "link": "https://www.cnbc.com/2026/02/04/nintendo-shares-sink-10percent-as-gaming-giant-faces-memory-shortage-concerns-.html"
  },
  {
    "text": "Democrats just handed RFK Jr. billions more than he asked for. It was a big risk. - Politico",
    "fullText": "Lawmakers rejected huge health cuts President Donald Trump requested. Kennedy’s diverting the funds to pet projects and red states.",
    "link": "https://www.politico.com/news/2026/02/03/democrats-handed-rfk-jr-billions-more-than-he-asked-for-00763792"
  },
  {
    "text": "House Ethics eyes \"extremely rare\" televised trial for Cherfilus-McCormick - Axios",
    "fullText": "\"She's in trouble,\" said one House Democrat. \"Read that report. It's crazy.\"",
    "link": "https://www.axios.com/2026/02/04/cherfilus-mccormick-ethics-committee-trial-public"
  },
  {
    "text": "Senate Banking Democrats demand delay on Warsh nomination until Powell and Cook investigations end - CNBC",
    "fullText": "Sen. Thom Tillis, R-N.C., has separately vowed to hold up the nomination until the DOJ resolves its criminal investigation of Fed Chair Jerome Powell.",
    "link": "https://www.cnbc.com/2026/02/03/senate-democrats-delay-warsh-nomination-fed.html"
  },
  {
    "text": "Putin 'kept his word' — Trump reacts to latest Russian strike on Ukraine - The Kyiv Independent",
    "fullText": "U.S. President Donald Trump said on Feb. 3 that Vladimir Putin had \"kept his word\" on a temporary truce on strikes against Ukraine's energy infrastructure, remarks that came after Russia targeted Ukraine's power plants overnight.",
    "link": "https://kyivindependent.com/putin-kept-his-word-trump-reacts-to-latest-russian-attack-on-ukraine/"
  },
  {
    "text": "Trump says states are agents of federal government in elections - CNN",
    "fullText": "President Donald Trump on Tuesday claimed that “a state is an agent for the federal government in elections,” as he defended his call for Republicans to nationalize elections.",
    "link": "https://www.cnn.com/2026/02/03/politics/trump-nationalize-elections-states"
  },
  {
    "text": "Anthropic’s Move Into Legal Is Sinking Data Services Stocks - Bloomberg.com",
    "fullText": "Once again, artificial intelligence is dominating investors’ attention in the stock market. These days, however, the focus is turning more and more toward companies that may get disrupted by the new technology rather than those who stand to profit from it.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-03/legal-software-stocks-plunge-as-anthropic-releases-new-ai-tool"
  },
  {
    "text": "Grizzlies blockbuster trade could open door for Morant to Heat; Wiggins, Powell out vs. Hawks - Sun Sentinel",
    "fullText": "Ja Morant to the Miami Heat? It appears that the Memphis Grizzlies guard is going somewhere by Thursday’s NBA trade deadline.",
    "link": "https://www.sun-sentinel.com/2026/02/03/grizzlies-blockbuster-trade-could-next-open-door-for-morant-to-heat/"
  },
  {
    "text": "Fourteen migrants dead after collision with Greek coastguard boat - BBC",
    "fullText": "The coastguard said a pursuit was under way at the time of the collision, near the island of Chios.",
    "link": "https://www.bbc.com/news/articles/cdre825p110o"
  },
  {
    "text": "Measles outbreak linked to a Florida university, as cases keep rising in the U.S. - NBC News",
    "fullText": "Measles cases in the U.S. are spreading beyond mostly schoolkids and their families.",
    "link": "https://www.nbcnews.com/health/health-news/measles-outbreak-linked-florida-university-cases-keep-rising-us-rcna257220"
  },
  {
    "text": "The four best Super Bowl TV deals we found - The Verge",
    "fullText": "There are countless TV deals at any given moment, but if you’re serious about quality, these 4K TV deals stand out from the rest for the Super Bowl.",
    "link": "https://www.theverge.com/gadgets/873160/super-bowl-4k-oled-big-tv-deal-sale"
  },
  {
    "text": "Chappell Roan bringing Pink Pony Club to Fortnite Festival - Polygon",
    "fullText": "Epic is adding Grammy Award-winning pop star Chappell Roan to Fortnite alongside her iconic outfits and songs as the next Fortnite Festival Icon.",
    "link": "https://www.polygon.com/chappell-roan-fortnite-festival-release-date-skins-emotes-jam-tracks/"
  },
  {
    "text": "Lorde Posts 'Ice Out' and Donates $204,000 From Minneapolis Merch - Variety",
    "fullText": "Lorde revealed that she donated all of her merch sales from her Minneapolis shows along with the message 'ICE out.'",
    "link": "https://variety.com/2026/music/news/lorde-posts-ice-out-donates-from-minneapolis-merch-sales-1236651196/"
  },
  {
    "text": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/sun-releases-4-strong-solar-flares-expect/story?id\\\\u003d129814702"
  },
  {
    "text": "DeSantis, MLB commissioner say Rays ‘belong in Tampa Bay’ - Tampa Bay Times",
    "fullText": "The governor and MLB commissioner Rob Manfred spoke at a news conference at Hillsborough College on Tuesday.",
    "link": "https://www.tampabay.com/sports/rays/2026/02/03/governor-desantis-tampa-bay-rays-hillsborough-college-stadium/"
  },
  {
    "text": "NFL says ICE not among federal agencies at Super Bowl LX - ESPN",
    "fullText": "The NFL's chief security officer said the federal security presence at Super Bowl LX will be consistent with past games and ICE will not be among the agencies there.",
    "link": "https://www.espn.com/nfl/story/_/id/47818353/nfl-says-ice-not-federal-agencies-super-bowl-lx"
  },
  {
    "text": "Sony is working on its next Xperia phones, and they’re all but confirmed to go almost global - PhoneArena",
    "fullText": "We are getting a flagship and a mid-range Xperia model this year.",
    "link": "https://www.phonearena.com/news/sony-is-working-on-its-next-xperia-phones-and-theyre-all-but-confirmed-to-go-almost-global_id177913"
  },
  {
    "text": "A new generation revives 'The Muppet Show' and it's as delightful as ever - NPR",
    "fullText": "This isn't the first reincarnation of Jim Henson's crew, but it's one of the best in a very long time. Seth Rogen is an executive producer, and Maya Rudolph and Sabrina Carpenter guest star.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697369/the-muppet-show-review"
  },
  {
    "text": "Did we just see a black hole explode? Physicists think so—and it could explain (almost) everything - Phys.org",
    "fullText": "In 2023, a subatomic particle called a neutrino crashed into Earth with such a high amount of energy that it should have been impossible. In fact, there are no known sources anywhere in the universe capable of producing such energy—100,000 times more than the…",
    "link": "https://phys.org/news/2026-02-black-hole-physicists.html"
  }
]