[
  {
    "text": "Panarin traded to Kings by Rangers, signs 2-year contract - NHL.com",
    "fullText": "New York receives prospect Greentree, 2 conditional draft picks for forward",
    "link": "https://www.nhl.com/news/artemi-panarin-traded-to-kings-by-rangers-signs-two-year-contract"
  },
  {
    "text": "Sources: LHP Framber Valdez, Tigers reach 3-year, $115M deal - ESPN",
    "fullText": "Framber Valdez and the Tigers are in agreement on a three-year, $115 million contract, sources told ESPN's Jeff Passan, the highest average annual value ever for a left-handed pitcher.",
    "link": "https://www.espn.com/mlb/story/_/id/47832764/framber-valdez-detroit-tigers-agree-3-year-115-million-contract"
  },
  {
    "text": "Brad Karp to step down as Paul Weiss chair after Epstein revelations - Financial Times",
    "fullText": "Files released by US Department of Justice detailed his relationship with the child sex offender",
    "link": "https://www.ft.com/content/70014a3d-629e-4413-a5db-50528108e815"
  },
  {
    "text": "New York poised to legalize medical aid in dying - Politico",
    "fullText": "Gov. Kathy Hochul will have until midnight Friday to sign the amended legislation.",
    "link": "https://www.politico.com/news/2026/02/04/medical-aid-in-dying-new-york-00766413"
  },
  {
    "text": "Alphabet won’t talk about the Google-Apple AI deal, even to investors - TechCrunch",
    "fullText": "Alphabet CEO skipped an analyst's question about Apple on the company's earnings call.",
    "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/"
  },
  {
    "text": "Stock Market Today: Nasdaq Continues Slide; AI Jitters Rattle Software Stocks — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-04-2026"
  },
  {
    "text": "Glimpsing the quantum vacuum: Particle spin correlations offer insight into how visible matter emerges from 'nothing' - Phys.org",
    "fullText": null,
    "link": "https://phys.org/news/2026-02-glimpsing-quantum-vacuum-particle-insight.html"
  },
  {
    "text": "Newly released court records reveal misconduct inquiry into federal judge - NPR",
    "fullText": "A federal judge said he retired to speak out about threats to the rule of law. Newly released court orders suggest his exit coincided with a misconduct inquiry that ended when he stepped down.",
    "link": "https://www.npr.org/2026/02/04/nx-s1-5699462/judges-accountability-abuse-clerks-judge-mark-wolf"
  },
  {
    "text": "E.l.f. Beauty posts earnings beat, raises full-year guidance - CNBC",
    "fullText": "E.l.f. Beauty said its acquisition of Hailey Bieber's skin-care company, Rhode, contributed $128 million to the company's net third-quarter sales growth.",
    "link": "https://www.cnbc.com/2026/02/04/elf-beauty-elf-q3-2026.html"
  },
  {
    "text": "Meet Gizmo: a TikTok for interactive, vibe-coded mini apps - TechCrunch",
    "fullText": "Gizmo's app is like a TikTok for vibe-coded mini apps... and it's a lot of fun.",
    "link": "https://techcrunch.com/2026/02/04/meet-gizmo-a-tiktok-for-interactive-vibe-coded-mini-apps/"
  },
  {
    "text": "Measles exposure in Milbank, Brookings - KELOLAND.com",
    "fullText": "SIOUX FALLS, S.D. (KELO) – The Department of Health is notifying the public of potential measles exposures in Milbank and Brookings. A Grant County resident with a confirmed measles infection visited several locations while infectious. The places the infected…",
    "link": "https://www.keloland.com/news/local-news/measles-exposure-in-milbank-brookings/"
  },
  {
    "text": "Measles Is Causing Brain Swelling in Children in South Carolina - WIRED",
    "fullText": "In the ongoing measles outbreak in South Carolina that has infected more than 800 people, some children have developed a rare but serious complication called encephalitis.",
    "link": "https://www.wired.com/story/measles-is-causing-brain-swelling-in-children-in-south-carolina/"
  },
  {
    "text": "Moltbook is the newest social media platform — but it’s just for AI bots - NPR",
    "fullText": "A new message board for artificial intelligence agents has prompted some strange conversations, and existential questions about the inner lives of bots.",
    "link": "https://www.npr.org/2026/02/04/nx-s1-5697392/moltbook-social-media-ai-agents"
  },
  {
    "text": "Trump’s ‘Prison Camp’ Threat Sparks Widespread MAGA Backlash - Yahoo",
    "fullText": "“To welcome such a facility over the welcome of human beings is to question the values that shape our community,” one resident said.",
    "link": "https://www.thedailybeast.com/trumps-prison-camp-threat-sparks-widespread-maga-backlash/"
  },
  {
    "text": "First Winter Olympics Event Was Halted Within Moments - Newser",
    "fullText": "Curling matches resumed after a brief power outage in Cortina",
    "link": "https://www.newser.com/story/383156/first-winter-olympics-event-gets-underway.html"
  },
  {
    "text": "Are There Ten Trillion Objects Like 3I/ATLAS Within the Solar System Right Now? - Avi Loeb – Medium",
    "fullText": "The latest data from the Hubble Space Telescope (reported here) implies that the radius of the nucleus of the interstellar object 3I/ATLAS…",
    "link": "https://avi-loeb.medium.com/are-there-ten-trillion-objects-like-3i-atlas-within-the-solar-system-right-now-589a833136eb"
  },
  {
    "text": "UFC's Jones needs hip replaced, still wants fight at White House - ESPN",
    "fullText": "UFC star Jon Jones said he's in need of a hip replacement, but he is still interested in competing at the UFC's White House event scheduled for June.",
    "link": "https://www.espn.com/mma/story/_/id/47828785/ufc-jones-needs-hip-replaced-wants-fight-white-house"
  },
  {
    "text": "Ted Cruz Wants Ted Sarandos to Answer for Billie Eilish’s “Stolen Land” Grammys Speech, for Some Reason - The Hollywood Reporter",
    "fullText": "During the Senate's antitrust hearing on the Netflix-Warner Bros Discovery merger and its impact on competition, Cruz pressed about how Eilish's speech reflects that \"the entertainment world is deeply corrupt.\"",
    "link": "http://www.hollywoodreporter.com/music/music-news/ted-cruz-questions-netflix-billie-eilish-speech-1236494881/"
  },
  {
    "text": "Whitney Leavitt Leveraged ‘Mormon Wives’ to Earn ‘Chicago.’ She’s Not Sure How She’ll Ever Go Back - Variety",
    "fullText": "Whitney Leavitt chronicles her path from homemaking to 'The Secret Lives of Mormon Wives' to 'Chicago' — and shares she may need to leave reality TV.",
    "link": "https://variety.com/2026/tv/news/whitney-leavitt-chicago-mormon-wives-exit-season-5-1236650389/"
  }
]