[
  {
    "text": "He hasn't thrown a pass since 2023. Now a team's Super Bowl hopes hinge on his arm. - NBC News",
    "fullText": "In the recesses of the stadium, a doctor examined the right ankle of Bo Nix, the Broncos’ starting quarterback.",
    "link": "https://www.nbcnews.com/sports/nfl/jarrett-stidham-denver-broncos-afc-championship-rcna255454"
  },
  {
    "text": "Winter Storm Fern Update: Delta makes schedule adjustments to Atlanta and Northeast regions - Delta News Hub",
    "fullText": "As our teams continue to monitor Winter Storm Fern, Delta encourages customers traveling this weekend in affected areas to move their flights before or after the storm due to anticipated cancellations.",
    "link": "https://news.delta.com/winter-storm-fern-update-delta-makes-schedule-adjustments-atlanta-and-northeast-regions"
  },
  {
    "text": "Samsung Galaxy S26: The 7 rumored features that could make me switch - Mashable",
    "fullText": "I've been an iPhone user for a long time, but these features could make me defect from Apple-land.",
    "link": "https://mashable.com/article/samsung-galaxy-s26-features-switch-from-iphone"
  },
  {
    "text": "‘The Moment’ Review: Brat Summer Is A Neverending Nightmare For Charli XCX In Meta Mockumentary - Deadline",
    "fullText": "Charli XCX's meta mockumentary 'The Moment' finally marks the end of an era, more than a year after 'brat' summer.",
    "link": "http://deadline.com/2026/01/the-moment-review-charli-xcx-sundance-1236690970/"
  },
  {
    "text": "How Sydney's beaches became a 'perfect storm' for sharks - BBC",
    "fullText": "Human-shark encounters in Australia are rising - but experts are keen to point out it isn't the animals' fault.",
    "link": "https://www.bbc.com/news/articles/c0err023g5lo"
  },
  {
    "text": "Adult with measles visited high school in Clark County while contagious, officials say - kptv.com",
    "fullText": "Clark County Public Health says an adult with a confirmed case of measles was at a local high school while they were contagious.",
    "link": "https://www.kptv.com/2026/01/24/adult-with-measles-visited-high-school-clark-county-while-contagious-county-officials-say/"
  },
  {
    "text": "Title Change On WWE SmackDown - WrestleTalk",
    "fullText": "There has been a title change during tonight's January 23 episode of WWE SmackDown in Montreal, Quebec, Canada.",
    "link": "https://wrestletalk.com/news/title-change-wwe-smackdown-solo-sikoa-tama-tonga-wyatt-sicks/"
  },
  {
    "text": "Pelissero provides update on Atlanta Falcons general manager search | 'The Insiders' - NFL.com",
    "fullText": "<p>NFL Insider Tom Pelissero gives an update on the interview process for the Atlanta Falcons general manager search.</p>",
    "link": "https://www.nfl.com/videos/pelissero-provides-update-on-atlanta-falcons-general-manager-search-the-insiders"
  },
  {
    "text": "State of Emergency Declared - DEMA Emergency Operations Center Activated For Winter Storm Response - news.delaware.gov",
    "fullText": "Governor Matthew Meyer has signed a State of Emergency at 5:00 p.m. today in anticipation of Winter Storm Fern. The State of Emergency will take effect at 12:01 a.m. on Sunday, January 25, 2026, and will allow for the mobilization of statewide resources neede…",
    "link": "https://news.delaware.gov/2026/01/23/soe-eoc-activated-winter-storm/"
  },
  {
    "text": "Daytona Friday Notebook - Sportscar365",
    "fullText": "Check out John Dagys' notebook on the eve of the 64th Rolex 24 at Daytona...",
    "link": "https://sportscar365.com/imsa/iwsc/daytona-friday-notebook-25/"
  },
  {
    "text": "Is China quietly winning the AI race? - BBC",
    "fullText": "The BBC's Lily Jamali looks into why big US firms and start-ups alike are turning to Chinese tech.",
    "link": "https://www.bbc.com/news/articles/c86v52gv726o"
  },
  {
    "text": "Vance addresses criticism that Trump admin has not done enough to move anti-abortion rights agenda forward - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/vance-addresses-criticism-trump-admin-move-anti-abortion/story?id\\\\u003d129497076"
  },
  {
    "text": "CISA confirms active exploitation of four enterprise software bugs - BleepingComputer",
    "fullText": "The Cybersecurity and Infrastructure Security Agency (CISA) in the U.S. warned of active exploitation of four vulnerabilities impacting enterprise software from Versa and Zimbra, the Vite frontend tooling framework, and the Prettier code formatter.",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-confirms-active-exploitation-of-four-enterprise-software-bugs/"
  },
  {
    "text": "‘Mercy’ Mints $1.5M Previews, Eyes $12M+ Opening, But Monster Winter Storm Could Snow Cinemas In - Deadline",
    "fullText": "There's one major studio wide entry this weekend, Amazon MGM Studios' $60M dystopian future thriller, Mercy starring Chris Pratt, and while it did $1.5M in previews in yesterday, the entire 3-day outlook could be impacted by the looming winter storm that's hi…",
    "link": "http://deadline.com/2026/01/box-office-mercy-chris-pratt-1236694631/"
  },
  {
    "text": "NASA’s Chandra Releases Deep Cut From Catalog of Cosmic Recordings - NASA (.gov)",
    "fullText": "Like a recording artist who has had a long career, NASA’s Chandra X-ray Observatory has a “back catalog” of cosmic recordings that is impossible to",
    "link": "https://www.nasa.gov/missions/chandra/nasas-chandra-releases-deep-cut-from-catalog-of-cosmic-recordings/"
  },
  {
    "text": "Jamie Dimon is learning what happens when a CEO dares to defy Trump - CNN",
    "fullText": "Top Wall Street bankers during the Trump 2.0 era have tread carefully around the subject of politics generally and President Donald Trump specifically. The consensus has generally been: Smile and nod, stay in your lane, don’t become a target.",
    "link": "https://www.cnn.com/2026/01/23/business/jamie-dimon-donald-trump"
  },
  {
    "text": "'I'm a harder puzzle for Gaethje than Khabib' - BBC",
    "fullText": "Britain's Paddy Pimblett says he expects to finish Justin Gaethje early in their interim UFC lightweight title, while his opponent described him as \"overconfident\".",
    "link": "https://www.bbc.com/sport/mixed-martial-arts/articles/c4g558gxzg1o"
  },
  {
    "text": "A black hole 'feeding frenzy' could help explain a cosmic mystery uncovered by the James Webb Space Telescope - Space",
    "fullText": "\"It is exciting to think that Little Red Dots may represent the first direct observational evidence of the birth of the most massive black holes in the universe.\"",
    "link": "https://www.space.com/astronomy/black-holes/a-black-hole-feeding-frenzy-could-help-explain-a-cosmic-mystery-uncovered-by-the-james-webb-space-telescope"
  },
  {
    "text": "These Washington restaurants, chefs and bars are 2026 James Beard Award semifinalists - seattlerefined.com",
    "fullText": "From best new restaurant to outstanding bar and best chef, Washington names are bringing a spotlight to our region's impressive culinary scene.",
    "link": "https://seattlerefined.com/eat-drink/james-beard-award-semifinalists-2026-seattle-washington-restaurants-bars-chefs-local-food-scene"
  }
]