[
  {
    "text": "Nancy Guthrie live updates as apparent person of interest is released, home searched in Rio Rico, Arizona - CBS News",
    "fullText": "Nancy Guthrie, the mother of \"Today\" show co-host Savannah Guthrie, was reported missing on Feb. 1 and ransom notes were being investigated.",
    "link": "https://www.cbsnews.com/live-updates/nancy-guthrie-disappearance-swat-team-ransom/"
  },
  {
    "text": "Dow ticks lower as investor enthusiasm for better-than-expected jobs data wanes: Live updates - CNBC",
    "fullText": "Traders reacted to the release of the delayed January jobs report, which showed a gain of 130,000 on the month.",
    "link": "https://www.cnbc.com/2026/02/10/stock-market-today-live-updates.html"
  },
  {
    "text": "“Landman”'s Michelle Randolph Admits She Asked Her On-Screen Dad Billy Bob Thornton If He 'Drank Angelina Jolie's Blood' - Yahoo News Canada",
    "fullText": "In a new interview, 'Landman' actress Michelle Randolph revealed she asked TV dad Billy Bob Thornton if he 'drank' his ex Angelina Jolie's blood.",
    "link": "https://people.com/landman-michelle-randolph-asked-onscreen-dad-billy-bob-thornton-if-he-drank-angelina-jolie-blood-11904134"
  },
  {
    "text": "GOP Senators rail at FDA after closed-door briefing on abortion drug - Politico",
    "fullText": "Republicans aren't confident the Trump administration is taking a promised review seriously.",
    "link": "https://www.politico.com/live-updates/2026/02/11/congress/bitter-pills-00775740"
  },
  {
    "text": "Corbin Carroll To Undergo Surgery For Hamate Fracture - MLB Trade Rumors",
    "fullText": "Diamondbacks superstar Corbin Carroll broke a bone during batting practice and will need surgery. Get more details over at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/02/dbacks-corbin-caroll-hamate-fracture-surgery.html"
  },
  {
    "text": "Susquehanna-backed crypto lender BlockFills halts client withdrawals - Financial Times",
    "fullText": "Move comes during period of sustained volatility in digital asset markets",
    "link": "https://www.ft.com/content/73e506f4-6b58-4c38-9198-110e845f48b2"
  },
  {
    "text": "Oak Lawn freight train derailment impacting Metra SWS services, roads near Central Avenue and 108th Street railroad crossing - ABC7 Chicago",
    "fullText": "A freight train derailment impacted Metra services and caused road closures in Oak Lawn on Wednesday.",
    "link": "https://abc7chicago.com/post/oak-lawn-freight-train-derailment-impacting-metra-services-roads-central-avenue-108th-street-railroad-crossing/18585059/"
  },
  {
    "text": "AI’s threat to white-collar jobs just got more real - vox.com",
    "fullText": "You’ve become more replaceable.",
    "link": "https://www.vox.com/politics/478794/ai-economy-claude-code-jobs-openai-anthropic"
  },
  {
    "text": "As the Trump EPA Prepares to Revoke Key Legal Finding on Climate Change, What Happens Next? - Inside Climate News",
    "fullText": "Following three of the warmest years on record, as scientists reckon with climate tipping points and states and cities grapple with the escalating cost of extreme weather and more intense wildfires, the Trump administration this week is expected to formally e…",
    "link": "https://insideclimatenews.org/news/11022026/as-the-trump-epa-prepares-to-revoke-key-legal-finding-on-climate-change-what-happens-next/"
  },
  {
    "text": "Inside the Secret Smear Machine That’s Targeting Hollywood - The Hollywood Reporter",
    "fullText": "A shadowy network of anonymous slander sites is attacking players in high-profile entertainment scandals — from Blake vs. Baldoni to a Rebel Wilson film fiasco to an ugly K-pop feud. Critics allege they’re all the handiwork of a small circle of operatives.",
    "link": "http://www.hollywoodreporter.com/business/business-news/inside-hollywood-smear-campaign-scandals-1236501807/"
  },
  {
    "text": "Daniel Cormier argues Jon Jones ‘doesn’t have anything left’ after revealing severe injuries: ‘It’s a sad thing’ - MMA Fighting",
    "fullText": "Daniel Cormier says Jon Jones is likely coming to terms with the fact that his fighting career might be over",
    "link": "https://www.mmafighting.com/ufc/471354/daniel-cormier-argues-jon-jones-doesnt-have-anything-left-after-revealing-severe-injuries-its-a-sad-thing"
  },
  {
    "text": "Greetings from Mexico City's iconic boulevard, where a dog on a bike steals the show - NPR",
    "fullText": "Every week, more than 100,000 people ride bikes, skates and rollerblades past some of the best-known parts of Mexico's capital. And sometimes their dogs join them too.",
    "link": "https://www.npr.org/2026/02/11/nx-s1-5699414/mexico-city-sunday-paseo-de-la-reforma"
  },
  {
    "text": "Andrew sent Epstein UK briefing on Afghan investments, document suggests - BBC",
    "fullText": "The briefing which includes \"high value commercial opportunities\" in Helmand province, appears in the Epstein files.",
    "link": "https://www.bbc.com/news/articles/cjd95r1k279o"
  },
  {
    "text": "Gunman takes hostages after firing shots at school in southern Thailand - NBC News",
    "fullText": "A gunman who fired shots at a school in Hat Yai district in southern Thailand has been detained and all the people who were held hostage have been freed.",
    "link": "https://www.nbcnews.com/world/thailand/thailand-gunman-school-shots-hostages-hat-yai-rcna258507"
  },
  {
    "text": "Poll: Trump's ratings on immigration tumble as Americans lose confidence in his top issue - NBC News",
    "fullText": "Support for President Donald Trump’s immigration agenda is in free fall in early 2026 after federal immigration agents shot and killed two Americans last month, according to the new NBC News Decision Desk Poll powered by SurveyMonkey",
    "link": "https://www.nbcnews.com/politics/trump-administration/poll-trumps-ratings-immigration-tumble-americans-lose-confidence-top-i-rcna258159"
  },
  {
    "text": "From TSA lines to disaster relief, here’s how a DHS shutdown would hurt - Politico",
    "fullText": "Immigration and border security agencies wouldn't as affected in a funding lapse as other parts of the department.",
    "link": "https://www.politico.com/news/2026/02/10/dhs-shutdown-impact-furloughs-00775499"
  },
  {
    "text": "U.S. Olympians Rally After Trump Jab Fuels Free Speech Spat: 'Pretty Childish' - HuffPost",
    "fullText": "\"Considering that side of the political spectrum always champions free speech, it's a little, I think, surprising to see them so triggered.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-winter-olympians-rally_n_698c2b59e4b04325c3fbcaf4"
  },
  {
    "text": "Inside the Ralph Lauren fall 2026 fashion show: Anne Hathaway, Lana Del Rey, Lili Reinhart and more celebrities - Page Six",
    "fullText": "See all the biggest names at the show.",
    "link": "https://pagesix.com/2026/02/10/style/ralph-lauren-fall-winter-2026-fashion-show-anne-hathaway-lana-del-rey-lili-reinhart-and-more/"
  }
]