[
  {
    "text": "In Memoriam: All the tech that died in 2025 - Mashable",
    "fullText": "Join us in saying goodbye (or good riddance) to these apps, gadgets, and software.",
    "link": "https://mashable.com/article/in-memoriam-tech-deaths-2025-tivo-skype-microsoft-passwords"
  },
  {
    "text": "Kennedy Center exodus: The 11 acts that have pulled out post-Trump takeover - Axios",
    "fullText": "A jazz ensemble and a New York dance company this week joined those canceling their events at the Kennedy Center.",
    "link": "https://www.axios.com/2025/12/30/new-years-2026-trump-kennedy-center"
  },
  {
    "text": "NASA could be weeks away from its biggest test in decades - CNN",
    "fullText": "The NASA Artemis II mission, set to lift off as soon as February, will mark the first time astronauts have aimed to venture beyond near-Earth orbit since 1972.",
    "link": "https://www.cnn.com/2025/12/31/science/artemis-2-astronauts-moon-mission-overview"
  },
  {
    "text": "Remembering the actors, musicians, writers and artists we lost in 2025 - NPR",
    "fullText": "Every year, we remember some of the writers, actors, musicians, filmmakers and performers who died over the past year, and whose lifetime of creative work helped shape our world.",
    "link": "https://www.npr.org/2025/12/31/nx-s1-5600863/obituaries-2025-reiner-keaton-redford-hackman"
  },
  {
    "text": "Times Square has a dazzling new ball for the New Year’s Eve drop — and it’s the biggest yet - CNN",
    "fullText": "It’s out with the old and in with the new in Times Square this year.",
    "link": "https://www.cnn.com/2025/12/31/style/times-square-new-ball-scli-intl"
  },
  {
    "text": "US stocks are set for a third-straight year of stellar gains - CNN",
    "fullText": "The US stock market is about to achieve something so rare that it’s only happened five times since the 1940s: three consecutive years of double-digit gains.",
    "link": "https://www.cnn.com/2025/12/31/investing/year-gains-us-stock-market"
  },
  {
    "text": "CIA behind strike at Venezuelan dock that Trump claims was used by drug smugglers, AP sources say - NPR",
    "fullText": "The CIA was behind a drone strike last week at a docking area believed to have been used by Venezuelan drug cartels. That's according to two people familiar with details of the operation.",
    "link": "https://www.npr.org/2025/12/31/g-s1-104073/cia-behind-strike-at-venezuelan-dock-that-trump-claims-was-used-by-drug-smugglers-ap-sources-say"
  },
  {
    "text": "TCU 30-27 USC (Dec 30, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778327"
  },
  {
    "text": "Pistons 128-106 Lakers (Dec 30, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810315"
  },
  {
    "text": "China Factory Activity Grows, Ending Longest Slump on Record - Bloomberg.com",
    "fullText": "President Xi Jinping declared China is set to meet its economic targets for 2025, with growth expected to reach “about 5%,” providing an upbeat backdrop to data showing a recovery in the nation’s manufacturing sector.",
    "link": "https://www.bloomberg.com/news/articles/2025-12-31/china-factory-activity-expands-ending-longest-slump-on-record"
  },
  {
    "text": "Wilson Dominates In 79-66 Win Over Seminoles - University of North Carolina Athletics",
    "fullText": "Caleb Wilson impressed with another double-double as 12th-ranked North Carolina pulled away from Florida State for a 79-66 win in the ACC opener for both tea...",
    "link": "https://goheels.com/news/2025/12/30/mens-basketball-mbb-recap-vs-fsu"
  },
  {
    "text": "Thailand releases 18 Cambodian soldiers as ceasefire holds - Al Jazeera",
    "fullText": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
    "link": "https://www.aljazeera.com/news/2025/12/31/thailand-releases-18-cambodian-soldiers-as-ceasefire-holds"
  },
  {
    "text": "Trump administration says it's freezing child care funds to Minnesota after series of fraud schemes - AP News",
    "fullText": "The Trump administration has announced that it is freezing child care funds to Minnesota after a series of fraud schemes in recent years. Deputy Secretary of Health and Human Services Jim O’Neill said on the social platform X on Tuesday that the move is in re…",
    "link": "https://apnews.com/article/minnesota-child-care-funds-fraud-b511941de10f02fbb7349eff6738f748"
  },
  {
    "text": "Today is Warren Buffett’s last day as Berkshire CEO. Business leaders tell us what they learned from him - CNN",
    "fullText": "Warren Buffett has worn many hats over the years: The stock-picking Oracle of Omaha. An avuncular, Dairy-Queen-eating, Coke-drinking product pitchman. A living symbol of capitalism and its complexities.",
    "link": "https://www.cnn.com/2025/12/31/business/warren-buffett-lessons"
  },
  {
    "text": "Congressional Bill H.R. 504 Vetoed - The White House (.gov)",
    "fullText": "I am returning herewith without my approval H.R. 504, the Miccosukee Reserved Area Amendments Act.  The subject of this bill is a specific area in",
    "link": "https://www.whitehouse.gov/briefings-statements/2025/12/congressional-bill-h-r-504-vetoed/"
  },
  {
    "text": "Tatiana Schlossberg, granddaughter of JFK, dies aged 35 - DW",
    "fullText": "Tatiana Schlossberg revealed she had been diagnosed with a rare type of leukemia in an essay in The New Yorker last month. She was highly critical of her relative Robert F. Kennedy Jr., the US health secretary.",
    "link": "https://www.dw.com/en/tatiana-schlossberg-granddaughter-of-jfk-dies-aged-35/a-75346596"
  },
  {
    "text": "Quick hits: Altmyer leads one last Illini comeback in 30-28 walk-off win over Tennessee in Music City Bowl - 247Sports",
    "fullText": "Illinois used up the final 458 of regulation to set up Olanos gamewinning walkoff field goal",
    "link": "https://247sports.com/college/illinois/article/illinois-fighting-illini-football-tennessee-volunteers-music-city-bowl-recap-quick-hits-268577493/"
  },
  {
    "text": "China flexes blockade capabilities near Taiwan on second day of military drills - AP News",
    "fullText": "China's People's Liberation Army is conducting large-scale military drills around Taiwan as part of \"Justice Mission 2025.\" The exercises aim to deter external support for Taiwan, which China claims as its territory. Taiwanese officials report that some live …",
    "link": "https://apnews.com/article/china-military-drills-taiwan-us-japan-cd6600c23c206385822c733dc2016217"
  },
  {
    "text": "Flu, COVID and norovirus cases rise as holiday gatherings wind down - 6abc Philadelphia",
    "fullText": "According to the Centers for Disease Control and Prevention, flu activity is very high in New Jersey, moderate in Pennsylvania and minimal in Delaware.",
    "link": "https://6abc.com/post/flu-covid-norovirus-cases-rise-holiday-gatherings-wind-down/18333920/"
  }
]