[
  {
    "text": "February Update 1.15.0 - ARC Raiders",
    "fullText": "ARC Raiders is a multiplayer extraction adventure, set in a lethal future earth, ravaged by a mysterious mechanized threat known as ARC.",
    "link": "https://arcraiders.com/news/patch-notes-1-15-0"
  },
  {
    "text": "Chappell Roan Exits Wasserman Music Agency Due to CEO’s Epstein Emails - Pitchfork",
    "fullText": "“I hold my teams to the highest standards and have a duty to protect them,” she wrote on Instagram",
    "link": "https://pitchfork.com/news/chappell-roan-exits-wasserman-music-agency-due-to-ceos-epstein-emails/"
  },
  {
    "text": "Salesforce made a new round of job cuts. These teams were affected. - Business Insider",
    "fullText": "Salesforce trims staff in marketing, product, and data teams, affecting fewer than 1,000 roles. The company recently had a leadership overhaul.",
    "link": "https://www.businessinsider.com/salesforce-cuts-jobs-executive-changes-2026-2"
  },
  {
    "text": "Asian Stocks Set to Extend Rally to Another Record: Markets Wrap - bloomberg.com",
    "fullText": "Asian stocks extended their rally to a fresh record as a rebound in US technology shares gathered pace, easing pressure on markets after worries over outsized spending on artificial intelligence.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-09/stock-market-today-dow-s-p-live-updates"
  },
  {
    "text": "New video game sees Africans fantasise about taking back looted treasures - BBC",
    "fullText": "Imagine it is 2099 and a historic treaty to return African artefacts is falling apart.",
    "link": "https://www.bbc.com/news/articles/clyg4lgm1d2o"
  },
  {
    "text": "House approves housing bill, setting stage for tough Senate negotiations - Politico",
    "fullText": "After a bipartisan House vote, the housing deal faces a bicameral test.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/house-approves-housing-bill-setting-stage-for-tough-senate-negotiations-00772552"
  },
  {
    "text": "SFUSD teachers are on strike. Schools closed for 50,000 kids - The San Francisco Standard",
    "fullText": "Negotiations between the teachers union and district officials resume at noon. The Standard will have updates throughout the day.",
    "link": "https://sfstandard.com/2026/02/09/sfusd-teachers-strike-begins-schools-closed-negotiations-monday/"
  },
  {
    "text": "Thailand election: The result the polls never saw coming - BBC",
    "fullText": "Why did a youthful, progressive party do so poorly compared to a transactional, old-style party?",
    "link": "https://www.bbc.com/news/articles/c5y6534y3y5o"
  },
  {
    "text": "Memory Chip Squeeze Wreaks Havoc in Markets, With More to Come - bloomberg.com",
    "fullText": "The relentless surge in memory chip prices over the past few months has driven a vast divide between winners and losers in the stock market, and investors don’t see any end in sight.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-09/memory-chip-squeeze-wreaks-havoc-in-markets-with-more-to-come"
  },
  {
    "text": "Common Sweetener May Damage Critical Brain Barrier, Risking Stroke - ScienceAlert",
    "fullText": "Found in everything from protein bars to energy drinks, erythritol has long been considered a safe alternative to sugar.",
    "link": "https://www.sciencealert.com/common-sweetener-may-damage-critical-brain-barrier-risking-stroke"
  },
  {
    "text": "US Labor Board Gives Up Oversight of SpaceX in Victory for Musk - bloomberg.com",
    "fullText": "Agency drops yearslong case over firing of Musk critics.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-09/us-nlrb-gives-up-oversight-of-elon-musk-s-spacex"
  },
  {
    "text": "Student shot inside Maryland high school, suspect in custody: Police - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/shooting-reported-inside-maryland-high-school-1-victim/story?id\\\\u003d130004552"
  },
  {
    "text": "King's 'profound concern' as police consider Andrew claims over Epstein - BBC",
    "fullText": "Making his first intervention in the Epstein scandal, the King said he is ready to support the police in their inquiries.",
    "link": "https://www.bbc.com/news/articles/cqlgv3z79klo"
  },
  {
    "text": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-exclude-democratic-governors-bipartisan-meeting-white-house/story?id\\\\u003d129989068"
  },
  {
    "text": "Study claims the massive ocean on Jupiter's moon Europa is more likely 'dead' than teeming with life - Earth.com",
    "fullText": "Europa has a deep ocean, but a new study suggests its seafloor may be too quiet to supply the energy life needs to survive.",
    "link": "https://www.earth.com/news/jupiter-moon-europa-vast-ocean-may-lack-the-energy-to-support-life/"
  },
  {
    "text": "Trump, Netanyahu to meet Wednesday in Washington - The Center Square",
    "fullText": "(The Center Square) – As the U.S. is in the midst of nuclear talks with Iran, Israeli Prime Minister Benjamin Netanyahu will visit the White House on Wednesday, according to",
    "link": "https://www.thecentersquare.com/national/article_6ef039c6-72df-4b46-a550-1f614268bcbc.html"
  },
  {
    "text": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm - AP News",
    "fullText": "Federal judges around the country are scrambling to address a deluge of lawsuits from immigrants locked up under the Trump administration’s mass deportation campaign. Under past administrations, most noncitizens with no criminal record who were arrested away …",
    "link": "https://apnews.com/article/trump-immigration-bond-habeas-courts-d1d1fa9b16365577651ef958a0ec342f"
  },
  {
    "text": "Sheen beatification confirmed; date and place remain TBD - The Pillar",
    "fullText": "Beatification of the popular American archbishop has been anticipated for several years",
    "link": "https://www.pillarcatholic.com/p/sheen-beatification-confirmed-date"
  },
  {
    "text": "Taking Inventory: Fishing Rod - Minecraft",
    "fullText": "Once upon a time, Minecraft’s lakes and rivers were more or less empty of life. In the earliest versions of the game, water was basically just an obstacle and a danger. That all changed in the tenth and final of the game’s seecret updates – in September 2010 …",
    "link": "https://www.minecraft.net/en-us/article/fishing-rod"
  }
]