[
  {
    "text": "Two killed, three injured in shooting at ice rink in Pawtucket - WJAR",
    "fullText": "Three people, including the shooter, were dead and three people critically injured in a shooting at the Dennis M. Lynch Arena during a high school hockey game.",
    "link": "https://turnto10.com/news/local/police-presence-dennis-m-lynch-arena-andrew-d-ferland-way-pawtucket-rhode-island-february-16-2026"
  },
  {
    "text": "Judge orders restoration of Philadelphia slavery exhibits - Politico",
    "fullText": "Cynthia Rufe, a George W. Bush appointee, compared the administration’s effort to remove the panels to Orwell’s “1984.”",
    "link": "https://www.politico.com/news/2026/02/16/judge-orders-restoration-philadelphia-slavery-exhibits-00783293"
  },
  {
    "text": "Switch 2 price, PS6 release could be impacted by memory shortage - Mashable",
    "fullText": "Rumors are surfacing about more problems related to RAM shortages.",
    "link": "https://mashable.com/article/switch-2-price-ps6-release-could-be-impacted-by-memory-shortage"
  },
  {
    "text": "Aliens are ‘real,’ Obama says, as Washington shrugs - The Washington Post",
    "fullText": "The former president appeared to confirm decades-old conspiracy theories. Lawmakers say Barack Obama is simply saying what many Americans already believe.",
    "link": "https://www.washingtonpost.com/politics/2026/02/16/obama-aliens-ufos/"
  },
  {
    "text": "Federal Reserve set to loosen US bank rules in attempt to boost mortgage lending - Financial Times",
    "fullText": "Central bank plans to ease capital requirements in an effort to shift home lending back to banks, top official says",
    "link": "https://www.ft.com/content/b36ca89c-39d6-47b6-9f62-0389ec8dda9d"
  },
  {
    "text": "US build-up of warships and fighter jets tracked near Iran - BBC",
    "fullText": "BBC Verify has seen US aircraft carrier USS Abraham Lincoln near Iran ahead of talks between the two countries",
    "link": "https://www.bbc.com/news/articles/c1d64p3q2d0o"
  },
  {
    "text": "Patriots 5 steps back to Super Bowl: No. 1 — Trade for Maxx Crosby - Boston Herald",
    "fullText": "Step 1 to get the Patriots back to a Super Bowl: Trade for Raiders DE Maxx Crosby.",
    "link": "https://www.bostonherald.com/2026/02/16/patriots-5-steps-back-to-super-bowl-no-1-trade-for-maxx-crosby/"
  },
  {
    "text": "Primary care is in trouble. Doctors are banding together to increase market power - NPR",
    "fullText": "As costs increase, primary care practices are joining forces in Independent Physician Associations. The goal is to leverage better insurance contracts, while ensuring doctors still call the shots.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5715996/primary-care-independent-physician-association-ipa-medicaid-cuts-value-based-reimbursement"
  },
  {
    "text": "Russia accused of killing Navalny with dart frog toxin. What we know about the rare poison - Axios",
    "fullText": "Marco Rubio told reporters today the findings by 5 European allies is \"troubling,\" but \"we don't have any reason to question\" it.",
    "link": "https://www.axios.com/2026/02/16/russia-navalny-death-poison-dart-frog-what-to-know"
  },
  {
    "text": "Hapag-Lloyd to Buy Israeli Rival Zim for $4.2 Billion - The Wall Street Journal",
    "fullText": "The deal will be funded from cash reserves and external financing of up to $2.5 billion",
    "link": "https://www.wsj.com/business/deals/hapag-lloyd-in-advanced-talks-over-potential-acquisition-of-israeli-rival-zim-2cce5e83"
  },
  {
    "text": "How Ricursive Intelligence raised $335M at a $4B valuation in 4 months - TechCrunch",
    "fullText": "The reason why this nascent startup had VCs lining up is the founders.They are so famed in the AI world, everyone tried to hire them.",
    "link": "https://techcrunch.com/2026/02/16/how-ricursive-intelligence-raised-335m-at-a-4b-valuation-in-4-months/"
  },
  {
    "text": "Nate Diaz lists 3 opponents for possible UFC return; Dustin Poirier responds - MMA Fighting",
    "fullText": "Nate Diaz wants to fight Conor McGregor and possibly two others if he makes a return to the UFC.",
    "link": "https://www.mmafighting.com/ufc/471961/nate-diaz-lists-3-opponents-for-possible-ufc-return-white-house-card-would-be-dope"
  },
  {
    "text": "Iran meets UN nuclear watchdog in Geneva ahead of a second round of US talks - AP News",
    "fullText": "Iran's top diplomat has held talks with the U.N. nuclear watchdog in Geneva a day before a second round of negotiations between the U.S. and Iran. Iran’s Foreign Minister Abbas Araghchi met with IAEA chief Rafael Grossi and later planned to hold talks with Om…",
    "link": "https://apnews.com/article/iran-nuclear-talks-us-geneva-8628f2dbd4c911cb4cda5fb92c1aadef"
  },
  {
    "text": "Ford is asking the Trump Administration to allow Chinese EV tech in the US - Electrek",
    "fullText": "In what would be a “watershed moment,” Ford’s CEO, Jim Farley, reportedly spoke with the Trump Administration about partnering with...",
    "link": "http://electrek.co/2026/02/16/ford-asks-trump-administration-allow-chinese-ev-tech-in-the-us/"
  },
  {
    "text": "Antarctica sits above Earth's strongest 'gravity hole.' Now we know how it got that way - Phys.org",
    "fullText": "Gravity feels reliable—stable and consistent enough to count on. But reality is far stranger than our intuition. In truth, the strength of gravity varies over Earth's surface. And it is weakest beneath the frozen continent of Antarctica after accounting for E…",
    "link": "https://phys.org/news/2026-02-antarctica-earth-strongest-gravity-hole.html"
  },
  {
    "text": "FCC finds no violations in Bad Bunny halftime show - NBC Sports",
    "fullText": "Spanish lyrics were \"scrubbed\" of potentially problematic words.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/fcc-finds-no-violations-in-bad-bunny-halftime-show"
  },
  {
    "text": "One of this century’s most important Republicans takes a beating in home state - The Washington Post",
    "fullText": "Three GOP candidates, all former McConnell interns, are keeping their distance as they seek to align with President Donald Trump.",
    "link": "https://www.washingtonpost.com/politics/2026/02/16/kentucky-senate-mcconnell-trump-midterms/"
  },
  {
    "text": "Parents opt kids out of school computers, insisting on pen-and-paper instead - NBC News",
    "fullText": "A loose network of parents are teaching each other how to get their kids off of school-issued Chromebooks and iPads.",
    "link": "https://www.nbcnews.com/tech/tech-news/parents-opt-kids-school-laptops-ask-pen-paper-rcna257158"
  },
  {
    "text": "An Islamist party becomes Bangladesh's main opposition for the first time - NPR",
    "fullText": "An Islamist party has become Bangladesh's main opposition for the first time in the country's history, challenging the old dynastic political system despite persistent concerns among critics about the party's policies on women.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5715741/islamist-party-bangladesh-opposition"
  }
]