[
  {
    "text": "Stellan Skarsgård & Renate Reinsve Scoop Best Actor & Actress For ‘Sentimental Value’ At European Film Awards – Updating Live - Deadline",
    "fullText": "Joachim Trier's 'Sentimental Value' Sweeps Board At   European Film Awards With Wins For Best Film, Director, Screenwriter, Actor, Actress & Score",
    "link": "http://deadline.com/2026/01/2026-european-film-awards-updating-live-1236685950/"
  },
  {
    "text": "Injured Darnold hasn't thrown a pass in 48 hours. One ex-49ers QB is worried. - SFGATE",
    "fullText": "ESPN analyst Alex Smith, a former 49ers quarterback, says Seahawks quarterback Sam Darnold's injury is a cause for real concern.",
    "link": "https://www.sfgate.com/49ers/article/former-49ers-qb-not-buying-downplay-darnold-injury-21300397.php"
  },
  {
    "text": "Perrie Edwards Gives Birth to Second Child with Fiancé Alex Oxlade-Chamberlain - TMZ",
    "fullText": "Perrie Edwards is a mom of 2!",
    "link": "https://www.tmz.com/2026/01/17/perrie-edwards-gives-birth-to-second-child-little-mix/"
  },
  {
    "text": "Justice Dept. enters new territory with probe of Minnesota officials - The Washington Post",
    "fullText": "The agency is targeting critics during a moment of crisis in which protesters are clashing with federal agents on icy city streets.",
    "link": "https://www.washingtonpost.com/politics/2026/01/17/trump-walz-frey-investigation-minnesota-justice-department/"
  },
  {
    "text": "Abigail Spanberger becomes Virginia’s 1st female governor in historic inauguration - Politico",
    "fullText": "Her swearing-in marks a new political chapter in the commonwealth, with Democrats pulling the levers of power in state government.",
    "link": "https://www.politico.com/news/2026/01/17/abigail-spanberger-becomes-virginias-1st-female-governor-in-historic-inauguration-00735529"
  },
  {
    "text": "RFK-backed infant vaccine study in Africa to proceed despite backlash, U.S. says - The Washington Post",
    "fullText": "U.S. funding for a study on the timing of hepatitis B vaccine doses in infants in Guinea-Bissau has sparked confusion and ethics concerns.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/rfk-vaccine-trump-hepatitis-b-guinea-bissau-infant-trial/"
  },
  {
    "text": "European Union and Mercosur bloc of South American nations sign landmark free trade agreement - AP News",
    "fullText": "The European Union and the Mercosur bloc of South American countries have formally signed a long-sought landmark free trade agreement. The deal inked on Saturday caps more than a quarter-century of torturous negotiations to strengthen commercial ties in the f…",
    "link": "https://apnews.com/article/mercosur-european-union-trade-agreement-south-america-b779460da4b7ecb6aa15d322976fa70d"
  },
  {
    "text": "Dodgers Likely To Keep Teoscar Hernandez - MLB Trade Rumors",
    "fullText": "Despite some trade buzz earlier this winter, the outfielder is probably staying put. Visit MLB Trade Rumors for more on the Dodgers' outfield.",
    "link": "https://www.mlbtraderumors.com/2026/01/dodgers-likely-to-keep-teoscar-hernandez.html"
  },
  {
    "text": "Jorge Masvidal addresses Conor McGregor rumors, only coming back for UFC White House fight - MMA Fighting",
    "fullText": "Jorge Masvidal wants in on the UFC White House event.",
    "link": "https://www.mmafighting.com/ufc/466676/jorge-masvidal-addresses-conor-mcgregor-rumors-only-coming-back-for-ufc-white-house-fight"
  },
  {
    "text": "Trump to POLITICO: ‘It’s time to look for new leadership in Iran’ - Politico",
    "fullText": "Trump, after being read a series of hostile X posts from Iran’s Supreme Leader, said the Ayatollah is guilty of “the complete destruction of his country.”",
    "link": "https://www.politico.com/news/2026/01/17/trump-to-politico-its-time-to-look-for-new-leadership-in-iran-00735528"
  },
  {
    "text": "Five graphics that show Greenland’s importance to Trump - DW.com",
    "fullText": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
    "link": "https://www.dw.com/en/five-graphics-that-show-greenlands-importance-to-trump/a-75547831"
  },
  {
    "text": "John Harbaugh may be looking for \"parallel report\" to ownership with Joe Schoen - NBC Sports",
    "fullText": "Will Giants change their front-office structure to get the coach they want?",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/john-harbaugh-may-be-looking-for-parallel-report-to-ownership-with-joe-schoen"
  },
  {
    "text": "Top 10 Most Wishlisted Strategy Games On Steam In 2026 - Strategy and Wargaming",
    "fullText": "Explore the 10 most wishlisted strategy games on Steam in 2026, featuring Slay the Spire 2, Total War: Warhammer 40,000, and more.",
    "link": "https://strategyandwargaming.com/2026/01/17/top-10-most-wishlisted-strategy-games-on-steam-in-2026/"
  },
  {
    "text": "WA sees measles outbreak for first time in years - The Seattle Times",
    "fullText": "Snohomish County’s health officer said he \"firmly believes\" there are other measles infections in the state that public health teams have not yet found.",
    "link": "https://www.seattletimes.com/seattle-news/health/4-wa-measles-cases-leave-health-officials-racing-to-quell-outbreak/"
  },
  {
    "text": "LeAnn Rimes Throws It Back To 2016 On Instagram & Leaves Gen X Gasping For Air, Chili Bowl Drama & MEAT! - OutKick",
    "fullText": "Plus: What's up with so many cars with headlights and taillights burnt out?",
    "link": "https://www.outkick.com/culture/leann-rimes-throws-back-2016-instagram-leaves-gen-x-gasping-air"
  },
  {
    "text": "Uganda election result: Yoweri Museveni beats Bobi Wine to win a seventh term - BBC",
    "fullText": "President Yoweri Museveni wins a seventh term, as his main rival Bobi Wine decries \"fake results\".",
    "link": "https://www.bbc.com/news/articles/c2lgxxrxd52o"
  },
  {
    "text": "Here’s where Trump’s most jaw-dropping promises stand a year into his second term - AP News",
    "fullText": "President Donald Trump has made lots of promises during the first year of his second term in the White House. Some ideas have come to fruition. Others have faded away. Some are kicking around. These include a new Air Force One gifted by Qatar and the U.S. ann…",
    "link": "https://apnews.com/article/trump-promises-second-term-greenland-alcatraz-canada-858c0f1d3ec934dc696a70a5b38eace3"
  },
  {
    "text": "Why people in 2026 are hung up on 2016 - CNN",
    "fullText": "Celebrities and laypeople are sharing fond memories from 2016, the era of face “baking” and #ImWithHer, when some of the biggest national dramas pitted Kim Kardashian against Taylor Swift.",
    "link": "https://www.cnn.com/2026/01/17/us/2016-trend-nostalgia-cec"
  },
  {
    "text": "From ‘A+’ grade to ‘we can’t stand this much longer,’ Georgia voters take stock of Trump’s first year back in office - CNN",
    "fullText": "Franz Rowland has heard President Donald Trump endlessly brag about a roaring economy, but he’s seen few signs of it from his cotton farm here in southern Georgia.",
    "link": "https://www.cnn.com/2026/01/17/politics/donald-trump-georgia-voters"
  },
  {
    "text": "How Ukrainians Are Protecting Their Homes Against Russia’s Winter Offensive - Kyiv Post",
    "fullText": "Kyiv faces up to 20 hours without electricity each day after relentless Russian strikes, yet residents are finding creative ways to cope with the blackout.",
    "link": "https://www.kyivpost.com/post/68177"
  }
]