[
  {
    "text": "Christian McCaffrey Wins 2025-26 Comeback Player of the Year Award, Full Voting Results - Bleacher Report",
    "fullText": "San Francisco 49ers running back Christian McCaffrey was rewarded for his resurgent 2025 season with Comeback Player of the Year honors on Thursday.",
    "link": "https://bleacherreport.com/articles/25352760-christian-mccaffrey-wins-2025-26-comeback-player-year-award-full-voting-results"
  },
  {
    "text": "Democrats involved in 'illegal orders' video say they won't cooperate with DOJ probe - NBC News",
    "fullText": "Two Democrats who participated in a video that urged members of the military and the intelligence community not to follow illegal orders are refusing to comply with an investigation by the Justice Department.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-involved-illegal-orders-video-say-wont-cooperate-doj-probe-rcna257715"
  },
  {
    "text": "Yankees still could find way to Paul Goldschmidt reunion — but there might be competition - New York Post",
    "fullText": "He surely wants a chance to win a ring, and even by running it back, they are an AL favorite.",
    "link": "https://nypost.com/2026/02/05/sports/yankees-still-could-find-way-to-paul-goldschmidt-reunion/"
  },
  {
    "text": "US strikes another boat in the eastern Pacific, killing 2 - cnn.com",
    "fullText": "The US military conducted a strike against another alleged drug-trafficking boat in the eastern Pacific Ocean on Thursday, killing two people, according to US Southern Command.",
    "link": "https://www.cnn.com/2026/02/05/politics/us-boat-strike-pacific-kills-2"
  },
  {
    "text": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos - MPR News",
    "fullText": "The federal government has filed a motion seeking to end asylum claims for the family of Liam Conejo Ramos, according to the lawyer representing the family.",
    "link": "https://www.mprnews.org/story/2026/02/05/liam-conejo-ramos-dhs-requests-expedited-deportation-proceedings-for-family"
  },
  {
    "text": "Big Tech to Spend $650 Billion This Year as AI Race Intensifies - bloomberg.com",
    "fullText": "Four of the biggest US technology companies together have forecast capital expenditures that will reach about $650 billion in 2026 — a mind-boggling tide of cash earmarked for new data centers and the long list of equipment needed to make them tick, including…",
    "link": "https://www.bloomberg.com/news/articles/2026-02-06/how-much-is-big-tech-spending-on-ai-computing-a-staggering-650-billion-in-2026"
  },
  {
    "text": "Stock futures drop as Amazon slide adds to Wall Street's tech woes: Live updates - CNBC",
    "fullText": "Thursday night's action followed a rough day on Wall Street, with the market once again bogged down by technology stocks.",
    "link": "https://www.cnbc.com/2026/02/05/stock-market-today-live-updates.html"
  },
  {
    "text": "New iPhone launching this month with four key changes: report - 9to5Mac",
    "fullText": "According to a new report today, Apple’s next iPhone is launching very soon. Macwelt reports that the iPhone 17e is...",
    "link": "https://9to5mac.com/2026/02/05/new-iphone-launching-soon-with-four-new-features/"
  },
  {
    "text": "The Switch 2 is getting a new Virtual Console (kind of) - Ars Technica",
    "fullText": "Hamster Corp.'s new \"Console Archives\" does what Nintendon't.",
    "link": "https://arstechnica.com/gaming/2026/02/the-virtual-console-is-sort-of-back-on-the-switch-2/"
  },
  {
    "text": "Lisa Kudrow Urges New Warner Bros. Owners Not To \"Change A Thing\" - Deadline",
    "fullText": "With the imminent sale of Warner Bros., Lisa Kudrow recently took a stroll down Memory Lane—located on the Burbank studio lot.",
    "link": "http://deadline.com/2026/02/lisa-kudrow-pleads-new-warner-bros-owner-not-change-thing-1236710613/"
  },
  {
    "text": "Tim Cook Teases Plans for Apple's Upcoming 50th Anniversary - MacRumors",
    "fullText": "Apple turns 50 this year, and its CEO Tim Cook has promised to celebrate the milestone. The big day falls on April 1, 2026.   \"I've been...",
    "link": "https://www.macrumors.com/2026/02/05/tim-cook-teases-apple-50th-anniversary/"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "New analysis suggests puzzling fossil may have been an unknown life-form - CNN",
    "fullText": "A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular life, according to a new study.",
    "link": "https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form"
  },
  {
    "text": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity - NASA (.gov)",
    "fullText": "NASA’s SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select",
    "link": "https://www.nasa.gov/humans-in-space/nasas-spacex-crew-12-to-study-adaptation-to-altered-gravity/"
  },
  {
    "text": "WDH reports flu-related death of Fremont County child - County 10",
    "fullText": "A recently reported flu-related death of a Fremont County child is a sad reminder that influenza can be a serious disease and should not be overlooked, according to a Wyoming Department of Health (WDH) official. Dr. Alexia Harrist, State Health Officer with W…",
    "link": "https://county10.com/wdh-reports-flu-related-death-of-fremont-county-child/"
  },
  {
    "text": "Chairman of major US law firm steps down after Epstein files release - BBC",
    "fullText": "Brad Karp’s company, Paul Weiss, previously said he did not participate in any misconduct.",
    "link": "https://www.bbc.com/news/articles/c7v02m633mjo"
  },
  {
    "text": "Analyst predicts Disney will spin off ESPN after CEO change - Awful Announcing",
    "fullText": "Appearing on 'The Town with Matthew Belloni,' LightShed Media's Rich Greenfield predicted Disney will spin off ESPN.",
    "link": "https://awfulannouncing.com/espn/analyst-predicts-disney-could-spinoff-ceo-change.html"
  },
  {
    "text": "Kyiv’s great freeze - Financial Times",
    "fullText": "Russian strikes have plunged Ukrainians into their hardest winter yet, but they still want to fight on",
    "link": "https://www.ft.com/content/53214fda-22c2-48ea-8d62-abba78e17a87"
  },
  {
    "text": "Famine is threatening more of war-torn Sudan’s Darfur region as an attack in the south kills 22 - AP News",
    "fullText": "A global hunger monitoring group says that famine is threatening more areas in war-torn Sudan’s western Darfur region, where acute malnutrition has been registered in two more towns there. The group did not confirm a full famine in those towns. The report by …",
    "link": "https://apnews.com/article/sudan-famine-rsf-kordofan-darfur-war-hunger-9b16a0419f8d7cc67c7e95939a8a954d"
  }
]