[
  {
    "text": "Somaliland: Why has Israel recognised the breakaway African state as independent? - BBC",
    "fullText": "Somaliland wants international recognition - here's why, and what could have driven Israel to recognise it now.",
    "link": "https://www.bbc.com/news/articles/c14v4kmg275o"
  },
  {
    "text": "New Year’s Eve concert is latest cancellation at the Kennedy Center - The Washington Post",
    "fullText": "Jazz supergroup the Cookers scrapped their New Year’s Eve shows at the center days after a Christmas Eve concert was called off. Other acts have followed suit.",
    "link": "https://www.washingtonpost.com/entertainment/2025/12/29/new-years-eve-kennedy-center-concert-canceled/"
  },
  {
    "text": "Russian Offensive Campaign Assessment, December 29, 2025 - Institute for the Study of War",
    "fullText": "The Kremlin accused Ukraine of conducting a long-range drone strike targeting Russian President Vladimir Putin's residence on December 29.",
    "link": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-december-29-2025/"
  },
  {
    "text": "China flexes blockade capabilities near Taiwan on second day of military drills - AP News",
    "fullText": null,
    "link": "https://apnews.com/article/china-military-drills-taiwan-us-japan-cd6600c23c206385822c733dc2016217"
  },
  {
    "text": "Rams, NFC West standings and playoff picture after ‘Monday Night Football’ loss to Falcons - Turf Show Times",
    "fullText": "The Rams’ playoff seeding now rests fully on Week 18 vs. the Cardinals.",
    "link": "https://www.turfshowtimes.com/los-angeles-rams-nfl-playoffs/132275/nfl-playoff-picture-nfc-west-standings-updated-week-17-monday-night-football-atlanta-falcons-seeding-tiebreakers"
  },
  {
    "text": "Trump, top aides asked Netanyahu to change policy in occupied West Bank - Axios",
    "fullText": "Trump asked Netanyahu to avoid provocative steps and \"calm things down,\"",
    "link": "https://www.axios.com/2025/12/30/netanyahu-trump-west-bank-meeting-settlements"
  },
  {
    "text": "Judge rules basic Medicaid data can be shared with ICE - NBC News",
    "fullText": "A federal judge in California ruled Monday that the federal government is allowed to share basic information about Medicaid participants with Immigration and Customs Enforcement amid a government push to locate people it believes are in the country unlawfully",
    "link": "https://www.nbcnews.com/news/us-news/judge-rules-basic-medicaid-data-can-shared-ice-rcna251443"
  },
  {
    "text": "Nuggets’ Nikola Jokic suffers knee injury, leaves game in Miami - The Denver Post",
    "fullText": "Jokic limped to the locker room with a knee injury as the Nuggets finished a first half in Miami on Monday.",
    "link": "https://www.denverpost.com/2025/12/29/nikola-jokic-knee-injury-updates-nuggets-heat/"
  },
  {
    "text": "Trump says he might sue Fed Chair Jerome Powell for ‘gross incompetence’ - The Washington Post",
    "fullText": "It isn’t clear what specific claims could be brought against Powell or when.",
    "link": "https://www.washingtonpost.com/politics/2025/12/29/trump-powell-gross-incompetence-lawsuit/"
  },
  {
    "text": "Transcript from October closed hearing for Charlie Kirk murder suspect released by Utah court - CBS News",
    "fullText": "A Utah judge has ordered the release of a transcript from a closed-door hearing in October over whether the man charged with killing Charlie Kirk must be shackled during court proceedings.",
    "link": "https://www.cbsnews.com/news/tyler-robinson-accused-charlie-kirk-shooter-closed-court-hearing-transcript/"
  },
  {
    "text": "Dow Jones Futures: AppLovin, Nvidia, Palantir, Tesla Slide During Stock Market Drop - Investor's Business Daily",
    "fullText": "Dow Jones Futures: AppLovin, Nvidia, Palantir and Tesla sold off Monday during the stock market drop. Fed minutes are due Tuesday.",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-nvidia-palantir-tesla-sell-off-stock-market/"
  },
  {
    "text": "How a viral video prompted investigations into alleged fraud at day care centers in Minnesota - CBS News",
    "fullText": "While many of the Minnesota day care centers in the video were cited and fined for safety violations, investigators previously found no evidence of fraud.",
    "link": "https://www.cbsnews.com/news/minnesota-fraud-nick-shirley-video-day-care-investigation/"
  },
  {
    "text": "LG officially enters the art TV category with the Gallery TV - The Verge",
    "fullText": "The LG Gallery TV will compete with Samsung’s The Frame as well as the Hisense CanvasTV and TCL Nxtvision art TVs.",
    "link": "https://www.theverge.com/news/850876/lg-gallery-tv-ces-2026"
  },
  {
    "text": "National Guard to patrol New Orleans for New Year's a year after deadly attack - ABC News",
    "fullText": "A National Guard deployment in New Orleans authorized by President Donald Trump will begin Tuesday as part of a heavy security presence for New Year’s celebrations",
    "link": "https://abcnews.go.com/US/wireStory/national-guard-patrol-new-orleans-new-years-year-128766113"
  },
  {
    "text": "4 things that stood out to Bears coach Ben Johnson in Week 17 loss - Chicago Bears",
    "fullText": "After watching tape of Sunday night’s 42-38 loss to the 49ers, Bears coach Ben Johnson on Monday spoke about Caleb Williams’ two TD passes, the quarterback’s bond with Colston Loveland and more.",
    "link": "https://www.chicagobears.com/news/4-things-that-stood-out-to-bears-coach-ben-johnson-in-week-17-loss"
  },
  {
    "text": "Trump administration rolls out rural health funding, with strings attached - PBS",
    "fullText": "While every state applied for money from the Rural Health Transformation Program, it won't be distributed equally. And critics worry that the funding might be pulled back if a state's policies don't match up with the administration's.",
    "link": "https://www.pbs.org/newshour/health/trump-administration-rolls-out-rural-health-funding-with-strings-attached"
  },
  {
    "text": "Asia-Pacific markets mostly fall on penultimate day of the year - CNBC",
    "fullText": "Investors will be focused on China's military exercises around Taiwan today, after it announced new drills surrounding the island Monday.",
    "link": "https://www.cnbc.com/2025/12/30/asia-markets-live-nikkei-kospi-hang-seng.html"
  },
  {
    "text": "Chappell Roan Removes Brigitte Bardot Tribute After Learning About ‘All That Insane Shit’ - Rolling Stone",
    "fullText": "Chappell Roan removed her tribute to Brigitte Bardot after learning about the French icon's history of controversial statements.",
    "link": "http://www.rollingstone.com/music/music-news/chappell-roan-removes-brigitte-bardot-tribute-controversies-1235491761/"
  }
]