[
  {
    "text": "Winter storm timeline for New York, New Jersey shows when heaviest snow will hit this weekend - CBS News",
    "fullText": "The NYC area is bracing for a major winter storm that's set to hit the region with heavy snow on top of dangerous, subfreezing weather.",
    "link": "https://www.cbsnews.com/newyork/news/nyc-winter-storm-timeline-snow-forecast/"
  },
  {
    "text": "Rhodes, Fatu didn’t actually have match at Saturday Night’s Main Event, and it was awesome - Cageside Seats",
    "fullText": "WWE did not deliver on what they advertised here but I don’t care because it was still awesome.",
    "link": "https://www.cagesideseats.com/wwe/413141/cody-rhodes-and-jacob-fatu-didnt-actually-have-a-match-at-saturday-nights-main-event-and-it-was-awesome"
  },
  {
    "text": "Florida Congressman Maxwell Alejandro Frost Identifies Himself As Victim Of Racially Motivated Assault At CAA Sundance Party – Update - Deadline",
    "fullText": "A CAA Sundance Party on Friday saw an arrest in the aftermath of a racially charged incident in a restroom, sources have confirmed to Deadline.",
    "link": "http://deadline.com/2026/01/caa-sundance-party-sees-arrest-racially-charged-incident-1236695747/"
  },
  {
    "text": "Immigrant families protest inside Texas facility housing 5-year-old boy, father detained in Minnesota - texastribune.org",
    "fullText": "Liam Conejo Ramos and his father were detained in Minnesota in an incident that’s further inflamed tensions over the Trump administration’s hardline immigration enforcement.",
    "link": "http://www.texastribune.org/2026/01/24/immigration-facility-protest-texas-liam-conejo-ramos/"
  },
  {
    "text": "Five ways weight-loss jabs are changing spending habits - BBC",
    "fullText": "With GLP-1 drugs rising in popularity, how are businesses adapting to a new type of consumer?",
    "link": "https://www.bbc.com/news/articles/cj6wy85l3x5o"
  },
  {
    "text": "AJ Dybantsa just scored 43 points against Utah. Here’s how social media reacted - deseret.com",
    "fullText": "",
    "link": "https://www.deseret.com/sports/2026/01/24/aj-dybantsa-43-points-against-utah-social-media-reactions/"
  },
  {
    "text": "2026 Rolex 24 at Daytona live updates: Results, leaderboard, track map, teams, highlights, news - NBC Sports",
    "fullText": "It's the 64th running of the sports car classic, a 24-hour endurance event at the World Center of Racing.",
    "link": "https://www.nbcsports.com/motor-sports/news/2026-rolex-24-at-daytona-live-updates-results-leaderboard-track-map-teams-highlights-news-imsa"
  },
  {
    "text": "How Tennessee basketball altered Alabama travel plans due to winter weather - On3",
    "fullText": "Tennessee basketball changed travel plans following its game at Alabama on Saturday due to winter weather and will not return to Knoxville.",
    "link": "https://www.on3.com/teams/tennessee-volunteers/news/tennessee-basketball-alabama-travel-weather-georgia/"
  },
  {
    "text": "Seahawks’ Sam Darnold has chance to vanquish Rams — and his critics - seattletimes.com",
    "fullText": "The reputation of Seahawks QB Sam Darnold still has one boulder to barrel through to complete its transformation. Actually, make that one boulder to Ram through.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-sam-darnold-has-chance-to-vanquish-rams-and-his-critics/"
  },
  {
    "text": "Democrats in Texas Senate race call for ICE overhaul, hours after Minnesota shooting - NBC News",
    "fullText": "Rep. Jasmine Crockett and state Rep. James Talarico, the top Democrats running for Senate in Texas, called for overhauling Immigration and Customs Enforcement during a debate on Saturday.",
    "link": "https://www.nbcnews.com/politics/2026-election/democrats-call-ice-overhaul-texas-senate-debate-hours-minnesota-shooti-rcna255593"
  },
  {
    "text": "How much snow are Boston and Massachusetts getting this weekend? - CBS News",
    "fullText": "A major winter storm is heading to Massachusetts on Sunday. Here's how much snow you should expect to get in your area.",
    "link": "https://www.cbsnews.com/boston/news/how-much-snow-boston-massachusetts-storm-weekend-winter/"
  },
  {
    "text": "Stream live on WCNC+ | Ice storm coverage in Charlotte, across Carolinas - wcnc.com",
    "fullText": "Stream live ice storm updates on WCNC+. Download on your TV and watch for free.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/stream-live-ice-storm-coverage-wcnc-brad-panovich-charlotte-north-carolina-winter-weather/275-b7205542-1cc2-4c9c-8844-7858e6c88e9d"
  },
  {
    "text": "Amber Heard Returns in Sundance Doc About Women Silenced by Defamation Suits, Recalls Johnny Depp Trial: ‘I Didn’t Understand It Could Get So Much Worse For Me’ - Variety",
    "fullText": "Amber Heard made a surprise return at Sundance in the documentary 'Silenced,' which chronicles women in defamation cases.",
    "link": "https://variety.com/2026/film/news/amber-heard-johnny-depp-sundance-silenced-1236639996/"
  },
  {
    "text": "Heavy snow and ice are coming to Philly, and may stick around for a week, or more - inquirer.com",
    "fullText": "Up to 10 inches of snow is possible, followed by ice station Philly.",
    "link": "https://www.inquirer.com/weather/philadelphia-forecast-snow-storm-sleet-20260124.html"
  },
  {
    "text": "Wife of Uganda’s opposition leader describes moment armed men attacked her at home - AP News",
    "fullText": "Armed men entered the home of Ugandan opposition leader Bobi Wine and held his wife, Barbara Kyagulanyi, at gunpoint as they demanded to know his whereabouts. Speaking on Saturday from her hospital bed, she said she was assaulted when she refused to cooperate…",
    "link": "https://apnews.com/article/uganda-opposition-bobi-wine-wife-19ee8a1bce8d0f14e9d337eba561c286"
  },
  {
    "text": "Did Edison accidentally make graphene in 1879? - Ars Technica",
    "fullText": "Rice University chemists replicated Thomas Edison's seminal experiment and found a surprising byproduct.",
    "link": "https://arstechnica.com/science/2026/01/did-edison-accidentally-make-graphene-in-1879/"
  },
  {
    "text": "N.J. weather: Latest snow totals predicted by 11 forecasters for the looming winter storm - nj.com",
    "fullText": "Some snowfall projections have dropped by a few inches, but most forecasters agree the approaching weekend storm has the ingredients to become a big and dangerous winter storm.",
    "link": "https://www.nj.com/weather/2026/01/nj-weather-latest-snow-totals-predicted-by-11-forecasters-for-the-looming-winter-storm.html"
  },
  {
    "text": "What Happens to Your Blood Sugar When You Take Omega 3 Supplements Every Day? - Verywell Health",
    "fullText": "Based on extensive research, there is insufficient scientific evidence to support taking an omega-3 supplement daily to improve blood sugar levels.",
    "link": "https://www.verywellhealth.com/omega-3-supplements-and-blood-sugar-11865218"
  },
  {
    "text": "Ukrainian officials call talks with U.S. and Russia \"positive\" and \"constructive\" - Axios",
    "fullText": "The talks, aimed at ending the war, took place as Russia launched a massive missile and drone attack against Kyiv and other cities.",
    "link": "https://www.axios.com/2026/01/24/us-russia-ukraine-talks-abu-dhabi"
  }
]