[
  {
    "text": "‘Tomb Raider’ First Look: Sophie Turner Becomes Lara Croft as Filming Starts on Prime Video’s Reboot Series - Variety",
    "fullText": "Prime Video has unveiled a first look at the 'Tomb Raider' live-action series, showing Sophie Turner as Lara Croft.",
    "link": "https://variety.com/2026/tv/news/tomb-raider-sophie-turner-lara-croft-first-look-1236605699/"
  },
  {
    "text": "Cassidy raises $1.65 million for reelection fight - Politico",
    "fullText": "Sen. Bill Cassidy (R-La.) has built an $11 million war chest as he seeks to ward off a right-wing primary challenge.",
    "link": "https://www.politico.com/live-updates/2026/01/15/congress/cassidy-raises-1-65m-00730420"
  },
  {
    "text": "Washington Commanders and HKS unveil initial renderings of new world-class stadium - Washington Commanders",
    "fullText": "The roofed stadium will be a dynamic, year-round destination for sports, entertainment and community engagement, integrating sustainable design practices and reimagining the fan experience through immersive spaces.",
    "link": "https://www.commanders.com/news/washington-commanders-hks-initial-renderings-stadium"
  },
  {
    "text": "Goldman Sachs Q4 earnings top consensus, revenue misses due to Apple Card markdown (GS:NYSE) - Seeking Alpha",
    "fullText": null,
    "link": "https://seekingalpha.com/news/4539367-goldman-sachs-q4-earnings-top-consensus-revenue-misses-due-to-apple-card-markdown"
  },
  {
    "text": "Henry Zeffman: Jenrick sacking is huge moment for future of British right - BBC",
    "fullText": "It was Kemi Badenoch's belief that Robert Jenrick was about to make the ultimate leap to the right which has plunged the Conservative Party into turmoil.",
    "link": "https://www.bbc.com/news/articles/cql4e6pkzdqo"
  },
  {
    "text": "Spotify is hiking prices again - The Verge",
    "fullText": "The price of Spotify Premium is about to jump again in the US, marking its third price hike in the region since 2023.",
    "link": "https://www.theverge.com/news/862465/spotify-premium-us-price-increase-2026"
  },
  {
    "text": "Kristy Scott Posts in Skin-Tight Dress After Filing for Divorce - TMZ",
    "fullText": "Kristy Scott showed off her figure in a jaw-dropping dress after filing for divorce from Desmond Scott.",
    "link": "https://www.tmz.com/2026/01/15/kristy-scott-skin-tight-dress-after-filing-for-divorce-desmond/"
  },
  {
    "text": "What to do if you’ve been exposed to measles - CNN",
    "fullText": "The United States reported a record number of measles cases in 2025, and the virus continues to spread rapidly in the new year. At least ​171 measles cases have been reported in the first two weeks of 2026, according to data published Wednesday by the US Cent…",
    "link": "https://www.cnn.com/2026/01/15/health/measles-exposure-what-to-do-wellness"
  },
  {
    "text": "Hundreds of Millions of Audio Devices Need a Patch to Prevent Wireless Hacking and Tracking - WIRED",
    "fullText": "Flaws in how 17 models of headphones and speakers use Google’s one-tap Fast Pair Bluetooth protocol have left devices open to eavesdroppers and stalkers.",
    "link": "https://www.wired.com/story/google-fast-pair-bluetooth-audio-accessories-vulnerability-patches/"
  },
  {
    "text": "A new era for Canada-China relations? Prime Minister Carney signals change in Beijing - AP News",
    "fullText": "Prime Minister Mark Carney says Canada and China are entering a new era of relations. Carney, on the first trip by a Canadian leader to China in eight years, aims to repair ties that have been strained for several years. He met with Chinese Premier Li Qiang i…",
    "link": "https://apnews.com/article/canada-carney-china-li-beijing-talks-tariffs-53107cae170d9939fb18b38281c08e88"
  },
  {
    "text": "OpenAI’s ChatGPT translator challenges Google Translate - The Verge",
    "fullText": "﻿ChatGPT Translate allows users to direct the style of translated text, such as ‘more fluent’ and ‘academic.’",
    "link": "https://www.theverge.com/news/862448/openai-chatgpt-translate-tool-launch-website"
  },
  {
    "text": "Drake Maye offers frightening observation about Houston Texans linebackers - MassLive",
    "fullText": "Patriots QB Drake Maye offers his take on the Houston Texans defense.",
    "link": "https://www.masslive.com/patriots/2026/01/drake-maye-offers-frightening-observation-about-houston-texans-linebackers.html"
  },
  {
    "text": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam - Axios",
    "fullText": "\"There's a frustration with all these impeachments,\" said one House Democrat. \"Noem is just soup du jour.\"",
    "link": "https://www.axios.com/2026/01/14/kristi-noem-impeachment-democrats-centrists"
  },
  {
    "text": "Elon Musk says retirement savings 'won't matter' in 20 years. We asked 7 personal finance and AI gurus what they think. - Business Insider",
    "fullText": "Elon Musk said retirement savings will be \"irrelevant\" in 20 years if he's right about an abundant future. Experts see challenges to that vision.",
    "link": "https://www.businessinsider.com/elon-musk-retirement-savings-wealth-ai-abundance-personal-finance-experts-2026-1"
  },
  {
    "text": "How do you prosecute another country’s president? - Politico",
    "fullText": "Legal experts point to a number of hurdles that are likely to arise in the case of Nicolás Maduro.",
    "link": "https://www.politico.com/news/2026/01/15/nicolas-maduro-criminal-case-00729510"
  },
  {
    "text": "What Teddy Roosevelt has to do with Trump's moves in Venezuela and Greenland - NPR",
    "fullText": "Presidents James Monroe and Theodore Roosevelt helped shape a policy that rationalizes U.S. intervention in Latin America and elsewhere. But Trump has brought that idea to a whole new level.",
    "link": "https://www.npr.org/2026/01/15/nx-s1-5675874/trump-monroe-doctrine-roosevelt-latin-america-intervention"
  },
  {
    "text": "Australia banned social media for under 16s a month ago — here's how it's going - CNBC",
    "fullText": "The effects of a new social media ban for under 16s in Australia has been mixed so far. Some teens are embracing new habits while others are bypassing the law.",
    "link": "https://www.cnbc.com/2026/01/15/australias-social-media-ban-for-teens-how-its-going.html"
  },
  {
    "text": "What are Trump’s military options for an attack on Iran? - Al Jazeera",
    "fullText": "Trump told Iranian protesters that ‘help is on its way’ in a Truth Social post.",
    "link": "https://www.aljazeera.com/news/2026/1/14/what-are-trumps-military-options-for-an-attack-on-iran"
  },
  {
    "text": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes ‘One Battle After Another’ at U.S. Box Office - The Hollywood Reporter",
    "fullText": "Chalamet, working with director Josh Safdie and A24, came up with a number of bold viral marketing stunts that have seen the original film smash one record after another since its nationwide release on Christmas Day.",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/timothee-chalamet-marty-supreme-one-battle-after-another-1236473797/"
  }
]