[
  {
    "text": "Restaurants' hottest menu item in 2025 was 'value.' That won't change next year - CNBC",
    "fullText": "Restaurant chains bet on value in 2025, and they're not likely to ditch the strategy next year.",
    "link": "https://www.cnbc.com/2025/12/28/value-meals-restaurants-mcdonalds-chilis-taco-bell.html"
  },
  {
    "text": "Guinea votes in first election since 2021 coup with junta leader expected to win - AP News",
    "fullText": "Guineans are voting to elect a new president in the country’s first election since a 2021 coup. The election on Sunday features a weakened opposition with a total of nine candidates. Analysts have predicted a likely win for junta leader Gen. Mamadi Doumbouya.…",
    "link": "https://apnews.com/article/guinea-election-voting-conakry-9c51dff8b5d244b5c5f2157be6eaf1d2"
  },
  {
    "text": "This is your teen’s brain on phones and social media, according to science - The Washington Post",
    "fullText": "A wave of new studies is shedding light on the risks of early smartphone access and heavy screen use for adolescent mental health and development.",
    "link": "https://www.washingtonpost.com/health/2025/12/28/adolescent-brain-development-screen-time/"
  },
  {
    "text": "For Ukrainians, a nuclear missile museum is a bitter reminder of what the country gave up - NPR",
    "fullText": "The Museum of Strategic Missile Forces tells the story of how Ukraine dismantled its nuclear weapons arsenal after independence in 1991. Today many Ukrainians believe that decision to give up nukes was a mistake.",
    "link": "https://www.npr.org/2025/12/28/g-s1-103485/ukraine-museum-strategic-missile-forces-budapest-agreement"
  },
  {
    "text": "Mercury: The planet that shouldn't exist - BBC",
    "fullText": "Mercury has long baffled astronomers because it defies much of what we know about planet formation. A new space mission arriving in 2026 might solve the mystery.",
    "link": "https://www.bbc.com/future/article/20251223-mercury-the-planet-that-shouldnt-exist"
  },
  {
    "text": "EU backs Somalia after Israel recognizes Somaliland - DW",
    "fullText": "Israel’s support for Somaliland has triggered sharp pushback across Africa, the Middle East and beyond, with the EU urging calm and Somalia vowing to defend its sovereignty.",
    "link": "https://www.dw.com/en/eu-backs-somalia-after-israel-recognizes-somaliland/a-75318108"
  },
  {
    "text": "Putin Humiliates Trump With Kyiv Strike on Eve of Peace Talks - The Daily Beast",
    "fullText": "The attack flies in the face of the country’s so-called “commitment to peace,” as described by Trump officials.",
    "link": "https://www.thedailybeast.com/putin-humiliates-trump-with-kyiv-strike-on-eve-of-peace-talks/"
  },
  {
    "text": "Game recap: 5 takeaways from Packers’ loss to Ravens - Green Bay Packers – packers.com",
    "fullText": "Baltimore was in control the whole way",
    "link": "https://www.packers.com/news/game-recap-5-takeaways-from-packers-loss-to-ravens-week-17-2025"
  },
  {
    "text": "Foods with healthy-sounding buzzwords could be hiding added sugar in plain sight - ABC News",
    "fullText": "People probably don’t know how much sugar they’re eating",
    "link": "https://abcnews.go.com/Health/wireStory/foods-healthy-sounding-buzzwords-hiding-added-sugar-plain-128728905"
  },
  {
    "text": "Horoscope for Sunday, December 28, 2025 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2025/12/28/horoscopes-today-sunday-december-28-2025"
  },
  {
    "text": "Polls open for Myanmar’s first election since military seized power - AP News",
    "fullText": "Voters in Myanmar have voted in the first phase of the country’s general election. The polls are being held under military rule amid a civil war. Final results will not be known until after two more rounds of voting are completed in January. The first phase w…",
    "link": "https://apnews.com/article/myanmar-election-yangon-suu-kyi-hlaing-military-f361d4962d30b9c5c4741110bb1271ef"
  },
  {
    "text": "Massive Rainbow Six Siege breach gives players billions of credits - BleepingComputer",
    "fullText": "Ubisoft's Rainbow Six Siege (R6) suffered a breach that allowed hackers to abuse internal systems to ban and unban players, manipulate in-game moderation feeds, and grant massive amounts of in-game currency and cosmetic items to accounts worldwide.",
    "link": "https://www.bleepingcomputer.com/news/security/massive-rainbow-six-siege-breach-gives-players-billions-of-credits/"
  },
  {
    "text": "Gas leak outside Los Angeles shuts down major highway, nearby residents told to shelter-in-place - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/gas-leak-los-angeles-shuts-major-highway-nearby/story?id\\\\u003d128727653"
  },
  {
    "text": "Thailand and Cambodia sign a new ceasefire agreement to end border fighting - AP News",
    "fullText": "Thailand and Cambodia have signed a ceasefire agreement to end weeks of fighting over border disputes. The agreement, effective Saturday at noon, halts military movements and airspace violations. Thailand had conducted airstrikes in Cambodia as recently as Sa…",
    "link": "https://apnews.com/article/thailand-cambodia-border-fighting-ceasefire-0019310e1c062cd211f9f5398b3bc463"
  },
  {
    "text": "After starting 0-3, Texans relish being in playoffs - ESPN",
    "fullText": "The Texans clinched a playoff spot with their win over the Chargers on Saturday.",
    "link": "https://www.espn.com/nfl/story/_/id/47431081/texans-clinch-postseason-berth-starting-0-3"
  },
  {
    "text": "Broncos are AFC West champions - 9News",
    "fullText": "The Chargers' loss to the Texans clinched the Broncos' first division title in 10 years.",
    "link": "https://www.9news.com/article/sports/nfl/denver-broncos/mike-klis/chargers-loss-gives-broncos-first-division-title-since-2015/73-09b52dbd-caa0-4c8e-af44-38548854cd81"
  },
  {
    "text": "Jeffrey R. Holland, next in line to lead Church of Jesus Christ of Latter-day Saints, dies at 85 - NPR",
    "fullText": "Jeffrey R. Holland led the Quorum of the Twelve Apostles, a key governing body. He was next in line to become the church's president.",
    "link": "https://www.npr.org/2025/12/27/nx-s1-5659302/jeffrey-r-holland-church-of-jesus-christ-of-latter-day-saints-obit"
  },
  {
    "text": "Winter storm brings heavy snow and ice to busy holiday travel weekend - NPR",
    "fullText": "A powerful winter storm is impacting parts of the U.S. with major snowfall, ice, and below zero wind chills. The conditions are disrupting holiday travel and could last through next week.",
    "link": "https://www.npr.org/2025/12/27/g-s1-103821/winter-storm-post-christmas-travel"
  },
  {
    "text": "Samsung will debut two new wireless speakers at CES 2026 - The Verge",
    "fullText": "Samsung’s new wireless speakers from designer Erwan Bouroullec are designed to enhance the home design aesthetic.",
    "link": "https://www.theverge.com/news/850481/two-new-wireless-samsung-speakers-for-2026-lean-into-aesthetics"
  }
]