[
  {
    "text": "Dow closes more than 450 points lower, S&P 500 pulls back from record: Live updates - CNBC",
    "fullText": "The S&P 500 and Dow Jones Industrial Average notched fresh all-time intraday records on Wednesday.",
    "link": "https://www.cnbc.com/2026/01/06/stock-market-today-live-updates.html"
  },
  {
    "text": "Separatist group in Yemen loses contact with delegation that went to Riyadh for talks - AP News",
    "fullText": "A separatist group in southern Yemen says it's urgently trying to contact a delegation that traveled to the Saudi capital for talks meant to de-escalate recent tensions. The Southern Transitional Council says a 50-member delegation arrived Wednesday but went …",
    "link": "https://apnews.com/article/yemen-separatists-war-houthis-uae-saudi-arabia-8957267e4b0e82b4e75cdab23fe939b6"
  },
  {
    "text": "Orioles Designate Jhonkensy Noel For Assignment - MLB Trade Rumors",
    "fullText": "The Orioles love waiver claims. MLBTR looks at the latest moves.",
    "link": "https://www.mlbtraderumors.com/2026/01/orioles-designate-jhonkensy-noel-for-assignment.html"
  },
  {
    "text": "Minneapolis mayor says ICE officer's killing of a motorist was 'reckless' and wasn't self-defense - AP News",
    "fullText": "An Immigration and Customs Enforcement officer has shot and killed a Minneapolis driver during the Trump administration’s latest immigration crackdown on a major American city. Federal officials called the 37-year-old woman's killing Wednesday an act of self-…",
    "link": "https://apnews.com/article/minnesota-immigration-enforcement-shooting-crackdown-surge-173e00fa7388054e98c3b5b9417c1e5a"
  },
  {
    "text": "Lib Dem council to ask for election delay weeks after Davey's warning - BBC",
    "fullText": "Cheltenham Borough Council is asking for its May elections to be postponed.",
    "link": "https://www.bbc.com/news/articles/c4gw944x83lo"
  },
  {
    "text": "Béla Fleck cancels Kennedy Center appearance, says it's become 'charged and political' - NPR",
    "fullText": "The 18-time Grammy Award winner is the latest musician to cancel an show at the Kennedy Center. Béla Fleck says he cannot currently perform there because it \"has become charged and political.\"",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5670241/bela-fleck-kennedy-center-cancel"
  },
  {
    "text": "In Maduro’s capture, Russia sees a great-power rival act with impunity - The Washington Post",
    "fullText": "The U.S. intervention in Venezuela distracts attention from Ukraine and signals a new era of great-power politics in which Russia can seek its own sphere of dominance.",
    "link": "https://www.washingtonpost.com/world/2026/01/07/russia-venezuela-great-power-politics/"
  },
  {
    "text": "Bose open-sources its SoundTouch home theater smart speakers ahead of end-of-life - Ars Technica",
    "fullText": "If companies insist on bricking gadgets, this is a better way to do it.",
    "link": "https://arstechnica.com/gadgets/2026/01/bose-open-sources-its-soundtouch-home-theater-smart-speakers-ahead-of-eol/"
  },
  {
    "text": "Dell admits consumers don’t care about AI PCs - The Verge",
    "fullText": "Dell is now shifting it focus this year away from being ‘all about the AI PC.’",
    "link": "https://www.theverge.com/news/857723/dell-consumers-ai-pcs-comments"
  },
  {
    "text": "Timothée Chalamet brings a lot to the table in 'Marty Supreme' - NPR",
    "fullText": "Chalamet stars as a scrappy shoe salesman who dreams of becoming the greatest table tennis player in the world — and is willing to steal, cheat, sweet-talk and hustle his way to the top.",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5668275/marty-supreme-review-timothee-chalamet"
  },
  {
    "text": "Fossils unearthed in Morocco are first from little-understood period of human evolution - CNN",
    "fullText": "Fossils unearthed in Morocco are the first from a little-understood period of human evolution and may be remains of a mysterious human ancestor.",
    "link": "https://www.cnn.com/2026/01/07/science/morocco-early-human-fossils"
  },
  {
    "text": "There’s new ‘toxic mom group’ drama starring Ashley Tisdale and Hilary Duff’s husband - CNN",
    "fullText": "Beef looks a little different these days for some teens stars from the early 2000s.",
    "link": "https://www.cnn.com/2026/01/07/entertainment/ashley-tisdale-hilary-duff-husband-toxic-mom-group"
  },
  {
    "text": "Judge orders DOJ to explain why Lindsey Halligan is still using the title of US attorney - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/judge-orders-doj-explain-lindsey-halligan-title-us/story?id\\\\u003d128977427"
  },
  {
    "text": "Avelo To Exit Deportation Biz - New Haven Independent",
    "fullText": "Avelo Airlines plans to stop running deportation flights for the Trump administration later this month after deciding that its participation in the Department of Homeland Security (DHS) program is too complex and costly to continue.",
    "link": "http://www.newhavenindependent.org/2026/01/07/avelo-to-exit-deportation-biz/"
  },
  {
    "text": "Mark Cuban Increases His Indiana Football Spending for Transfer Portal - Front Office Sports",
    "fullText": "Cuban told FOS that he gave for a second straight year after never previously backing Indiana’s sports teams.",
    "link": "http://frontofficesports.com/mark-cuban-indiana-football-transfer-portal/"
  },
  {
    "text": "Spotify now lets you share what you’re streaming in real time with friends - TechCrunch",
    "fullText": "You can tap a friend’s listening activity to play the track, save it, open the menu, or react with an emoji.",
    "link": "https://techcrunch.com/2026/01/07/spotify-now-lets-you-share-what-youre-streaming-in-real-time-with-friends/"
  },
  {
    "text": "NASA Perseverance rover sees megaripples on Mars photo of the day for Jan. 7, 2026. - Space",
    "fullText": "Another view from Perseverance shows how windswept Mars' landscape truly is.",
    "link": "https://www.space.com/space-exploration/mars-rovers/nasa-perseverance-rover-sees-megaripples-on-mars-space-photo-of-the-day-for-jan-7-2026"
  },
  {
    "text": "Top 5 storylines for Bills at Jaguars | AFC Wild Card Round - Buffalo Bills Home | Buffalo Bills - buffalobills.com",
    "fullText": "Josh Allen's playoff numbers, a best-on-best matchup, the reason behind the Jaguars win streak + more.",
    "link": "https://www.buffalobills.com/news/top-5-storylines-for-bills-at-jaguars-afc-wild-card-round"
  }
]