[
  {
    "text": "S&P 500 futures climb after index starts February trading on a winning note: Live updates - CNBC",
    "fullText": "Investors this week are digesting more than 100 S&P 500 companies posting earnings results. AMD and Pfizer are among those expected to report on Tuesday.",
    "link": "https://www.cnbc.com/2026/02/02/stock-market-today-live-updates.html"
  },
  {
    "text": "Uruguay President Orsi deepens ties with China’s Xi despite Trump threats - Al Jazeera",
    "fullText": "Yamandu Orsi is the first Latin American leader to visit China since the US abducted Venezuela’s Nicolas Maduro.",
    "link": "https://www.aljazeera.com/news/2026/2/3/uruguay-president-orsi-deepens-ties-with-chinas-xi-despite-trump-threats"
  },
  {
    "text": "Record-breaking snow blankets Japan, killing at least 30 people - Al Jazeera",
    "fullText": "Japan deploys troops to help residents and warns people to watch for avalanches and snow falling from roofs.",
    "link": "https://www.aljazeera.com/news/2026/2/3/record-breaking-snow-blankets-japan-killing-at-least-30-people"
  },
  {
    "text": "China Bans Hidden Car Door Handles in World-First Safety Policy - Bloomberg",
    "fullText": "China banned concealed door handles on electric vehicles, the first country in the world to outlaw a design popularized by Tesla Inc. that is now facing global regulatory scrutiny due to a spate of deadly incidents.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-02/china-bans-hidden-car-door-handles-in-world-first-safety-policy"
  },
  {
    "text": "‘Crisis’: The fallout from Trump’s surprise plan to close Kennedy Center - The Washington Post",
    "fullText": "The president’s announcement shocked artists and staff. A letter obtained by The Washington Post brought the National Symphony Orchestra’s future into focus.",
    "link": "https://www.washingtonpost.com/entertainment/2026/02/02/trump-kennedy-center-closure-nso/"
  },
  {
    "text": "Ukraine agrees multi-tier plan for enforcing any ceasefire with Russia - Financial Times",
    "fullText": "European forces would be dispatched and backed by US military in case of repeated Russian violations",
    "link": "https://www.ft.com/content/0f26d56d-98cd-4999-8908-4a851a2de773"
  },
  {
    "text": "Couples at the Westminster show bond over dogs, and each other - AP News",
    "fullText": "The Westminster Kennel Club Dog Show spotlights the bond between people and dogs. But reaching the United States’ premier canine event also can be about another kind of love. Just ask professional dog handlers Bill and Taffe McFadden. He's a two-time Westmins…",
    "link": "https://apnews.com/article/westminster-dog-show-150th-couples-12bb9efd3292859879d7ebae4bc1ffaf"
  },
  {
    "text": "Powerball: See the winning numbers in Monday’s $65 million drawing - PennLive.com",
    "fullText": "Check your numbers to see if you hit it big in Monday's jackpot.",
    "link": "https://www.pennlive.com/lottery/2026/02/powerball-see-the-winning-numbers-in-mondays-65-million-drawing.html"
  },
  {
    "text": "It's all on the line for these 6 teams in 2026, 1 from each division - MLB.com",
    "fullText": "The Yankees and Giants will open the 2026 MLB season on March 25. We’ll be counting down to that date with our annual preview series, with each story looking ahead to the coming season by breaking down a particular topic, division by division.\nPreviously: The…",
    "link": "https://www.mlb.com/news/mlb-teams-with-the-most-at-stake-in-2026"
  },
  {
    "text": "Another huge intra-division victory on home ice: Capitals beat Islanders 4-1 - RMNB",
    "fullText": "The Washington Capitals took on the New York Islanders in their next \"biggest game of the season\" on Monday night. With a…",
    "link": "https://russianmachineneverbreaks.com/2026/02/02/another-huge-intra-division-victory-on-home-ice-capitals-beat-islanders-4-1/"
  },
  {
    "text": "Russia resumes night strikes on major Ukrainian cities, ending brief reprieve agreed between Putin and Trump - CNN",
    "fullText": "Russia launched its biggest missile and drone attack on Ukraine so far this year on Tuesday, according to Ukrainian authorities, cutting heat to tens of thousands of people and ending a brief reprieve agreed to by Moscow and Washington as Ukrainians grapple w…",
    "link": "https://www.cnn.com/2026/02/02/europe/russia-resumes-strikes-ukraine-kyiv-intl-hnk"
  },
  {
    "text": "Elon Musk's SpaceX confirms it is taking over xAI - BBC",
    "fullText": "Musk says the combined firm - which has been valued at more than $1tn - will be an \"innovation engine\".",
    "link": "https://www.bbc.com/news/articles/cq6vnrye06po"
  },
  {
    "text": "Maryland House passes new congressional map, setting up a showdown with the state Senate - NBC News",
    "fullText": "The Maryland House approved legislation Monday to redraw the state’s congressional map, sending it to the state Senate, where its future is uncertain.",
    "link": "https://www.nbcnews.com/politics/2026-election/maryland-house-passes-new-congressional-map-state-senate-rcna257030"
  },
  {
    "text": "Kansas vs Texas Tech: Predictions, Odds, Picks & How to Watch - Action Network",
    "fullText": "Read for Kansas vs Texas Tech predictions, picks and odds for their college basketball game on Monday, February 2.",
    "link": "https://www.actionnetwork.com/ncaab/kansas-jayhawks-vs-texas-tech-red-raiders-predictions-picks-odds-college-basketball-monday-february-2"
  },
  {
    "text": "Officials issue urgent warning amid race to contain outbreak of disease with no known cure: 'Intensified surveillance at border points' - Yahoo",
    "fullText": "\"Health checks have also been ordered for people entering ... through other border crossings.\"",
    "link": "https://www.yahoo.com/news/articles/officials-issue-urgent-warning-amid-233000794.html"
  },
  {
    "text": "Adobe Animate is shutting down next month - The Verge",
    "fullText": "Adobe Animate is shutting down. The animation app will no longer be available for purchase starting March 1st, 2026, while existing users will have until March 1st, 2027, to download their files.",
    "link": "https://www.theverge.com/news/872731/adobe-animate-app-shutdown-date"
  },
  {
    "text": "Spoiler: Closing for February 2 WWE RAW Revealed - Ringside News",
    "fullText": "Roman Reigns will reportedly close out tonight’s episode of Monday Night RAW, just days after winning the 2026 Men’s Royal Rumble. According to",
    "link": "https://www.ringsidenews.com/spoiler-closing-february-2-wwe-raw-revealed/"
  },
  {
    "text": "Populist conservative Laura Fernández wins Costa Rica's presidential election - NPR",
    "fullText": "Candidate Laura Fernández won a resounding victory, promising to continue the aggressive reorienting of the Central American nation's politics started by her predecessor.",
    "link": "https://www.npr.org/2026/02/02/g-s1-108418/costa-rica-election-laura-fernandez-wins"
  },
  {
    "text": "Father of 5-year-old detained in Minnesota disputes government assertion he abandoned the boy - AP News",
    "fullText": "The father of a 5-year-old boy detained by immigration officers in Texas denies abandoning his son. Adrian Conejo Arias is originally from Ecuador. He tells ABC News he loves his son, Liam, and disputes claims from the Department of Homeland Security that he …",
    "link": "https://apnews.com/article/immigration-minnesota-trump-ice-liam-5cd3379ce44db7a38ad0b2c5e910da54"
  },
  {
    "text": "Firefox is adding a switch to turn AI features off - The Verge",
    "fullText": "Mozilla is launching a new option that will allow you to turn off AI-powered features inside Firefox, including abuilt-in chatbot, AI translations, AI tab groups, and more.",
    "link": "https://www.theverge.com/news/872489/mozilla-firefox-ai-features-off-button"
  }
]