[
  {
    "text": "Tommy Lee Jones’s daughter ‘found dead in hotel room’, aged 34 - thetimes.com",
    "fullText": "Emergency services attended the Fairmont Hotel in San Francisco in the early hours of New Year’s Day. A drug overdose is suspected",
    "link": "https://www.thetimes.com/us/news-today/article/tommy-lee-jones-daughter-found-dead-hotel-room-bzqn2s3xk"
  },
  {
    "text": "New York reports record-breaking number of flu hospitalizations in a single week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-york-reports-record-breaking-number-flu-hospitalizations/story?id\\\\u003d128849108"
  },
  {
    "text": "Playoff Quarterfinal at the Capital One Orange Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Capital One Orange Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Orange-recap.aspx"
  },
  {
    "text": "Early gains fade as Wall Street wobbles into 2026 - AP News",
    "fullText": "Stocks wavered on Wall Street to kick off the new year with a wobbly start. The S&P 500 rose 0.2% Friday, coming off a gain of more than 16% in 2025. The Nasdaq rose 0.1%. The Dow rose 289 points, or 0.6%. Benchmarks in Britain and South Korea hit records. Wa…",
    "link": "https://apnews.com/article/stocks-markets-baidu-trump-rates-491d6d4e0f3e4b3f8c0e48ae2b1455b3"
  },
  {
    "text": "Lamar Jackson Gets Full Week of Practice; Rashod Bateman Still Sidelined - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Lamar Jackson had had a full week of practice and Kyle Van Noy (quad) returned to practice Friday.",
    "link": "https://www.baltimoreravens.com/news/injury-report-ravens-steelers-title-game-lamar-jackson-tj-watt-kyle-van-noy-rashod-bateman"
  },
  {
    "text": "2026 is the year humanity will finally go back to the moon - Space",
    "fullText": "It's happening. We are going.",
    "link": "https://www.space.com/space-exploration/artemis/2026-is-the-year-humanity-will-finally-go-back-to-the-moon"
  },
  {
    "text": "Look up tonight: Quadrantid meteor shower will peak, joined by 1st supermoon of 2026 - LiveNOW from FOX",
    "fullText": "This year's first supermoon is called the Super Wolf Moon.",
    "link": "https://www.livenowfox.com/news/look-up-tonight-quadrantid-meteor-shower-will-peak-joined-1st-supermoon-2026"
  },
  {
    "text": "Saks Global announces new CEO as it reportedly prepares for bankruptcy - CNBC",
    "fullText": "The company was created in July 2024 after Hudson's Bay Company acquired Neiman Marcus.",
    "link": "https://www.cnbc.com/2026/01/02/saks-global-new-ceo-richard-baker-bankruptcy-reports.html"
  },
  {
    "text": "Sparklers may have led to deadly New Year's Swiss resort bar fire, investigators say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/sparkling-candles-led-deadly-new-years-swiss-resort/story?id\\\\u003d128846606"
  },
  {
    "text": "The 1st full moon of 2026 rises tonight! Here's what to expect from January's supermoon Wolf Moon - Space",
    "fullText": "The first full moon of 2026 has arrived.",
    "link": "https://www.space.com/stargazing/the-1st-full-moon-of-2026-rises-tonight-heres-what-to-expect-from-januarys-supermoon-wolf-moon"
  },
  {
    "text": "Catholic influencer Paul Kim’s son dies aged five after severe case of the flu - The Independent",
    "fullText": "Kim said the boy suffered sepsis and seizures",
    "link": "https://www.the-independent.com/life-style/paul-kim-son-dead-flu-b2893561.html"
  },
  {
    "text": "‘Wicked’ Composer Stephen Schwartz Says He’ll Back Out Of Kennedy Center Hosting Gig - Forbes",
    "fullText": "Schwartz was set to host the Washington National Opera Gala in May, but he told Newsday there’s “no way” he would set foot in the Kennedy Center after President Donald Trump’s renaming.",
    "link": "https://www.forbes.com/sites/conormurray/2026/01/02/wicked-composer-stephen-schwartz-says-hell-back-out-of-kennedy-center-hosting-gig/"
  },
  {
    "text": "Woman killed in suspected mountain lion attack while hiking in northern Colorado - The Colorado Sun",
    "fullText": "Wildlife officials tracked and killed two lions and are looking for a third in the mountains northeast of Estes Park where the attack occurred",
    "link": "http://coloradosun.com/2026/01/02/colorado-fatal-mountain-lion-attack-estes-park/"
  },
  {
    "text": "'More Neanderthal than human': How DNA from our long-lost ancestors affects our health today - Live Science",
    "fullText": "Neanderthals and humans mated millennia ago, and their legacy lives on in us today. Here's how.",
    "link": "https://www.livescience.com/health/genetics/more-neanderthal-than-human-how-dna-from-our-long-lost-ancestors-affects-our-health-today"
  },
  {
    "text": "Volodymyr Zelenskyy picks military spymaster to replace top aide - Financial Times",
    "fullText": "Ukraine’s former head of defence intelligence Kyrylo Budanov to become chief of staff following Andriy Yermak resignation",
    "link": "https://www.ft.com/content/73140502-f8e1-427e-b70a-04e2489cae67"
  },
  {
    "text": "London stocks hit record as 2026 kicks off with global gains - Yahoo Finance",
    "fullText": "Stock markets mostly rose Friday, the first trading day of 2026, with London's benchmark FTSE 100 index reaching 10,000 points for the first time.The...",
    "link": "https://finance.yahoo.com/news/asia-stocks-bright-start-2026-045402256.html"
  },
  {
    "text": "Saudi warplanes strike UAE-backed separatists in southern Yemen - NBC News",
    "fullText": "Saudi warplanes have reportedly struck on Friday forces in southern Yemen backed by the United Arab Emirates, a separatist leader says.",
    "link": "https://www.nbcnews.com/world/yemen/saudi-warplanes-strike-uae-backed-separatists-southern-yemen-rcna251898"
  }
]