[
  {
    "text": "Times Square has a dazzling new ball for the New Year’s Eve drop — and it’s the biggest yet - CNN",
    "fullText": "It’s out with the old and in with the new in Times Square this year.",
    "link": "https://www.cnn.com/2025/12/31/style/times-square-new-ball-scli-intl"
  },
  {
    "text": "US stocks are set for a third-straight year of stellar gains - CNN",
    "fullText": "The US stock market is about to achieve something so rare that it’s only happened five times since the 1940s: three consecutive years of double-digit gains.",
    "link": "https://www.cnn.com/2025/12/31/investing/year-gains-us-stock-market"
  },
  {
    "text": "Thailand releases 18 Cambodian soldiers as ceasefire holds - Al Jazeera",
    "fullText": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
    "link": "https://www.aljazeera.com/news/2025/12/31/thailand-releases-18-cambodian-soldiers-as-ceasefire-holds"
  },
  {
    "text": "The phone is dead. Long live . . . what exactly? - TechCrunch",
    "fullText": "\"We're not going to be using iPhones in 10 years,\" Callaghan says flatly. \"I kind of don't think we'll be using them in five years.\"",
    "link": "https://techcrunch.com/2025/12/30/the-phone-is-dead-long-live-what-exactly/"
  },
  {
    "text": "Trump administration says it's freezing child care funds to Minnesota after series of fraud schemes - AP News",
    "fullText": "The Trump administration has announced that it is freezing child care funds to Minnesota after a series of fraud schemes in recent years. Deputy Secretary of Health and Human Services Jim O’Neill said on the social platform X on Tuesday that the move is in re…",
    "link": "https://apnews.com/article/minnesota-child-care-funds-fraud-b511941de10f02fbb7349eff6738f748"
  },
  {
    "text": "Congressional Bill H.R. 504 Vetoed - The White House (.gov)",
    "fullText": "I am returning herewith without my approval H.R. 504, the Miccosukee Reserved Area Amendments Act.  The subject of this bill is a specific area in",
    "link": "https://www.whitehouse.gov/briefings-statements/2025/12/congressional-bill-h-r-504-vetoed/"
  },
  {
    "text": "Lucas: FSU Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the ACC opener.",
    "link": "https://goheels.com/news/2025/12/30/mens-basketball-lucas-fsu-rapid-reactions"
  },
  {
    "text": "Guinea elections: Gen Mamady Doumbouya wins controversial election - BBC",
    "fullText": "The victory, which gives the junta leader a seven-year mandate, was widely expected.",
    "link": "https://www.bbc.com/news/articles/cx2520nyp8yo"
  },
  {
    "text": "GTA 6, Resident Evil 9, AI and EA: Gaming trends to watch in 2026 - BBC",
    "fullText": "Next year could be hugely significant for video games - here are the big things to keep an eye on.",
    "link": "https://www.bbc.com/news/articles/cg5mennm6p2o"
  },
  {
    "text": "Asia-Pacific markets open lower in year-end trade - CNBC",
    "fullText": "Asia-Pacific markets were poised for modest gains on the holiday-shortened and final trading day of the year.",
    "link": "https://www.cnbc.com/2025/12/31/asia-pacific-markets-hang-seng-index-nifty-50-csi-300.html"
  },
  {
    "text": "Tyler Perry’s Legal Troubles May Just Be Starting - The Hollywood Reporter",
    "fullText": "Two sexual assault lawsuits have claimed Perry has abused actors looking for opportunities in Hollywood. The mogul's lawyer denies the accounts and calls them \"a $77 million money grab scam.\"",
    "link": "http://www.hollywoodreporter.com/news/general-news/tyler-perry-legal-battle-lawsuits-1236461300/"
  },
  {
    "text": "Projected Lineup: December 30 at Pittsburgh - NHL.com",
    "fullText": "Andersen likely to make his 16th start of the season",
    "link": "https://www.nhl.com/hurricanes/news/projected-lineup-december-30-at-pittsburgh"
  },
  {
    "text": "3 found dead during search for fallen hiker in California, authorities say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/3-hikers-found-dead-search-rescue-effort-mount/story?id\\\\u003d128787732"
  },
  {
    "text": "Flu cases are surging and rates will likely get worse, new CDC data shows - NPR",
    "fullText": "Flu season is off to a rough start this year, according to new CDC data. The virus is spreading faster than in previous years and the surge is likely to get worse. Here's what you need to know.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/30/nx-s1-5661508/flu-cdc-health"
  },
  {
    "text": "Disney to pay $10m over alleged children's privacy law violations - BBC",
    "fullText": "Regulators accused Disney of failing to properly label kids' videos uploaded to YouYube, allowing for data collection and targeted advertising.",
    "link": "https://www.bbc.com/news/articles/crrnl94lq5vo"
  },
  {
    "text": "Superbug hits 27 states: Here’s where the deadly fungus is spreading - Yahoo News Canada",
    "fullText": "Hospitals, nursing homes and other medical facilities are struggling to gain ground on a drug-resistant and deadly fungus that has infected at least 7,000 people in 2025, according to tracking by the Centers for Disease Control and Prevention.",
    "link": "https://thehill.com/homenews/5666816-superbug-hits-27-states-heres-where-the-deadly-fungus-is-spreading/"
  },
  {
    "text": "Shocking Orange Bowl Ticket Prices Days Before Oregon vs. Texas Tech - Sports Illustrated",
    "fullText": "The No. 5 Oregon Ducks and No. 4 Texas Tech Red Raiders will face off in the College Football Playoff quarterfinals. The Orange Bowl will take place at Hard Rock Stadium in Miami Gardens, Florida, and the ticket prices are trending down ahead of the game.",
    "link": "https://www.si.com/college/oregon/football/shocking-orange-bowl-ticket-prices-oregon-ducks-texas-tech-red-raiders-playoff-matchup"
  },
  {
    "text": "Artemis 2 moon astronauts rehearse for launch day (photos) - Space",
    "fullText": "NASA's first crewed lunar mission in more than 50 years moved one step closer to liftoff recently with a full launch day dress rehearsal in Florida.",
    "link": "https://www.space.com/space-exploration/artemis/artemis-2-moon-astronauts-rehearse-for-launch-day-photos"
  },
  {
    "text": "Protests spread across Iran for third day after currency hits record low - BBC",
    "fullText": "The Iranian rial hit a record low against the US dollar on Sunday, prompting shopkeepers in Tehran to stage protests, which have quickly spread.",
    "link": "https://www.bbc.com/news/articles/cqj2llkjv8vo"
  },
  {
    "text": "A 2025 Year in Review Retrospective from the World of Pokémon - Pokemon.com",
    "fullText": "This past year was filled with all sorts of Pokémon fun! How many of these moments do you remember?",
    "link": "https://www.pokemon.com/us/pokemon-news/a-2025-year-in-review-retrospective-from-the-world-of-pokemon"
  }
]