[
  {
    "text": "Trump orders Chinese-controlled firm to unwind chip asset deal, citing national security risks - CNBC",
    "fullText": "A Chinese-controlled company must divest semiconductor assets it bought from Emcore after the White House said the deal could threaten U.S. national security.",
    "link": "https://www.cnbc.com/2026/01/03/trump-orders-unwind-chinese-chip-acquisition-emcore-hiefo-emcore-velocity-one-navgiation-gyro.html"
  },
  {
    "text": "Explosions and low-flying aircraft are heard in Venezuelan capital of Caracas - CBS News",
    "fullText": "At least seven explosions and the sound of low-flying aircraft have been heard in Venezuela's capital, Caracas.",
    "link": "https://www.cbsnews.com/news/venezuela-explosions-heard-caracas/"
  },
  {
    "text": "Winter Classic ‘awesome event’ for Panthers despite loss to Rangers - NHL.com",
    "fullText": "Open roof, snow help make for spectacular scene in Miami",
    "link": "https://www.nhl.com/news/winter-classic-awesome-event-for-panthers-despite-loss"
  },
  {
    "text": "What to know about the Ukrainian general picked by Zelenskyy to be his new chief of staff - ABC News",
    "fullText": "Ukrainian President Volodymyr Zelenskyy has announced Gen. Kyrylo Budanov, the head of the country’s military intelligence service, as his new chief of staff",
    "link": "https://abcnews.go.com/International/wireStory/ukrainian-general-picked-zelenskyy-new-chief-staff-128860283"
  },
  {
    "text": "Elon Musk's Grok under fire for generating explicit AI images of minors - Axios",
    "fullText": "One user asked Grok to remove clothing from an image of a 14-year-old \"Stranger Things\" actress.",
    "link": "https://www.axios.com/2026/01/02/elon-musk-grok-ai-child-abuse-images-stranger-things"
  },
  {
    "text": "Strong earthquake shakes Mexico's independence monument, hits roads and hospitals - KSL.com",
    "fullText": "A powerful earthquake shook southern Mexico on Friday morning, damaging roads and hospitals and ​briefly interrupting President Claudia Sheinbaum's first press conference of the new year.",
    "link": "https://www.ksl.com/article/51426686/strong-earthquake-shakes-mexicos-independence-monument-hits-roads-and-hospitals"
  },
  {
    "text": "Victoria Jones, daughter of Tommy Lee Jones, found dead in hotel on New Year's Day - NBC News",
    "fullText": "The daughter of Academy Award-winning actor Tommy Lee Jones has died, her family acknowledged in a statement on Friday night.",
    "link": "https://www.nbcnews.com/pop-culture/celebrity/victoria-jones-daughter-tommy-lee-jones-found-dead-hotel-new-years-day-rcna251896"
  },
  {
    "text": "Bucks 122-121 Hornets (Jan 2, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810336"
  },
  {
    "text": "What weather forecast for 49ers-Seahawks on Saturday has in store for Brock Purdy - San Francisco Chronicle",
    "fullText": "In what figures to be a welcome forecast for the San Francisco 49ers and quarterback Brock Purdy, the weather in Santa Clara on Saturday might not be too messy.",
    "link": "https://www.sfchronicle.com/sports/49ers/article/weather-forecast-49ers-vs-seahawks-brock-purdy-21273692.php"
  },
  {
    "text": "NYT Connections hints and answers for January 3, Tips to solve 'Connections' #937. - Mashable",
    "fullText": "Everything you need to solve 'Connections' #937.",
    "link": "https://mashable.com/article/nyt-connections-hint-answer-today-january-3-2026"
  },
  {
    "text": "SpaceX launches Italian Earth-observing satellite to orbit on the 1st mission of 2026 - Space",
    "fullText": "Liftoff of the COSMO-SkyMed Second Generation mission occurred on schedule at 9:09 p.m. ET tonight (Jan. 2).",
    "link": "https://www.space.com/space-exploration/private-spaceflight/spacex-cosmo-skymed-second-generation-falcon-9-launch"
  },
  {
    "text": "DHS hypes worksite enforcement as fraud allegations rip through Minnesota - Axios",
    "fullText": "Sec. Noem says there's \"more coming\" as ICE focuses on businesses.",
    "link": "https://www.axios.com/2026/01/02/dhs-noem-minnesota-fraud"
  },
  {
    "text": "Yemen’s separatists announce a constitution for an independent south - AP News",
    "fullText": "Yemen’s separatist movement has announced a constitution for an independent nation in the south and demanded other factions in the war-torn country accept the move. The announcement Friday marked an escalation of a confrontation that has pitted Gulf powerhous…",
    "link": "https://apnews.com/article/yemen-saudi-arabia-uae-aden-hadramout-stc-47430060997b893492a4770841a6eab1"
  },
  {
    "text": "Zohran Mamdani's first full day as NYC mayor: subway rides, new offices and backlash from Israel - AP News",
    "fullText": "Zohran Mamdani, New York City's new mayor, begins his term with a symbolic commute. On Friday, he traveled from his Queens apartment to City Hall, engaging with commuters and emphasizing his connection to everyday New Yorkers. Mamdani, a democratic socialist,…",
    "link": "https://apnews.com/article/zohran-mamdani-inauguration-e01bb2e7be86002b3423f843f0a6ea20"
  },
  {
    "text": "Is Trump taking too much aspirin? Here's what experts say - NPR",
    "fullText": "Trump takes four times the recommended dose of aspirin for cardiac prevention. Even low-dose aspirin is no longer recommended for people over 60 who don't have heart disease.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/02/nx-s1-5665112/trump-aspirin-325-81-mg-low-dose-cardiac-stroke-heart-attack-bleeding"
  },
  {
    "text": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Sugar-recap.aspx"
  },
  {
    "text": "California's open carry gun ban unconstitutional, federal court rules - Axios",
    "fullText": "The court ruled that openly carrying guns is \"part of this Nation's history and tradition.\"",
    "link": "https://www.axios.com/2026/01/02/california-guns-open-carry-ban-unconstitutional"
  },
  {
    "text": "Anthrax nearly kills healthy 18-year-old welder amid puzzling pattern - Ars Technica",
    "fullText": "Welder's Anthrax\" was first coined in 2022, when seven cases had been identified.",
    "link": "https://arstechnica.com/health/2026/01/anthrax-nearly-kills-healthy-18-year-old-welder-amid-puzzling-pattern/"
  },
  {
    "text": "Ohio police seek suspect after dentist and his wife found shot to death at home - CBS News",
    "fullText": "Officers in Columbus, Ohio, were dispatched to the couple's home on the morning Dec. 30 for a welfare check and found them dead at the scene.",
    "link": "https://www.cbsnews.com/news/columbus-ohio-dentist-shot-killed-spencer-tepe-wife-monique/"
  }
]