[
  {
    "text": "José María Balcázar becomes Peru’s eighth president in a decade - Associated Press News",
    "fullText": "José María Balcázar has become Peru's new interim president, replacing another interim leader who was removed over corruption allegations just four months into his term. Balcázar was elected late Wednesday with a majority in the 130-member legislature, defeat…",
    "link": "https://apnews.com/article/peru-president-congress-interim-election-c6f1e2d6c061ea8ba1cb0f4f467609bc"
  },
  {
    "text": "3 takeaways from BYU’s loss at No. 4 Arizona - Deseret News",
    "fullText": "The Cougars couldn’t topple No. 4 Arizona, with the shorthanded Wildcats scoring a 75-68 victory Wednesday night at McKale Center in Tucson.",
    "link": "https://www.deseret.com/sports/2026/02/18/byu-basketball-loses-against-arizona-mckale-center-3-takeaways/"
  },
  {
    "text": "Bowser declares Potomac sewage spill an emergency, seeks federal aid for cleanup - The Washington Post",
    "fullText": "The administration of D.C. Mayor Muriel E. Bowser hopes the move will free up federal funds to reimburse local authorities for repair and recovery costs.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/02/18/potomac-sewage-spill-emergency-dc-order/"
  },
  {
    "text": "Trump administration gives ICE broader powers to detain legal refugees, citing security concerns - CBS News",
    "fullText": "The Trump administration has given ICE the authority to detain refugees who entered the U.S. lawfully but don't have green cards yet, part of a bid to scrutinize the legal immigration system, according to a government memo obtained by CBS News.",
    "link": "https://www.cbsnews.com/news/trump-administration-gives-ice-broader-powers-to-detain-legal-refugees-citing-security-concerns/"
  },
  {
    "text": "Bernie Sanders and Gavin Newsom become adversaries over push to tax California billionaires - Associated Press News",
    "fullText": "Bernie Sanders has traveled to Los Angeles to kick off a campaign for a proposed “billionaires tax” that has set off an uproar in the Silicon Valley and led to divisions among Democrats. Sanders said at a rally that passage of the tax would show “the billiona…",
    "link": "https://apnews.com/article/california-billionaires-bernie-sanders-gavin-newsom-democrats-87a1e54f463aad49a2093382969e5cca"
  },
  {
    "text": "OpenAI Funding on Track to Top $100 Billion With Latest Round - Bloomberg",
    "fullText": null,
    "link": "https://www.bloomberg.com/news/articles/2026-02-19/openai-funding-on-track-to-top-100-billion-with-latest-round"
  },
  {
    "text": "Trump meets with top Iran advisers as war threat grows - Axios",
    "fullText": "The Trump administration is closer to a major war in the Middle East than most Americans realize.",
    "link": "https://www.axios.com/2026/02/18/trump-iran-meeting-military-strike"
  },
  {
    "text": "US to withdraw troops from Syria amid Iran tensions - BBC",
    "fullText": "The decision came as US President Donald Trump ramps up military presence in the Middle East as tensions mount with Iran.",
    "link": "https://www.bbc.com/news/articles/c875pey8vy2o"
  },
  {
    "text": "Boeing defense headquarters to return to St. Louis after leaving the area in 2017 - STLPR",
    "fullText": "Boeing announced on Wednesday that its security headquarters will return to the St. Louis region from Arlington, Virginia, after moving away in 2017.",
    "link": "https://www.stlpr.org/economy-business/2026-02-18/boeing-defense-headquarters-return-st-louis"
  },
  {
    "text": "Nancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos made a plea Tuesday to the suspect in Nancy Guthrie’s disappearance, urging the individual to “just let her go.” He added that the investigation continues to be a rescue operation and not a recovery mission.",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-18-live-updates"
  },
  {
    "text": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "fullText": "Cardiologists share the important advice they give patients that you can also incorporate into your daily routine.",
    "link": "https://www.aol.com/articles/cardiologists-share-6-surprising-lifestyle-140000687.html"
  },
  {
    "text": "Minnesota weather: 2 to 3 feet of snow on North Shore; significant accumulations in the Twin Cities - MPR News",
    "fullText": "Prolific snowfall totals fell along Lake Superior’s North Shore region. Highs winds gusted to over 60 mph.",
    "link": "https://www.mprnews.org/story/2026/02/18/2-to-3-feet-of-snow-on-north-shore-significant-accumulations-in-the-twin-cities"
  },
  {
    "text": "Warner Sale’s Impact on Theaters Is Probed by Justice Department - Bloomberg.com",
    "fullText": "The US Justice Department has summoned some of the country’s largest theater chains to private conversations about the potential impact of a sale of Warner Bros. Discovery Inc., according to people familiar with the matter.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-18/warner-sale-s-impact-on-theaters-is-probed-by-justice-department"
  },
  {
    "text": "Neon, Oscar-Winning Studio Behind ‘Parasite’ and ‘Anora,’ in Talks to Sell Stake to Department M (EXCLUSIVE) - Variety",
    "fullText": "Neon, the Oscar-winning studio behind 'Parasite' and 'Anora,' has sold a stake to Department M.",
    "link": "https://variety.com/2026/film/news/neon-studio-parasite-anora-selling-stake-department-m-1236666837/"
  },
  {
    "text": "For Alysa Liu, competition is just 'pure enjoyment' - NBC Olympics",
    "fullText": "The U.S. women's figure skaters, known as the \"Blade Angels\" reflect on their uneven short program outing, with renewed focus for the free skate — where ,\"you never know what is going to happen,”",
    "link": "https://www.nbcolympics.com/news/alysa-liu-competition-just-pure-enjoyment"
  },
  {
    "text": "Who Will Be Next to Headline the Sphere? We Make Our Educated Guess - Rolling Stone",
    "fullText": "The people who run the Las Vegas Sphere keep their plans secret, but we're still speculating about Metallica, Tool, and others who may perform there.",
    "link": "http://www.rollingstone.com/music/music-features/sphere-las-vegas-metallica-tool-roger-waters-1235518839/"
  },
  {
    "text": "Highland High reports over a week of measles exposure as Utah reaches 300 cases - KSL News",
    "fullText": "Highland High students could have been exposed to measles for more than a week as an infectious student attended school, and the Utah outbreak has reached 300 infections.",
    "link": "https://www.ksl.com/article/51449754/highland-high-reports-over-a-week-of-measles-exposure-as-utah-reaches-300-cases"
  },
  {
    "text": "What we learned from Day 1 of the second Bahrain test - Formula 1",
    "fullText": "F1.com's Lawrence Barretto looks back on the opening day of the second official 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-1-of-the-second-2026-pre-season-test-in-bahrain.7Gt63jOARM2yPHXsSqyMCs"
  }
]