[
  {
    "text": "Trump slams justices after Supreme Court strikes down most of his tariffs - The Washington Post",
    "fullText": "The ruling deals a major blow to the president’s signature economic policy and represents a stinging political setback.",
    "link": "https://www.washingtonpost.com/politics/2026/02/20/trump-tariffs-supreme-court-decision/"
  },
  {
    "text": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates - 6abc Philadelphia",
    "fullText": "A Winter Storm Watch will go into effect on Sunday for a system that could bring snow to our area well into Monday.",
    "link": "https://6abc.com/live-updates/winter-storm-set-bring-foot-snow-parts-philadelphia-region-live-updates/18625971/"
  },
  {
    "text": "A Galaxy Composed Almost Entirely of Dark Matter Has Been Confirmed - WIRED",
    "fullText": "What scientists thought were four separate star clusters are actually part of one nearly invisible system.",
    "link": "https://www.wired.com/story/a-galaxy-composed-almost-entirely-of-dark-matter-has-been-confirmed/"
  },
  {
    "text": "WWE SmackDown Spoiler Lineup for February 20, 2026: Full Match Card and Backstage Notes Revealed - Ringside News",
    "fullText": "WWE SmackDown is set to deliver an exciting night of action on February 20, 2026 with a lineup featuring thrilling matches and intense rivalries. Fans can",
    "link": "https://www.ringsidenews.com/wwe-smackdown-spoiler-lineup-for-february-20-2026-full-match-card-and-backstage-notes-revealed/"
  },
  {
    "text": "Trump says he is considering limited military strike on Iran - BBC",
    "fullText": "Trump's new threat came a day after he appeared to give Iran about 10 days to agree to a deal to curb its nuclear programme.",
    "link": "https://www.bbc.com/news/articles/cdxzk4gvzp0o"
  },
  {
    "text": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show - CBS News",
    "fullText": "A major nor'easter could bring blizzard conditions to Boston at the end of the weekend, the latest weather forecast shows.",
    "link": "https://www.cbsnews.com/boston/news/boston-weather-snow-blizzard-maps/"
  },
  {
    "text": "Trump adminstration rolls back mercury rules for coal-fired power plants - The Allegheny Front",
    "fullText": "The rule for mercury emissions from coal-fired power plants will be rolled back to a 2012 standard. Mercury is a neurotoxin.",
    "link": "https://www.alleghenyfront.org/trump-mercury-standard-coal-fired-power-plants-rollback/"
  },
  {
    "text": "2026 draft: Ten debate-worthy prospects to track at the NFL combine - NFL.com",
    "fullText": "With the NFL combine around the corner, Bucky Brooks dissects 10 prospects who are sure to inspire debate heading into the 2026 draft.",
    "link": "https://www.nfl.com/news/2026-draft-ten-debate-worthy-prospects-to-track-at-the-nfl-combine"
  },
  {
    "text": "Nuggets play Trail Blazers on back-to-back - NBA",
    "fullText": "Denver wraps up its 12th back-to-back of the season. They're 7-4 on the second night of a back-to-back, winning three of their last four \"no rest\" games.",
    "link": "https://nuggets.com/news/nuggets-play-trail-blazers-on-back-to-back"
  },
  {
    "text": "Multiple people at state wrestling tournament diagnosed with measles as it spreads in Utah - KSL News",
    "fullText": "Utah health officials say cases of measles are spreading to new areas in Utah, particularly in schools and at extracurricular events like a recent state wrestling tournament.",
    "link": "https://www.ksl.com/article/51451348/multiple-people-at-state-wrestling-tournament-diagnosed-with-measles-as-it-spreads-in-utah"
  },
  {
    "text": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "fullText": "In a new video of Punch, the baby monkey is dragged around in circles by an adult monkey, upsetting animal lovers around the globe. The zoo explains.",
    "link": "https://www.usatoday.com/story/news/world/2026/02/20/punch-baby-monkey-update-attacked-video-japan-zoo/88776501007/"
  },
  {
    "text": "Germany's Nolte, Buckwitz lead USA's Humphries at two-woman bobsled midpoint - NBC Olympics",
    "fullText": "Kaillie Humphries went fastest after Run 1 of the two-woman bobsled event on Friday, but will enter the second day of competition in 3rd place.",
    "link": "https://www.nbcolympics.com/news/germanys-nolte-buckwitz-lead-usas-humphries-two-woman-bobsled-midpoint"
  },
  {
    "text": "Americans Are Reacting To South Korea's Ex-President Being Jailed For Insurrection - BuzzFeed",
    "fullText": "\"Must be nice.\"",
    "link": "https://www.buzzfeed.com/michaelabramwell/americans-react-to-ex-south-korean-president-jailed"
  },
  {
    "text": "See where snow could be measured in inches — or feet — in the East this weekend - The Washington Post",
    "fullText": "A strong nor’easter is expected to form near the Mid-Atlantic coast on Sunday, threatening to bring accumulating snow, strong winds and travel disruptions.",
    "link": "https://www.washingtonpost.com/weather/2026/02/20/noreaster-snow-forecast-midatlantic-northeast/"
  },
  {
    "text": "Mark Zuckerberg’s entourage threatened with contempt for wearing Meta AI glasses into a no-recording courtroom - Yahoo",
    "fullText": "“This is very serious,” Judge Carolyn B. Kuhl said in response to the apparent product placement stunt.",
    "link": "https://www.yahoo.com/news/articles/mark-zuckerberg-entourage-threatened-contempt-172703928.html"
  },
  {
    "text": "Bounty Pack 2 Vault Card - Borderlands | Official Website",
    "fullText": "Venture into the heart of the mountains in this paid DLC coming February 26.",
    "link": "https://borderlands.2k.com/borderlands-4/news/bounty-pack-2/"
  },
  {
    "text": "Facing a mental health crisis, an NJ school pulled a beloved novel from English class - NPR",
    "fullText": "Junot Díaz's The Brief Wondrous Life of Oscar Wao was removed from an English class at the public school. PEN America says it's part of a trend of scrubbing literature dealing with uncomfortable topics.",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5708741/junot-diaz-oscar-wao-mental-health-book-bans"
  },
  {
    "text": "Author and philanthropist Anna Murdoch-Mann dies at 81 - New York Post",
    "fullText": "Anna Murdoch-Mann, 81, passed away Tuesday, February 17 — surrounded by family — at her home in Palm Beach.",
    "link": "https://nypost.com/2026/02/20/world-news/author-and-philanthropist-anna-murdoch-mann-dies-at-81/"
  }
]