[
  {
    "text": "Foods with healthy-sounding buzzwords could be hiding added sugar in plain sight - NBC News",
    "fullText": "Many consumers feel pride in avoiding the glazed pastries in the supermarket and instead opting for “all natural” granola that comes packed with extra protein.",
    "link": "https://www.nbcnews.com/health/health-news/foods-hiding-added-sugar-rcna251215"
  },
  {
    "text": "Picks And Predictions For Week 17 vs. the Carolina Panthers - Seattle Seahawks",
    "fullText": "The Seattle Seahawks face the Panthers on December 28 at Bank of America Stadium as part of Week 17 of the 2025 season. Kickoff is set for 10:00 a.m. PT. Here’s what local and national media are predicting:",
    "link": "https://www.seahawks.com/news/picks-and-predictions-for-week-17-vs-the-carolina-panthers"
  },
  {
    "text": "Netanyahu’s ties with Trump to be tested amid differences ahead of visit - The Washington Post",
    "fullText": "With the Israeli leader to visit Mar-a-Lago on Monday, his hawkishness on Gaza and other Middle East hotspots is butting up against Trump’s peacemaking efforts.",
    "link": "https://www.washingtonpost.com/world/2025/12/28/netanyahu-trump-gaza-iran-lebanon/"
  },
  {
    "text": "Funeral Services Planned for President Jeffrey R. Holland - newsroom.churchofjesuschrist.org",
    "fullText": "Funeral services for President Jeffrey R. Holland of the Quorum of the Twelve Apostles of The Church of Jesus Christ of Latter-day Saints will be held in the Tabernacle on Temple Square on Wednesday, December 31, 2025.",
    "link": "https://newsroom.churchofjesuschrist.org/article/funeral-services-planned-for-president-jeffrey-r-holland"
  },
  {
    "text": "Dad uses parental control software to find kidnapped daughter: Police - NewsNation",
    "fullText": "The father became concerned Thursday when the 15-year-old girl took her dog for a walk and did not return at her usual time.",
    "link": "https://www.newsnationnow.com/crime/phone-controls-rescue-daughter-texas/"
  },
  {
    "text": "Brigitte Bardot, French femme fatale and cultural phenomenon, dies at 91 - The Washington Post",
    "fullText": "The actress and singer was a symbol of sexual revolution. She later became an animal-welfare campaigner and incendiary right-wing commenter.",
    "link": "https://www.washingtonpost.com/obituaries/2025/12/28/brigitte-bardot-dead/"
  },
  {
    "text": "How much snow from winter storm 12/26/25: Snowfall totals from NYC, NY, NJ and CT - ABC7 New York",
    "fullText": "Here's a look at updated snowfall totals from a powerful winter storm blanketing the Tri-State area Friday evening into Saturday morning.",
    "link": "https://abc7ny.com/post/how-snow-winter-storm-122625-snowfall-totals-nyc-ny-nj-ct/18321079/"
  },
  {
    "text": "Myanmar holds first election since military seized power but critics say the vote is a sham - AP News",
    "fullText": "Voters in Myanmar have voted in the first phase of the country’s general election. The polls are being held under military rule amid a civil war. Final results will not be known until after two more rounds of voting are completed in January. The first phase w…",
    "link": "https://apnews.com/article/myanmar-election-yangon-suu-kyi-hlaing-military-f361d4962d30b9c5c4741110bb1271ef"
  },
  {
    "text": "New York subway ends its MetroCard era and switches fully to tap-and-go fares - ABC News",
    "fullText": "The New York City transit system is retiring the MetroCard after more than 30 years",
    "link": "https://abcnews.go.com/US/wireStory/new-york-subway-ends-metrocard-era-switches-fully-128731205"
  },
  {
    "text": "‘Things I think’ before Giants, Raiders battle for chance at No. 1 pick - Big Blue View",
    "fullText": "Some things to think about before Sunday afternoon’s ‘Tank Bowl.’",
    "link": "https://www.bigblueview.com/new-york-giants-analysis/149849/nfl-week-17-preview-jaxson-dart-narratives-no-1-pick-joe-schoen-status"
  },
  {
    "text": "Restaurants' hottest menu item in 2025 was 'value.' That won't change next year - CNBC",
    "fullText": "Restaurant chains bet on value in 2025, and they're not likely to ditch the strategy next year.",
    "link": "https://www.cnbc.com/2025/12/28/value-meals-restaurants-mcdonalds-chilis-taco-bell.html"
  },
  {
    "text": "Britain Pushed Ahead With Green Power. Its Grid Can’t Handle It. - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/business/energy-oil/britain-pushed-ahead-with-green-power-its-grid-cant-handle-it-b674c413"
  },
  {
    "text": "Week 17 NFL straight up, against the spread, and survivor pool picks: Sunday edition - PhillyVoice",
    "fullText": "Look for the Raiders to win the No. 1 overall pick by losing to the Giants, and for the Bucs and Panthers to set the stage for a Week 18 showdown to decide the NFC South.",
    "link": "https://www.phillyvoice.com/week-17-nfl-straight-against-spread-and-survivor-pool-picks-sunday-edition/"
  },
  {
    "text": "New winter storm heads for Midwest, Northeast with 40 million people on alert - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/new-winter-storm-heads-midwest-northeast-40-million/story?id\\\\u003d128730117"
  },
  {
    "text": "Thai and Cambodian top diplomats meet in China to solidify ceasefire - ABC News",
    "fullText": "Top diplomats from Thailand and Cambodia have begun talks in China to address their border dispute",
    "link": "https://abcnews.go.com/International/wireStory/thai-cambodian-top-diplomats-meet-china-solidify-ceasefire-128730021"
  },
  {
    "text": "Iran in ‘all-out war’ with US, Europe and Israel, says president - Financial Times",
    "fullText": "Pezeshkian warns that Iran’s military forces are ‘more prepared’ than ever",
    "link": "https://www.ft.com/content/901dd070-aef6-4139-8a3f-94ffdc9d0829"
  },
  {
    "text": "For Ukrainians, a nuclear missile museum is a bitter reminder of what the country gave up - NPR",
    "fullText": "The Museum of Strategic Missile Forces tells the story of how Ukraine dismantled its nuclear weapons arsenal after independence in 1991. Today many Ukrainians believe that decision to give up nukes was a mistake.",
    "link": "https://www.npr.org/2025/12/28/g-s1-103485/ukraine-museum-strategic-missile-forces-budapest-agreement"
  },
  {
    "text": "How to watch New England Patriots vs. New York Jets game in Week 17 of the NFL schedule - CBS News",
    "fullText": "The Patriots and Jets play Sunday as New England eyes a potential AFC East title.",
    "link": "https://www.cbsnews.com/boston/news/how-to-watch-new-england-patriots-new-york-jets-game-today-week-17-nfl-schedule/"
  },
  {
    "text": "Mercury: The planet that shouldn't exist - BBC",
    "fullText": "Mercury has long baffled astronomers because it defies much of what we know about planet formation. A new space mission arriving in 2026 might solve the mystery.",
    "link": "https://www.bbc.com/future/article/20251223-mercury-the-planet-that-shouldnt-exist"
  },
  {
    "text": "Spadaro: A six-pack of storylines to follow at Bills - Philadelphia Eagles",
    "fullText": "How will the Eagles contend with the NFL's reigning MVP? What insight do new Eagles who played Buffalo earlier this year offer? How will the weather factor into the game plan?",
    "link": "https://www.philadelphiaeagles.com/news/eagles-bills-game-previews-dave-spadaro-week-17-storylines-nfl"
  }
]