[
  {
    "text": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
    "fullText": "A number of prominent figures have stepped down or are facing investigations after their communications with Jeffrey Epstein and his former longtime companion, Ghislaine Maxwell, were released last month.",
    "link": "https://www.washingtonpost.com/politics/2026/02/17/epstein-files-resignations-investigations/"
  },
  {
    "text": "Stock Market Today: Dow, S&P 500 and Nasdaq set to retreat as tech stocks continue to reel - MarketWatch",
    "fullText": "Stocks are mixed early Tuesday as investors return from a three-day break.",
    "link": "https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p-500-and-nasdaq-set-to-retreat-as-tech-stocks-continue-to-reel"
  },
  {
    "text": "2026 NFL franchise tag window opens today - NFL.com",
    "fullText": "The NFL's 2026 franchise tag window opens Feb. 17 and runs through March 3. What does that mean for players headed to free agency?",
    "link": "https://www.nfl.com/news/2026-nfl-franchise-tag-window-opens-today"
  },
  {
    "text": "Measles Outbreaks Are Increasingly Common. Here’s What You Need to Know. - Slate",
    "fullText": "Babies normally don’t get the measles vaccine until they’re a year old. But you can ask for it sooner!",
    "link": "https://slate.com/technology/2026/02/measles-outbreaks-vaccines-babies-guide.html"
  },
  {
    "text": "Noem's use of Coast Guard resources strains her relationship with the military branch, sources say - NBC News",
    "fullText": "WASHINGTON — Homeland Security Secretary Kristi Noem’s relationship with U.S.",
    "link": "https://www.nbcnews.com/politics/immigration/noems-use-coast-guard-resources-strains-relationship-military-branch-s-rcna258904"
  },
  {
    "text": "Little-used ICE agreements with local police have exploded under Trump - NPR",
    "fullText": "Partnerships between ICE and local law enforcement agencies has expanded widely, under the second Trump administration, data analyzed by NPR shows.",
    "link": "https://www.npr.org/2026/02/17/nx-s1-5707449/local-police-immigration-cooperation-287g"
  },
  {
    "text": "Why Congress failed to reach an Obamacare deal - Politico",
    "fullText": "Lawmakers delayed negotiations despite a drumbeat of warnings. That was just the first problem.",
    "link": "https://www.politico.com/news/2026/02/17/inside-congress-failed-battle-to-keep-obamacare-premiums-from-skyrocketing-00781825"
  },
  {
    "text": "PH, US strengthen alliance to prevent conflict in West PH Sea - ABS-CBN",
    "fullText": "The Philippines and the United States on Monday strengthened their alliance to prevent maritime conflict in the West Philippine Sea (WPS), the US Embassy said, amid China’s continuing aggression in the disputed area.",
    "link": "https://www.abs-cbn.com/news/nation/2026/2/17/ph-us-strengthen-alliance-to-prevent-conflict-in-west-ph-sea-1250"
  },
  {
    "text": "Horoscope for Tuesday, February 17, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/17/horoscopes-today-tuesday-february-17-2026"
  },
  {
    "text": "Danaher closes in on nearly $10bn deal for medical device maker Masimo - Financial Times",
    "fullText": "Technology company known for pulse oximeters is in a long-running intellectual property dispute with Apple",
    "link": "https://www.ft.com/content/da25dd17-0e28-4ad1-bc38-a8be2ab88368"
  },
  {
    "text": "Modi Seizes AI Summit to Assert India’s Global Ambitions After Tough Year - Bloomberg.com",
    "fullText": "Six months ago, Indian Prime Minister Narendra Modi was fending off verbal attacks from US President Donald Trump, trying to regain the upper hand over Pakistan after an armed conflict, and facing questions about his economy’s prospects.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-17/modi-seizes-ai-summit-to-assert-india-s-global-ambitions-after-tough-year"
  },
  {
    "text": "Samsung Promotes New Feature Ahead Of Galaxy S26 Ultra Launch - Forbes",
    "fullText": "Ahead of Galaxy Unpacked and the launch of the Galaxy S26 Ultra, Samsung has teased a new feature that will help the new flagship stand out against the competition.",
    "link": "https://www.forbes.com/sites/ewanspence/2026/02/16/samsung-galaxy-s26-ultra-new-features-upgrade-privacy-display/"
  },
  {
    "text": "Adult with measles possibly exposed others in Fairfax County - WTOP",
    "fullText": "Health officials say a Northern Virginian with the measles may have exposed others to the virus in Fairfax County last week.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-possibly-exposed-others-in-fairfax-county/"
  },
  {
    "text": "Android getting new ‘local file backup’ feature via Google Drive - 9to5Google",
    "fullText": "According to new Google Play Services release notes, Android phones will be getting a “new local file backup feature” with Google Drive.",
    "link": "http://9to5google.com/2026/02/16/android-local-file-backup/"
  },
  {
    "text": "US increases military pressure on Iran ahead of high-stakes talks - CNN",
    "fullText": "The US military is continuing a significant buildup of air and naval assets in the Middle East ahead of planned talks with Iran in Geneva on Tuesday. The pieces are being moved into place both to intimidate Tehran and to have options to strike inside the coun…",
    "link": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure"
  },
  {
    "text": "Android Auto 16.3 update lands with traces of video apps, light theme - 9to5Google",
    "fullText": "Google has started rolling out Android Auto 16.3 through the beta track and while there are no major changes, there...",
    "link": "http://9to5google.com/2026/02/16/android-auto-16-3-update-lands-with-traces-of-video-apps-light-theme/"
  }
]