[
  {
    "text": "Johnson & Johnson strikes deal with U.S. government to lower drug prices - CNBC",
    "fullText": "Johnson & Johnson said on Thursday that it has reached an agreement with the U.S. President's administration to cut drug prices for Americans.",
    "link": "https://www.cnbc.com/2026/01/09/johnson-johnson-strikes-deal-with-us-government-to-lower-drug-prices.html"
  },
  {
    "text": "Michigan State 76-66 Northwestern (Jan 8, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401825428"
  },
  {
    "text": "Sarah Jessica Parker, Helen Mirren honored at Golden Eve celebration - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/sarah-jessica-parker-dame-helen-mirren-honored-golden-eve/story?id\\\\u003d128960856"
  },
  {
    "text": "Asia markets trade mixed ahead of China inflation data; Uniqlo owner shares jump 7% - CNBC",
    "fullText": "Asia-Pacific markets were set to trade higher Friday as investors parse China's inflation data coming out later in the day.",
    "link": "https://www.cnbc.com/2026/01/09/asia-pacific-markets-china-cpi-hang-seng-index-kospi-nikkei-225.html"
  },
  {
    "text": "'Tangled': Kathryn Hahn In Talks to Play Mother Gothel - Deadline",
    "fullText": "Kathryn Hahn is in talks to play Motehr Gothel in Disney's live-action remake of Tangled.",
    "link": "http://deadline.com/2026/01/tangled-kathryn-hahn-mother-gothel-1236676810/"
  },
  {
    "text": "17 Republicans vote to restore lapsed Obamacare subsidies - Politico",
    "fullText": "Democrats and moderate Republicans hope the bill's passage will put pressure on the Senate to come up a bipartisan compromise.",
    "link": "https://www.politico.com/news/2026/01/08/17-republicans-vote-to-restore-lapsed-obamacare-subsidies-00717497"
  },
  {
    "text": "First galaxy-wide wobbling black hole jet discovered in a disk galaxy - Phys.org",
    "fullText": "Astronomers using W. M. Keck Observatory on Maunakea, Hawaiʻi Island have uncovered the largest and most extended stream of super-heated gas ever observed flowing from a nearby galaxy, providing the clearest evidence yet that a supermassive black hole can dra…",
    "link": "https://phys.org/news/2026-01-galaxy-wide-black-hole-jet.html"
  },
  {
    "text": "Leaked test results from Galaxy S26 Ultra's new 60W charging fail to impress - GSMArena.com news - GSMArena.com",
    "fullText": "The outgoing S25 Ultra only supports 45W wired charging - 60W is the first upgrade on Samsung phones in a while. Internal testing has shown that Samsung...",
    "link": "https://www.gsmarena.com/leak_galaxy_s26_ultras_new_60w_charging_was_tested_results_fail_to_impress-news-71021.php"
  },
  {
    "text": "Buccaneers Make Changes to 2026 Coaching Staff - Tampa Bay Buccaneers",
    "fullText": "On Thursday, the Bucs parted ways with five assistant coaches, including Offensive Coordinator Josh Grizzard and Special Teams Coordinator Thomas McGaughey, while Tom Moore and Nick Rapone elected to retire",
    "link": "https://www.buccaneers.com/news/buccaneers-make-changes-2026-coaching-staff"
  },
  {
    "text": "French farmers force their way through Paris with tractors to protest free trade deal - abcnews.go.com",
    "fullText": "Dozens of angry farmers demonstrated in front of France’s lower house of parliament",
    "link": "https://abcnews.go.com/Business/wireStory/french-farmers-force-paris-tractors-protest-free-trade-129010284"
  },
  {
    "text": "Trump blasts 5 Republicans for war powers vote - PBS",
    "fullText": "President Donald Trump called their vote “stupidity” in a post to Truth social on Thursday.",
    "link": "https://www.pbs.org/newshour/politics/trump-blasts-5-republicans-for-war-powers-vote"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Establishes New Department of Justice Division for National Fraud Enforcement - The White House (.gov)",
    "fullText": "FIGHTING CRIMINAL FRAUD NATIONWIDE: Today, the Trump Administration is announcing the upcoming creation of the Department of Justice’s new division for",
    "link": "https://www.whitehouse.gov/fact-sheets/2026/01/fact-sheet-president-donald-j-trump-establishes-new-department-of-justice-division-for-national-fraud-enforcement/"
  },
  {
    "text": "Exclusive | Kevin Stefanski’s first Giants sit-down ‘went very well’ as coaching cycle revs up - New York Post",
    "fullText": "The Giants met with the the two-time Coach of the Year winner on Wednesday following his firing from the Browns.",
    "link": "https://nypost.com/2026/01/08/sports/how-kevin-stefanski-fared-in-first-giants-sit-down/"
  },
  {
    "text": "Manfred: MLB ready to step in for Main Street - ESPN",
    "fullText": "Major League Baseball is prepared to produce and distribute local broadcasts for teams whose telecasts are uncertain this season because of the financial problems of the FanDuel Sports Network regional networks.",
    "link": "https://www.espn.com/mlb/story/_/id/47551260/manfred-says-mlb-prepared-produce-distribute-local-broadcasts-fanduel-network-teams"
  },
  {
    "text": "The Official Website of Governor Phil Murphy - NJ.gov",
    "fullText": "The official website of the 56th Governor of New Jersey State, Phil Murphy.",
    "link": "https://www.nj.gov/governor/news/news/562026/approved/20260108a.shtml"
  },
  {
    "text": "Antarctica’s Oldest, Largest Iceberg Is Turning an Ominous Blue Color - Gizmodo",
    "fullText": "The iceberg could completely disintegrate within days or weeks, scientists say.",
    "link": "https://gizmodo.com/antarcticas-oldest-largest-iceberg-is-turning-an-ominous-blue-color-2000707527"
  },
  {
    "text": "Uvalde officer trial: Judge tosses testimony of key prosecution witness - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/uvalde-officer-trial-judge-tosses-testimony-key-prosecution/story?id\\\\u003d129016362"
  }
]