[
  {
    "text": "Despite 3 million files, Epstein release leaves big questions unanswered - The Washington Post",
    "fullText": "The members of Congress who wrote the law requiring disclosure of the files are still looking for explanations.",
    "link": "https://www.washingtonpost.com/politics/2026/02/03/epstein-file-release-unanswered-questions/"
  },
  {
    "text": "Satellite imagery shows where the U.S. military is positioned near Iran - The Washington Post",
    "fullText": "The scale of the buildup seems aimed at readying forces for expansive operations, analysts said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/03/trump-iran-military-equipment-strikes/"
  },
  {
    "text": "Stocks making the biggest moves premarket: Palantir Technologies, Merck, Pfizer & more - CNBC",
    "fullText": "These are the stocks posting the largest moves in early trading.",
    "link": "https://www.cnbc.com/2026/02/03/stocks-making-the-biggest-moves-premarket-pltr-mrk-pfe.html"
  },
  {
    "text": "Pfizer says obesity injection shows promise as monthly treatment in mid-stage trial - CNBC",
    "fullText": "The data on Pfizer's GLP-1 offer early evidence that the injection can be administered less frequently than existing drugs without sacrificing efficacy.",
    "link": "https://www.cnbc.com/2026/02/03/pfizers-monthly-obesity-injection-drove-shows-promise-in-trial.html"
  },
  {
    "text": "How a single tech heavyweight managed to pull the rug on gold and global markets - MarketWatch",
    "fullText": "Joachim Klement sees a worrying link between popular assets and one bad event",
    "link": "https://www.marketwatch.com/story/how-a-single-tech-heavyweight-managed-to-pull-the-rug-on-gold-and-global-markets-6c384fa2"
  },
  {
    "text": "Pfizer beats quarterly estimates despite Covid product decline, reaffirms modest outlook - CNBC",
    "fullText": "The pharmaceutical giant reaffirmed the modest 2026 outlook that rattled investors in December.",
    "link": "https://www.cnbc.com/2026/02/03/pfizer-pfe-earnings-q4-2025.html"
  },
  {
    "text": "Column | What science says we’ve been getting wrong about exercise - The Washington Post",
    "fullText": "Doctors and physiologists point to studies that show tiny, regular bursts of effort — like climbing a few stairs — can capture many of the benefits of the gym.",
    "link": "https://www.washingtonpost.com/health/2026/02/03/exercise-longevity-stairs-blue-zones/"
  },
  {
    "text": "Russia ends 'week-long pause' with major attack on Ukraine energy sites - BBC",
    "fullText": "The attack - which reportedly consisted of more than 70 missiles and 450 drones - comes after a so-called \"energy truce\" expired at the weekend.",
    "link": "https://www.bbc.com/news/articles/cpwng25114ro"
  },
  {
    "text": "PepsiCo earnings beat estimates as drinks sales pick up around the world - CNBC",
    "fullText": "PepsiCo reported fourth-quarter earnings and revenue that topped Wall Street's estimates.",
    "link": "https://www.cnbc.com/2026/02/03/pepsico-pep-q4-2025-earnings.html"
  },
  {
    "text": "19 Winter Olympic storylines we're watching (they're not just about sports) - NPR",
    "fullText": "The Winter Olympics promise plenty of high adrenaline, fierce competition, historic firsts and emotional moments over 2 1/2 weeks. Here are some of the names and narratives to keep an eye on.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5689901/2026-winter-olympics-preview"
  },
  {
    "text": "Trump prepares to let go of arms control with Russia - Politico",
    "fullText": "Russian and U.S. nuclear arsenals could expand for the first time in three decades.",
    "link": "https://www.politico.com/news/2026/02/03/the-last-us-nuclear-weapons-treaty-with-russia-is-dying-00761240"
  },
  {
    "text": "Android 16 QPR3: Pixel adds Adaptive Connectivity auto-switch, battery settings - 9to5Google",
    "fullText": "With Android 16 QPR3, Google is introducing more granular Adaptive Connectivity settings on Pixel phones...",
    "link": "http://9to5google.com/2026/02/02/pixel-adaptive-connectivity-settings/"
  },
  {
    "text": "Super Bowl Opening Night recap: Seahawks quip about Super Bowl XLIX ending and more - The Seattle Times",
    "fullText": "The Seahawks and Patriots officially kicked off Super Bowl week with Opening Night, which included \"Ham for Sam\" hats and Super Bowl XLIX jokes.",
    "link": "https://www.seattletimes.com/sports/seahawks/super-bowl-opening-night-seahawks-patriots-live-updates-news-notes/"
  },
  {
    "text": "Google Home gets the upgrade we've all been waiting for - Android Police",
    "fullText": "It's time to get physical",
    "link": "https://www.androidpolice.com/google-home-gets-the-upgrade-weve-all-been-waiting-for/"
  },
  {
    "text": "Populist conservative Laura Fernández wins Costa Rica's presidential election - NPR",
    "fullText": "Candidate Laura Fernández won a resounding victory, promising to continue the aggressive reorienting of the Central American nation's politics started by her predecessor.",
    "link": "https://www.npr.org/2026/02/02/g-s1-108418/costa-rica-election-laura-fernandez-wins"
  },
  {
    "text": "Two Major Segments Revealed for February 2 WWE RAW in Philadelphia - Ringside News",
    "fullText": "WWE has officially loaded up tonight’s episode of Monday Night RAW with some big names and brutal matchups—just days after the 2026 Royal Rumble shook the",
    "link": "https://www.ringsidenews.com/two-major-segments-revealed-february-2-wwe-raw-philadelphia/"
  },
  {
    "text": "Free HIV drugs save lives. Why one state is restricting access for thousands. - The Washington Post",
    "fullText": "An estimated 16,000 HIV and AIDS patients in Florida might lose free medication, health care as the state dramatically rolls back a decades-old program.",
    "link": "https://www.washingtonpost.com/health/2026/02/01/florida-hiv-adap-cuts/"
  },
  {
    "text": "Trump slashes tariffs on India after Modi agrees to stop buying Russian oil - CNN",
    "fullText": "President Donald Trump on Monday announced he would reduce tariffs on Indian goods in exchange for, among other things, a promise to stop buying Russian oil.",
    "link": "https://www.cnn.com/2026/02/02/business/india-russian-oil-trump-tariffs"
  }
]