[
  {
    "text": "Key participant in 2012 Benghazi attack has been brought to U.S. to face charges, DOJ says - NBC News",
    "fullText": "A key participant in the 2012 attack on a U.S. diplomatic mission in the Libyan city of Benghazi that killed four Americans has been taken into custody and is facing charges in the U.S., Justice Department officials said Friday.",
    "link": "https://www.nbcnews.com/politics/justice-department/justice-department-arrests-suspected-key-participant-2012-benghazi-att-rcna257782"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News - Forbes",
    "fullText": "A new Samsung Galaxy S26 Ultra delivery more disappointing battery news for the upcoming flagship.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/02/06/samsung-galaxy-s26-ultra-leak-battery-qi2/"
  },
  {
    "text": "Car crashes into LA grocery store; 3 dead, 2 critically injured: Officials - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/car-crashes-la-grocery-store-2-dead-hurt/story?id\\\\u003d129895789"
  },
  {
    "text": "Big Tech sees over $1 trillion wiped from stocks as fears of AI bubble ignite sell-off - CNBC",
    "fullText": "Fears over AI spending have sparked a sell-off among tech stocks.",
    "link": "https://www.cnbc.com/2026/02/06/ai-sell-off-stocks-amazon-oracle.html"
  },
  {
    "text": "'The hostility has been relentless': How Wuthering Heights became this year's most divisive film - BBC",
    "fullText": "Ever since it was announced, Emerald Fennell's version of the torrid Brontë classic has been the subject of furious online discourse over everything from its casting to its costumes.",
    "link": "https://www.bbc.com/culture/article/20260205-how-wuthering-heights-became-this-years-most-divisive-film"
  },
  {
    "text": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangs - NPR",
    "fullText": "In the documents, Homeland Security said the raid \"was based on intelligence that there were illegal aliens unlawfully occupying apartments.\" There is no mention of criminal gangs or Tren de Aragua.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5703603/court-records-chicago-immigration-raid-was-about-squatters-not-venezuelan-gangs"
  },
  {
    "text": "Steve Kornacki: Democratic primary season kicks off with an anti-establishment earthquake - NBC News",
    "fullText": "There’s no official winner yet, but the Democratic primary for the special election in New Jersey’s 11th Congressional District already amounts to a political earthquake in the state",
    "link": "https://www.nbcnews.com/politics/2026-election/steve-kornacki-new-jersey-primary-anti-establishment-earthquake-rcna257738"
  },
  {
    "text": "Minneapolis now has daily deportation flights. One man has been documenting them - NPR",
    "fullText": "A professional airplane enthusiast has been tracking the federally chartered deportation flights out of the Minneapolis airport as DHS sends immigration detainees to other states and, eventually, other countries.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5701432/minneapolis-ice-air-deportation-flights"
  },
  {
    "text": "House Republicans prepare full-court press for voting restrictions - Politico",
    "fullText": "The SAVE America Act, up for a vote next week in the House, has been a rare rallying point for a divided GOP.",
    "link": "https://www.politico.com/news/2026/02/06/house-save-act-vote-filibuster-00768499"
  },
  {
    "text": "The U.S. leads on day one of the figure skating team event. Here's how it works - NPR",
    "fullText": "The three-day event is a chance for the top 10 skating countries to bring home a medal — and for viewers to get acquainted with the sport's different disciplines and biggest names.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5702747/olympic-figure-skating-team-event"
  },
  {
    "text": "Ronald Hicks to be installed as 11th archbishop of New York - NPR",
    "fullText": "Ronald Hicks, a former Illinois bishop chosen by Pope Leo XIV to replace the retiring Cardinal Timothy Dolan, is set to be installed as New York's 11th archbishop",
    "link": "https://www.npr.org/2026/02/06/g-s1-108954/ronald-hicks-to-be-installed-as-11th-archbishop-of-new-york"
  },
  {
    "text": "Christian McCaffrey Wins 2025-26 Comeback Player of the Year Award, Full Voting Results - Bleacher Report",
    "fullText": "San Francisco 49ers running back Christian McCaffrey was rewarded for his resurgent 2025 season with Comeback Player of the Year honors on Thursday.",
    "link": "https://bleacherreport.com/articles/25352760-christian-mccaffrey-wins-2025-26-comeback-player-year-award-full-voting-results"
  },
  {
    "text": "Horoscope for Friday, February 06, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/06/horoscopes-today-friday-february-06-2026"
  },
  {
    "text": "Penguins Grades: The Rookies, the Refs, and Overcoming Real Issues - Pittsburgh Hockey Now",
    "fullText": "BUFFALO, N.Y. — And the rookies shall lead them. The Pittsburgh Penguins‘ inauspicious start became an energetic attack. Avery Hayes, […]",
    "link": "https://pittsburghhockeynow.com/pittsburgh-penguins-rookies-avery-hayes-ben-kindel-game-analysis-ben-kindel/"
  },
  {
    "text": "Kauai chickenpox outbreak doubles, expands to more schools - Honolulu Star-Advertiser",
    "fullText": "The Hawaii Department of Health reports the community outbreak of chickenpox on Kauai has expanded, raising concerns the highly contagious disease will continue to spread.",
    "link": "https://www.staradvertiser.com/2026/02/05/breaking-news/kauai-chickenpox-outbreak-doubles-expands-to-more-schools/"
  },
  {
    "text": "In Greenland’s anxious capital, a show of solidarity from Canada and other allies - Politico",
    "fullText": "Nuuk residents say they just want a normal life back after Trump’s threats. “It's not good for us, and it’s not good for our land. It could be some bad things,” said Mayor Avaaraq Olsen. “Like Ukraine.”",
    "link": "https://www.politico.com/news/2026/02/05/greenland-canada-consulate-nuuk-allies-00768198"
  },
  {
    "text": "Sex in space is finally happening, moving from theory to urgent reality - Earth.com",
    "fullText": "As space travel expands, scientists warn that reproductive health risks and ethical gaps can no longer be ignored.",
    "link": "https://www.earth.com/news/human-reproduction-sex-in-space-is-moving-from-theory-to-urgent-reality/"
  },
  {
    "text": "Statins don’t cause most of the side effects on package warnings, study finds - statnews.com",
    "fullText": "Many people who should be taking statins avoid them for fear of side effects. A large new study says most of those side effects don't actually show up.",
    "link": "https://www.statnews.com/2026/02/05/statin-side-effects-evidence-lacking-lancet-study-says/"
  },
  {
    "text": "Sony confirms WF-1000XM6 release date in first official teaser - Notebookcheck",
    "fullText": "Sony has confirmed the long-awaited release date of its WF-1000XM6 earbuds. Dubbed rather grandiously as the 'next generation of earbuds', Sony has offered a peek at its design too. The successors to the WF-1000XM5 can already be viewed in two colours though,…",
    "link": "https://www.notebookcheck.net/Sony-confirms-WF-1000XM6-release-date-in-first-official-teaser.1220779.0.html"
  }
]