[
  {
    "text": "Jazz fined $500K by NBA for 'conduct detrimental to the league,' but why target Utah? - KSL News",
    "fullText": "The Jazz were fined $500,000 after the team rested starters during games against the Magic and Heat as a way to discourage tanking after week-long criticisms of Utah's handling of it's players.",
    "link": "https://www.ksl.com/article/51448192/jazz-fined-500k-by-nba-for-conduct-detrimental-to-the-league-but-why-target-utah"
  },
  {
    "text": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks - NASCAR.com",
    "fullText": "Bookmark this page and return often as links, results and more for 2026 Daytona Speedweeks are added for all three series.",
    "link": "https://www.nascar.com/news-media/2026/02/13/nascar-at-daytona-key-information-links-results-for-2026-speedweeks/"
  },
  {
    "text": "Reanimal Review - IGN",
    "fullText": "The creator of Little Nightmares returns with more of the dark puzzle platforming it has honed over the last decade.",
    "link": "https://www.ign.com/articles/reanimal-review"
  },
  {
    "text": "Stephen Amell Cast As Hobie In Fox’s ‘Baywatch’ Reboot - Deadline",
    "fullText": "Stephen Amell is the first actor cast in Fox's 'Baywatch' reboot from Matt Nix, in the role of Hobie.",
    "link": "http://deadline.com/2026/02/stephen-amell-cast-fox-baywatch-reboot-1236719496/"
  },
  {
    "text": "WHO slams US-funded newborn vaccine trial as \"unethical\" - Ars Technica",
    "fullText": "CDC awarded $1.6 million for study birth dose of hepatitis B vaccine in Guinea-Bissau.",
    "link": "https://arstechnica.com/health/2026/02/who-slams-us-funded-newborn-vaccine-trial-as-unethical/"
  },
  {
    "text": "Republicans worry shutdown will overshadow Trump’s State of the Union - Politico",
    "fullText": "President Donald Trump’s Feb. 24 address to Congress is set to collide with a DHS funding lapse.",
    "link": "https://www.politico.com/news/2026/02/13/trump-state-of-the-union-shutdown-00781266"
  },
  {
    "text": "GoFundMe for James Van Der Beek's family tops $2.3 million to help with 'financial strain' following star's death - ca.news.yahoo.com",
    "fullText": "The donations include $25,000 from Steven Spielberg and his wife, Kate Capshaw, and a recurring monthly payment of $2,500 from actress Zoe Saldaña.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/gofundme-for-james-van-der-beeks-family-tops-23-million-to-help-with-financial-strain-following-stars-death-231553091.html"
  },
  {
    "text": "Amazon’s stock just clinched its worst losing streak in nearly 20 years. It’s giving investors AWS déjà vu. - MarketWatch",
    "fullText": "As shares of Amazon deepen into a bear market, investors are once again weighing if the company’s spending plans will pay off",
    "link": "https://www.marketwatch.com/story/amazons-stock-just-clinched-its-worst-losing-streak-in-nearly-two-decades-its-giving-investors-aws-deja-vu-2f239fe3"
  },
  {
    "text": "Spoiler: Opening Match for February 13 WWE SmackDown Revealed - Ringside News",
    "fullText": "WWE has locked in the opening match for tonight’s episode of Friday Night SmackDown — and it’s a championship bout. Cory Hays of Bodyslam.net shared the",
    "link": "https://www.ringsidenews.com/spoiler-opening-match-february-13-wwe-smackdown-revealed/"
  },
  {
    "text": "Matt Weston: Skeleton pilot wins emphatic Olympic gold for first medal GB medal of games - BBC",
    "fullText": "Matt Weston cements his status as the best skeleton racer in the world, making history by winning Olympic gold in emphatic fashion in Cortina and securing Team GB’s first medal of the 2026 Winter Games.",
    "link": "https://www.bbc.com/sport/articles/cgml91gx27go"
  },
  {
    "text": "ICE plans to spend $38.3 billion turning warehouses into detention centers - The Washington Post",
    "fullText": "ICE plans to spend $38.3 billion converting warehouses into detention centers, according to planning documents, more than the annual budgets of 22 states.",
    "link": "https://www.washingtonpost.com/business/2026/02/13/ice-detention-center-expansion/"
  },
  {
    "text": "Mehmet Oz's vaccine call is 'too little, too late' - DW.com",
    "fullText": "Measles is still spreading in the US but calls from government officials for Americans to vaccinate now won’t be enough to keep the country from losing a quarter-century of success eradicating the disease.",
    "link": "https://www.dw.com/en/mehmet-oz-measles-vaccine-recommendation-case-numbers-increase-in-us-down-europe-central-asia/a-75951461"
  },
  {
    "text": "World's rules-based order 'no longer exists', Germany's Merz warns - BBC",
    "fullText": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "link": "https://www.bbc.com/news/articles/cy4wpv0wx43o"
  },
  {
    "text": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "fullText": "The San Francisco teachers strike is over as the school district and union reach a tentative agreement.",
    "link": "https://www.sfchronicle.com/sf/article/sfusd-teachers-strike-over-21351605.php"
  },
  {
    "text": "Children flee bus stop after ICE agents spotted in Lindenwold, New Jersey, school district says - ABC7 Los Angeles",
    "fullText": "A New Jersey community was shaken after several elementary school students said they felt unsafe while waiting for their school bus when ICE agents were spotted nearby",
    "link": "https://abc7.com/post/children-flee-bus-stop-ice-agents-spotted-lindenwold-new-jersey-school-district-says/18596470/"
  },
  {
    "text": "‘Arrest Her’: Virginia’s Abigail Spanberger Roasted Over Disastrous Grill Photo-Op - Mediaite",
    "fullText": "Virginia Governor Abigail Spanberger (D) is taking her own turn being roasted after she inexplicably shared a disastrous photograph of her operating a grill.",
    "link": "https://www.mediaite.com/media/news/arrest-her-virginias-abigail-spanberger-roasted-over-disastrous-grill-photo-op/"
  },
  {
    "text": "Judge dismisses charges against men accused of assaulting ICE officer in Minneapolis shooting case - AP News",
    "fullText": "A federal judge in Minneapolis has ordered the dismissal of felony assault charges against two Venezuelan men, including one shot in the leg by an immigration officer. The charges were dropped Friday after a highly unusual filing the night before by the U.S. …",
    "link": "https://apnews.com/article/immigration-prosecutors-assault-shooting-minneapolis-charges-d713836a06471af9f38ee6ee8976a20c"
  },
  {
    "text": "Spy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader - AP News",
    "fullText": "South Korea’s spy agency says it believes the teenage daughter of North Korean leader Kim Jong Un is close to being designated as the country’s future leader. The assessment comes as Kim moves to extend the family dynasty to a fourth generation. The assessmen…",
    "link": "https://apnews.com/article/north-korea-kim-jong-un-daughter-c795f8c25177d45f1f4a8bf5af160007"
  },
  {
    "text": "Antonelli and Mercedes top final day of first Bahrain test - Formula 1",
    "fullText": "Kimi Antonelli led team mate George Russell as Mercedes locked out the top two positions on the timing screens across the third and final day of 2026’s opening pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/antonelli-and-mercedes-top-final-day-of-first-pre-season-test-in-bahrain.2veRxqtC9svL27xeURp0no"
  }
]