[
  {
    "text": "Inside USA House: The converted church that left a MAGA mark on Davos - The Washington Post",
    "fullText": "As Europeans worked furiously to divert a crisis over the president’s threatened takeover of Greenland, his allies took over this Swiss alpine village.",
    "link": "https://www.washingtonpost.com/politics/2026/01/23/trump-davos-greenland/"
  },
  {
    "text": "Is China quietly winning the AI race? - BBC",
    "fullText": "The BBC's Lily Jamali looks into why big US firms and start-ups alike are turning to Chinese tech.",
    "link": "https://www.bbc.com/news/articles/c86v52gv726o"
  },
  {
    "text": "No. 17 Alabama plans to play 7-footer Charles Bediako, who turned pro in 2023, against Tennessee - AP News",
    "fullText": "Alabama coach Nate Oats says 7-foot center Charles Bediako, who gave up his college eligibility in 2023 to enter the NBA draft, will play against Tennessee on Saturday. Although Oats called the NCAA system that is allowing professional players to return to co…",
    "link": "https://apnews.com/article/alabama-charles-bediako-ncaa-lawsuit-c30d6c071e71a297598d9676c8a054c9"
  },
  {
    "text": "TR-49 is interactive fiction for fans of deep research rabbit holes - Ars Technica",
    "fullText": "Dense narrative deduction game tells a compellingly academia-tinged sci-fi tale.",
    "link": "https://arstechnica.com/gaming/2026/01/tr-49-is-interactive-fiction-for-fans-of-deep-research-rabbit-holes/"
  },
  {
    "text": "How to prepare for \"rare,\" \"dangerous\" ice expected from this weekend's storm - Axios",
    "fullText": "This weekend's storm looks to have major impacts from both snow and ice from Texas all the way to New England.",
    "link": "https://www.axios.com/2026/01/23/ice-storm-warning-weather-forecast-snow"
  },
  {
    "text": "Goldman Sachs Boosts CEO Solomon’s Pay 21% to $47 Million - Bloomberg",
    "fullText": "Goldman Sachs Group Inc. boosted Chief Executive Officer David Solomon’s pay to $47 million, his biggest award ever and capping a year in which the investment bank’s shares soared and its leader reasserted his control at the top.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-23/goldman-sachs-boosts-ceo-david-solomon-s-pay-21-to-47-million"
  },
  {
    "text": "How the Seahawks Learned Their Lesson and Re-Built a Super Bowl Contender - Sports Illustrated",
    "fullText": "The steps Seattle took to reach the NFC Championship. Plus, how the Rams, Patriots and Broncos put together their final four rosters.",
    "link": "https://www.si.com/nfl/playoffs/seahawks-rams-patriots-broncos-roster-construction"
  },
  {
    "text": "ICE has been entering homes without judicial warrants since last summer, sources say - NBC News",
    "fullText": "Immigration and Customs Enforcement officers began forcibly entering homes without judicial warrants last summer, two administration officials told NBC News",
    "link": "https://www.nbcnews.com/politics/immigration/ice-entering-homes-judicial-warrants-last-summer-sources-say-rcna255619"
  },
  {
    "text": "Metro Atlanta under ice storm warning as region braces for winter weather - wabe.org",
    "fullText": "The National Weather Service has issued an ice storm warning for Northeast Georgia, while metro Atlanta continues to prepare for a weekend storm that could cause widespread power outages and make travel \"nearly impossible.\"",
    "link": "https://www.wabe.org/northeast-georgia-ice-storm-warning-issued-as-atlanta-braces-for-winter-weather/"
  },
  {
    "text": "Health officials say no evidence of mystery brain illness in New Brunswick - BBC",
    "fullText": "The results of the investigation add to a growing body of research that suggests patients may have diagnosable illnesses.",
    "link": "https://www.bbc.com/news/articles/cy4qwyp3gpno"
  },
  {
    "text": "Bari Weiss’s CBS News Won’t Even Condemn Israel for Killing a CBS Contributor - Zeteo | Substack",
    "fullText": "‘CBS Evening News’ anchor Tony Dokoupil peddled Israel’s talking points about it killing a Palestinian journalist. A CBS source calls it a ‘disgrace.’",
    "link": "https://zeteo.com/p/bari-weisss-cbs-news-israel-journalists-killed"
  },
  {
    "text": "Live updates: House rejects Democratic-backed Venezuela war powers resolution - AP News",
    "fullText": "The House rejected a Democratic-backed resolution Thursday that would have prevented President Donald Trump from sending U.S. military forces to Venezuela after a tied vote on the legislation fell just short of the majority needed for passage.",
    "link": "https://apnews.com/live/donald-trump-news-updates-1-23-2026"
  },
  {
    "text": "Busfield Case Puts Scrutiny on Warner Bros.’ Own Investigation of Abuse Claims - hollywoodreporter.com",
    "fullText": "New Mexico prosecutors have criticized the studio for slow-walking access to its finished report and witnesses once law enforcement got involved.",
    "link": "http://www.hollywoodreporter.com/news/general-news/busfield-case-warner-bros-own-investigation-abuse-claims-1236482703/"
  },
  {
    "text": "Trump administration weighs naval blockade to halt Cuban oil imports - Politico",
    "fullText": "“Energy is the chokehold to kill” the Cuban regime, said a person familiar with the discussions.",
    "link": "https://www.politico.com/news/2026/01/23/trump-administration-weighs-naval-blockade-to-halt-cuban-oil-imports-00744708"
  },
  {
    "text": "Kushner’s vision for rebuilding Gaza faces major obstacles - AP News",
    "fullText": "Jared Kushner envisions a rebuilt Gaza with high-rises, a coastline that attracts tourists and a bustling port. Speaking at an economic forum in Davos, U.S. President Donald Trump’s son-in-law and Middle East adviser claimed Gaza could be rebuilt quickly, so …",
    "link": "https://apnews.com/article/israel-hamas-ceasefire-trump-gaza-kushner-758867a971b917f8f21b056fe9a281ca"
  },
  {
    "text": "CISA confirms active exploitation of four enterprise software bugs - BleepingComputer",
    "fullText": "The Cybersecurity and Infrastructure Security Agency (CISA) in the U.S. warned of active exploitation of four vulnerabilities impacting enterprise software from Versa and Zimbra, the Vite frontend tooling framework, and the Prettier code formatter.",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-confirms-active-exploitation-of-four-enterprise-software-bugs/"
  },
  {
    "text": "BlackRock’s Rick Rieder surges in Federal Reserve chair race - Financial Times",
    "fullText": "Donald Trump has said he plans to name his nominee to run the US central bank ‘in the not too distant future’",
    "link": "https://www.ft.com/content/a9bad7cb-ff5f-41ca-abcd-be93e7e20cd1"
  },
  {
    "text": "UFC fighter Cameron Smotherman collapses after making weight - ESPN",
    "fullText": "UFC bantamweight Cameron Smotherman collapsed moments after making weight Friday in a disturbing scene for the sport of mixed martial arts.",
    "link": "https://www.espn.com/mma/story/_/id/47706166/ufc-fighter-cameron-smotherman-collapses-making-weight"
  },
  {
    "text": "Nicole 'Snooki' Polizzi Reveals Doctors Found Cancerous Cells in Her Cervix: ‘I’m Scared’ - Yahoo News UK",
    "fullText": "Nicole \"Snooki\" Polizzi revealed she recently had a biopsy where cancerous cells were discovered on her cervix. The ‘Jersey Shore’ star, 38, admitted that she delayed her routine screenings and urged other women to stay on top of their health.",
    "link": "https://people.com/nicole-snooki-polizzi-reveals-cervical-cancer-scare-11891378"
  },
  {
    "text": "Jamie Dimon is learning what happens when a CEO dares to defy Trump - CNN",
    "fullText": "Top Wall Street bankers during the Trump 2.0 era have tread carefully around the subject of politics generally and President Donald Trump specifically. The consensus has generally been: Smile and nod, stay in your lane, don’t become a target.",
    "link": "https://www.cnn.com/2026/01/23/business/jamie-dimon-donald-trump"
  }
]