[
  {
    "text": "The New Year Preview – Prince Yriel counterattacks with new Aeldari Corsairs - Warhammer Community",
    "fullText": "The Eldritch Raiders strike from the void.",
    "link": "https://www.warhammer-community.com/articles/l7x5v6ib/the-new-year-preview-prince-yriel-counterattacks-with-new-aeldari-corsairs"
  },
  {
    "text": "Live The New Year Warhammer Preview Live! 2026 – See all of the reveals - Warhammer Community",
    "fullText": "Every reveal in one convenient place.",
    "link": "https://www.warhammer-community.com/articles/ssts1hyy/the-new-year-warhammer-preview-live-2026-see-all-of-the-reveals"
  },
  {
    "text": "Measles exposure reported at Upstate Walmart - WYFF News 4",
    "fullText": "A measles exposure has been reported at several Upstate businesses including Walmart as 124 new cases have been reported since Tuesday.",
    "link": "https://www.wyff4.com/article/walmart-measles-exposure-health-south-carolina/70024037"
  },
  {
    "text": "Kevin Hassett pivots to possible ‘Trump cards’ amid credit card battle with banks - CNBC",
    "fullText": "Trump called for banks to cap credit card interest rates at 10%, an idea that has been roundly rejected by industry executives and their lobbyists this week.",
    "link": "https://www.cnbc.com/2026/01/16/white-house-hassett-trump-cards-credit-card-battle.html"
  },
  {
    "text": "Giants, John Harbaugh haggle over contract \"language\" - NBC Sports",
    "fullText": "At some point, they need to get it done.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/giants-john-harbaugh-haggle-over-contract-language"
  },
  {
    "text": "Biggest offshore wind project in U.S. to resume construction after judge lifts Trump suspension - CNBC",
    "fullText": "Coastal Virginia Offshore Wind will resume construction after a federal judge on Friday temporarily lifted the Trump administration's suspension.",
    "link": "https://www.cnbc.com/2026/01/16/biggest-offshore-wind-project-in-us-to-resume-construction-after-judge-lifts-trump-suspension.html"
  },
  {
    "text": "Live updates: Trump warns Minnesota ICE protests will be dealt with 'quickly' - BBC",
    "fullText": "The president says protesters will be dealt with \"quickly and effectively\" if he is \"forced to act\" as Democrat lawmakers say \"reckless, even lethal, use of force cannot continue\".",
    "link": "https://www.bbc.com/news/live/cwyg34kexrgt"
  },
  {
    "text": "Snow odds increasing in Massachusetts for Patriots game Sunday. Maps show latest storm track and forecast. - CBS News",
    "fullText": "Odds are increasing that Massachusetts will be dealing with snow from a coastal storm Sunday, and it could impact the Patriots game.",
    "link": "https://www.cbsnews.com/boston/news/snow-weather-forecast-patriots-game-sunday/"
  },
  {
    "text": "Mets To Sign Bo Bichette - MLB Trade Rumors",
    "fullText": "The Mets bounced back quickly after missing on Kyle Tucker. Bo Bichette is headed to Queens. Read more at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-sign-bo-bichette.html"
  },
  {
    "text": "Venezuelan opposition leader Machado 'grateful' to Trump after giving him her Nobel medal - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/trump-meet-venezuelan-opposition-leader-mara-corina-machado/story?id\\\\u003d129234741"
  },
  {
    "text": "Mexican president highlights 'compelling results' in crackdown of cartels in face of Trump threats - AP News",
    "fullText": "Mexican President Claudia Sheinbaum says that efforts to crack down on Mexican cartels and slow migration north were showing “compelling results” in an effort to head off intervention by the Trump administration. The comments come after U.S. President Donald …",
    "link": "https://apnews.com/article/mexico-us-sheinbaum-trump-cartels-582836f84da21a61ec75d4c7be880fef"
  },
  {
    "text": "Bowman Wants Fed Ready to Cut Rates for Still-Fragile Job Market - Bloomberg.com",
    "fullText": "Federal Reserve Vice Chair for Supervision Michelle Bowman said monetary policy remains moderately restrictive and officials should be prepared to lower interest rates further unless the employment landscape improves.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-16/bowman-wants-fed-ready-to-cut-rates-for-still-fragile-job-market"
  },
  {
    "text": "Trump floats new tariffs in push to acquire Greenland - CNBC",
    "fullText": "The comments show Trump considering applying his aggressive tariff strategies to his efforts to acquire Greenland.",
    "link": "https://www.cnbc.com/2026/01/16/trump-greenland-tariffs.html"
  },
  {
    "text": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "fullText": "The parent company of X and Grok, xAI, launched a counter-suit saying she had violated its terms of service.",
    "link": "https://www.bbc.com/news/articles/cp37erw0zwwo"
  },
  {
    "text": "Ted Sarandos: “I Don’t Know Why” Trump Shared Article Saying to “Stop” Netflix Deal for Warner Bros. - The Hollywood Reporter",
    "fullText": "\"I don’t want to overread it, either,\" the Netflix co-CEO says in a measured new interview.",
    "link": "http://www.hollywoodreporter.com/business/business-news/ted-sarandos-trump-netflix-deal-warner-bros-1236476148/"
  },
  {
    "text": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded - BBC",
    "fullText": "The secret discussions, bombshell leak and sacking which led to Robert Jenrick defecting to the Reform party.",
    "link": "https://www.bbc.com/news/articles/ce3ejzz78gxo"
  },
  {
    "text": "Trump's proposed ban on buying single-family homes introduces uncertainty for family offices - CNBC",
    "fullText": "Wall Street landlords are the primary target of Trump's proposed ban, but investment firms of the ultra rich could get caught in the crosshairs.",
    "link": "https://www.cnbc.com/2026/01/16/trump-investors-homes-family-offices.html"
  },
  {
    "text": "‘A piece of chicken, a piece of broccoli’: Agriculture secretary says healthy meals cost $3 - The Washington Post",
    "fullText": "Brooke Rollins drew ridicule on social media after saying a meal could be a “piece of chicken, a piece of broccoli, a corn tortilla and one other thing.”",
    "link": "https://www.washingtonpost.com/business/2026/01/16/three-dollar-meals-rollins/"
  }
]