[
  {
    "text": "Dr. William Foege, leader in smallpox eradication, dies - ABC News",
    "fullText": "The 6-foot-7 inch Foege literally stood out in the field of public health.",
    "link": "https://abcnews.go.com/Health/wireStory/dr-william-foege-leader-smallpox-eradication-dies-129543666"
  },
  {
    "text": "Sean McVay on whether he expects Matthew Stafford back: \"What the hell kind of question is that?\" - NBC Sports",
    "fullText": "Said Stafford: \"I can't generalize six months of my life ten minutes after a loss.\"",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/sean-mcvay-on-whether-he-expects-matthew-stafford-back-what-the-hell-kind-of-question-is-that"
  },
  {
    "text": "Iran Is Selling More Oil but Making Less Money - The Wall Street Journal",
    "fullText": "Middlemen and buyers take advantage of embattled regime’s limited options for unloading crude",
    "link": "https://www.wsj.com/world/middle-east/iran-is-selling-more-oil-but-making-less-money-841985ea"
  },
  {
    "text": "Inside Apple’s AI Shake-Up and Its Plans for Two New Versions of Siri - Bloomberg.com",
    "fullText": "Apple shakes up its AI efforts with a Google partnership, management changes and two new versions of Siri. Also: The company gets ready to kick off its 2026 Mac launches and puts CEO candidate John Ternus in charge of design.",
    "link": "https://www.bloomberg.com/news/newsletters/2026-01-25/inside-apple-s-ai-shake-up-ai-safari-and-plans-for-new-siri-in-ios-26-4-ios-27-mktqy7xb"
  },
  {
    "text": "NFC championship: Seahawks ride late 4th-down stop, career game from Sam Darnold past Rams into Super Bowl - Yahoo Sports",
    "fullText": "The Seahawks are headed to the Super Bowl.",
    "link": "https://sports.yahoo.com/nfl/breaking-news/live/nfc-championship-seahawks-ride-late-fourth-down-stop-career-game-from-sam-darnold-past-rams-into-super-bowl-220009934.html"
  },
  {
    "text": "Winter storm live updates for NYC and Tri-State Area as snow, sleet and dangerous cold take over - CBS News",
    "fullText": "The monster winter storm that New York City and the Tri-State Area have been bracing for arrived Sunday, bringing heavy snow, sleet and frigid temperatures.",
    "link": "https://www.cbsnews.com/newyork/live-updates/winter-storm-nyc-weather-how-much-snow-new-jersey-connecticut/"
  },
  {
    "text": "Japan returns pandas to China amid strained ties - BBC",
    "fullText": "The twin cubs' departure will leave Japan without any pandas for the first time since 1972.",
    "link": "https://www.bbc.com/news/articles/c8d0l778dero"
  },
  {
    "text": "Opinion | The unjust killing of Alex Pretti marks a turning point in Trump’s second term - The Washington Post",
    "fullText": "Congress can step in to stop the president from overreaching on immigration.",
    "link": "https://www.washingtonpost.com/opinions/2026/01/25/minneapolis-immigration-killing-government-shutdown-ice-alex-pretti/"
  },
  {
    "text": "Japan Government Bond Yields, Stocks Fall After Yen’s Rebound - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/finance/japan-government-bond-yields-stocks-fall-after-yens-rebound-8c6a1914"
  },
  {
    "text": "Carney says Canada not pursuing free trade deal with China as Trump threatens 100% tariffs - CNBC",
    "fullText": "Trump's rhetoric on Truth Social contrasts with what he said after the agreement between Ottawa and Beijing: \"If you can get a deal with China, you should do that.\"",
    "link": "https://www.cnbc.com/2026/01/26/canada-china-trade-deal-tariffs-trump.html"
  },
  {
    "text": "'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home - TMZ",
    "fullText": "Quinton Aaron -- the actor who played Michael Oher in \"The Blind Side\" -- has been hospitalized after collapsing at his home .. TMZ has learned.",
    "link": "https://www.tmz.com/2026/01/25/blind-side-actor-quinton-aaron-hospitalized-after-falling-at-home/"
  },
  {
    "text": "Democrats vow to oppose homeland security funds after Minnesota shooting as shutdown risk grows - AP News",
    "fullText": "Democratic senators are vowing to oppose a funding bill for the Department of Homeland Security following the shooting death of a man in Minnesota. And that opposition increases the prospect of a partial government shutdown by week's end. Six of the 12 annual…",
    "link": "https://apnews.com/article/senate-democrats-homeland-security-funding-government-shutdown-f727fa0f3865990f191d4d5770e04752"
  },
  {
    "text": "I Don’t Wanna Gatekeep, So I’m Putting These 27 Cool Things On Your Radar - buzzfeed.com",
    "fullText": "This is me being nice, so...you're welcome or whatever.",
    "link": "https://www.buzzfeed.com/taylor_steele/cool-things-to-put-on-your-radar"
  },
  {
    "text": "A major winter storm has hit the D.C. region. Here’s what to know - wamu.org",
    "fullText": "Snow, extreme cold, and sleet will disrupt travel, business, and services in the D.C. area Sunday and throughout the week.",
    "link": "https://wamu.org/story/26/01/25/major-winter-storm-has-hit-the-dc-region/"
  },
  {
    "text": "The Warner Bros. Bidding War Is Over - Bloomberg",
    "fullText": "Paramount needs to raise its offer to reclaim the initiative",
    "link": "https://www.bloomberg.com/news/newsletters/2026-01-25/the-warner-bros-bidding-war-is-over"
  },
  {
    "text": "Winter storm leaves hundreds of thousands of customers without power across the South - PBS",
    "fullText": "A massive winter storm dumped sleet, freezing rain and snow across much of the U.S. on Sunday, leaving hundreds of thousands of homes and businesses in the Southeast without electricity.",
    "link": "https://www.pbs.org/newshour/nation/winter-storm-leaves-hundreds-of-thousands-of-customers-without-power-across-the-south"
  },
  {
    "text": "Philadelphia snow updates: Latest forecast, storm timing, travel impact and more - whyy.org",
    "fullText": "Significant snow accumulations are impacting Pennsylvania, New Jersey and Delaware. Here’s everything you need to know.",
    "link": "http://whyy.org/articles/philadelphia-snow-storm-updates-latest-forecast-timing/"
  },
  {
    "text": "Giants agree to hire Dennard Wilson as defensive coordinator - NBC Sports",
    "fullText": "The Giants have found their new defensive coordinator for their first season with John Harbaugh as head coach.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/giants-agree-to-hire-dennard-wilson-as-defensive-coordinator"
  }
]