[
  {
    "text": "Trump's Fed fight looks like something from another country - BBC",
    "fullText": "Donald Trump's stand-off with the US central bank has recalled episodes in other countries - which ended badly for the economy.",
    "link": "https://www.bbc.com/news/articles/cy9yxlz70dvo"
  },
  {
    "text": "Trump threatens to use Insurrection Act to deploy troops to Minnesota to \"put an end\" to protests - CBS News",
    "fullText": "An Immigration and Customs Enforcement officer​ shot a man Wednesday night in north Minneapolis after allegedly being attacked by men with shovels during an arrest operation, three U.S. officials told CBS News.",
    "link": "https://www.cbsnews.com/minnesota/live-updates/minnesota-ice-shooting-protests-trump-insurrection-act/"
  },
  {
    "text": "Dodgers To Sign Kyle Tucker - MLB Trade Rumors",
    "fullText": "The Dodgers have done it again. Read more about the Kyle Tucker deal at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/dodgers-to-sign-kyle-tucker.html"
  },
  {
    "text": "Indiana begins effort to pass legislation to pay for new Bears stadium - NBC Sports",
    "fullText": "As the Bears prepare to play a significant postseason game in their longtime home of Soldier Field, the process of finding a new home continues.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/indiana-begins-effort-to-pass-legislation-to-pay-for-new-bears-stadium"
  },
  {
    "text": "Kim Kardashian Shares Adorable Snaps With Chicago West On Daughter's 8th Birthday - TMZ",
    "fullText": "Time is flying ... Kim Kardashian and Kanye West's daughter, Chicago West, is 8 years old today ... and Kim is marking the occasion with a super sweet social media post and some cute photos of them together.",
    "link": "https://www.tmz.com/2026/01/15/kim-kardashian-chicago-west-birthday-photos/"
  },
  {
    "text": "FBI: 1 arrested after protesters smash into unmarked federal vehicles allegedly containing federal documents - CBS News",
    "fullText": "The FBI says that a suspect is in custody after protests in north Minneapolis Wednesday evening culminated in vandalism and the apparent compromising of federal documents.",
    "link": "https://www.cbsnews.com/minnesota/news/fbi-1-arrested-after-protesters-smash-into-unmarked-federal-vehicles-allegedly-containing-federal-documents/"
  },
  {
    "text": "Rare earths magnets: How realistic are India's its ambitions? - BBC",
    "fullText": "India has a $800m plan to make rare earth magnets, aiming to reduce dependence on Chinese imports - but can it work?",
    "link": "https://www.bbc.com/news/articles/c9qe1d8p5xgo"
  },
  {
    "text": "Hilary Duff drops her spicy new single 'Roommates' - Yahoo",
    "fullText": "This is Duff's second single off her forthcoming album, \"Luck …or something,\" out next month.",
    "link": "https://www.yahoo.com/entertainment/music/article/hilary-duff-drops-her-spicy-new-single-roommates-000259768.html"
  },
  {
    "text": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com",
    "fullText": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction"
  },
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "fullText": "The company said it had stopped Grok from undressing people on the X platform. Grok’s stand-alone app still does it.",
    "link": "https://www.washingtonpost.com/technology/2026/01/15/grok-ai-image-generator-sexualized/"
  },
  {
    "text": "Push for greater ICE training grows on some Republicans - Politico",
    "fullText": "Criticism of ICE has grown among influential voices for the president’s coalition in the wake of the Minneapolis shooting.",
    "link": "https://www.politico.com/news/2026/01/15/ice-training-republicans-shootings-00732583"
  },
  {
    "text": "“I am very annoyed”: Pharma execs blast RFK Jr.’s attack on vaccines - Ars Technica",
    "fullText": "Pharma execs had avoided conflict with Trump admin, but now join doctors in rebukes.",
    "link": "https://arstechnica.com/health/2026/01/big-pharma-is-openly-railing-against-rfk-jr-s-anti-vaccine-agenda/"
  },
  {
    "text": "Netanyahu says the announced start of Gaza ceasefire’s next phase is a ‘declarative move’ - AP News",
    "fullText": "Israeli strikes in Gaza have killed nine people, including three women, following the U.S. announcement of a second phase in the fragile ceasefire. Israeli Prime Minister Benjamin Netanyahu called the ceasefire largely symbolic, questioning its implementation…",
    "link": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-netanyahu-ceasefire-b916e332a2f88200ee9540d48c3d83a1"
  },
  {
    "text": "Swarms of tiny earthquakes uncover secrets of California’s big faults - SFGATE",
    "fullText": "Seismologists tracked earthquake swarms to paint a new picture of the Mendocino Triple Junction, off the Humboldt County coast.",
    "link": "https://www.sfgate.com/earthquakes/article/swarms-tiny-earthquakes-uncover-secrets-21294838.php"
  },
  {
    "text": "Finally, Some Good News in the Fight Against Cancer - Gizmodo",
    "fullText": "The American Cancer Society’s annual report found that 70% of patients now survive at least five years after diagnosis.",
    "link": "https://gizmodo.com/finally-some-good-news-in-the-fight-against-cancer-2000710820"
  },
  {
    "text": "Rosters announced for 2026 AHL All-Star Classic - The American Hockey League",
    "fullText": null,
    "link": "https://theahl.com/news/rosters-announced-2026-ahl-all-star-classic"
  }
]