[
  {
    "text": "Lindsey Vonn's Olympic medal hopes dashed after just 13 seconds - NBC News",
    "fullText": "Lindsey Vonn's pursuit of an against-all-odds Olympic medal ended Sunday in a devastating crash only 13.4 seconds into the downhill final.",
    "link": "https://www.nbcnews.com/sports/olympics/lindsey-vonn-downhill-winter-olympics-rcna257918"
  },
  {
    "text": "Ledecka’s quest for Olympic snowboarding three-peat comes to a shocking halt - AP News",
    "fullText": "Ester Ledecka’s quest to become the first snowboarder to win gold medals in three straight Olympics came to a surprisingly early end. She lost her quarterfinal race in the sport’s parallel giant slalom by 0.06 seconds to Austria’s Sabine Payer. The 30-year-ol…",
    "link": "https://apnews.com/article/ledecka-winter-olympics-snowboard-75c1551954fbb0ec44190ee187d68f7b"
  },
  {
    "text": "What Houston coach Kelvin Sampson said after beating BYU - Deseret News",
    "fullText": "Kelvin Sampson loves beating BYU. He’s done it four times in the past three years without losing once.",
    "link": "https://www.deseret.com/sports/2026/02/08/kelvin-sampson-byu-postgame-2026/"
  },
  {
    "text": "Apple Prepares to Kick Off 2026 With the iPhone 17e, New iPads and Macs - Bloomberg.com",
    "fullText": "Apple is going to begin a 2026 product blitz with the iPhone 17e, updated iPads and fresh Macs. Also: Here’s exactly what CEO Tim Cook told employees about immigration, artificial intelligence and the company’s 50th anniversary during an all-hands meeting. La…",
    "link": "https://www.bloomberg.com/news/newsletters/2026-02-08/apple-readies-iphone-17e-new-siri-entry-level-ipad-ipad-air-and-macbook-pro-mldr3hpk"
  },
  {
    "text": "10 Cool New Gadgets to Keep on Your Radar - Gear Patrol",
    "fullText": "Catching you up on the past week’s most notable product releases.",
    "link": "https://www.gearpatrol.com/audio/best-new-tech-releases-2-08-2026/"
  },
  {
    "text": "Voters are worried about the cost of housing. But Trump wants home prices to keep climbing - AP News",
    "fullText": "The White House is trying to show it's lowering the cost of living, but President Donald Trump has said he doesn't want to see the price of homes come down. He wants to keep values high. That's something in the interest of existing homeowners and they're a ke…",
    "link": "https://apnews.com/article/trump-housing-mortgage-midterm-elections-prices-affordability-6bda9c1260550990bc819bcb6f1402cf"
  },
  {
    "text": "Vladimir Alexeyev: Three suspects in shooting of Russian general named - BBC",
    "fullText": "The suspects include the alleged gunman, Lyubomir Korba, whom Russia says fled to the UAE after the attack.",
    "link": "https://www.bbc.com/news/articles/cy7j6xe8862o"
  },
  {
    "text": "From blackouts to food shortages: How US blockade is crippling life in Cuba - Al Jazeera",
    "fullText": "US pressure pushes island nation’s 11 million people to the brink as Cuba imposes emergency measures amid fuel crisis.",
    "link": "https://www.aljazeera.com/economy/2026/2/8/from-blackouts-to-food-shortages-how-us-blockade-is-crippling-life-in-cuba"
  },
  {
    "text": "Iran's top diplomat strikes a hard line on US talks, saying Tehran's power comes from saying 'no' - AP News",
    "fullText": "Iran's top diplomat says Tehran's strength comes from its ability to “say no to the great powers.” Sunday's statement follows recent nuclear negotiations with the United States and nationwide protests that shook Iran. Speaking at a summit in Tehran, Foreign M…",
    "link": "https://apnews.com/article/iran-us-nuclear-talks-protests-araghchi-389531836ccaa4c126b5ee06c1d5b1f8"
  },
  {
    "text": "Andrei Arlovksi bludgeons Ben Rothwell in bloody BKFC heavyweight title fight at Knucklemania 6 - Yahoo Sports",
    "fullText": "Andrei Arlovski made it three in a row against Ben Rothwell, who was left battered, beaten and without a belt.",
    "link": "https://sports.yahoo.com/mma/breaking-news/live/andrei-arlovksi-bludgeons-ben-rothwell-in-bloody-bkfc-heavyweight-title-fight-at-knucklemania-6-063037486.html"
  },
  {
    "text": "Bitcoin is still about $69,000 too high - Financial Times",
    "fullText": "The crypto crash is coming — and the landing won’t be pretty",
    "link": "https://www.ft.com/content/2b030926-2012-4446-b22d-e549e10e7086"
  },
  {
    "text": "El Grande Americano attacks El Grande Americano in AAA - Cageside Seats",
    "fullText": "The feud continues.",
    "link": "https://www.cagesideseats.com/lucha-libre-aaa-cmll/416717/el-grande-americano-attacks-el-grande-americano-aaa-wwe"
  },
  {
    "text": "Zelensky: Trump wants Russia-Ukraine peace deal by June, before midterms focus - Axios",
    "fullText": "\"We had very good talks today having to do with Russia-Ukraine. Something could be happening,\" Trump told reporters.",
    "link": "https://www.axios.com/2026/02/07/zelensky-trump-russia-ukraine-peace-deal"
  },
  {
    "text": "5 Handy Costco Gadgets To Upgrade Your Smart Home - SlashGear",
    "fullText": "Smart home devices are everywhere, but you don't need to visit more than one store in order to fully upgrade your home with the latest tech.",
    "link": "https://www.slashgear.com/2093793/costco-gadgets-to-upgrade-smart-home/"
  },
  {
    "text": "Kim expected to issue major policy goals at North Korea party congress in late February - AP News",
    "fullText": "North Korean state media says the country's leadership will convene a major political conference later this month. Kim Jong Un is expected to outline his domestic and foreign policies for the next five years at the ruling Workers’ Party congress. The official…",
    "link": "https://apnews.com/article/north-korea-workers-party-congress-kim-nuclear-a411f6429dcbfc720257b5023f3b78d1"
  },
  {
    "text": "Second measles case connected to Disneyland visitor reported by Orange County officials - cbsnews.com",
    "fullText": "Orange County officials confirm second measles case in Disneyland visitor",
    "link": "https://www.cbsnews.com/losangeles/news/measles-disneyland-california-adventure-traveler-orange-county-anaheim/"
  },
  {
    "text": "Bugs in food and sickness haunt immigrants held in Texas - Yahoo",
    "fullText": "A detention center in rural Texas has become a harsh symbol of President Donald Trump's immigration crackdown, with disease breaking out among the throng of ...",
    "link": "https://www.yahoo.com/news/articles/bugs-food-sickness-haunt-immigrants-011701141.html"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  }
]