[
  {
    "text": "Multiple people at state wrestling tournament diagnosed with measles as it spreads in Utah - KSL News",
    "fullText": "Utah health officials say cases of measles are spreading to new areas in Utah, particularly in schools and at extracurricular events like a recent state wrestling tournament.",
    "link": "https://www.ksl.com/article/51451348/multiple-people-at-state-wrestling-tournament-diagnosed-with-measles-as-it-spreads-in-utah"
  },
  {
    "text": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "fullText": "In a new video of Punch, the baby monkey is dragged around in circles by an adult monkey, upsetting animal lovers around the globe. The zoo explains.",
    "link": "https://www.usatoday.com/story/news/world/2026/02/20/punch-baby-monkey-update-attacked-video-japan-zoo/88776501007/"
  },
  {
    "text": "Trump pledges $10 billion for Board of Peace in inaugural meeting on Gaza - Axios",
    "fullText": null,
    "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4wY1MxNlVxUWNnMUxOenZoX1RWQ2g2VTdOUzVsYlY5dGIyaDlxSElxdDBQNFdBSGhRSHlFUlhPMXp0ZVE5ZmxBb1V3Y2JuY25BV0JDUXk3LTc5cWJMcElrOWxDNEJmbWFpclBrcGFtTUxCejNQ?oc=5"
  },
  {
    "text": "Why does women's pain last longer than men's? A new study offers an answer - NBC News",
    "fullText": "Women are more likely to experience chronic pain, studies have found, and their pain lasts longer, on average. New research suggests it's because of immune system differences.",
    "link": "https://www.nbcnews.com/health/womens-health/why-women-pain-last-longer-men-study-rcna259809"
  },
  {
    "text": "See where snow could be measured in inches — or feet — in the East this weekend - The Washington Post",
    "fullText": "A strong nor’easter is expected to form near the Mid-Atlantic coast on Sunday, threatening to bring accumulating snow, strong winds and travel disruptions.",
    "link": "https://www.washingtonpost.com/weather/2026/02/20/noreaster-snow-forecast-midatlantic-northeast/"
  },
  {
    "text": "Veteran almost fails to make weight again for UFC Houston - MMA Fighting",
    "fullText": "Sean Strickland and Anthony Hernandez made weight for UFC Houston, and one veteran nearly registered a third weight miss.",
    "link": "https://www.mmafighting.com/ufc/472458/ufc-houston-weigh-in-results-phil-rowe-misses-weight-for-third-time"
  },
  {
    "text": "OpenAI’s first Jony Ive device sounds like HomePod 2.0: report - 9to5Mac",
    "fullText": "A new report details OpenAI’s hardware ambitions, and reveals that the first Jony Ive-designed device expected to launch is a smart speaker.",
    "link": "https://9to5mac.com/2026/02/20/openais-first-jony-ive-device-sounds-like-homepod-2-0-report/"
  },
  {
    "text": "Trump adviser drops bombshell on Meta, Microsoft - thestreet.com",
    "fullText": "White House puts Big Tech on notice.",
    "link": "https://www.thestreet.com/economy/trump-adviser-drops-bombshell-on-meta-microsoft"
  },
  {
    "text": "House Speaker Johnson rejects request for Jesse Jackson to lie in honor at Capitol - CNN",
    "fullText": "House Speaker Mike Johnson has denied a request for the late Rev. Jesse Jackson Sr. to lie in honor at the United States Capitol, citing past precedent over how the deaths of other high-profile figures were handled, according to sources familiar with the matt…",
    "link": "https://www.cnn.com/2026/02/20/politics/jesse-jackson-lie-in-honor-capitol-rejected"
  },
  {
    "text": "Top-ranked Canada, U.S. fall in women's Olympic curling semis - ESPN",
    "fullText": "Canada's top-ranked women were upset by Sweden in the Olympic curling semifinals, while the United States also suffered a 7-4 loss to Switzerland.",
    "link": "https://www.espn.com/olympics/story/_/id/47986807/top-ranked-canada-us-fall-women-olympic-curling-semis"
  },
  {
    "text": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Gennaro Filice defies \"positional value,\" predicting a running back, linebacker and safety come off the board in the top 10. Check out his full first-round projection, 1-32.",
    "link": "https://www.nfl.com/news/gennaro-filice-2026-nfl-mock-draft-1-0-jeremiyah-love-cracks-top-five-chiefs-take-wr-jordyn-tyson"
  },
  {
    "text": "Nintendo turned its biggest flop into an expensive, uncomfortable novelty - The Verge",
    "fullText": "Nintendo’s new Virtual Boy accessory for the Switch and Switch 2 is much like the original: an interesting, awkward, and uncomfortable novelty.",
    "link": "https://www.theverge.com/games/881677/nintendo-switch-virtual-boy-review"
  },
  {
    "text": "Ali Akbar, who's sold newspapers on the streets of Paris for 50 years, is now a knight - NPR",
    "fullText": "For decades, Ali Akbar has sold papers on the Left Bank of Paris. Last month, France gave the beloved 73-year-old immigrant from Pakistan one of its highest honors — and his neighborhood is cheering.",
    "link": "https://www.npr.org/2026/02/20/g-s1-110565/france-paris-newspaper-seller-knighthood-chevalier-ali-akbar"
  },
  {
    "text": "Oddest moments from India’s AI summit: Missing stars, traffic chaos and robo-dog controversy - politico.eu",
    "fullText": "A lot of important topics were debated in New Delhi, but there was also some fun and frustration.",
    "link": "https://www.politico.eu/article/oddest-moments-from-indias-ai-summit-missing-stars-traffic-chaos-and-robo-dog-controversy/"
  },
  {
    "text": "Under Mamdani, City to Probe Businesses Where Most Workers Take Zero Sick Days - THE CITY - NYC News",
    "fullText": "Employers will be subject to an investigation by the Department of Consumer and Worker Protection if more than half their employees took zero paid time off in a given year.",
    "link": "https://www.thecity.nyc/2026/02/20/zohran-mamdani-workers-sick-leave-enforcement/"
  },
  {
    "text": "Israeli settlers kill 19-year-old Palestinian American, officials and witnesses say - NPR",
    "fullText": "Israeli settlers in the occupied West Bank shot and killed a Palestinian American man during an attack on a village, the Palestinian Health Ministry said.",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5720677/israeli-settlers-kill-19-year-old-palestinian-american-officials-and-witnesses-say"
  },
  {
    "text": "A Mystery Phone, Found in the Desert, Slowly Reveals Its Secrets - CNET",
    "fullText": "Exclusive: The Samsung phone had been lost for a decade. Then Katie Elkin found it.",
    "link": "https://www.cnet.com/tech/mobile/samsung-phone-lost-in-desert-10-years-lives-again/"
  },
  {
    "text": "Hubble telescope discovers rare galaxy that is 99% dark matter - Space",
    "fullText": "\"This is the first galaxy detected solely through its globular cluster population.\"",
    "link": "https://www.space.com/astronomy/dark-universe/hubble-telescope-discovers-rare-galaxy-that-is-99-percent-dark-matter"
  }
]