[
  {
    "text": "Live updates: California slammed by 'dangerous' storm, 8 feet of snow and life-threatening floods - FOX Weather",
    "fullText": "A dangerous storm is slamming California with life-threatening flash floods, mudslides, and up to 8 feet of Sierra snow. Stay informed with real-time radar, Los Angeles evacuation warnings, and major travel disruptions across the Golden State.",
    "link": "https://www.foxweather.com/live-news/live-updates-california-slammed-by-dangerous-storm-8-feet-of-snow-and-life-threatening-floods"
  },
  {
    "text": "FCC finds no violations in Bad Bunny halftime show - NBC Sports",
    "fullText": "Spanish lyrics were \"scrubbed\" of potentially problematic words.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/fcc-finds-no-violations-in-bad-bunny-halftime-show"
  },
  {
    "text": "One of this century’s most important Republicans takes a beating in home state - The Washington Post",
    "fullText": "Three GOP candidates, all former McConnell interns, are keeping their distance as they seek to align with President Donald Trump.",
    "link": "https://www.washingtonpost.com/politics/2026/02/16/kentucky-senate-mcconnell-trump-midterms/"
  },
  {
    "text": "Sony Considering PS6 Delay to 2028 or Even 2029, New Report Says - Push Square",
    "fullText": "Thanks to chip demand and RAM prices",
    "link": "https://www.pushsquare.com/news/2026/02/sony-considering-ps6-delay-to-2028-or-even-2029-new-report-says"
  },
  {
    "text": "Forget Concrete: Scientists Created a Living Building Material That Grows, Breathes, and Repairs Its Own Cracks - The Daily Galaxy",
    "fullText": "Backed by 400 days of lab data, this radical “living material” could transform how buildings fight climate change.",
    "link": "https://dailygalaxy.com/2026/02/scientists-create-living-self-healing-building-material-capture-carbon/"
  },
  {
    "text": "Netflix's 'America's Next Top Model' docuseries doesn't let Tyra Banks off easy - NPR",
    "fullText": "Netflix's new docuseries unpacks how the hit modeling show made for \"good TV\" for its creators and devastating consequences for its participants.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5707543/americas-next-top-model-netflix-reality-check"
  },
  {
    "text": "Trump's second year: Whiplash - Politico",
    "fullText": "\"Even proposals that don’t ultimately move forward have consequences.\"",
    "link": "https://www.politico.com/news/2026/02/16/trump-policy-whiplash-grants-canada-credit-cards-00780845"
  },
  {
    "text": "What's open and closed on Presidents Day 2026? Here's what to expect on the federal holiday. - CBS News",
    "fullText": "Most retail and food establishments will remain open, but services like mail delivery will be suspended for the federal holiday.",
    "link": "https://www.cbsnews.com/news/whats-open-closed-presidents-day-2026/"
  },
  {
    "text": "The myth that women are more naturally empathetic than men - BBC",
    "fullText": "Scientific research is up-ending age-old gender stereotypes about empathy – and revealing new ways of thinking about masculinity.",
    "link": "https://www.bbc.com/future/article/20260213-are-women-naturally-more-empathetic-than-men"
  },
  {
    "text": "Can flickering lights and sound slow Alzheimer’s? A researcher seeks that answer - CNN",
    "fullText": "A Georgia Tech researcher is turning flickering light and sound into a new tool in the fight against Alzheimer’s, using rhythmic sensory stimulation to “tune” brain waves, boost memory, and potentially slow the disease’s progression. Her hope is that this non…",
    "link": "https://www.cnn.com/health/flickering-lights-sound-slow-alzheimers-annabelle-singer-spc"
  },
  {
    "text": "An Islamist party becomes Bangladesh's main opposition for the first time - NPR",
    "fullText": "An Islamist party has become Bangladesh's main opposition for the first time in the country's history, challenging the old dynastic political system despite persistent concerns among critics about the party's policies on women.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5715741/islamist-party-bangladesh-opposition"
  },
  {
    "text": "House fire prompts heavy emergency response in Sterling neighborhood - WJLA",
    "fullText": "Firefighters are on the scene of a house fire in Sterling, Virginia, that prompted a large emergency response on Sunday afternoon.According to Loudoun County F",
    "link": "https://wjla.com/news/local/sterling-loudoun-county-northern-virginia-house-fire-broad-run-drive-emergency-response-rapid-intervention-task-force-tanker-residential-roof-flames-blaze-traffic-delays-residents-investigation-smoke-conditions-public-safety-presence"
  },
  {
    "text": "YouTube adds new hurdles for ad blockers, and there's currently no way around it - Android Authority",
    "fullText": "YouTube is coming up with another infuriating way to force users to pay for Premium subscipriton or watch ads.",
    "link": "https://www.androidauthority.com/youtube-ad-blocker-comments-turned-off-3641167/"
  },
  {
    "text": "Salma Hayek Joins Mexican President Claudia Sheinbaum For Launch Of 30% Cinema Incentive - Deadline",
    "fullText": "Salma Hayek Joins Mexican President Claudia Sheinbaum For Launch Of 30% Cinema Incentive",
    "link": "http://deadline.com/2026/02/salma-hayek-mexican-president-sheinbaum-cinema-incentive-1236725762/"
  },
  {
    "text": "New Chrome Zero-Day (CVE-2026-2441) Under Active Attack — Patch Released - The Hacker News",
    "fullText": "Google fixes actively exploited Chrome zero-day CVE-2026-2441, a high-severity CSS use-after-free flaw enabling sandboxed remote code execution.",
    "link": "https://thehackernews.com/2026/02/new-chrome-zero-day-cve-2026-2441-under.html"
  },
  {
    "text": "Concerns over autocracy in the U.S. continue to grow - NPR",
    "fullText": "Is America still a democracy? Scholars tell NPR that after the last year under President Trump, the country has slid closer to autocracy or may already be there.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5705955/us-autocracy-concerns-grow"
  },
  {
    "text": "US carmakers spooked by Chinese rivals gaining foothold in America - Financial Times",
    "fullText": "Executives on edge about a possible policy shift in Washington ahead of Trump’s planned visit to China in April",
    "link": "https://www.ft.com/content/6192e7c1-2b0c-4a63-b66d-a23e6ba8c9e6"
  },
  {
    "text": "Kevin Durant Accused of Having a New Burner Account After Shocking Group Chats Get Leaked - Yahoo Sports",
    "fullText": "Kevin Durant has been accused of having a new burner account while roasting former teammates of his in leaked DM screenshots.",
    "link": "https://thesportsrush.com/nba-news-kevin-durant-accused-of-having-a-new-burner-account-after-shocking-group-chats-get-leaked/"
  },
  {
    "text": "Isaacman planning to meet with head of Roscosmos - SpaceNews",
    "fullText": "NASA Administrator Jared Isaacman said he is interested in meeting with his Russian counterpart and attending an upcoming Soyuz launch.",
    "link": "http://spacenews.com/isaacman-planning-to-meet-with-head-of-roscosmos/"
  }
]