[
  {
    "text": "North Korea’s Kim Jong Un triumphant at rare congress - Financial Times",
    "fullText": "Analysts say the reclusive regime is in its strongest geopolitical and economic position in years",
    "link": "https://www.ft.com/content/620a5268-a147-464f-8bf9-1b967efcb210"
  },
  {
    "text": "Rivian Adds A Sport Mode To All R1 EVs On The Road - InsideEVs",
    "fullText": "Plus, there’s a dedicated Apple Watch app that allows Gen 1 owners to leave their car key and smartphone at home.",
    "link": "https://insideevs.com/news/787692/rivian-sport-mode-all-r1-evs-apple-watch-app/"
  },
  {
    "text": "U.S. fighter jets intercept Russian warplanes off Alaskan coast - CBS News",
    "fullText": "Two Russian Tu-95s bombers, two Su-35s fighter planes and an A-50 spy plane were detected in the Alaskan Air Defense Identification Zone, NORAD said.",
    "link": "https://www.cbsnews.com/news/u-s-fighter-jets-intercept-russian-warplanes-off-alaskan-coast/"
  },
  {
    "text": "Asia stocks fall as rate uncertainty, Iran tensions weigh; S.Korea outperforms - Investing.com",
    "fullText": "Asia stocks fall as rate uncertainty, Iran tensions weigh; S.Korea outperforms",
    "link": "https://www.investing.com/news/stock-market-news/asia-stocks-fall-as-rate-uncertainty-iran-tensions-weigh-skorea-outperforms-4515123"
  },
  {
    "text": "Missing Bay Area skier Colin Kang found dead at Northstar California Resort, marking 3rd death this month - ABC7 San Francisco",
    "fullText": "A skier who was reported missing Wednesday night at Northstar resort in Truckee was found dead Thursday morning by search crews, the Placer County Sheriff's Office said. Authorities identified the man as 21-year-old Colin Kang of Fremont, who was an off-duty …",
    "link": "https://abc7news.com/post/missing-skier-found-dead-northstar-california-resort-marking-3rd-death-month/18622440/"
  },
  {
    "text": "In a historic vote, Tennessee Volkswagen workers get their first union contract - NPR",
    "fullText": "Two years ago, the successful union drive at this plant was expected to spark victories throughout the South. But now, as members vote to make their contract official, momentum has fizzled.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5711458/union-uaw-volkswagen-tennessee-contract-vote"
  },
  {
    "text": "'The Night Agent' Creator Talks S3 Shocking Death, Gives Big S4 Clues - Deadline",
    "fullText": "'The Night Agent's Shawn Ryan talks with Deadline about Season 3's shocking death, gives major S4 clues & reveals the story behind 'FU' to President.",
    "link": "http://deadline.com/2026/02/the-night-agent-shawn-ryan-season-3-death-season-4-clues-1236725307/"
  },
  {
    "text": "‘Landman’s Billy Bob Thornton Tells Great Robert Duvall Stories & Divulges The Deep Dark Secret He Never Told His Mentor - Deadline",
    "fullText": "'Landman' star Billy Bob Thornton tells great stories about his mentor, Robert Duvall, who died February 15 at 95.",
    "link": "http://deadline.com/2026/02/landman-billy-bob-thornton-tells-great-robert-duvall-tales-1236730026/"
  },
  {
    "text": "Epstein would 'name drop' Trump, Les Wexner says in deposition video - CNBC",
    "fullText": "Democrats on the House Oversight Committee have expressed skepticism about Wexner's insistence that he had virtually no social life with Epstein.",
    "link": "https://www.cnbc.com/2026/02/19/epstein-trump-les-wexner-deposition.html"
  },
  {
    "text": "Illinois Democrat tries to bleep her way through a tough Senate primary with a new expletive-laden anti-Trump ad - NBC News",
    "fullText": "Illinois Democratic Senate candidate Juliana Stratton's new ad full of F-bombs is the latest move in a contest that has centered on Trump.",
    "link": "https://www.nbcnews.com/politics/2026-election/illinois-democrat-juliana-stratton-senate-primary-trump-ad-rcna259761"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "‘Knight of the Seven Kingdoms’ Averaging Nearly 13 Million Viewers Per Episode, ‘The Pitt’ Season 2 at 12 Million - Variety",
    "fullText": "HBO and HBO Max programming can take an early victory lap, with both \"A Knight of the Seven Kingdoms\" and \"The Pitt\" Season 2 nabbing huge audiences",
    "link": "https://variety.com/2026/tv/ratings/knight-of-the-seven-kingdoms-the-pitt-season-2-viewership-1236667803/"
  },
  {
    "text": "Closing in on a universal vaccine: Nasal spray protects mice from respiratory viruses, bacteria and allergens - Medical Xpress",
    "fullText": "In the realm of medical advancements, a universal vaccine that can protect against any pathogen has long been a Holy Grail—and about as elusive as a mythological vessel. But Stanford Medicine researchers and collaborators have taken an astonishing step forwar…",
    "link": "https://medicalxpress.com/news/2026-02-universal-vaccine-nasal-spray-mice.html"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  },
  {
    "text": "Galaxy Buds 4 dummy leaks downplay AirPod comparisons with new metallic finish - 9to5Google",
    "fullText": "We know Samsung has another round of earbuds coming soon, likely timed with next week’s Galaxy S26 unveiling. Ahead of...",
    "link": "http://9to5google.com/2026/02/19/galaxy-buds-4-dummy-leaks-downplay-airpod-comparisons-with-new-metallic-finish/"
  },
  {
    "text": "Cats give genetic clues to better cancer treatments - Financial Times",
    "fullText": "Similarities between pet and human tumours suggest new ideas for targeting both",
    "link": "https://www.ft.com/content/807ac68a-d96a-4da0-bdfc-5970c3c5a836"
  },
  {
    "text": "Amazon surpasses Walmart in annual revenue for first time, as both chase AI-fueled growth - CNBC",
    "fullText": "The shuffle underscores the rivalry between the two retailers, particularly as Walmart expands its advertising and third-party marketplace businesses.",
    "link": "https://www.cnbc.com/2026/02/19/amazon-revenue-passes-walmart-earnings-reports.html"
  },
  {
    "text": "Why Christian Parker, Cowboys chose each other, and more: 'I'm ready' - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "An exhaustive search led the Cowboys right to the front door of Christian Parker, and both sides felt an instant chemistry in choosing to join forces to fix Dallas' ailing defense.",
    "link": "https://www.dallascowboys.com/news/why-christian-parker-cowboys-chose-each-other-and-more-i-m-ready"
  },
  {
    "text": "This new Windows 11 taskbar tool lets you test your internet speed in seconds - how to try it - ZDNET",
    "fullText": "This new taskbar button lets you measure the speed of your internet connection.",
    "link": "https://www.zdnet.com/article/windows-11-network-speed-test/"
  }
]