[
  {
    "text": "Seahawks franchise is going up for sale - The Seattle Times",
    "fullText": "The Seattle Seahawks officially announced Wednesday morning that the Paul G. Allen estate is beginning the process of putting the team up for sale.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-going-up-for-sale-paul-g-allen-estate-announces/"
  },
  {
    "text": "Trump has discussed timeline for Iran strikes — including as soon as this weekend — but no decision yet - CBS News",
    "fullText": "Trump has not yet made a final decision about whether to strike Iran, sources told CBS News.",
    "link": "https://www.cbsnews.com/news/trump-possible-timeline-iran-strikes/"
  },
  {
    "text": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "fullText": null,
    "link": "https://www.aol.com/articles/cardiologists-share-6-surprising-lifestyle-140000687.html"
  },
  {
    "text": "Trump says UK’s Starmer making ‘a big mistake’ with Chagos Islands deal - Al Jazeera",
    "fullText": "The US president warned the military base on Diego Garcia may be needed to respond to possible attack from Iran.",
    "link": "https://www.aljazeera.com/news/2026/2/18/trump-says-uks-starmer-big-mistake-diego-garcia-lease"
  },
  {
    "text": "Mass departures from Justice Dept. are boon for law firms, legal groups and political campaigns - CBS News",
    "fullText": "More than 5,000 employees have resigned, retired or been fired​ from the Justice Department in the first year of Mr. Trump's second administration.",
    "link": "https://www.cbsnews.com/news/mass-departures-justice-dept-boon-for-law-firms-legal-groups-campaigns/"
  },
  {
    "text": "White House taps Jay Bhattacharya, CDC critic, to lead agency for now - The Washington Post",
    "fullText": "The co-author of the Great Barrington Declaration, which rebuked CDC’s response to the coronavirus pandemic, will oversee the nation’s leading public health agency.",
    "link": "https://www.washingtonpost.com/politics/2026/02/18/jay-bhattacharya-cdc-director/"
  },
  {
    "text": "Texas Tech star JT Toppin receives heartbreaking injury diagnosis - On3",
    "fullText": null,
    "link": "https://www.on3.com/college/texas-tech-red-raiders/news/jt-toppin-injury-update-texas-tech-star-diagnosed-with-season-ending-torn-acl/"
  },
  {
    "text": "Agouti integrates environmental cues to regulate paternal behaviour - Nature",
    "fullText": "Expression of agouti signalling protein in neurons in the medial preoptic area is increased by group housing and negatively associated with care, and overexpression of Agouti reduces care and enhances infanticide in previously tolerant mice.",
    "link": "https://www.nature.com/articles/s41586-026-10123-4"
  },
  {
    "text": "Eddie Hearn blasts Dana White and his ‘new daddy,’ calls Zuffa Boxing ‘absolute complete dogsh*t’ so far - MMA Fighting",
    "fullText": "Eddie Hearn says it took Dana White about a ‘nanosecond’ to turn things personal between them",
    "link": "https://www.mmafighting.com/boxing/472228/eddie-hearn-blasts-dana-white-and-his-new-daddy-calls-zuffa-boxing-absolute-complete-dogsht-so-far"
  },
  {
    "text": "Bunnie Xo Says She Felt Like She Was 'Looking at a Younger Version of Me' When She Initially Met Stepdaughter Bailee - Yahoo",
    "fullText": "Bunnie Xo opened up about her deep connection with her stepdaughter Bailee Ann, 17, whom her husband Jelly Roll welcomed during a previous relationship. The podcaster shared that she saw a younger version of herself when she initially met her.",
    "link": "https://people.com/bunnie-xo-saw-a-younger-version-of-me-when-she-first-met-her-stepdaughter-11909160"
  },
  {
    "text": "Trump, weeks after backlash over racist post, hosts Black History Month reception - Associated Press News",
    "fullText": "President Donald Trump has hosted a White House reception for Black History Month, less than two weeks after he sparked a bipartisan outcry by posting a racist video on social media that depicted former President Barack Obama and his wife, Michelle Obama, as …",
    "link": "https://apnews.com/article/trump-black-history-month-white-house-5504416889f26156dcbdfc24d34b5c60"
  },
  {
    "text": "Etsy stock pops 14% on sale of Depop to eBay for $1.2 billion - CNBC",
    "fullText": "Etsy, which bought Depop nearly five years ago, said the deal would allow it to focus on its core marketplace business.",
    "link": "https://www.cnbc.com/2026/02/18/ebay-buying-depop-etsy.html"
  },
  {
    "text": "Anthony Hernandez responds to Sean Strickland’s racist post, vows to ‘torture him’ at UFC Houston - MMA Fighting",
    "fullText": "Anthony Hernandez would love to use all five rounds to beat down Sean Strickland.",
    "link": "https://www.mmafighting.com/ufc/472171/anthony-hernandez-responds-to-sean-stricklands-racist-post-vows-to-torture-him-at-ufc-houston"
  },
  {
    "text": "A startup called Germ becomes the first private messenger that launches directly from Bluesky's app - TechCrunch",
    "fullText": "Social network Bluesky now offers private messaging by integrating the startup Germ's E2E encrypted messenger natively in its app.",
    "link": "https://techcrunch.com/2026/02/18/a-startup-called-germ-becomes-the-first-private-messenger-that-launches-directly-from-blueskys-app/"
  },
  {
    "text": "Rapper Lil Poppa Dead at 25 - TMZ",
    "fullText": "Lil Poppa -- a popular rapper based out of Jacksonville, Florida -- has died ... TMZ has learned.",
    "link": "https://www.tmz.com/2026/02/18/rapper-lil-poppa-dead-at-25/"
  },
  {
    "text": "U2 releases Renee Good tribute song 'American Obituary' - NBC News",
    "fullText": "Irish rockers U2 condemn ICE immigration raids with the surprise release of EP \"Days of Ash,\" featuring a song for slain Minneapolis protester Renée Good, \"American Obituary.\"",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/u2-releases-renee-good-tribute-song-american-obituary-rcna259592"
  },
  {
    "text": "This is when Samsung is restocking the Galaxy Z TriFold in the US - GSMArena.com news - GSMArena.com",
    "fullText": "There will probably be limited quantities available again. Samsung's Galaxy Z TriFold launched in the US in late January and sold out in minutes, due to...",
    "link": "https://www.gsmarena.com/this_is_when_samsung_is_restocking_the_galaxy_z_trifold_in_the_us-news-71619.php"
  },
  {
    "text": "Hubble identifies a near-invisible galaxy that may be 99% dark matter - Phys.org",
    "fullText": null,
    "link": "https://phys.org/news/2026-02-hubble-invisible-galaxy-dark.html"
  },
  {
    "text": "Highland High reports over a week of measles exposure as Utah reaches 300 cases - KSL News",
    "fullText": "Highland High students could have been exposed to measles for more than a week as an infectious student attended school, and the Utah outbreak has reached 300 infections.",
    "link": "https://www.ksl.com/article/51449754/highland-high-reports-over-a-week-of-measles-exposure-as-utah-reaches-300-cases"
  }
]