[
  {
    "text": "S&P 500 seesaws after Trump signals Hassett may not be pick for new Fed chair: Live updates - CNBC",
    "fullText": "Semiconductor and bank stocks helped lift the broad market higher on Thursday.",
    "link": "https://www.cnbc.com/2026/01/15/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump floats new tariffs in push to acquire Greenland - CNBC",
    "fullText": "The comments show Trump considering applying his aggressive tariff strategies to his efforts to acquire Greenland.",
    "link": "https://www.cnbc.com/2026/01/16/trump-greenland-tariffs.html"
  },
  {
    "text": "Rams vs. Bears weather update: Snow, wind, cold in forecast for NFL divisional round - NBC Sports",
    "fullText": "The current forecast for kickoff is a temperature of 19 degrees, wind gusts of 20 miles per hour and a 45 percent chance of snow.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/rams-vs-bears-weather-update-snow-wind-cold-in-forecast-for-nfl-divisional-round"
  },
  {
    "text": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "fullText": "The parent company of X and Grok, xAI, launched a counter-suit saying she had violated its terms of service.",
    "link": "https://www.bbc.com/news/articles/cp37erw0zwwo"
  },
  {
    "text": "Cumberland County DA cancels news conference on ICE activity after state court concern - Portland Press Herald - Maine Sunday Telegram",
    "fullText": "The event was planned as officials in Maine's 2 largest cities anticipate an increased presence from U.S. Immigration and Customs Enforcement in the coming days.",
    "link": "https://www.pressherald.com/2026/01/16/cumberland-county-da-portland-officials-plan-friday-news-conference-on-ice-activity/"
  },
  {
    "text": "Novo Nordisk wins 3,071 prescriptions for Wegovy pill (NVO:NYSE) - Seeking Alpha",
    "fullText": "Novo Nordisk (NVO) stock is in focus as the Wegovy pill tops 3,071 U.S. scripts in the first 4 days of its launch. Read more here.",
    "link": "https://seekingalpha.com/news/4539771-novo-nordisk-wins-3071-prescriptions-wegovy-pill"
  },
  {
    "text": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded - BBC",
    "fullText": "The secret discussions, bombshell leak and sacking which led to Robert Jenrick defecting to the Reform party.",
    "link": "https://www.bbc.com/news/articles/ce3ejzz78gxo"
  },
  {
    "text": "Ukraine substation fire leaves city without power in freezing temperatures - BBC",
    "fullText": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "link": "https://www.bbc.com/news/live/cy7myy6k0jyt"
  },
  {
    "text": "4 questions that will be answered in the NFL playoffs’ divisional round - CNN",
    "fullText": "This postseason has already set an NFL playoff record with 12 fourth-quarter lead changes — and that’s before we even get to the divisional round this weekend.",
    "link": "https://www.cnn.com/2026/01/16/sport/nfl-playoffs-divisional-round"
  },
  {
    "text": "A 4-year-old died of flu complications. Her mother has a message for other parents - CNN",
    "fullText": "Four-year-old Ellie Rudd – who loved mud and getting dressed up and having dance parties with her brother and sisters – died January 6, after the flu and a co-infection with an adenovirus turned into pneumonia and sepsis.",
    "link": "https://www.cnn.com/2026/01/16/health/ellie-rudd-pediatric-flu"
  },
  {
    "text": "RFK Jr. Says He’s Ending the War on Protein. It Doesn’t Exist - WIRED",
    "fullText": "There is no war on protein. But pretending there is goes hand-in-hand with the Trump administration’s appeal to traditional masculinity.",
    "link": "https://www.wired.com/story/rfk-jr-says-hes-ending-the-war-on-protein-it-doesnt-exist/"
  },
  {
    "text": "Science shows very different psychiatric disorders might have the same cause - The Washington Post",
    "fullText": "A sweeping new study of psychiatric and genetic records has the potential to change treatment for millions of psychiatric patients.",
    "link": "https://www.washingtonpost.com/health/2026/01/01/psychiatric-disorders-genetic-bipolar-schizophrenia/"
  },
  {
    "text": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities - CNN",
    "fullText": "Public opinion on nearly every aspect of President Donald Trump’s first year back in the White House is negative, a new CNN poll conducted by SSRS finds, with a majority of Americans saying Trump is focused on the wrong priorities and doing too little to addr…",
    "link": "https://www.cnn.com/2026/01/16/politics/trump-economy-first-year-cnn-poll"
  },
  {
    "text": "'A Knight of the Seven Kingdoms' is 'Game of Thrones' for the haters - NPR",
    "fullText": "There are no dragons, no maps and no internecine family trees in this Game of Thrones prequel about an underdog knight and his would-be squire.",
    "link": "https://www.npr.org/2026/01/16/nx-s1-5671737/a-knight-of-the-seven-kingdoms-review-hbo-game-of-thrones-prequel"
  },
  {
    "text": "Patriots vs. Texans increasingly likely to become a snow game - Pats Pulpit",
    "fullText": "The Patriots will host the Texans at Gillette Stadium on Sunday afternoon.",
    "link": "https://www.patspulpit.com/new-england-patriots-nfl-playoffs/119367/weather-forecast-divisional-round-packers"
  },
  {
    "text": "Republicans are scrambling to counter Trump on Greenland - Politico",
    "fullText": "GOP lawmakers are stepping up their warnings and engaging in diplomacy as the president's threats escalate.",
    "link": "https://www.politico.com/news/2026/01/16/greenland-trump-republicans-congress-00732945"
  },
  {
    "text": "Google is finally copying this Apple Watch feature for its Pixel Watch - Android Authority",
    "fullText": "An upcoming Android feature may alert you if your Pixel Watch gets left behind, though its real utility will be to alert you if it's stolen.",
    "link": "https://www.androidauthority.com/pixel-watch-left-behind-notification-3633004/"
  },
  {
    "text": "10 breakthrough technologies to expect in 2026 : Short Wave - NPR",
    "fullText": "Wanna know where tech is headed this year? MIT Technology Review has answers. They compile an annual list called \"10 Breakthrough Technologies\". Today, host Regina G. Barber speaks with executive editor Amy Nordrum about the list, and they get into everything…",
    "link": "https://www.npr.org/2026/01/16/nx-s1-5675328/tech-list-2026-ai-space"
  }
]