[
  {
    "text": "Andrei Arlovksi bludgeons Ben Rothwell in bloody BKFC heavyweight title fight at Knucklemania 6 - Yahoo Sports",
    "fullText": "Andrei Arlovski made it three in a row against Ben Rothwell, who was left battered, beaten and without a belt.",
    "link": "https://sports.yahoo.com/mma/breaking-news/live/andrei-arlovksi-bludgeons-ben-rothwell-in-bloody-bkfc-heavyweight-title-fight-at-knucklemania-6-063037486.html"
  },
  {
    "text": "James Harden makes mark in Cavs’ debut, helping Cleveland rally from behind in 132-126 win - Cleveland.com",
    "fullText": "Harden and the Cavs rallied in the fourth quarter to escape with a 132-126 win over the crumbling Sacramento Kings on Saturday night.",
    "link": "https://www.cleveland.com/cavs/2026/02/james-harden-makes-mark-in-cavs-debut-helping-cleveland-rally-from-behind-in-132-126-win.html"
  },
  {
    "text": "Pokemon Presents predictions for Pokemon Day 2026 - Nintendo Everything",
    "fullText": "We take a look at every possible announcement and update for the upcoming Pokemon Presents on February 27, 2026 for Pokemon Day.",
    "link": "https://nintendoeverything.com/pokemon-day-predictions-2026/"
  },
  {
    "text": "El Grande Americano attacks El Grande Americano in AAA - Cageside Seats",
    "fullText": "The feud continues.",
    "link": "https://www.cagesideseats.com/lucha-libre-aaa-cmll/416717/el-grande-americano-attacks-el-grande-americano-aaa-wwe"
  },
  {
    "text": "Quick hits: Illini win streak snapped in 85-82 overtime loss at No. 10 Michigan State - 247Sports",
    "fullText": "Jeremy Fears Jr outdueled Keaton Wagler in a top10 Big Ten showdown",
    "link": "https://247sports.com/college/illinois/article/illinois-fighting-illini-basketball-michigan-state-quick-hits-recap-273547872/"
  },
  {
    "text": "Did a popular acne medication drive a Texas teen to shoot his friends? - cbsnews.com",
    "fullText": "Connor Hilton, 17, said that after taking Accutane, a prescribed acne medication, he began to have suicidal and homicidal thoughts – thoughts that, his defense argued, led him to shoot two friends in the head at his Friendswood, Texas, home. Prosecutors weren…",
    "link": "https://www.cbsnews.com/news/connor-hilton-friendswood-texas-shooting-acne-medication-48-hours/"
  },
  {
    "text": "Democrat Chasity Verret Martinez wins District 60 seat, replacing Chad Brown - The Advocate",
    "fullText": "Martinez, a Democrat and Iberville Parish Council member won Saturday's special election with 62% of the vote against small business owner and port commission member Brad Daigle.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/elections/chasity-verret-martinez-wins-election/article_4215bf58-3e04-4797-bdf5-067053533090.html"
  },
  {
    "text": "M5 MacBook Air will just be a spec bump, but there’s one upgrade I really want to see - 9to5Mac",
    "fullText": "In many of its most recent hardware launches, including iPad Pro and iPhone 17 Pro, Apple has prioritized one thing...",
    "link": "https://9to5mac.com/2026/02/07/m5-macbook-air-one-feature-request-better-thermals/"
  },
  {
    "text": "Five takeaways from IU basketball’s win against Wisconsin - Inside the Hall",
    "fullText": "IU basketball won a pivotal game on Saturday afternoon,beating Wisconsin 78-77 in overtime at Simon Skjodt Assembly Hall.",
    "link": "https://www.insidethehall.com/2026/02/07/five-takeaways-from-iu-basketballs-win-against-wisconsin/"
  },
  {
    "text": "Amazon MGM Goes on Offense as ‘Melania’ Risks Getting Sacked at Super Bowl Box Office - The Hollywood Reporter",
    "fullText": "The first lady's documentary is falling off steeply in its second weekend, prompting Amazon MGM to go on the offensive and stress that the film is in it for the long game, whether theatrically or streaming.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/amazon-defends-melania-sacked-box-office-1236497985/"
  },
  {
    "text": "Immigrant whose skull was broken in 8 places during ICE arrest says beating was unprovoked - NPR",
    "fullText": "Alberto Castañeda Mondragón was hospitalized with eight skull fractures and five life-threatening brain hemorrhages. Officers claimed he ran into a wall, but medical staff doubted that account.",
    "link": "https://www.npr.org/2026/02/07/g-s1-109219/immigrant-ice-arrest-beating"
  },
  {
    "text": "Appeals court affirms Trump policy of jailing immigrants without bond - AP News",
    "fullText": "A federal appeals court has ruled that President Donald Trump's administration can continue detaining immigrants without bond. The 5th Circuit Court of Appeals decided on Friday that the Department of Homeland Security's policy aligns with the constitution an…",
    "link": "https://apnews.com/article/fifth-circuit-immigrant-detainees-denied-bond-f5265ecf771d1f8e9f20d48bddfb1a25"
  },
  {
    "text": "Trump aims to hold the first meeting of his new Board of Peace in Washington this month - Politico",
    "fullText": "The meeting, proposed for Feb. 19, will seek to raise money for the reconstruction of Gaza.",
    "link": "https://www.politico.com/news/2026/02/07/trump-aims-to-hold-the-first-meeting-of-his-new-board-of-peace-in-washington-this-month-00770478"
  },
  {
    "text": "N. Korea to hold party congress in February, first since 2021 - Yahoo",
    "fullText": "North Korea's leadership will hold a party congress later this month, state media announced Sunday, in what will be the first such major gathering since 2021...",
    "link": "https://www.yahoo.com/news/articles/n-korea-hold-party-congress-224248957.html"
  },
  {
    "text": "Everything in Roger Goodell’s NFL is designed to make you feel sick - New York Post",
    "fullText": "Exciting night. Can’t wait for pandering Roger Goodell’s latest halftime extravaganza.",
    "link": "https://nypost.com/2026/02/07/sports/everything-in-roger-goodells-nfl-is-designed-to-make-you-feel-sick/"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Former French minister Lang resigns from Arab World Institute after Epstein correspondence revealed - cnn.com",
    "fullText": "Jack Lang, a former French culture minister, has resigned as president of the Arab World Institute, the French Foreign Affairs Ministry said on Saturday, after revelations of his past contacts with Jeffrey Epstein and the launch of a financial investigation.",
    "link": "https://www.cnn.com/2026/02/07/europe/france-jack-lang-epstein-ties-latam-intl"
  },
  {
    "text": "Teachers, others shocked to get SFUSD ‘assignments’ for strike day - Mission Local",
    "fullText": "On late Friday, workers were given 'redeployment assignments' to 'Staff Centers' opened because of Monday's school closures. They're confused.",
    "link": "http://missionlocal.org/2026/02/teachers-others-shocked-to-get-sfusd-assignments-for-strike-day/"
  },
  {
    "text": "These Game Boy, DS, 3DS, GameCube, Wii, and Wii U games sold exactly 1 copy each in the U.S. in 2025 - Nintendo Everything",
    "fullText": "New data has been released that reveals games that sold exactly one unit in the United States during 2025 on older Nintendo platforms. Wii U is the newest of the bunch, but this stretches all the way back to the Game Boy. The full list is as follows: Game Boy…",
    "link": "https://nintendoeverything.com/these-game-boy-ds-3ds-gamecube-wii-and-wii-u-games-sold-exactly-1-copy-each-in-the-u-s-in-2025/"
  },
  {
    "text": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org",
    "fullText": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…",
    "link": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html"
  }
]