[
  {
    "text": "Smith seizes Matias' WBC belt with stunning KO - ESPN",
    "fullText": "Dalton Smith pulled off a stunning fifth-round knockout of Subriel Matias to become the WBC junior welterweight champion in a thrilling clash in Brooklyn.",
    "link": "https://www.espn.com/boxing/story/_/id/47577703/dalton-smith-stuns-subriel-matias-5th-round-ko-win-title"
  },
  {
    "text": "Sources: Bregman to Cubs on 5-year, $175M deal - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mlb/story/_/id/47576883/sources-alex-bregman-agrees-5-year-175m-deal-cubs"
  },
  {
    "text": "Spurs 100-95 Celtics (Jan 10, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810400"
  },
  {
    "text": "Rams 34-31 Panthers (Jan 10, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nfl/recap?gameId\\\\u003d401772979"
  },
  {
    "text": "'I had no electricity for six months': American families struggle with soaring energy prices - BBC",
    "fullText": "Rising electricity costs have emerged as a key cost-of-living concern, pushing families further into debt.",
    "link": "https://www.bbc.com/news/articles/c1dz0dz0zkvo"
  },
  {
    "text": "Lucas: Wake Forest Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the lone meeting with the Deacs.",
    "link": "https://goheels.com/news/2026/1/10/mens-basketball-lucas-wake-forest-rapid-reactions"
  },
  {
    "text": "Slow-moving prisoner releases in Venezuela enter 3rd day after government announces goodwill effort - abcnews.go.com",
    "fullText": "Venezuela’s government has pledged to free a significant number of prisoners.",
    "link": "https://abcnews.go.com/International/wireStory/slow-moving-prisoner-releases-venezuela-enter-3rd-day-129092386"
  },
  {
    "text": "Town cashing-in on China's billion-dollar appetite for luxury durian - BBC",
    "fullText": "A former gold mining town in Malaysia has seen its riches turn a new shade of yellow, thanks to this pungent fruit.",
    "link": "https://www.bbc.com/news/articles/cz7ndzw28v4o"
  },
  {
    "text": "US military strikes Islamic State group targets in Syria, officials say - BBC",
    "fullText": "US President Donald Trump ordered the \"large-scale strikes\" on Saturday, US Central Command announced.",
    "link": "https://www.bbc.com/news/articles/cly9597r4qpo"
  },
  {
    "text": "Day after Minneapolis shooting, Noem ordered new restriction on congressional oversight - Politico",
    "fullText": "The Trump administration revealed the new policy late Saturday after three lawmakers were blocked from entering an ICE facility in Minnesota.",
    "link": "https://www.politico.com/news/2026/01/10/minnesota-democrats-ice-00721211"
  },
  {
    "text": "Oregon warns of possible measles exposure at two Linn County hospitals - OregonLive.com",
    "fullText": "Oregon's first two confirmed measles cases were reported earlier this week.",
    "link": "https://www.oregonlive.com/health/2026/01/oregon-warns-of-possible-measles-exposure-at-two-linn-county-hospitals.html"
  },
  {
    "text": "Nasty flu season tears through Northern Virginia - InsideNoVa.com",
    "fullText": "It’s that time of year again, but this time it’s particularly bad. Respiratory illnesses, especially influenza, are tearing through Northern Virginia, accounting for 22% of ER visits in the week ending Jan. 3, according to the Virginia Department of Health.",
    "link": "https://www.insidenova.com/news/fairfax/nasty-flu-season-tears-through-northern-virginia/article_b885e69b-eb59-424e-b1a5-b119d986e754.html"
  },
  {
    "text": "Watch SpaceX launch NASA's Pandora exoplanet-studying satellite on Jan. 11 - Space",
    "fullText": "Liftoff is scheduled for 8:19 a.m. ET on Sunday (Jan. 11).",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/watch-spacex-launch-nasas-pandora-exoplanet-studying-satellite-on-jan-11"
  },
  {
    "text": "AEW Collision Preview: January 10, 2026 – Briscoe Defends TNT Title, El Clon vs. Komander, Women’s Champs in Trios Action, More - AEW",
    "fullText": "We’re back in Arlington, Texas, for AEW Collision to continue the residency at Esports Stadium Arlington, LIVE tonight at 8 p.m. ET/7 p.m. CT on TNT and streaming on HBO Max!",
    "link": "https://www.allelitewrestling.com/post/aew-collision-preview-january-10-2026"
  },
  {
    "text": "Samsung Confirms New Options For Android Users After Gmail Issues - Forbes",
    "fullText": "Decision time for Android users as Google’s AI completely takes over your smartphone.",
    "link": "https://www.forbes.com/sites/zakdoffman/2026/01/10/samsung-confirms-new-options-for-android-users-after-gmail-issues/"
  },
  {
    "text": "Hubble Telescope’s Final Countdown: Could It Disappear Sooner Than Expected? - The Daily Galaxy",
    "fullText": "As the Hubble Space Telescope faces the end of its mission, experts predict that it could reenter Earth’s atmosphere earlier than predicted.",
    "link": "https://dailygalaxy.com/2026/01/hubble-countdown-could-it-disappear-sooner/"
  },
  {
    "text": "Samsung's Galaxy S26 series release date may have just been etched in stone - PhoneArena",
    "fullText": "It's a little later than we all expected a while ago, but mostly in line with the most recent speculation.",
    "link": "https://www.phonearena.com/news/samsung-galaxy-s26-series-release-date-rumored-almost-guaranteed_id177214"
  },
  {
    "text": "5 ground-breaking (and strange) products you could soon buy from the 2026 Consumer Electronics Show - Business Insider",
    "fullText": "From a lollipop that lets you taste sound to a Tamagotchi style AI pet that physically grows, here are the coolest tech you could get your hands on.",
    "link": "https://www.businessinsider.com/ground-breaking-and-quirky-products-from-the-2026-ces-2026-1"
  }
]