[
  {
    "text": "Seahawks’ Super Bowl parade and celebration: What to know - The Seattle Times",
    "fullText": "Wednesday's parade will kick off after the trophy celebration at Lumen Field. While that celebration will require tickets, the parade will not.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-super-bowl-parade-and-celebration-what-to-know/"
  },
  {
    "text": "Asian Stocks Set to Extend Rally to Another Record: Markets Wrap - bloomberg.com",
    "fullText": "Asian stocks extended their rally to a fresh record as a rebound in US technology shares gathered pace, easing pressure on markets after worries over outsized spending on artificial intelligence.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-09/stock-market-today-dow-s-p-live-updates"
  },
  {
    "text": "49ers' Keion White has surgery after being shot in ankle in S.F. - ESPN",
    "fullText": "49ers defensive lineman Keion White underwent surgery Monday after he was shot in the ankle in San Francisco hours after Super Bowl LX concluded.",
    "link": "https://www.espn.com/nfl/story/_/id/47882230/49ers-keion-white-shot-ankle-san-francisco-hours-super-bowl-lx"
  },
  {
    "text": "New video game sees Africans fantasise about taking back looted treasures - BBC",
    "fullText": "Imagine it is 2099 and a historic treaty to return African artefacts is falling apart.",
    "link": "https://www.bbc.com/news/articles/clyg4lgm1d2o"
  },
  {
    "text": "House approves housing bill, setting stage for tough Senate negotiations - Politico",
    "fullText": "After a bipartisan House vote, the housing deal faces a bicameral test.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/house-approves-housing-bill-setting-stage-for-tough-senate-negotiations-00772552"
  },
  {
    "text": "SFUSD teachers are on strike. Schools closed for 50,000 kids - The San Francisco Standard",
    "fullText": "Negotiations between the teachers union and district officials resume at noon. The Standard will have updates throughout the day.",
    "link": "https://sfstandard.com/2026/02/09/sfusd-teachers-strike-begins-schools-closed-negotiations-monday/"
  },
  {
    "text": "Thailand election: The result the polls never saw coming - BBC",
    "fullText": "Why did a youthful, progressive party do so poorly compared to a transactional, old-style party?",
    "link": "https://www.bbc.com/news/articles/c5y6534y3y5o"
  },
  {
    "text": "Travis Kelce’s Ex Kayla Nicole Pokes Fun at His Relationship With Taylor Swift in Super Bowl Ad - Billboard",
    "fullText": "Travis Kelce's ex Kayla Nicole poked fun at his romance with Taylor Swift in a Super Bowl ad also starring Offset and Tiffany Haddish.",
    "link": "http://www.billboard.com/music/music-news/travis-kelce-ex-kayla-nicole-pokes-fun-taylor-swift-sb-ad-1236176948/"
  },
  {
    "text": "Just look at Ayaneo's absolute unit of a Windows gaming \"handheld\" - Ars Technica",
    "fullText": "The Ayaneo Next II pushes past 3 pounds, 13 inches wide, and costs up to $4,300.",
    "link": "https://arstechnica.com/gaming/2026/02/just-look-at-ayaneos-absolute-unit-of-a-windows-gaming-handheld/"
  },
  {
    "text": "Andrew Janocko among Las Vegas Raiders offensive coordinator candidates - Silver And Black Pride",
    "fullText": "Insider names three Seahawks assistants to watch for Las Vegas Raiders OC opening. Raiders offensive coordinator role, Andrew Janocko, Justin Outten headline",
    "link": "https://www.silverandblackpride.com/las-vegas-raiders-coaching-staff/121838/andrew-janocko-among-las-vegas-raiders-offensive-coordinator-candidates"
  },
  {
    "text": "Instagram and YouTube owners built 'addiction machines', trial told - BBC",
    "fullText": "The tech giants are under scrutiny over social media addiction in a landmark jury trial in Los Angeles",
    "link": "https://www.bbc.com/news/articles/c3wlpqpe2z4o"
  },
  {
    "text": "Common Sweetener May Damage Critical Brain Barrier, Risking Stroke - ScienceAlert",
    "fullText": "Found in everything from protein bars to energy drinks, erythritol has long been considered a safe alternative to sugar.",
    "link": "https://www.sciencealert.com/common-sweetener-may-damage-critical-brain-barrier-risking-stroke"
  },
  {
    "text": "Multiple employees of Canadian mining company found dead in Mexico - BBC",
    "fullText": "Vizsla Silver Corp says that family members of some of the kidnapped workers have informed the company that their relatives were found dead.",
    "link": "https://www.bbc.com/news/articles/cly0zz7yd3go"
  },
  {
    "text": "King's 'profound concern' as police consider Andrew claims over Epstein - BBC",
    "fullText": "Making his first intervention in the Epstein scandal, the King said he is ready to support the police in their inquiries.",
    "link": "https://www.bbc.com/news/articles/cqlgv3z79klo"
  },
  {
    "text": "Trump administration’s changes to the CFPB cost Americans $19B, a new report says - AP News",
    "fullText": "The Trump administration has significantly reduced the Consumer Financial Protection Bureau's activities over the past year. Consumer advocates and Democrats now estimate this has cost Americans $19 billion in lost financial relief. The administration argues …",
    "link": "https://apnews.com/article/cfpb-russell-vought-trump-elizabeth-warren-783a68f170d79e83444fe2350239d098"
  },
  {
    "text": "Column | Want to lose weight? Here’s why exercise probably won’t help. - The Washington Post",
    "fullText": "The benefits of exercise are numerous, but losing weight isn’t one of them. Here are some better motivations to add regular exercise to your routine.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/09/exercise-weight-loss/"
  },
  {
    "text": "Vance is in Armenia, a country no sitting US president or vice president has visited before - AP News",
    "fullText": "Vice President JD Vance is in Armenia, a country that no sitting U.S. vice president or president has visited before. He's there on Monday to try advance a U.S.-brokered deal aimed at ending a conflict between Armenia and Azerbaijan. Vance and Armenia's prime…",
    "link": "https://apnews.com/article/trump-vance-armenia-azerbaijan-69a04efaea7e62994d3a749bb2bf27fc"
  },
  {
    "text": "Sheen beatification confirmed; date and place remain TBD - The Pillar",
    "fullText": "Beatification of the popular American archbishop has been anticipated for several years",
    "link": "https://www.pillarcatholic.com/p/sheen-beatification-confirmed-date"
  }
]