[
  {
    "text": "2025-26 College Football Playoff schedule, dates, TV channel, sites - NCAA.com",
    "fullText": "Here's the schedule for the College Football Playoff for the 2025-26 season. This is the second year of the 12-team playoff. The bracket was announced on Sunday, Dec. 7.",
    "link": "https://www.ncaa.com/news/football/article/2025-12-31/2025-26-college-football-playoff-schedule-dates-tv-channel-sites"
  },
  {
    "text": "China announces it 'successfully completed' Taiwan military maneuvers - ABC News",
    "fullText": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
    "link": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777"
  },
  {
    "text": "Oil tanker pursued by US now has a Russian flag painted on its side - CNN",
    "fullText": "Crew members aboard the aging, rusted oil tanker that the US has been pursuing at sea for nearly two weeks appear to have painted a crude image of a Russian flag on the ship’s hull, which American officials believe is an attempt at claiming Russian protection…",
    "link": "https://www.cnn.com/2025/12/31/politics/oil-tanker-venezuela-russian-flag"
  },
  {
    "text": "Trump vetoes two bipartisan bills, marking first vetoes of second term - CNN",
    "fullText": "President Donald Trump issued the first vetoes of his second term Tuesday, blocking two bipartisan, infrastructure-related bills.",
    "link": "https://www.cnn.com/2025/12/31/politics/trump-bipartisan-bills-vetoes"
  },
  {
    "text": "Real-life experiment shows Niels Bohr was right in a theoretical debate with Einstein - Phys.org",
    "fullText": "Scientists in China have performed an experiment first proposed by Albert Einstein almost a century ago when he sought to disprove the quantum mechanical principle of complementarity put forth by Niels Bohr and his school of physicists. Bohr claimed there are…",
    "link": "https://phys.org/news/2025-12-real-life-niels-bohr-theoretical.html"
  },
  {
    "text": "Why flu cases are surging this season. And, protests erupt in Iran over the economy - NPR",
    "fullText": "The flu is spreading rapidly across the U.S. this season, and it is expected to get worse. And, protests have erupted across Iran over the country's troubled economy.",
    "link": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests"
  },
  {
    "text": "Body found during search for missing Texas teen as another girl disappears and more top headlines - Fox News",
    "fullText": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
    "link": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-another-girl-disappears-more-top-headlines"
  },
  {
    "text": "The Most Awkward CFP Run Ever: Ole Miss, LSU, Lane Kiffin, And A Transfer Portal About To Explode - OutKick",
    "fullText": "Lane Kiffin’s move to LSU created unprecedented awkwardness for Ole Miss during CFP prep, with assistants juggling roles and portal tensions rising.",
    "link": "https://www.outkick.com/sports/ole-miss-sugar-bowl-drama-kiffin-lsu-coaching-charlie-weis-crossover"
  },
  {
    "text": "It's going to be a cold New Year's Eve in the Pittsburgh area with heavy snowfall tonight - CBS News",
    "fullText": "A Winter Weather Advisory has been issued for the region with a Winter Storm Warning for Somerset County and the ridges of Westmoreland and Fayette County.",
    "link": "https://www.cbsnews.com/pittsburgh/news/its-going-to-be-a-cold-new-years-eve-in-the-pittsburgh-area-with-heavy-snowfall-tonight/"
  },
  {
    "text": "Kennedy Center changed board rules months before vote to add Trump’s name - The Washington Post",
    "fullText": "The cultural center said only trustees appointed by the president could vote, barring other members, including Democrats who hold seats, from decisions.",
    "link": "https://www.washingtonpost.com/style/2025/12/31/kennedy-center-board-trustees-bylaws/"
  },
  {
    "text": "NASA could be weeks away from its biggest test in decades - CNN",
    "fullText": "The NASA Artemis II mission, set to lift off as soon as February, will mark the first time astronauts have aimed to venture beyond near-Earth orbit since 1972.",
    "link": "https://www.cnn.com/2025/12/31/science/artemis-2-astronauts-moon-mission-overview"
  },
  {
    "text": "Guinea elections: Gen Mamady Doumbouya wins presidency by landslide - BBC",
    "fullText": null,
    "link": "https://www.bbc.com/news/articles/cx2520nyp8yo"
  },
  {
    "text": "Latest deep-sea search for missing Malaysia Airlines Flight 370 gets underway - ABC News",
    "fullText": "A deep-sea search for Malaysia Airlines Flight 370 has begun in the Indian Ocean, reviving efforts to solve one of aviation’s greatest mysteries",
    "link": "https://abcnews.go.com/International/wireStory/latest-deep-sea-search-missing-malaysia-airlines-flight-128801273"
  },
  {
    "text": "Zelenskyy suggests Trump fly to Ukraine to help 'end the war' - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/zelenskyy-suggests-trump-fly-ukraine-end-war/story?id\\\\u003d128799582"
  },
  {
    "text": "When increased 2026 Social Security payments arrive — and what's changing - Axios",
    "fullText": "Higher Social Security retirement and disability benefits are coming. What is the January payment schedule.",
    "link": "https://www.axios.com/2025/12/31/social-security-benefits-2026-cola-increase-payments"
  },
  {
    "text": "Remembering the actors, musicians, writers and artists we lost in 2025 - NPR",
    "fullText": "Every year, we remember some of the writers, actors, musicians, filmmakers and performers who died over the past year, and whose lifetime of creative work helped shape our world.",
    "link": "https://www.npr.org/2025/12/31/nx-s1-5600863/obituaries-2025-reiner-keaton-redford-hackman"
  },
  {
    "text": "Cotton Bowl Skull Session: Get Dumped Then, Miami - Eleven Warriors",
    "fullText": "It's been a bad day to be a Miami Hurricane since Jan. 3, 2003. Now it's time for the Ohio State Buckeyes to make it even worse.",
    "link": "https://www.elevenwarriors.com/skull-sessions/2025/12/160728/cotton-bowl-skull-session-get-dumped-then-miami"
  }
]