[
  {
    "text": "Manon Bannerman Taking Temporary Hiatus From KATSEYE - TMZ",
    "fullText": "KATSEYE is going to look and sound different ... because moving forward the group will be missing Manon Bannerman.",
    "link": "https://www.tmz.com/2026/02/20/manon-leaving-katseye-temporarily/"
  },
  {
    "text": "‘Venom’ Animated Movie in the Works With ‘Final Destination’ Filmmakers Zach Lipovsky, Adam B. Stein (Exclusive) - The Hollywood Reporter",
    "fullText": "Animated symbiotes, oh my!",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/venom-animated-movie-in-the-works-1236510453/"
  },
  {
    "text": "Mayweather to unretire, resume boxing after Tyson exhibition - ESPN",
    "fullText": "Former boxing superstar Floyd Mayweather Jr. says he is unretiring and will resume his undefeated career after his planned exhibition bout against Mike Tyson.",
    "link": "https://www.espn.com/boxing/story/_/id/47989767/mayweather-jr-unretire-resume-boxing-tyson-exhibition"
  },
  {
    "text": "California storm dumped staggering amounts of snow in Tahoe - San Francisco Chronicle",
    "fullText": "Some parts of the Sierra Nevada near Tahoe got over 10 feet of snow over five days, making for the largest accumulations in decades in some areas.",
    "link": "https://www.sfchronicle.com/weather/article/california-tahoe-sierra-snow-21369411.php"
  },
  {
    "text": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show - CBS News",
    "fullText": "A major nor'easter could bring blizzard conditions to Boston at the end of the weekend, the latest weather forecast shows.",
    "link": "https://www.cbsnews.com/boston/news/boston-weather-snow-blizzard-maps/"
  },
  {
    "text": "Snooki Reveals Cervical Cancer Diagnosis, Urges Fans to Get Pap Smears - TMZ",
    "fullText": "Snooki is sharing a scary health update ... revealing she’s been diagnosed with stage 1 cervical cancer.",
    "link": "https://www.tmz.com/2026/02/20/snooki-clarifies-cancer-diagnosis/"
  },
  {
    "text": "Trump adminstration rolls back mercury rules for coal-fired power plants - The Allegheny Front",
    "fullText": "The rule for mercury emissions from coal-fired power plants will be rolled back to a 2012 standard. Mercury is a neurotoxin.",
    "link": "https://www.alleghenyfront.org/trump-mercury-standard-coal-fired-power-plants-rollback/"
  },
  {
    "text": "Judge forced to slash SF jury pool over hate for Elon Musk - SFGATE",
    "fullText": "A San Francisco trial over Elon Musk's Twitter acquisition lost more than a third of its prospective jurors due to intense bias against the billionaire.",
    "link": "https://www.sfgate.com/tech/article/sf-jury-elon-musk-21369850.php"
  },
  {
    "text": "2026 draft: Ten debate-worthy prospects to track at the NFL combine - NFL.com",
    "fullText": "With the NFL combine around the corner, Bucky Brooks dissects 10 prospects who are sure to inspire debate heading into the 2026 draft.",
    "link": "https://www.nfl.com/news/2026-draft-ten-debate-worthy-prospects-to-track-at-the-nfl-combine"
  },
  {
    "text": "“Netflix Does Not Need this Deal”: Netflix Stock (NASDAQ:NFLX) Notches Up as Warner Merger Looks Shaky - TipRanks",
    "fullText": "Streaming giant Netflix ($NFLX) may be on the verge of taking over Warner Bros. Discovery ($WBD). There are doubts, however, that that deal will actually reach fruition. But even if",
    "link": "https://www.tipranks.com/news/netflix-does-not-need-this-deal-netflix-stock-nasdaqnflx-notches-up-as-warner-merger-looks-shaky"
  },
  {
    "text": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "fullText": "In a new video of Punch, the baby monkey is dragged around in circles by an adult monkey, upsetting animal lovers around the globe. The zoo explains.",
    "link": "https://www.usatoday.com/story/news/world/2026/02/20/punch-baby-monkey-update-attacked-video-japan-zoo/88776501007/"
  },
  {
    "text": "Americans Are Reacting To South Korea's Ex-President Being Jailed For Insurrection - BuzzFeed",
    "fullText": "\"Must be nice.\"",
    "link": "https://www.buzzfeed.com/michaelabramwell/americans-react-to-ex-south-korean-president-jailed"
  },
  {
    "text": "See where snow could be measured in inches — or feet — in the East this weekend - The Washington Post",
    "fullText": "A strong nor’easter is expected to form near the Mid-Atlantic coast on Sunday, threatening to bring accumulating snow, strong winds and travel disruptions.",
    "link": "https://www.washingtonpost.com/weather/2026/02/20/noreaster-snow-forecast-midatlantic-northeast/"
  },
  {
    "text": "Scoop: NJ, NY reps to oppose Iran war powers resolution in House - Axios",
    "fullText": "Their opposition will make it harder for the resolution to pass.",
    "link": "https://www.axios.com/2026/02/20/iran-war-powers-gottheimer-lawler-congress"
  },
  {
    "text": "Ubisoft confirms a lot of new Far Cry and Assassin's Creed games are in development - Eurogamer",
    "fullText": "Ubisoft has not one, but two Far Cry games currently in development.",
    "link": "https://www.eurogamer.net/ubisoft-confirms-a-lot-of-new-far-cry-and-assassins-creed-games-are-in-development"
  },
  {
    "text": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Gennaro Filice defies \"positional value,\" predicting a running back, linebacker and safety come off the board in the top 10. Check out his full first-round projection, 1-32.",
    "link": "https://www.nfl.com/news/gennaro-filice-2026-nfl-mock-draft-1-0-jeremiyah-love-cracks-top-five-chiefs-take-wr-jordyn-tyson"
  },
  {
    "text": "Norway wins its 17th gold medal, breaking record for most golds won in a single Winter Olympics - AP News",
    "fullText": "Johannes Dale-Skjevdal of Norway was the only biathlete to hit all 20 of his targets in the 15-kilometer mass start race Friday and skied his way to gold Norway’s 17th gold medal of the Milan Cortina Winter Olympics — breaking the record for the most gold med…",
    "link": "https://apnews.com/article/winter-olympics-norway-gold-record-biathlon-8d64eaeceeaf2d94e36df59d8d204639"
  },
  {
    "text": "Trump hosts governors' breakfast after National Governors Association pulls out of event - PBS",
    "fullText": "President Donald Trump is still expected to meet with governors at the White House on Friday but the event will not be facilitated by an organization founded more than a century ago to help state leaders from both parties advocate for their interests in Washi…",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-hosts-governors-breakfast-after-national-governors-association-pulls-out-of-event"
  },
  {
    "text": "OpenAI Plans to Price Smart Speaker at $200 to $300, as AI Device Team Takes Shape - The Information",
    "fullText": "OpenAI has more than 200 people working on a family of AI-powered devices that will include a smart speaker and possibly smart glasses and a smart lamp, according to a person with knowledge of the plans. New details are starting to emerge about the group and …",
    "link": "https://www.theinformation.com/articles/inside-openai-team-developing-ai-devices"
  },
  {
    "text": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say - AP News",
    "fullText": "Four years into its full-scale invasion, Russia controls about 20% of Ukrainian territory, where an estimated 3 million to 5 million people live. Life in shattered cities and villages alike remains difficult, with residents facing problems with housing, water…",
    "link": "https://apnews.com/article/russia-war-ukraine-occupation-putin-cf2ca7071c54da307650c3b9e2fa8f07"
  }
]