[
  {
    "text": "Seahawks parade 2026 recap: Players, fans celebrate Super Bowl in Seattle - The Seattle Times",
    "fullText": "The Seattle Seahawks and the team's biggest fans celebrated their Super Bowl win Wednesday with the Seahawks World Champions Parade.",
    "link": "https://www.seattletimes.com/seattle-news/seahawks-parade-2026-updates-1-million-fans-expected-for-super-bowl-celebration/"
  },
  {
    "text": "Pentagon-FAA dispute over lasers to thwart cartel drones led to airspace closure, AP sources say - AP News",
    "fullText": "The Pentagon allowed U.S. Customs and Border Protection to use an anti-drone laser earlier this week, leading the Federal Aviation Administration to suddenly close the airspace over El Paso, Texas. That's according to two people familiar with the situation wh…",
    "link": "https://apnews.com/article/faa-el-paso-texas-air-space-closed-1f774bdfd46f5986ff0e7003df709caa"
  },
  {
    "text": "S.F. teachers strike: Union supporters form human banner at Ocean Beach, negotiations ongoing - San Francisco Chronicle",
    "fullText": "San Francisco teachers strike: The teachers union abandoned negotiations late Tuesday night, but they will resume today",
    "link": "https://www.sfchronicle.com/sf/article/teachers-strike-sfusd-21347453.php"
  },
  {
    "text": "Protesters in multiple states press Target to oppose the immigration crackdown in Minnesota - Yahoo",
    "fullText": "Activists planned protests at more than two dozen Target stores around the United States on Wednesday to pressure the discount retailer into taking a public ...",
    "link": "https://www.yahoo.com/news/articles/protesters-multiple-states-press-target-223649465.html"
  },
  {
    "text": "Ben Stiller Shuts Down Congressman for Demanding FCC Investigation into Bad Bunny’s Super Bowl Halftime Show: ‘Bunny’s Got Huge Talent and Even Bigger Heart’ - Variety",
    "fullText": "Ben Stiller is mocking congressman Randy Fine for demanding the FCC investigate Bad Bunny's Super Bowl Halftime Show.",
    "link": "https://variety.com/2026/music/news/ben-stiller-bad-bunny-randy-fine-fcc-investigation-super-bowl-1236659734/"
  },
  {
    "text": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious - WINK News",
    "fullText": "AVE MARIA, Fla.—Now 57 cases of Measles have been reported at Ave Maria University, seven of which are contagious, according to the school's latest update.",
    "link": "https://www.winknews.com/news/collier/57-cases-of-measles-confirmed-at-ave-maria-university-7-currently-contagious/article_298f2922-a5b2-4b67-a0cd-24009dc56801.html"
  },
  {
    "text": "Real Estate Services Stocks Sink in Latest ‘AI Scare Trade’ - Bloomberg.com",
    "fullText": "Real estate services stocks sank on Wednesday as investors assessed the companies’ vulnerability to the newest crop of artificial intelligence applications and tools that threatens to disrupt several industries.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-11/real-estate-services-stocks-latest-domino-in-ai-scare-trade"
  },
  {
    "text": "Instagram chief denies social media can be ‘clinically addictive’ in landmark case - CNN",
    "fullText": "Adam Mosseri, the head of Instagram, testified on Wednesday that he does not think users can be “clinically addicted” to the social media app.",
    "link": "https://www.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction"
  },
  {
    "text": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users - TechCrunch",
    "fullText": "Critical security flaws targeting Windows and Office users allow hackers to take complete control of a victim's computer by clicking a malicious link or opening a file. Patch now.",
    "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/"
  },
  {
    "text": "Exclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East - The Wall Street Journal",
    "fullText": "Trump is ratcheting up the pressure on Iran to make a deal over its nuclear program",
    "link": "https://www.wsj.com/politics/national-security/pentagon-prepares-second-aircraft-carrier-to-deploy-to-the-middle-east-e7140a64"
  },
  {
    "text": "Microsoft Is Considering A Big Game Pass Change - Report - GameSpot",
    "fullText": "Microsoft may, or may not, be planning a big change to Game Pass in the future.",
    "link": "https://www.gamespot.com/articles/microsoft-is-considering-a-big-game-pass-change-report/1100-6538116/"
  },
  {
    "text": "Tillis pans ‘political lawfare’ after grand jury declines to indict Democratic lawmakers - Politico",
    "fullText": "The two-term senator has been a thorn in the president’s side even before he declared he wouldn’t seek reelection last June.",
    "link": "https://www.politico.com/live-updates/2026/02/11/congress/tillis-on-lawfare-00775810"
  },
  {
    "text": "China showcases new Moon ship and reusable rocket in one extraordinary test - Ars Technica",
    "fullText": "The test marks a significant step in China's push to land humans on the Moon by 2030.",
    "link": "https://arstechnica.com/space/2026/02/china-showcases-new-moon-ship-and-reusable-rocket-in-one-extraordinary-test/"
  },
  {
    "text": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now - Axios",
    "fullText": "The meeting lasted three hours.",
    "link": "https://www.axios.com/2026/02/11/netanyahu-trump-iran-strike-nuclear-talks"
  },
  {
    "text": "Albert Breer’s Mailbag: How the Bills Can Help Josh Allen in Free Agency - Sports Illustrated",
    "fullText": "The Seahawks’ Rashid Shaheed and the Colts’ Alec Pierce are two wide receivers to watch this offseason. Plus, how the Falcons will build under Kevin Stefanski and more from around the league.",
    "link": "https://www.si.com/nfl/albert-breer-mailbag-how-bills-can-help-josh-allen-free-agency"
  },
  {
    "text": "NFL rookie report cards: Grading and ranking every team's 2025 draft class - NFL.com",
    "fullText": "Which NFL team had the best 2025 draft class? The worst? With the season in the books, it's time for rookie report cards! Gennaro Filice ranks every group, from No. 1 to 32, providing accompanying grades and analysis.",
    "link": "https://www.nfl.com/news/nfl-rookie-report-cards-grading-and-ranking-every-team-s-2025-draft-class"
  },
  {
    "text": "Google cancels today’s Android 17 Beta 1 release - 9to5Google",
    "fullText": "Android 17 Beta 1 was supposed to launch today, but Google has since pulled the release.",
    "link": "http://9to5google.com/2026/02/11/android-17-beta-1-cancel/"
  },
  {
    "text": "Ranking all 63 starting quarterbacks from the 2025 NFL season - NFL.com",
    "fullText": "Nick Shook evaluates every quarterback who started a game during the 2025 campaign (including the playoffs) to create one comprehensive ranking -- from 1 to 63 -- for the entire season. Who's the top rookie?",
    "link": "https://www.nfl.com/news/ranking-all-63-starting-quarterbacks-from-the-2025-nfl-season"
  },
  {
    "text": "South Carolina sees dip in daily measles cases but too early to call slowdown, health official says - Yahoo",
    "fullText": "Feb 11 (Reuters) - Reported daily measles cases in South Carolina have been declining in recent days, but it is too early to know whether the outbreak is...",
    "link": "https://www.yahoo.com/news/articles/south-carolina-sees-dip-daily-182615103.html"
  }
]