[
  {
    "text": "A look at Seattle’s billionaire lineup with Seahawks for sale - The Seattle Times",
    "fullText": "As the Seahawks go through a formal sale process, the team could get nabbed by a member of Seattle's tech elite.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-sale-could-draw-a-seattle-billionaire-what-about-jeff-bezos/"
  },
  {
    "text": "Bernie Sanders and Gavin Newsom become adversaries over push to tax California billionaires - Associated Press News",
    "fullText": "Bernie Sanders has traveled to Los Angeles to kick off a campaign for a proposed “billionaires tax” that has set off an uproar in the Silicon Valley and led to divisions among Democrats. Sanders said at a rally that passage of the tax would show “the billiona…",
    "link": "https://apnews.com/article/california-billionaires-bernie-sanders-gavin-newsom-democrats-87a1e54f463aad49a2093382969e5cca"
  },
  {
    "text": "As Israel takes steps to claim land in West Bank, U.S. stands by - The Washington Post",
    "fullText": "Despite Trump’s opposition to annexation, Israel has moved to expand control over the West Bank — to the condemnation of Britain and others at a U.N. Security Council meeting.",
    "link": "https://www.washingtonpost.com/world/2026/02/18/israel-west-bank-annexation-trump-land-registration/"
  },
  {
    "text": "Boeing defense headquarters to return to St. Louis after leaving the area in 2017 - STLPR",
    "fullText": "Boeing announced on Wednesday that its security headquarters will return to the St. Louis region from Arlington, Virginia, after moving away in 2017.",
    "link": "https://www.stlpr.org/economy-business/2026-02-18/boeing-defense-headquarters-return-st-louis"
  },
  {
    "text": "Nancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos made a plea Tuesday to the suspect in Nancy Guthrie’s disappearance, urging the individual to “just let her go.” He added that the investigation continues to be a rescue operation and not a recovery mission.",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-18-live-updates"
  },
  {
    "text": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "fullText": "Cardiologists share the important advice they give patients that you can also incorporate into your daily routine.",
    "link": "https://www.aol.com/articles/cardiologists-share-6-surprising-lifestyle-140000687.html"
  },
  {
    "text": "White House economic adviser says Fed researchers should be punished - The Washington Post",
    "fullText": "One of President Donald Trump’s top economic advisers assailed Fed research into the administration’s tariffs policies, saying the authors deserved to be punished.",
    "link": "https://www.washingtonpost.com/business/2026/02/18/hassett-trump-fed-tariffs/"
  },
  {
    "text": "Mass departures from Justice Dept. are boon for law firms, legal groups and political campaigns - CBS News",
    "fullText": "More than 5,000 employees have resigned, retired or been fired​ from the Justice Department in the first year of Mr. Trump's second administration.",
    "link": "https://www.cbsnews.com/news/mass-departures-justice-dept-boon-for-law-firms-legal-groups-campaigns/"
  },
  {
    "text": "Christian Parker outlines vision for Cowboys' defense in 2026 and beyond - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "From a change in base defensive looks to building the scheme around his players, new Cowboys DC Christian Parker outlined his vision for Dallas' defense in 2026.",
    "link": "https://www.dallascowboys.com/news/christian-parker-outlines-vision-for-cowboys-defense-in-2026-and-beyond"
  },
  {
    "text": "Texas Tech star JT Toppin receives heartbreaking injury diagnosis - On3",
    "fullText": ".",
    "link": "https://www.on3.com/college/texas-tech-red-raiders/news/jt-toppin-injury-update-texas-tech-star-diagnosed-with-season-ending-torn-acl/"
  },
  {
    "text": "Los Angeles-area state lawmakers call for Wasserman to step aside - Politico",
    "fullText": "Ten lawmakers on the state’s legislative Olympics committees told POLITICO he should step down as chair of LA28.",
    "link": "https://www.politico.com/news/2026/02/18/los-angeles-state-lawmakers-call-for-wasserman-to-step-down-00787153"
  },
  {
    "text": "Agouti integrates environmental cues to regulate paternal behaviour - Nature",
    "fullText": "Expression of agouti signalling protein in neurons in the medial preoptic area is increased by group housing and negatively associated with care, and overexpression of Agouti reduces care and enhances infanticide in previously tolerant mice.",
    "link": "https://www.nature.com/articles/s41586-026-10123-4"
  },
  {
    "text": "Eddie Hearn blasts Dana White and his ‘new daddy,’ calls Zuffa Boxing ‘absolute complete dogsh*t’ so far - MMA Fighting",
    "fullText": "Eddie Hearn says it took Dana White about a ‘nanosecond’ to turn things personal between them",
    "link": "https://www.mmafighting.com/boxing/472228/eddie-hearn-blasts-dana-white-and-his-new-daddy-calls-zuffa-boxing-absolute-complete-dogsht-so-far"
  },
  {
    "text": "Physicists recreated the first millisecond after the Big Bang — and found it was surprisingly soupy - Live Science",
    "fullText": "Scientists saw a quark plowing through primordial plasma for the first time, offering a rare look at the first moments after the Big Bang",
    "link": "https://www.livescience.com/physics-mathematics/particle-physics/physicists-recreated-the-first-millisecond-after-the-big-bang-and-found-it-was-surprisingly-soupy"
  },
  {
    "text": "U2 releases Renee Good tribute song 'American Obituary' - NBC News",
    "fullText": "Irish rockers U2 condemn ICE immigration raids with the surprise release of EP \"Days of Ash,\" featuring a song for slain Minneapolis protester Renée Good, \"American Obituary.\"",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/u2-releases-renee-good-tribute-song-american-obituary-rcna259592"
  },
  {
    "text": "This is when Samsung is restocking the Galaxy Z TriFold in the US - GSMArena.com news - GSMArena.com",
    "fullText": "There will probably be limited quantities available again. Samsung's Galaxy Z TriFold launched in the US in late January and sold out in minutes, due to...",
    "link": "https://www.gsmarena.com/this_is_when_samsung_is_restocking_the_galaxy_z_trifold_in_the_us-news-71619.php"
  },
  {
    "text": "Highland High reports over a week of measles exposure as Utah reaches 300 cases - KSL News",
    "fullText": "Highland High students could have been exposed to measles for more than a week as an infectious student attended school, and the Utah outbreak has reached 300 infections.",
    "link": "https://www.ksl.com/article/51449754/highland-high-reports-over-a-week-of-measles-exposure-as-utah-reaches-300-cases"
  },
  {
    "text": "RFK Jr. Posts Unhinged Workout Video With Kid Rock That Must Be Seen To Be Believed - HuffPost",
    "fullText": "“We are the dumbest f**king country on earth,” one X user said in response.",
    "link": "https://www.huffpost.com/entry/rfk-jr-posts-unhinged-workout-video-with-kid-rock-that-must-be-seen-to-be-believed_n_6995d4e8e4b0cc086c6bc23f"
  },
  {
    "text": "Elon Musk’s AI Pushes Back As He Encourages Users To Upload Medical Information - Forbes",
    "fullText": "Musk has long encouraged users of his artificial intelligence chatbot, Grok, to ask it for medical advice.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2026/02/18/elon-musk-keeps-telling-people-to-use-ai-for-medical-advice-but-grok-says-not-to/"
  }
]