[
  {
    "text": "Minnesota’s chief judge, a veteran in conservative legal circles, takes on ICE - Politico",
    "fullText": "The low-key George W. Bush appointee confronting Trump’s immigration tactics ordered the head of Immigration and Customs Enforcement to his courtroom.",
    "link": "https://www.politico.com/news/2026/01/27/patrick-schiltz-judge-minneapolis-ice-00750030"
  },
  {
    "text": "The DHS crisis is squeezing Susan Collins - Politico",
    "fullText": "The Maine Republican is under immense pressure as a huge funding package hangs by a thread and federal agents swarm her state.",
    "link": "https://www.politico.com/news/2026/01/27/susan-collins-dhs-ice-shutdown-00751545"
  },
  {
    "text": "Bari Weiss to CBS News staff: Without a shift in strategy, “we are toast.” - The Washington Post",
    "fullText": "The CBS News editor in chief said the network needs to produce journalism people want as she named a raft of new contributors from her website, the Free Press.",
    "link": "https://www.washingtonpost.com/business/2026/01/27/bari-weiss-cbs-news-allhands/"
  },
  {
    "text": "4 takeaways from No. 3 Michigan Basketball’s win vs No. 5 Nebraska - Maize n Brew",
    "fullText": "It wasn’t always pretty, but No. 3 Michigan Basketball hung on to beat now-formerly undefeated Nebraska. Here are 4 takeaways from the Wolverines’ huge win:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/104862/michigan-basketball-takeaways-nebraska-dusty-may-trey-mckenney-morez-johnson-aday-mara"
  },
  {
    "text": "After Further Review: How the Patriots Defense Won the AFC Title Game, Maye Breakdown, and Quick-Hit Film Notes From Sunday's Win in Denver - New England Patriots",
    "fullText": "The Patriots are headed back to the Super Bowl thanks to a 10-7 win over the Broncos on Sunday, but they'll need more from the offense in Santa Clara.",
    "link": "https://www.patriots.com/news/after-further-review-how-the-patriots-defense-won-the-afc-title-game-maye-breakdown-and-quick-hit-film-notes-from-sunday-s-win-in-denver"
  },
  {
    "text": "Consumer Price Index climbs 3.6% YoY in December, as expected - FXStreet",
    "fullText": "Australia’s Consumer Price Index (CPI) climbed by 3.6% year-over-year (YoY) in December, following a 3.5% increase (revised from 3.4%) reported in the previous reading, the latest data published by the Australian Bureau of Statistics (ABS) showed on Wednesday.",
    "link": "https://www.fxstreet.com/news/australia-cpi-set-to-show-sticky-inflation-fueling-rba-hawkish-bets-202601272000"
  },
  {
    "text": "S.F. private high school has three cases of active tuberculosis - sfchronicle.com",
    "fullText": "San Francisco public health officials have identified three active TB cases at the private high school since November.",
    "link": "https://www.sfchronicle.com/sf/article/riordan-high-school-tuberculosis-cases-21318508.php"
  },
  {
    "text": "Diplomats Worry Xi’s Purge Will Curb Critical Contact With China - Bloomberg.com",
    "fullText": "Xi Jinping’s purge of top Chinese generals has cost Western governments a key contact and deepened fears that the People’s Liberation Army is becoming even more walled-off from contact.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-27/diplomats-worry-xi-s-purge-will-curb-critical-contact-with-china"
  },
  {
    "text": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington D.C. - NPR",
    "fullText": "After a yearlong investigation, the National Transportation Safety Board did not find a single cause for the deadly collision near Washington, D.C., but blamed the crash on multiple systemic failures.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5689091/ntsb-dca-midair-collision-black-hawk-helicopter"
  },
  {
    "text": "Asia markets open mostly higher after S&P 500 hits record, South Korea pushes fresh highs - CNBC",
    "fullText": "Markets across Asia extended gains Wednesday after a record close on Wall Street, with Australia’s inflation release in focus.",
    "link": "https://www.cnbc.com/2026/01/28/asia-markets-today-wednesday-hang-seng-index-nikkei-225-kospi-inflation-yen-australia-cpi.html"
  },
  {
    "text": "A string of scandals and luxury handbags: Who is South Korea's former first lady? - BBC",
    "fullText": "Kim was accused of accepting luxury bags, a diamond necklace and other gifts as bribes.",
    "link": "https://www.bbc.com/news/articles/cj3vpe8zme8o"
  },
  {
    "text": "Microsoft promises behind the scenes platform changes on Windows 11 in 2026 - Windows Central",
    "fullText": "After a rough few weeks, Microsoft has promised to make behind-the-scenes platform changes to Windows 11 as it begins testing the next wave of features.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-vows-to-make-behind-the-scenes-platform-changes-as-it-begins-testing-next-phase-of-windows-11"
  },
  {
    "text": "‘KPop Demon Hunters’ HUNTR/X conquer the charts and claim their destiny - NPR",
    "fullText": "The fictional band HUNTR/X from the hit Netflix film KPop Demon Hunters went from a group no one had ever heard of to one of the biggest pop acts of 2025. Now they have five Grammy nominations.",
    "link": "https://www.npr.org/2026/01/27/nx-s1-5608362/huntrx-k-pop-demon-hunters-film-grammy-awards"
  },
  {
    "text": "Paddy Pimblett breaks his silence for the first time since hospitalization as wife's post shows severity of his injuries - Bloody Elbow",
    "fullText": "Paddy Pimblett has opened up about what happened at UFC 324",
    "link": "https://bloodyelbow.com/2026/01/27/paddy-pimblett-breaks-his-silence-for-the-first-time-since-hospitalization-as-wifes-post-shows-severity-of-his-injuries/"
  },
  {
    "text": "Carney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos - AP News",
    "fullText": "Canadian Prime Minister Mark Carney has told U.S. President Donald Trump that he stands by his comments made at the World Economic Forum in Davos. Carney plans to diversify Canada’s trade away from the U.S. with a dozen new deals. On Tuesday, Carney rejected …",
    "link": "https://apnews.com/article/carney-trump-canada-trade-davos-bessent-tariffs-8e83cdd9443f6f4a523b6e05fd63843a"
  },
  {
    "text": "Trump Claims Ilhan Omar Is Worth $44M. Here’s Why That’s Highly Unlikely. - Forbes",
    "fullText": "Her 2024 disclosure reported total business values rather than individual stakes, creating wide net-worth ranges that opponents have taken as literal estimates of her personal wealth.",
    "link": "https://www.forbes.com/sites/zacheverson/2026/01/27/ilhan-omar-trump-net-worth-disclosure-30-44-million/"
  },
  {
    "text": "The State-Led Crackdown on Grok and xAI Has Begun - WIRED",
    "fullText": "At least 37 attorneys general for US states and territories are taking action against xAI after Grok generated a flood of nonconsensual sexual images of women and minors.",
    "link": "https://www.wired.com/story/the-state-led-crackdown-on-grok-and-xai-has-begun/"
  }
]