[
  {
    "text": "2026 Golden Globes live updates: Full list of winners as 'One Battle After Another' and 'Hamnet' take home top film nods; 'Adolescence' recognized for TV with 4 wins - Yahoo",
    "fullText": "The show was hosted by Nikki Glaser for the second year in a row.",
    "link": "https://www.yahoo.com/entertainment/celebrity/live/2026-golden-globes-live-updates-full-list-of-winners-as-one-battle-after-another-and-hamnet-take-home-top-film-nods-adolescence-recognized-for-tv-with-4-wins-000306961.html"
  },
  {
    "text": "Japan plans to dissolve parliament with possible snap election in February: NHK - CNBC",
    "fullText": "The snap election, if called in Feburary, would be just about five months into Takaichi's term as prime minister.",
    "link": "https://www.cnbc.com/2026/01/12/japan-snap-election-sanae-takaichi-ldp-cdp-jip-komeito.html"
  },
  {
    "text": "Goodwill shopper sparks outrage after sharing photos of local store's shelves: 'Is this normal?' - Yahoo",
    "fullText": "\"They never clean, they never organize.\"",
    "link": "https://www.yahoo.com/lifestyle/articles/goodwill-shopper-sparks-outrage-sharing-021500709.html"
  },
  {
    "text": "U-Haul drives into crowd at Los Angeles anti-Iranian regime protest - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/haul-drives-crowd-los-angeles-anti-iranian-regime/story?id\\\\u003d129112878"
  },
  {
    "text": "Golden Globes 2026: Jennifer Lawrence dons see-through gown with embroidered florals - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Style/golden-globes-2026-jennifer-lawrence-dons-gown-embroidered/story?id\\\\u003d129112873"
  },
  {
    "text": "Australia social media ban: Meta blocks 550,000 accounts under new law - BBC",
    "fullText": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
    "link": "https://www.bbc.com/news/articles/cpqye2yygl4o"
  },
  {
    "text": "Person with measles traveled through Maryland, Virginia last week, health officials say - WTOP",
    "fullText": "The Maryland Department of Health said the person traveled on trains from Jan. 7-8.",
    "link": "https://wtop.com/local/2026/01/person-with-measles-traveled-through-maryland-last-week-state-health-officials-say/"
  },
  {
    "text": "Missing Oklahoma boy found safe after mother, stepfather arrested for alleged child abuse: officials - ABC7 Chicago",
    "fullText": "A missing 12-year-old boy in Oklahoma has been found after his mother and stepfather were arrested for alleged child abuse, officials said.",
    "link": "https://abcnews.go.com/US/mother-stepfather-arrested-alleged-child-abuse-amid-search/story?id=129064524"
  },
  {
    "text": "More federal agents to be sent to Minnesota after shooting, Trump administration says - BBC",
    "fullText": "The move comes after protests against immigration enforcement have been held across the US after a woman was shot by an ICE agent.",
    "link": "https://www.bbc.com/news/articles/cpv7knz8e8mo"
  },
  {
    "text": "A Cooler Week Ahead - KSAT",
    "fullText": "A light freeze affects the Hill Country, southern Edwards Plateau, and Rio Grande Plains. Temperatures will rise to the mid 50s and 60s under partly sunny skies, with a chance of spotty showers on Monday expanding southeast by Tuesday.",
    "link": "https://www.ksat.com/weather/2026/01/11/light-freeze-for-some-warmer-days-ahead/"
  },
  {
    "text": "U.S. Figure Skating finalizes Olympic squad of 16 - ESPN",
    "fullText": "World champions Ilia Malinin and the ice dance duo of Madison Chock and Evan Bates will anchor one of the strongest U.S. figure skating teams in history when they head to Italy for the Milan Cortina Olympics in less than a month.",
    "link": "https://www.espn.com/olympics/story/_/id/47583354/hopes-high-ilia-malinin-us-olympic-skating-team"
  },
  {
    "text": "Alnylam charts ambitious five-year plan as sales of key drug miss expectations - statnews.com",
    "fullText": "Gene-silencing company Alnylam charts ambitious five-year plan as sales of key drug miss expectations.",
    "link": "https://www.statnews.com/2026/01/11/alnylam-five-year-plan-amvuttra-investors-jpm-2026/"
  },
  {
    "text": "Anthropic joins OpenAI's push into health care with new Claude tools - NBC News",
    "fullText": "Anthropic announced a new suite of health care and life sciences features Sunday, enabling users of its Claude artificial intelligence platform to share access to their health records to better understand their medical information",
    "link": "https://www.nbcnews.com/tech/tech-news/anthropic-health-care-rcna252872"
  },
  {
    "text": "The struggle of resizing windows on macOS Tahoe - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46579864"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "Irish deny battery allegation against Freeman - ESPN",
    "fullText": "Notre Dame has denied that Marcus Freeman made physical contact with anyone after the football coach was accused of battery in a police report filed Jan. 3.",
    "link": "https://www.espn.com/college-football/story/_/id/47582269/notre-dame-denies-battery-allegations-marcus-freeman"
  },
  {
    "text": "Beloved singer/songwriter dies with five others in plane crash - AL.com",
    "fullText": "He was 34.",
    "link": "https://www.al.com/news/2026/01/beloved-singersongwriter-dies-with-five-others-in-plane-crash.html"
  },
  {
    "text": "DHS restricts congressional visits to ICE facilities in Minneapolis with new policy - NPR",
    "fullText": "A memo from Homeland Security Secretary Kristi Noem, obtained by NPR, instructs her staff that visits should be requested at least seven days in advance.",
    "link": "https://www.npr.org/2026/01/11/nx-s1-5673949/dhs-restricts-congressional-visits-to-ice-facilities-in-minneapolis-with-new-policy"
  },
  {
    "text": "Iran Edges Closer to a Revolution That Would Reshape the World - Bloomberg.com",
    "fullText": "If the uprising succeeds in toppling the Islamic Republic, it would upend global geopolitics and energy markets — with the risk of widespread chaos.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-11/iran-edges-closer-to-a-revolution-that-would-reshape-the-world"
  },
  {
    "text": "SpaceX launches NASA's Pandora exoplanet mission, 3 dozen other satellites (video) - Space",
    "fullText": "Pandora will study the atmospheres of at least 20 exoplanets during its yearlong mission.",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/watch-spacex-launch-nasas-pandora-exoplanet-studying-satellite-on-jan-11"
  }
]