[
  {
    "text": "Team Canada roster for 2026 Winter Olympics includes Celebrini, Horvat - NHL.com",
    "fullText": "Wilson, Marchand, Binnington, Kuemper also going to Milan; will play 1st game on Feb. 12",
    "link": "https://www.nhl.com/news/canada-roster-for-2026-winter-olympics"
  },
  {
    "text": "Some Warren Buffett wisdom on his last day leading Berkshire Hathaway - Yahoo Finance",
    "fullText": "The advice that legendary investor Warren Buffett offered on investing and life over the years helped earn him legions of followers who eagerly read his...",
    "link": "https://finance.yahoo.com/news/warren-buffett-known-advice-life-171401908.html"
  },
  {
    "text": "Photos: New Year’s celebrations around the world - CNN",
    "fullText": "Night skies are lighting up with New Year’s fireworks as people across the world ring in 2026.",
    "link": "https://www.cnn.com/2025/12/31/world/gallery/2026-new-year-celebrations"
  },
  {
    "text": "Wetzel: How college basketball ended up signing NBA draft picks - ESPN",
    "fullText": "The fault falls to college sports' leaders who spent decades defending amateurism with dated legal arguments.",
    "link": "https://www.espn.com/mens-college-basketball/story/_/id/47456917/how-college-basketball-ended-signing-nba-draft-picks"
  },
  {
    "text": "Stock Market Today: Silver Prices Slide; Dow Inches Lower to End 2025 — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-12-31-2025"
  },
  {
    "text": "You Can Finally Start Paying Attention To The College Football Playoff - Defector",
    "fullText": "Welcome to the Defector College Football Watch Guide, where Israel Daramola and Ray Ratto will tell you which of the weekend’s college football games are worth giving a crap about. The first round of the expanded playoff was, predictably, a bit of a dud. But …",
    "link": "https://defector.com/you-can-finally-start-paying-attention-to-the-college-football-playoff"
  },
  {
    "text": "China announces it 'successfully completed' Taiwan military maneuvers - ABC News",
    "fullText": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
    "link": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777"
  },
  {
    "text": "Kennedy Center Altered Rules So Only Trump-Appointed Board Members Could Vote on Name Change - Rolling Stone",
    "fullText": "The Kennedy Center revised its bylaws to only allow presidentially-appointed board members to vote on issues ahead of the institution's name change.",
    "link": "http://www.rollingstone.com/music/music-news/kennedy-center-altered-rules-donald-trump-name-change-1235492753/"
  },
  {
    "text": "Democrat wins Iowa state Senate seat, thwarting GOP supermajority hopes - The Washington Post",
    "fullText": "Renee Hardman’s convincing special-election win offers a hopeful signal for Democrats looking to 2026. She becomes the first Black woman elected to the Iowa Senate.",
    "link": "https://www.washingtonpost.com/politics/2025/12/31/iowa-renee-hardman-election-win/"
  },
  {
    "text": "Real-life experiment shows Niels Bohr was right in a theoretical debate with Einstein - Phys.org",
    "fullText": "Scientists in China have performed an experiment first proposed by Albert Einstein almost a century ago when he sought to disprove the quantum mechanical principle of complementarity put forth by Niels Bohr and his school of physicists. Bohr claimed there are…",
    "link": "https://phys.org/news/2025-12-real-life-niels-bohr-theoretical.html"
  },
  {
    "text": "Heavy police presence in Sydney for New Year's celebrations after Bondi attack - BBC",
    "fullText": "The words peace and unity were projected onto the Sydney Harbour Bridge as thousands gathered to watch the annual fireworks.",
    "link": "https://www.bbc.com/news/articles/clye3xz52e5o"
  },
  {
    "text": "Why flu cases are surging this season. And, protests erupt in Iran over the economy - NPR",
    "fullText": "The flu is spreading rapidly across the U.S. this season, and it is expected to get worse. And, protests have erupted across Iran over the country's troubled economy.",
    "link": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests"
  },
  {
    "text": "Body found during search for missing Texas teen as another girl disappears and more top headlines - Fox News",
    "fullText": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
    "link": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-another-girl-disappears-more-top-headlines"
  },
  {
    "text": "Zohran Mamdani becomes New York’s mayor on New Year’s Day. His administration is a work in progress - CNN",
    "fullText": "New York City Mayor-elect Zohran Mamdani is closing 2025 with a still-evolving image of the team that is going to help steer his government and enact an ambitious agenda to tackle the affordability crisis in the nation’s largest city.",
    "link": "https://www.cnn.com/2025/12/31/politics/new-york-mayor-transition-mamdani-administration"
  },
  {
    "text": "It's going to be a cold New Year's Eve in the Pittsburgh area with heavy snowfall tonight - CBS News",
    "fullText": "A Winter Weather Advisory has been issued for the region with a Winter Storm Warning for Somerset County and the ridges of Westmoreland and Fayette County.",
    "link": "https://www.cbsnews.com/pittsburgh/news/its-going-to-be-a-cold-new-years-eve-in-the-pittsburgh-area-with-heavy-snowfall-tonight/"
  },
  {
    "text": "NASA could be weeks away from its biggest test in decades - CNN",
    "fullText": "The NASA Artemis II mission, set to lift off as soon as February, will mark the first time astronauts have aimed to venture beyond near-Earth orbit since 1972.",
    "link": "https://www.cnn.com/2025/12/31/science/artemis-2-astronauts-moon-mission-overview"
  },
  {
    "text": "Farmers are about to pay a lot more for health insurance - NPR",
    "fullText": "Tariffs, inflation, and other federal policies have battered U.S. farmers' bottom lines. Now many farmers say the expiration of federal health care subsidies will make their coverage unaffordable.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/31/nx-s1-5655252/u-s-farmer-insurance-premiums-tariffs-seeds-fertilizer-inflation-iowa"
  },
  {
    "text": "Thailand releases 18 Cambodian soldiers as ceasefire holds - Al Jazeera",
    "fullText": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
    "link": "https://www.aljazeera.com/news/2025/12/31/thailand-releases-18-cambodian-soldiers-as-ceasefire-holds"
  },
  {
    "text": "HHS says it's freezing child care payments to Minnesota after fraud allegations - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/hhs-freezing-child-care-payments-minnesota-after-fraud/story?id\\\\u003d128793851"
  }
]