[
  {
    "text": "In rare move, Veterans Affairs pulls back on controversial disability rule - The Washington Post",
    "fullText": "Veterans groups had warned that the change would have disadvantaged veterans who need medication.",
    "link": "https://www.washingtonpost.com/politics/2026/02/19/veteran-affairs-disability-rule/"
  },
  {
    "text": "Millie Bobby Brown Shares Rare Photo of Her Daughter for Her Birthday - People.com",
    "fullText": "Millie Bobby Brown celebrates her 22nd birthday with a sweet photo of her baby girl, whom she shares with husband Jake Bongiovi.",
    "link": "https://people.com/millie-bobby-brown-shares-rare-photo-of-her-daughter-for-her-birthday-11910340"
  },
  {
    "text": "Virginia judge blocks Democrats’ referendum, a blow to redistricting effort over 4 U.S. House seats - WTOP",
    "fullText": "A Virginia court on Thursday temporarily blocked Democrats from preparing for an April voter referendum to redraw the state’s congressional maps.",
    "link": "https://wtop.com/virginia/2026/02/virginia-judge-temporarily-blocks-democrats-redistricting-work-on-bid-to-flip-4-congressional-seats/"
  },
  {
    "text": "Cowboys to play a 3-4 base defense for first time since 2012 - NBC Sports",
    "fullText": "The Cowboys hired Christian Parker from the Eagles to turn around a defense that set the team record for points allowed in 2025.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/cowboys-to-play-a-3-4-base-defense-for-first-time-since-2012"
  },
  {
    "text": "Tariffs paid by midsize US companies tripled last year, a JPMorganChase Institute study shows - AP News",
    "fullText": "New research shows midsize U.S. companies pay far more in Trump-era tariffs, and the costs land at home. The JPMorganChase Institute study says tariff payments for these companies tripled over the past year. The report says these businesses may have to raise …",
    "link": "https://apnews.com/article/trump-tariffs-midsized-companies-costs-consumers-2a25158ff1d06bd7f72d909a8ec64f25"
  },
  {
    "text": "Nvidia and OpenAI abandon unfinished $100bn deal in favour of $30bn investment - Financial Times",
    "fullText": "Chipmaker swaps last year’s complex framework with AI start-up in favour of equity cheque",
    "link": "https://www.ft.com/content/dea24046-0a73-40b2-8246-5ac7b7a54323"
  },
  {
    "text": "‘Landman’s Billy Bob Thornton Tells Great Robert Duvall Stories & Divulges The Deep Dark Secret He Never Told His Mentor - Deadline",
    "fullText": "'Landman' star Billy Bob Thornton tells great stories about his mentor, Robert Duvall, who died February 15 at 95.",
    "link": "http://deadline.com/2026/02/landman-billy-bob-thornton-tells-great-robert-duvall-tales-1236730026/"
  },
  {
    "text": "The James Webb Space Telescope just mapped auroras on Uranus in 3D for the 1st time, and scientists are thrilled - Space",
    "fullText": "\"This is a crucial step towards characterizing giant planets beyond our solar system.\"",
    "link": "https://www.space.com/astronomy/james-webb-space-telescope/the-james-webb-space-telescope-just-mapped-auroras-on-uranus-in-3d-for-the-1st-time-and-scientists-are-thrilled"
  },
  {
    "text": "Illinois Democrat tries to bleep her way through a tough Senate primary with a new expletive-laden anti-Trump ad - NBC News",
    "fullText": "Illinois Democratic Senate candidate Juliana Stratton's new ad full of F-bombs is the latest move in a contest that has centered on Trump.",
    "link": "https://www.nbcnews.com/politics/2026-election/illinois-democrat-juliana-stratton-senate-primary-trump-ad-rcna259761"
  },
  {
    "text": "Bank of America commits $25bn to private credit lending - Financial Times",
    "fullText": "Move follows similar initiatives by other Wall Street institutions but comes as concerns mount about sector’s health",
    "link": "https://www.ft.com/content/faedf9f9-6e73-457c-b073-bcd46ed780c7"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "Trump appears ready to attack Iran as U.S. strike force takes shape - The Washington Post",
    "fullText": "Although the United States and ally Israel have a military advantage over Iranian forces, there are ways for Tehran to make any attack painful, officials said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/19/trump-iran-attack-military/"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  },
  {
    "text": "From chickens to humans, animals think \"bouba\" sounds round - Ars Technica",
    "fullText": "There seems to be a deep-seated association between sounds and shapes.",
    "link": "https://arstechnica.com/science/2026/02/newly-hatched-chickens-form-the-same-sound-association-we-do/"
  },
  {
    "text": "One vaccine may provide broad protection against many respiratory infections and allergens - Stanford Medicine",
    "fullText": "Stanford Medicine researchers and their colleagues invented a new vaccine that protects mice from respiratory viruses, bacteria and allergens — the closest yet to a universal vaccine.",
    "link": "https://med.stanford.edu/news/all-news/2026/02/universal-vaccine.html"
  },
  {
    "text": "Cats give genetic clues to better cancer treatments - Financial Times",
    "fullText": "Similarities between pet and human tumours suggest new ideas for targeting both",
    "link": "https://www.ft.com/content/807ac68a-d96a-4da0-bdfc-5970c3c5a836"
  },
  {
    "text": "Amazon surpasses Walmart in annual revenue for first time, as both chase AI-fueled growth - CNBC",
    "fullText": "The shuffle underscores the rivalry between the two retailers, particularly as Walmart expands its advertising and third-party marketplace businesses.",
    "link": "https://www.cnbc.com/2026/02/19/amazon-revenue-passes-walmart-earnings-reports.html"
  },
  {
    "text": "Could Seahawks’ new owner move team? What we know about sale | Analysis - The Seattle Times",
    "fullText": "News that the Seahawks are on the market inevitably raises questions such as whether the team could leave Seattle. Here's our attempt at some answers.",
    "link": "https://www.seattletimes.com/sports/seahawks/could-seahawks-new-owner-move-team-what-we-know-about-sale-analysis/"
  },
  {
    "text": "Michael Pollan says AI may 'think' — but it will never be conscious - NPR",
    "fullText": "\"Consciousness is under siege,\" says author Michael Pollan. His new book, A World Appears, explores consciousness on both a personal and technological level.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5713514/michael-pollan-ai-consciousness-a-world-appears"
  }
]