[
  {
    "text": "As arctic front nears, when will icy weather develop in South Texas? Here’s a timeline. - expressnews.com",
    "fullText": "Thursday and Friday will be relatively warm, but temperatures will plummet over the weekend, and some freezing rain is possible.",
    "link": "https://www.expressnews.com/san-antonio-weather/forecast/article/ice-cold-texas-timeline-weather-arctic-21307586.php"
  },
  {
    "text": "NASA is about to send people to the moon — in a spacecraft not everyone thinks is safe to fly - CNN",
    "fullText": "As the four-person crew of Artemis II prepares to launch on a historic mission around the moon as soon as February, some experts are worried about the spacecraft’s heat shield.",
    "link": "https://www.cnn.com/2026/01/23/science/artemis-2-orion-capsule-heat-shield"
  },
  {
    "text": "Indiana's Fernando Mendoza, likely No. 1 pick, enters NFL draft - ESPN",
    "fullText": "Indiana quarterback Fernando Mendoza, who won the Heisman Trophy and led the No. 1 Hoosiers to their first national championship this past season, is forgoing his final college season and entering the NFL draft, he announced on social media Friday.",
    "link": "https://www.espn.com/nfl/story/_/id/47704043/indiana-fernando-mendoza-likely-no-1-pick-enters-nfl-draft"
  },
  {
    "text": "Trump says Greenland framework includes mineral rights. What minerals does the island have? - BBC",
    "fullText": "Greenland's natural resources include large reserves of rare earth deposits.",
    "link": "https://www.bbc.com/news/articles/cly9230yw15o"
  },
  {
    "text": "What to know as D.C. area braces for heavy snow, ice and severe cold - The Washington Post",
    "fullText": "Around 5 to 10 inches of snow and sleet are expected amid a prolonged, dangerous cold spell.",
    "link": "https://www.washingtonpost.com/weather/2026/01/23/dc-winter-storm-snow-ice-cold-forecast/"
  },
  {
    "text": "Advisors to the ultra rich say AI isn't a gamechanger for landing new clients - CNBC",
    "fullText": "Referrals are still the name of the game when it comes to earning the trust of the ultra-rich.",
    "link": "https://www.cnbc.com/2026/01/23/wealth-client-prospecting-ria-ai.html"
  },
  {
    "text": "The Battle Between Tom Brady’s Heirs for a Spot in the Super Bowl - The Wall Street Journal",
    "fullText": "Jarrett Stidham was once drafted as a potential successor to the New England quarterback. Instead, he’ll be lining up against Drake Maye and the Patriots in Sunday’s AFC Championship.",
    "link": "https://www.wsj.com/sports/football/jarrett-stidham-denver-broncos-drake-maye-e835ec17"
  },
  {
    "text": "Microsoft Gave FBI Keys To Unlock Encrypted Data, Exposing Major Privacy Flaw - Forbes",
    "fullText": "The tech giant said providing encryption keys was a standard response to a court order. But companies like Apple and Meta set up their systems so such a privacy violation isn’t possible.",
    "link": "https://www.forbes.com/sites/thomasbrewster/2026/01/22/microsoft-gave-fbi-keys-to-unlock-bitlocker-encrypted-data/"
  },
  {
    "text": "149 Million Usernames and Passwords Exposed by Unsecured Database - WIRED",
    "fullText": "This “dream wish list for criminals” includes millions of Gmail, Facebook, banking logins, and more. The researcher who discovered it suspects they were collected using infostealing malware.",
    "link": "https://www.wired.com/story/149-million-stolen-usernames-passwords/"
  },
  {
    "text": "5 arrested in connection with shooting of Indiana judge and his wife - NBC News",
    "fullText": "Police have arrested five people as part of a multi-state investigation into the shooting of an Indiana judge and his wife while they were at home on Sunday",
    "link": "https://www.nbcnews.com/news/us-news/5-arrested-connection-shooting-indiana-judge-wife-rcna255555"
  },
  {
    "text": "The Trump administration admits even more ways DOGE accessed sensitive personal data - NPR",
    "fullText": "New court documents reveal even more ways DOGE improperly accessed and shared sensitive personal data last year — and how that data appears to have been used to advance dubious fraud claims.",
    "link": "https://www.npr.org/2026/01/23/nx-s1-5684185/doge-data-social-security-privacy"
  },
  {
    "text": "Trump looks left on cost of living concerns - Politico",
    "fullText": "The White House is trying to embrace populist economic ideas that Republicans aren’t crazy about.",
    "link": "https://www.politico.com/news/2026/01/23/trump-democrats-warren-schumer-00742515"
  },
  {
    "text": "Scientists just overturned a 100-year-old rule of chemistry, and the results are “impossible” - ScienceDaily",
    "fullText": "Chemists at UCLA are showing that some of organic chemistry’s most famous “rules” aren’t as unbreakable as once thought. By creating bizarre, cage-shaped molecules with warped double bonds—structures long considered impossible—the team is opening the door to …",
    "link": "https://www.sciencedaily.com/releases/2026/01/260122073618.htm"
  },
  {
    "text": "iPhone 18 Pro: Leaker Reveals Alleged Size of Smaller Dynamic Island - MacRumors",
    "fullText": "For now, rumors have settled on the iPhone 18 Pro and iPhone 18 Pro Max featuring a smaller Dynamic Island, and now a leaker has revealed its alleged...",
    "link": "https://www.macrumors.com/2026/01/23/iphone-18-pro-alleged-dynamic-island-size/"
  },
  {
    "text": "Sundance: Chris Pine, Jenny Slate and Judd Apatow Kick Off Bittersweet Opening Night of Final Park City Edition - Yahoo News Canada",
    "fullText": "Judd Apatow, Chris Pine, Jenny Slate and Riz Ahmed had movies that premiered on opening night of Sundance Film Festival.",
    "link": "https://variety.com/2026/film/news/sundance-opening-night-chris-pine-jenny-slate-judd-apatow-1236638630/"
  },
  {
    "text": "Maps show where winter storm threatens to bring heavy snow, ice, brutal cold this weekend - CBS News",
    "fullText": "Heavy snow, ice and brutal cold are expected to make this winter storm a potentially life-threatening weather event, stretching across two-thirds of the U.S.",
    "link": "https://www.cbsnews.com/news/maps-winter-storm-snow-cold-weekend/"
  },
  {
    "text": "These Atlanta area and north Georgia schools will be closed due to winter storm - 11alive.com",
    "fullText": "The disruptive winter storm could bring substantial freezing rain and damaging ice accumulations in parts of north Georgia and even some parts of metro Atlanta.",
    "link": "https://www.11alive.com/article/weather/atlanta-area-north-georgia-school-closures-winter-storm/85-19f18761-7b25-48eb-9a4b-984cc5fee192"
  },
  {
    "text": "Pool Report from Tonight’s Houston Rockets at Philadelphia 76ers Game - official NBA",
    "fullText": "The Pool Report interview was conducted by Gina Mizell, Philadelphia Inquirer with Crew Chief John Goble following tonight’s Rockets at 76ers game.     QUESTION: Why was the Tyrese Maxey attempt at the end of regulation not reviewed for goaltending? GOBLE: By…",
    "link": "https://official.nba.com/pool-report-from-tonights-houston-rockets-at-philadelphia-76ers-game/"
  }
]