[
  {
    "text": "Trump tariffs live updates: EU discusses $108 billion in retaliatory tariffs; Danish PM says Europe 'will not be blackmailed' - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-eu-discusses-108-billion-in-retaliatory-tariffs-danish-pm-says-europe-will-not-be-blackmailed-152657886.html"
  },
  {
    "text": "FBI opened probe on Minneapolis shooting; none exists now, Justice Dept. says - The Washington Post",
    "fullText": "After the death of Renée Good in Minneapolis, FBI agents launched a civil rights probe into the shooting. The Justice Department says no such case now exists.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/18/fbi-minnesota-shooting-civil-rights-investigation/"
  },
  {
    "text": "Patriots favored by 4.5 at Broncos in AFC Championship Game - NBC Sports",
    "fullText": "The Patriots will be road favorites in Denver in next weekend's AFC Championship Game.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/patriots-favored-by-4-5-at-broncos-in-afc-championship-game"
  },
  {
    "text": "Texans’ C.J. Stroud Makes Unfortunate NFL History With Wild Run of Turnovers in Playoffs - Sports Illustrated",
    "fullText": "C.J. Stroud’s turnover numbers this postseason are unlike anything the NFL has ever seen.",
    "link": "https://www.si.com/nfl/texans-cj-stroud-unfortunate-nfl-history-turnovers-in-playoffs"
  },
  {
    "text": "Erie County issues a travel advisory as major winter storm approaches - WGRZ",
    "fullText": "Erie County will be under a Travel Advisory starting at 10 tonight as a long-duration winter storm moves into the region.",
    "link": "https://www.wgrz.com/article/weather/weather-impact/erie-county-issues-travel-advisory-winter-storm-approaches/71-90adaba1-894e-46de-a474-f1f7775163dd"
  },
  {
    "text": "Games Workshop Is Finally Making Female Custodes Models - Gizmodo",
    "fullText": "The new models mark the first time tabletop players will be given the option to build their Custodes units with unhelmeted female heads.",
    "link": "https://gizmodo.com/warhammer-40k-female-custodes-models-games-workshop-2000711356"
  },
  {
    "text": "Canada’s Tariff Cut Just Made This High-Tech Chinese EV 50% Cheaper - InsideEVs",
    "fullText": "A high-end electric performance SUV that's made in China is about to get dramatically cheaper for Canadians.",
    "link": "https://insideevs.com/news/784754/lotus-eletre-price-cut-canada-tariff-chinese-evs/"
  },
  {
    "text": "EXCLUSIVE: Xbox Cloud Gaming is getting ad-supported access VERY soon - Windows Central",
    "fullText": "Users have been noticing that Xbox Cloud Gaming has begun referencing \"ad support\" while launching games.",
    "link": "https://www.windowscentral.com/gaming/xbox/exclusive-xbox-cloud-gaming-will-get-an-ad-supported-tier-this-year-rumors-coalesce-after-ad-support-notices-appear-prematurely"
  },
  {
    "text": "7 police officers killed in attacks in Guatemala after prison crackdown on gangs - CBS News",
    "fullText": "The killings occurred a day after gang member inmates took 46 people hostage in three prisons across the country, officials said.",
    "link": "https://www.cbsnews.com/news/police-officers-killed-guatemala-prison-crackdown/"
  },
  {
    "text": "Mario Cristobal Could Have Been Guarding Donald Trump, Instead He's Coaching Miami In CFP Title Game - OutKick",
    "fullText": "Mario Cristobal reveals he was one step away from joining the Secret Service — a decision that could’ve put him protecting Donald Trump instead of chasing a CFP title.",
    "link": "https://www.outkick.com/sports/mario-cristobal-secret-service-donald-trump-miami-cfp-indiana"
  },
  {
    "text": "Colin Jost Reacts to Wife Scarlett Johansson Losing Top-Grossing Title - Yahoo",
    "fullText": "Colin Jost hilariously reacted to Zoe Saldaña surpassing his wife Scarlett Johansson as the highest-grossing star of all time during the Jan. 17 episode of...",
    "link": "https://www.eonline.com/news/1427471/colin-jost-on-scarlett-johansson-replaced-as-highest-grossing-star?cmpid=sn-syndicate-aolfeed-us-"
  },
  {
    "text": "Why is flu season so bad this year? - Live Science",
    "fullText": "Flu season in the U.S. is particularly bad this year, and a new branch of the flu family tree may be to blame.",
    "link": "https://www.livescience.com/health/flu/why-is-flu-season-so-bad-this-year"
  },
  {
    "text": "Opening & Matches Revealed for January 19 WWE RAW - Ringside News",
    "fullText": "WWE is stacking the deck for this Monday’s RAW, and it’s all going down on Netflix starting at 3 PM ET. Gunther is slated to open the show, as confirmed",
    "link": "https://www.ringsidenews.com/opening-matches-revealed-january-19-wwe-raw/"
  },
  {
    "text": "Predicting OpenAI's ad strategy - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46668021"
  },
  {
    "text": "ASUS goes \"all in AI\" and stops new smartphones, Chairman Jonney Shih confirms - VideoCardz.com",
    "fullText": "ASUS to stop launching new smartphones as company goes all in on AI ASUS chairman Jonney Shih says the company will stop adding new smartphone models and",
    "link": "https://videocardz.com/newz/asus-goes-all-in-ai-and-stops-new-smartphones-chairman-jonney-shih-confirms"
  },
  {
    "text": "Ketsu Battler adds Narmaya from Granblue Fantasy Versus: Rising - Gematsu",
    "fullText": "Ketsu Battler, the one-on-one butt shaking fighting game, has added Narmaya from Granblue Fantasy Versus: Rising as a free guest character today alongside the previously announced Beelzebub via its…",
    "link": "https://www.gematsu.com/2026/01/ketsu-battler-adds-narmaya-from-granblue-fantasy-versus-rising"
  },
  {
    "text": "Trump suffers major losses in his war on offshore wind - Politico",
    "fullText": "The administration’s arguments that offshore wind farms present a national security risk failed to convince judges in three separate courts.",
    "link": "https://www.politico.com/news/2026/01/18/trump-offshore-wind-problems-00734850"
  },
  {
    "text": "Why Coinbase derailed the crypto industry’s political future - The Verge",
    "fullText": "The powerful crypto exchange objected to a draft of the market structure bill at the last minute, infuriating the rest of the industry.",
    "link": "https://www.theverge.com/policy/864008/senate-clarity-act-coinbase-crypto-market"
  }
]