[
  {
    "text": "2026 NFL Honors live updates: Athletes nominated for AP NFL awards set to arrive on the red carpet - AP News",
    "fullText": "The NFL MVP and other AP NFL awards are being announced at the NFL Honors tonight. Winners so far include Christian McCaffrey, Joe Thuney, Myles Garrett and Mike Vrabel.",
    "link": "https://apnews.com/live/ap-nfl-honors-awards-2026-updates"
  },
  {
    "text": "Six Nations: Farrell's Ireland must 'stop rot' after Paris humbling - BBC",
    "fullText": "Ireland's heavy defeat by France to open the Six Nations will only further press questions raised by a lacklustre autumn.",
    "link": "https://www.bbc.com/sport/rugby-union/articles/c8018mgd1zxo"
  },
  {
    "text": "Trump promises Schumer funding for NY tunnel project — if Penn Station and Dulles Airport are renamed after him - cnn.com",
    "fullText": "President Donald Trump told Senate Minority Leader Chuck Schumer last month that he was finally prepared to drop his freeze on billions of dollars in funding for a major New York infrastructure project.",
    "link": "https://www.cnn.com/2026/02/05/politics/schumer-trump-ny-funding-rename"
  },
  {
    "text": "Stock Market Today: Nasdaq Slumps Again as Jobs Data Collides With Tech Selloff — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-05-2026"
  },
  {
    "text": "The latest update on where things stand with Dolphins and Tua Tagovailoa - Miami Herald",
    "fullText": "The latest on Tua Tagovailoa and the Dolphins",
    "link": "https://www.miamiherald.com/sports/nfl/miami-dolphins/article314566436.html"
  },
  {
    "text": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years - Variety",
    "fullText": "\"Moulin Rouge! The Musical\" is closing after seven years on Broadway.",
    "link": "https://variety.com/2026/legit/news/moulin-rouge-musical-close-broadway-1236653932/"
  },
  {
    "text": "The Switch 2 is getting a new Virtual Console (kind of) - Ars Technica",
    "fullText": "Hamster Corp.'s new \"Console Archives\" does what Nintendon't.",
    "link": "https://arstechnica.com/gaming/2026/02/the-virtual-console-is-sort-of-back-on-the-switch-2/"
  },
  {
    "text": "DHS’ problems go farther than Minneapolis. Republicans are noticing. - Politico",
    "fullText": "From disaster response to bungled leadership at the nation’s cybersecurity agency, some Republicans are finding a lot more to critique than DHS’ immigration response.",
    "link": "https://www.politico.com/news/2026/02/05/noems-problems-go-beyond-the-ice-shootings-in-minneapolis-00767750"
  },
  {
    "text": "Stock Market Today: SPY, QQQ Tumble on Trio of Weak Jobs Data as Rate Cut Odds Surge - TipRanks",
    "fullText": "Both the S&P 500 ETF ($SPY) and the Nasdaq 100 ETF ($QQQ) closed down by over 1% on Thursday as investors digested a series of fresh labor market data points amid",
    "link": "https://www.tipranks.com/news/stock-market-today-spy-qqq-tumble-on-trio-of-weak-jobs-data-as-rate-cut-odds-surge"
  },
  {
    "text": "NASA Selects Two Earth System Explorers Missions - NASA (.gov)",
    "fullText": "These two missions were selected for continued development as part of NASA’s Earth System Explorers Program, which conducts principal investigator-led Earth",
    "link": "https://www.nasa.gov/news-release/nasa-selects-two-earth-system-explorers-missions/"
  },
  {
    "text": "Middle East Preparing For War Ahead Of U.S.-Iran Negotiations - The War Zone",
    "fullText": "The talks in Oman tomorrow are seen as a last-ditch diplomatic effort to prevent another conflict in the tumultuous Middle East.",
    "link": "http://www.twz.com/news-features/middle-east-preparing-for-war-ahead-of-u-s-iran-negotiations"
  },
  {
    "text": "Tim Cook Teases Plans for Apple's Upcoming 50th Anniversary - MacRumors",
    "fullText": "Apple turns 50 this year, and its CEO Tim Cook has promised to celebrate the milestone. The big day falls on April 1, 2026.   \"I've been...",
    "link": "https://www.macrumors.com/2026/02/05/tim-cook-teases-apple-50th-anniversary/"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "fullText": "The New START deal was the last vestige of arms control between the world’s largest superpowers.",
    "link": "https://www.politico.com/news/2026/02/05/trump-nuclear-arms-treaty-russia-00767497"
  },
  {
    "text": "Measles outbreak in Mexico prompts health alert in World Cup host Jalisco - ABC News",
    "fullText": "The Mexican state of Jalisco has issued a health alert and mandated face masks in schools due to a measles outbreak in the state capital",
    "link": "https://abcnews.go.com/Health/wireStory/measles-outbreak-mexico-prompts-health-alert-world-cup-129892256"
  },
  {
    "text": "What a crowded congressional primary in N.J. says about the state of Democrats - NPR",
    "fullText": "The contest is one of the first congressional primaries of the year where we will find out what issues are currently resonating with some Democratic voters. Here are some key things to know.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5701337/nj-primary-election-democrats-sherrill"
  },
  {
    "text": "New analysis suggests puzzling fossil may have been an unknown life-form - CNN",
    "fullText": "A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular life, according to a new study.",
    "link": "https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form"
  }
]