[
  {
    "text": "Moreno’s Game Winner Lifts Cats Past Tigers - UK Athletics",
    "fullText": "Moreno’s Game Winner Lifts Cats Past Tigers",
    "link": "https://ukathletics.com/news/2026/01/14/morenos-game-winner-lifts-cats-past-tigers/"
  },
  {
    "text": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "fullText": "Sweeping cuts to mental health and addiction programs worth more than $2 billion are being reversed. After a political backlash from Republicans and Democrats, the grant money will be restored.",
    "link": "https://www.npr.org/2026/01/14/nx-s1-5677714/trump-administration-mental-health-addiction-grant-cuts-restored"
  },
  {
    "text": "NCAA asks CFTC to suspend prediction markets - ESPN",
    "fullText": "The NCAA asked a federal regulatory body to stop prediction markets from offering trades on college sports until more safeguards are in place.",
    "link": "https://www.espn.com/college-sports/story/_/id/47614688/ncaa-asks-regulators-suspend-collegiate-prediction-markets"
  },
  {
    "text": "Reports: Shooting involving federal law enforcement in north Minneapolis - kare11.com",
    "fullText": "A large crowd has formed in the Hawthorne neighborhood.",
    "link": "https://www.kare11.com/article/news/local/ice-in-minnesota/reports-shooting-involving-federal-law-enforcement-in-north-minneapolis/89-f0dc3033-f01c-4870-961a-369dc16bde21"
  },
  {
    "text": "Iran briefly closes airspace as U.S. tensions rise, flights rerouted across region - CNBC",
    "fullText": "Iran temporarily closed most of its airspace late Wednesday, forcing airlines to reroute flights as tensions with the United States escalated.",
    "link": "https://www.cnbc.com/2026/01/15/iran-briefly-closes-airspace-as-us-tensions-rise-flights-rerouted-across-region.html"
  },
  {
    "text": "Twenty one English councils ask for election delays - BBC",
    "fullText": "Nearly a third of eligible authorities have want to postpone local polls scheduled for May.",
    "link": "https://www.bbc.com/news/articles/cd7z892jzdeo"
  },
  {
    "text": "US and UK pulling some personnel from Qatar military base - BBC",
    "fullText": "US officials say it is a \"precautionary measure\" and comes as Donald Trump weighs up whether to take action against Iran.",
    "link": "https://www.bbc.com/news/articles/c701xywwxw8o"
  },
  {
    "text": "At least 171 measles cases confirmed in 9 states: CDC - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/171-measles-cases-confirmed-9-states-cdc/story?id\\\\u003d129198221"
  },
  {
    "text": "In a win for Democrats, court allows California's redistricting plan to proceed - NPR",
    "fullText": "In November, California voters approved a new congressional map that could help Democrats win five more House seats and counter the Republican redistricting that President Trump has prompted in other states.",
    "link": "https://www.npr.org/2026/01/14/nx-s1-5647442/midterm-elections-redistricting-trump-california"
  },
  {
    "text": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "fullText": "On Jan. 6, there were 211 cases. The outbreak, which began in October, is now at 434.",
    "link": "https://arstechnica.com/health/2026/01/sc-measles-outbreak-has-gone-berserk-124-cases-since-friday-409-quarantined/"
  },
  {
    "text": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "fullText": "A group of pro-labor holdouts handed the GOP its latest setback and underscored the tough path for party-line legislation this year.",
    "link": "https://www.politico.com/news/2026/01/14/embarrassing-floor-meltdown-has-house-republicans-questioning-their-leaders-00730119"
  },
  {
    "text": "PS5 And PS4's Most-Downloaded Games Of 2025 Revealed, Including A Call Of Duty Surprise - GameSpot",
    "fullText": "Sports games reigned in 2025, and Battlefield 6 wasn't far behind.",
    "link": "https://www.gamespot.com/gallery/ps5-and-ps4s-most-downloaded-games-of-2025-revealed-including-a-call-of-duty-surprise/2900-7406/"
  },
  {
    "text": "US will suspend immigrant visa processing from 75 countries over public assistance concerns - AP News",
    "fullText": "The State Department says it will suspend the processing of immigrant visas for citizens of 75 countries whose nationals are deemed likely to require public assistance while living in the United States. The department said Wednesday it had instructed consular…",
    "link": "https://apnews.com/article/trump-immigration-visas-79909bd01e9e1e3dedde144f865a1b9d"
  },
  {
    "text": "Congressional Bill S. 222 Signed into Law - The White House (.gov)",
    "fullText": "On Wednesday, January 14, 2026, the President signed into law: S. 222, the \"Whole Milk for Healthy Kids Act of 2025,\" which modifies the requirements for",
    "link": "https://www.whitehouse.gov/briefings-statements/2026/01/congressional-bill-s-222-signed-into-law/"
  },
  {
    "text": "Oil prices fall after Trump signals he could hold off on attacking Iran - CNBC",
    "fullText": "Trump told reporters in the Oval Office that \"we've been told that the killing in Iran is stopping. It's stopped. It's stopping, and there's no plan for executions.\"",
    "link": "https://www.cnbc.com/2026/01/14/oil-falls-nearly-2percent-after-trump-signals-he-could-hold-off-on-attacking-iran.html"
  },
  {
    "text": "Kiefer Sutherland arrested and accused of assaulting ride-share driver, L.A. police say - NBC News",
    "fullText": "Actor Kiefer Sutherland, a film and television star since the 1980s, was arrested Monday after he was alleged to have physically assaulted and threatened a ride-share driver, police said.",
    "link": "https://www.nbcnews.com/news/us-news/kiefer-sutherland-arrested-allegedly-assaulting-ride-share-driver-l-po-rcna253933"
  },
  {
    "text": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/01/14/live-coverage-spacex-to-launch-midweek-starlink-mission-on-falcon-9-rocket-from-cape-canaveral/"
  },
  {
    "text": "Ryan Hurst Cast As Kratos In Prime Video’s ‘God of War’ - Deadline",
    "fullText": "Ryan Hurst has been cast in the series lead role of Kratos In Prime Video’s 'God of War.'",
    "link": "http://deadline.com/2026/01/ryan-hurst-cast-kratos-prime-video-god-of-war-1236683097/"
  },
  {
    "text": "Red Sox To Sign Ranger Suárez - MLB Trade Rumors",
    "fullText": "The Red Sox missed on Bregman but quickly pivot to adding more pitching.",
    "link": "https://www.mlbtraderumors.com/2026/01/red-sox-to-sign-ranger-suarez.html"
  },
  {
    "text": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it - BBC",
    "fullText": "The satellite technology has become a vital communications lifeline after the government shut down the internet last week.",
    "link": "https://www.bbc.com/news/articles/c0r4veg0rrzo"
  }
]