[
  {
    "text": "Lawsuit contests RFK Jr.’s new vaccine guidance for children - The Washington Post",
    "fullText": "Several public health organizations accused the health secretary of packing a key advisory committee with vaccine skeptics, arguing its latest guidance should be voided.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/rfk-childhood-vaccines-lawsuit/"
  },
  {
    "text": "Noem announces 10K migrant arrests in Minneapolis - NewsNation",
    "fullText": "“We have arrested over 10,000 criminal illegal aliens who were killing Americans, hurting children and reigning terror in Minneapolis,” Noem wrote.",
    "link": "https://www.newsnationnow.com/us-news/immigration/minneapolis-migrant-arrests/"
  },
  {
    "text": "Game Observations: 8 Takeaways From the Patriots Divisional Round Victory Over the Texans to Reach the AFC Championship Game - New England Patriots",
    "fullText": "The Patriots advanced to the AFC Championship Game with a 28-16 victory over the Texans at Gillette Stadium on Sunday.",
    "link": "https://www.patriots.com/news/game-observations-8-takeaways-from-the-patriots-divisional-round-victory-over-the-texans-to-reach-the-afc-championship-game"
  },
  {
    "text": "DeMeco Ryans wants C.J. Stroud to “flush” Sunday’s performance against the Patriots - NBC Sports",
    "fullText": "“I just told him, ‘Don't listen to anything. Put your phone away,\" Ryans said.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/demeco-ryans-wants-c-j-stroud-to-flush-sundays-performance-against-the-patriots"
  },
  {
    "text": "Japan 40-Year Bond Yield Hits 4% for First Time Since 2007 Debut - Bloomberg.com",
    "fullText": "The yield on Japan’s 40-year government bond hit 4%, the highest since its debut in 2007 and a first for any maturity of the nation’s sovereign debt in more than three decades.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-20/japan-40-year-bond-yield-hits-4-for-first-time-since-2007-debut-mkluxpba"
  },
  {
    "text": "How to take pictures of the Northern Lights with Google Pixel and other Android phones - 9to5Google",
    "fullText": "The Northern Lights are the most visible they've been in decades, and you can capture it with a picture from Android or Google Pixel phones.",
    "link": "http://9to5google.com/2026/01/19/how-to-take-pictures-northern-lights-android-google-pixel/"
  },
  {
    "text": "Are 'tech dense' farms the future of farming? - BBC",
    "fullText": "A host of technology is on offer to farmers, promising to raise farming yields and lower food prices.",
    "link": "https://www.bbc.com/news/articles/c78e4l3rm22o"
  },
  {
    "text": "Even some Trump advisers are wary of a military pursuit of Greenland. Is an off-ramp possible? - CNN",
    "fullText": "Flying home this month from an extended Christmas vacation in Palm Beach, President Donald Trump was momentarily taken aback when a reporter asked him about the ice-covered island he’s openly trying to annex.",
    "link": "https://www.cnn.com/2026/01/19/politics/military-greenland-trump-denmark-nato"
  },
  {
    "text": "Browns conduct 2nd head coach interview with defensive coordinator Jim Schwartz - Cleveland Browns",
    "fullText": "Schwartz first interviewed on Jan. 8",
    "link": "https://www.clevelandbrowns.com/news/browns-conduct-2nd-head-coach-interview-with-defensive-coordinator-jim-schwartz"
  },
  {
    "text": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case - AP News",
    "fullText": "Federal Reserve Chair Jerome Powell will attend the Supreme Court’s oral arguments Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair. The high court is considering whether Presid…",
    "link": "https://apnews.com/article/federal-reserve-jerome-powell-lisa-cook-supreme-court-7f135bd222013d4fe61eb8f03c663676"
  },
  {
    "text": "The fastest human spaceflight mission in history crawls closer to liftoff - Ars Technica",
    "fullText": "After a remarkably smooth launch campaign, Artemis II reached its last stop before the Moon.",
    "link": "https://arstechnica.com/space/2026/01/nasas-artemis-ii-rocket-rolls-to-launch-pad-but-key-test-looms-ahead/"
  },
  {
    "text": "Updates: Denmark, Greenland float NATO mission on island - dw.com",
    "fullText": "Denmark's defense minister said he and Greenland's defense minister raised the possibility of a NATO surveillance mission in Greenland in a meeting with the NATO chief Mark Rutte.",
    "link": "https://www.dw.com/en/greenland-updates-denmark-floats-nato-mission-on-island/live-75558976"
  },
  {
    "text": "RFK Jr. is bringing the GOP and the trial bar together - Politico",
    "fullText": "Plaintiffs’ lawyers, long Republican adversaries, see a lot to like in Kennedy’s assault on food and pharma.",
    "link": "https://www.politico.com/news/2026/01/19/rfk-lawyers-plaintiffs-tort-trial-bar-00735148"
  },
  {
    "text": "Bill Murray watched John Candy drive famous director 'out of his mind': 'Shamefully irresponsible' - Entertainment Weekly",
    "fullText": "Bill Murray revealed in a new documentary that he once watched John Candy drive a famous director 'out of his mind' during a production: 'Shamefully irresponsible.'",
    "link": "https://ew.com/bill-murray-says-john-candy-drove-famous-director-out-of-his-mind-11886503"
  },
  {
    "text": "An armada of 6,500 Elite Dangerous players just embarked on a three-month expedition to explore the Milky Way, and there's still time to join them - Space",
    "fullText": "To explore strange new worlds; to seek out new life and new civilizations; to boldly go where no one has gone before!",
    "link": "https://www.space.com/entertainment/space-games/an-armada-of-6-500-elite-dangerous-players-just-embarked-on-a-three-month-expedition-to-explore-the-milky-way-and-theres-still-time-to-join-them"
  },
  {
    "text": "Natalya heel turn costs Maxxine Dupri Intercontinental championship - Cageside Seats",
    "fullText": "Why Nattie why?",
    "link": "https://www.cagesideseats.com/wwe/412041/natalya-heel-turn-costs-maxxine-dupri-intercontinental-championship-becky-lynch-wwe-raw"
  },
  {
    "text": "Iggy Azalea caught Nick Young cheating on security cameras: \"This is just like a second shot to the chest\" - Yahoo",
    "fullText": "Azalea exposed Young's infidelity.",
    "link": "https://www.basketballnetwork.net/off-the-court/iggy-azalea-caught-nick-young-cheating-on-security-cameras"
  },
  {
    "text": "What deep sea mud is revealing about giant earthquakes along the Pacific Coast - Phys.org",
    "fullText": "Marine turbidites are layers of mud and sand deposited on the deep ocean floor by massive underwater landslides and are often used as a historical record for reconstructing earthquake histories.",
    "link": "https://phys.org/news/2026-01-deep-sea-mud-revealing-giant.html"
  },
  {
    "text": "What the first medical evacuation from the International Space Station tells us about healthcare in space - Space",
    "fullText": "The evacuation was the first such event in the history of the ISS.",
    "link": "https://theconversation.com/what-the-first-medical-evacuation-from-the-international-space-station-tells-us-about-healthcare-in-space-273728"
  },
  {
    "text": "\"We will be ungovernable\": Resistance 2.0 pivots to disruption - Axios",
    "fullText": "\"Our folks want to do more than just mass mobilization,\" one organizer said.",
    "link": "https://www.axios.com/2026/01/19/trump-administration-protests-resistance"
  }
]