[
  {
    "text": "Restaurant Brands earnings top estimates as international Burger King restaurants fuel sales growth - CNBC",
    "fullText": "Outside of the U.S. and Canada, Restaurant Brands' same-store sales climbed 6.1%.",
    "link": "https://www.cnbc.com/2026/02/12/restaurant-brands-international-qsr-q4-2025-earnings.html"
  },
  {
    "text": "‘Wuthering Heights’ and the birth of the toxic boyfriend - The Washington Post",
    "fullText": "A new movie of “Wuthering Heights” by feminist director Emerald Fennell grapples with the Catherine and Heathcliff Problem. Their dysfunction is irresistible.",
    "link": "https://www.washingtonpost.com/style/2026/02/12/wuthering-heights-movie-heathcliff/"
  },
  {
    "text": "Billionaire Jim Ratcliffe Says UK Is ‘Colonized’ by Immigrants - Bloomberg.com",
    "fullText": "Prime Minister Keir Starmer called on Jim Ratcliffe to apologize after the billionaire co-owner of the Manchester United football club said the UK has been “colonized” by immigrants.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-11/billionaire-jim-ratcliffe-says-uk-is-colonized-by-immigrants"
  },
  {
    "text": "Police identify 18-year-old as suspect in Tumbler Ridge shootings - BBC",
    "fullText": "A candlelit vigil was held on Wednesday night in the remote British Columbia town where six people were killed and dozens injured.",
    "link": "https://www.bbc.com/news/articles/ce8w95knp55o"
  },
  {
    "text": "2026 Pac-12 football schedule announced - FBSchedules.com",
    "fullText": "The 2026 Pac-12 Football Schedule has been officially announced. Conference play begins on Saturday, Oct. 3 with all eight teams in action.",
    "link": "https://fbschedules.com/2026-pac-12-football-schedule-announced/"
  },
  {
    "text": "5 Takeaways from Michigan Basketball’s 87-75 comeback win at Northwestern - Maize n Brew",
    "fullText": "Michigan Basketball stormed back from a 16-point deficit to defeat Northwestern 87-75 on Wednesday. Here are five takeaways from the comeback win.",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/106124/michigan-wolverines-basketball-northwestern-wildcats-takeaways-lj-cason-trey-mckenney-yaxel-lendeborg-dusty-may"
  },
  {
    "text": "Kyle Busch wins pole for Daytona 500; Briscoe on front row for second straight year - NASCAR.com",
    "fullText": "In his 21st Daytona 500 attempt, Kyle Busch will lead the field to green for the first time. Briscoe joins Busch on the front row.",
    "link": "https://www.nascar.com/news-media/2026/02/11/kyle-busch-wins-pole-for-daytona-500-briscoe-on-front-row-for-second-straight-year/"
  },
  {
    "text": "Poll: Top NATO allies don’t think US helps deter enemies anymore - Politico",
    "fullText": "The United States' eroding reputation is raising fresh questions about the stability of the global order that has held for decades, and of the country's strength on the world stage.",
    "link": "https://www.politico.com/news/2026/02/11/poll-us-nato-alliances-00775984"
  },
  {
    "text": "3 Zodiac Signs Experience Hope They Haven't Felt In A While On February 12, 2026 - YourTango",
    "fullText": null,
    "link": "https://www.yourtango.com/2026394092/zodiac-signs-hope-february-12-2026"
  },
  {
    "text": "US Energy Secretary Chris Wright visits Venezuela to assess oil industry overhaul - AP News",
    "fullText": "U.S. Energy Secretary Chris Wright is visiting Venezuela to assess the country's oil industry as the Trump administration eases sanctions and pushes a major overhaul. Wright arrived in Caracas on Wednesday and was meeting with acting President Delcy Rodríguez…",
    "link": "https://apnews.com/article/venezuela-oil-trump-wright-visit-rodriguez-b06f79d4d95ad69759d648c7b1b86dbf"
  },
  {
    "text": "S.F. teachers strike: Schools closed again Thursday as talks continue - San Francisco Chronicle",
    "fullText": "San Francisco teachers strike: The teachers union abandoned negotiations late Tuesday night, but they will resume today",
    "link": "https://www.sfchronicle.com/sf/article/teachers-strike-sfusd-21347453.php"
  },
  {
    "text": "Protesters in multiple states press Target to oppose the immigration crackdown in Minnesota - AP News",
    "fullText": "Activists have planned protests at more than two dozen Target stores around the United States to pressure the discount retailer into taking a public stand against the 5-week-old immigration crackdown in its home state of Minnesota. A coalition of community gr…",
    "link": "https://apnews.com/article/target-ice-protest-minneapolis-4a9012400f6c8b44e96451a04e0113c8"
  },
  {
    "text": "Japan stocks extend post-election rally with Nikkei 225 breaching 58,000 for the first time - CNBC",
    "fullText": "Other markets in Asia also shrugged off strong U.S. payrolls data that has dampened expectations for Federal Reserve rate cuts and sent Wall Street lower overnight.",
    "link": "https://www.cnbc.com/2026/02/12/asia-pacific-markets-nikkei-225-kospi-hang-seng-index.html"
  },
  {
    "text": "Will incoming owner move Trail Blazers out of Portland? Oregon’s governor has thoughts - OregonLive.com",
    "fullText": "Kotek said proposal puts state \"in the ballpark\" of what it will take to keep the Trail Blazers from moving.",
    "link": "https://www.oregonlive.com/sports/2026/02/will-incoming-owner-move-trail-blazers-out-of-portland-gov-tina-kotek-has-thoughts.html"
  },
  {
    "text": "Senators introduce first bipartisan effort to curb utility bill hikes related to data centers - NBC News",
    "fullText": "ed together on a number of bipartisan initiatives, are wading into the policy fight weeks after President Donald Trump — who has made the rapid development of artificial intelligence and the data center buildout a core piece of his economic agenda — said his …",
    "link": "https://www.nbcnews.com/politics/congress/senators-introduce-first-bipartisan-effort-curb-utility-bill-hikes-rel-rcna258577"
  },
  {
    "text": "Watch Vulcan Centaur rocket launch 'neighborhood watch' satellites for the US military early on Feb. 12 - Space",
    "fullText": "Liftoff of the USSF-87 mission is scheduled for 4:22 a.m. ET on Thursday (Feb. 12).",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/ula-vulcan-centaur-ussf-87-launch-space-surveillance-satellites"
  },
  {
    "text": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious - WINK News",
    "fullText": "AVE MARIA, Fla.—Now 57 cases of Measles have been reported at Ave Maria University, seven of which are contagious, according to the school's latest update.",
    "link": "https://www.winknews.com/news/collier/57-cases-of-measles-confirmed-at-ave-maria-university-7-currently-contagious/article_298f2922-a5b2-4b67-a0cd-24009dc56801.html"
  }
]