[
  {
    "text": "Picks And Predictions For Week 17 vs. the Carolina Panthers - Seattle Seahawks",
    "fullText": "The Seattle Seahawks face the Panthers on December 28 at Bank of America Stadium as part of Week 17 of the 2025 season. Kickoff is set for 10:00 a.m. PT. Here’s what local and national media are predicting:",
    "link": "https://www.seahawks.com/news/picks-and-predictions-for-week-17-vs-the-carolina-panthers"
  },
  {
    "text": "Brigitte Bardot, French femme fatale and cultural phenomenon, dies at 91 - The Washington Post",
    "fullText": "The actress and singer was a symbol of sexual revolution. She later became an animal-welfare campaigner and incendiary right-wing commenter.",
    "link": "https://www.washingtonpost.com/obituaries/2025/12/28/brigitte-bardot-dead/"
  },
  {
    "text": "California's 5 freeway reopens after gas line rupture closed road - USA Today",
    "fullText": "Interstate 5 was closed for hours and a shelter-in-place was imposed after a gas line rupture north of Los Angeles.",
    "link": "https://www.usatoday.com/story/news/nation/2025/12/27/interestate-5-closed-los-angeles-gas-rupture/87932118007/"
  },
  {
    "text": "New York subway ends its MetroCard era and switches fully to tap-and-go fares - ABC News",
    "fullText": "The New York City transit system is retiring the MetroCard after more than 30 years",
    "link": "https://abcnews.go.com/US/wireStory/new-york-subway-ends-metrocard-era-switches-fully-128731205"
  },
  {
    "text": "Restaurants' hottest menu item in 2025 was 'value.' That won't change next year - CNBC",
    "fullText": "Restaurant chains bet on value in 2025, and they're not likely to ditch the strategy next year.",
    "link": "https://www.cnbc.com/2025/12/28/value-meals-restaurants-mcdonalds-chilis-taco-bell.html"
  },
  {
    "text": "Guinea votes in first election since 2021 coup with junta leader expected to win - AP News",
    "fullText": "Guineans are voting to elect a new president in the country’s first election since a 2021 coup. The election on Sunday features a weakened opposition with a total of nine candidates. Analysts have predicted a likely win for junta leader Gen. Mamadi Doumbouya.…",
    "link": "https://apnews.com/article/guinea-election-voting-conakry-9c51dff8b5d244b5c5f2157be6eaf1d2"
  },
  {
    "text": "Derrick Henry’s 36 carries on Saturday night were the most in an NFL game in two years - NBC Sports",
    "fullText": "They don't make workhorse running backs like they used to, but Ravens running back Derrick Henry had a throwback game on Saturday night.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/derrick-henrys-36-carries-on-saturday-night-were-the-most-in-an-nfl-game-in-two-years"
  },
  {
    "text": "New winter storm heads for Midwest, Northeast with 40 million people on alert - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/new-winter-storm-heads-midwest-northeast-40-million/story?id\\\\u003d128730117"
  },
  {
    "text": "Iran in ‘all-out war’ with US, Europe and Israel, says president - Financial Times",
    "fullText": "Pezeshkian warns that Iran’s military forces are ‘more prepared’ than ever",
    "link": "https://www.ft.com/content/901dd070-aef6-4139-8a3f-94ffdc9d0829"
  },
  {
    "text": "This is your teen’s brain on phones and social media, according to science - The Washington Post",
    "fullText": "A wave of new studies is shedding light on the risks of early smartphone access and heavy screen use for adolescent mental health and development.",
    "link": "https://www.washingtonpost.com/health/2025/12/28/adolescent-brain-development-screen-time/"
  },
  {
    "text": "For Ukrainians, a nuclear missile museum is a bitter reminder of what the country gave up - NPR",
    "fullText": "The Museum of Strategic Missile Forces tells the story of how Ukraine dismantled its nuclear weapons arsenal after independence in 1991. Today many Ukrainians believe that decision to give up nukes was a mistake.",
    "link": "https://www.npr.org/2025/12/28/g-s1-103485/ukraine-museum-strategic-missile-forces-budapest-agreement"
  },
  {
    "text": "Mercury: The planet that shouldn't exist - BBC",
    "fullText": "Mercury has long baffled astronomers because it defies much of what we know about planet formation. A new space mission arriving in 2026 might solve the mystery.",
    "link": "https://www.bbc.com/future/article/20251223-mercury-the-planet-that-shouldnt-exist"
  },
  {
    "text": "It's Not Just a COLA: 4 Big Social Security Changes Happening in 2026 - The Motley Fool",
    "fullText": "Get ready for a big shakeup.",
    "link": "https://www.fool.com/retirement/2025/12/28/its-not-just-a-cola-4-big-social-security-changes/"
  },
  {
    "text": "Foods with healthy-sounding buzzwords could be hiding added sugar in plain sight - ABC News",
    "fullText": "People probably don’t know how much sugar they’re eating",
    "link": "https://abcnews.go.com/Health/wireStory/foods-healthy-sounding-buzzwords-hiding-added-sugar-plain-128728905"
  },
  {
    "text": "Horoscope for Sunday, December 28, 2025 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2025/12/28/horoscopes-today-sunday-december-28-2025"
  },
  {
    "text": "Joint Statement by the Foreign Ministers of Jordan,Egypt,Algeria Comoros,Djibouti,Gambia Iran,Iraq Kuwait,Libya Maldives,Nigeria Oman,Pakistan, Palestine,Qatar,Saudi Arabia,Somalia Sudan,Turkiye,Yemen and the OIC - Ministry of Foreign Affairs, Government of Pakistan",
    "fullText": null,
    "link": "https://mofa.gov.pk/press-releases/joint-statement-by-the-foreign-ministers-of-jordanegyptalgeria-comorosdjiboutigambia-iraniraq-kuwaitlibya-maldivesnigeria-omanpakistan-palestineqatarsaudi-arabiasomalia-sudanturkiyeyemen-and-the-oic"
  },
  {
    "text": "Week 17 NFL Playoff Picture, AFC, NFC Bracket Scenarios After Saturday's Games - Bleacher Report",
    "fullText": "The Houston Texans became the sixth AFC team to clinch a postseason berth with their Saturday win over the Los Angeles Chargers.",
    "link": "https://bleacherreport.com/articles/25340193-week-17-nfl-playoff-picture-afc-nfc-bracket-scenarios-after-saturdays-games"
  },
  {
    "text": "Thailand and Cambodia sign a new ceasefire agreement to end border fighting - AP News",
    "fullText": "Thailand and Cambodia have signed a ceasefire agreement to end weeks of fighting over border disputes. The agreement, effective Saturday at noon, halts military movements and airspace violations. Thailand had conducted airstrikes in Cambodia as recently as Sa…",
    "link": "https://apnews.com/article/thailand-cambodia-border-fighting-ceasefire-0019310e1c062cd211f9f5398b3bc463"
  }
]