[
  {
    "text": "Statement on President Trump’s Comprehensive Plan to End the Gaza Conflict - The White House (.gov)",
    "fullText": "Yesterday, President Donald J. Trump congratulated the formation of the National Committee for the Administration of Gaza (NCAG), a vital step forward in",
    "link": "https://www.whitehouse.gov/briefings-statements/2026/01/statement-on-president-trumps-comprehensive-plan-to-end-the-gaza-conflict/"
  },
  {
    "text": "Rangers to retool roster, may trade popular players, Drury writes - NHL.com",
    "fullText": "GM says team must be ‘honest and realistic’ about our situation",
    "link": "https://www.nhl.com/news/new-york-rangers-gm-drury-team-needs-retool-may-trade-favorite-players"
  },
  {
    "text": "The New Year Preview – Prince Yriel counterattacks with new Aeldari Corsairs - Warhammer Community",
    "fullText": "The Eldritch Raiders strike from the void.",
    "link": "https://www.warhammer-community.com/articles/l7x5v6ib/the-new-year-preview-prince-yriel-counterattacks-with-new-aeldari-corsairs"
  },
  {
    "text": "It took 75 governors to elect a woman. Spanberger will soon be at Virginia's helm - NPR",
    "fullText": "Abigail Spanberger, a former CIA officer and three-term congresswoman, is breaking long-held traditions on inauguration day. She says she wants her swearing-in to showcase the state's modern vibrancy.",
    "link": "https://www.npr.org/2026/01/16/nx-s1-5675312/spanberger-virginia-governor-inauguration"
  },
  {
    "text": "Supreme Court will hear appeal by maker of popular Roundup weedkiller to block thousands of lawsuits - AP News",
    "fullText": "The Supreme Court has agreed to hear an appeal from agrochemical manufacturer Bayer to block thousands of state lawsuits alleging it failed to warn people its popular weedkiller could cause cancer. The justices said Friday they'll consider whether the Environ…",
    "link": "https://apnews.com/article/supreme-court-bayer-roundup-glyphosate-cancer-2e8e03708f125a84999259e624fb695c"
  },
  {
    "text": "Virginia lawmakers pass redistricting amendment, sending it to voters for approval - NBC News",
    "fullText": "The Virginia state Senate passed a constitutional amendment to pave the way for a mid-decade redistricting push, the final legislative step needed to send it to voters for approval.",
    "link": "https://www.nbcnews.com/politics/2026-election/virginia-lawmakers-pass-redistricting-amendment-voters-approval-rcna254049"
  },
  {
    "text": "ICE says a Cuban man died during a suicide attempt. A witness says a guard fatally choked him - AP News",
    "fullText": "A Cuban immigrant who lived in the U.S. for nearly three decades died in a Texas immigration facility during an altercation with guards. While the local medical examiner has indicated his death will likely be classified as a homicide, the federal government h…",
    "link": "https://apnews.com/article/ice-immigration-detention-death-texas-2bfb614b2b222803d309f338357d04eb"
  },
  {
    "text": "'Conjuring' Prequel, J.J. Abrams Movie, Keanu Reeves Project Release Dates - Deadline",
    "fullText": "Warner Bros has dated J.J. Abrams new movie 'The Great Beyond', a new 'Conjuring' prequel and movies from Sam Esmail and Keanu Reeves",
    "link": "http://deadline.com/2026/01/conjuring-first-communion-great-beyond-panic-carefully-release-dates-1236685371/"
  },
  {
    "text": "Giants, John Harbaugh haggle over contract \"language\" - NBC Sports",
    "fullText": "At some point, they need to get it done.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/giants-john-harbaugh-haggle-over-contract-language"
  },
  {
    "text": "Live updates: Trump warns Minnesota ICE protests will be dealt with 'quickly' - BBC",
    "fullText": "The president says protesters will be dealt with \"quickly and effectively\" if he is \"forced to act\" as Democrat lawmakers say \"reckless, even lethal, use of force cannot continue\".",
    "link": "https://www.bbc.com/news/live/cwyg34kexrgt"
  },
  {
    "text": "Mets To Sign Bo Bichette - MLB Trade Rumors",
    "fullText": "The Mets bounced back quickly after missing on Kyle Tucker. Bo Bichette is headed to Queens. Read more at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-sign-bo-bichette.html"
  },
  {
    "text": "Jonathan Kuminga Is In Basketball Purgatory - Defector",
    "fullText": "It’s hard to pinpoint the moment that Jonathan Kuminga first became disenchanted with the Golden State Warriors and their management, so we will have to start the clock with the trade demand that sparked the latest stage in their preposterous standoff. By tha…",
    "link": "https://defector.com/jonathan-kuminga-is-in-basketball-purgatory"
  },
  {
    "text": "WEF: Donald Trump set to dominate Davos 2026 - dw.com",
    "fullText": "Davos braces for Trump's return. Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence is expected to raise the stakes at WEF's annual meeting.",
    "link": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182"
  },
  {
    "text": "YouTube relaxes monetization guidelines for some controversial topics - TechCrunch",
    "fullText": "These controversial topics include self-harm, abortion, suicide, and domestic and sexual abuse.",
    "link": "https://techcrunch.com/2026/01/16/youtube-relaxes-monetization-guidelines-for-some-controversial-topics/"
  },
  {
    "text": "South Korean court sentences former president to 5 years in prison - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/south-korean-court-sentences-former-president-5-years/story?id\\\\u003d129271511"
  },
  {
    "text": "Matt Damon’s ‘The Rip’ Nearly Sets A Netflix Rotten Tomatoes Record - Forbes",
    "fullText": "The Rip releases today on Netflix starring Matt Damon and Ben Affleck, which has nearly set a record for the service on Rotten Tomatoes.",
    "link": "https://www.forbes.com/sites/paultassi/2026/01/16/matt-damons-the-rip-nearly-sets-a-netflix-rotten-tomatoes-record/"
  },
  {
    "text": "Cardiff University team helps find mysterious iron bar in space - BBC",
    "fullText": "Cardiff astronomers say they don't yet know where iron bar detected inside the Ring Nebula came from.",
    "link": "https://www.bbc.com/news/articles/ckgxlvv0wdko"
  },
  {
    "text": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "fullText": "The parent company of X and Grok, xAI, launched a counter-suit saying she had violated its terms of service.",
    "link": "https://www.bbc.com/news/articles/cp37erw0zwwo"
  }
]