[
  {
    "text": "Pentagon readies 1,500 soldiers to possibly deploy to Minnesota, officials say - The Washington Post",
    "fullText": "Soldiers with the Army’s 11th Airborne Division in Alaska have been placed at the ready following Trump’s Insurrection Act threat, according to defense officials.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/18/trump-minnesota-insurrection-act/"
  },
  {
    "text": "Bodybuilder Kali Muscle Hospitalized After Fainting at Gym - TMZ",
    "fullText": "Bodybuilder Kali Muscle was hospitalized after passing out while exercising at a California gym.",
    "link": "https://www.tmz.com/2026/01/17/bodybuilder-kali-muscle-hospitalized-after-fainting-at-gym/"
  },
  {
    "text": "Pennsylvania woman's final moments captured on home security video. Will it help prove she was murdered? - CBS News",
    "fullText": "Bruno Rocuba claims a freak accident while handling his gun caused the death of his wife, Melissa Rocuba. He was not arrested or charged with any crime. Years later, investigators uncover disturbing new evidence that challenges what really happened that night…",
    "link": "https://www.cbsnews.com/news/melissa-rocuba-bruno-rocuba-pennsylvania-shooting-death-home-security-video-48-hours/"
  },
  {
    "text": "In Denmark, U.S. lawmakers contradict Trump on Greenland - The Washington Post",
    "fullText": "Leaders of the bipartisan delegation said most Americans don’t want to acquire the territory, and thousands of Danes joined Hands-off Greenland protests.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/congressional-delegation-denmark-greenland-trump/"
  },
  {
    "text": "Fare thee well: Thousands give Bob Weir a stirring send-off at S.F. ‘homecoming’ - San Francisco Chronicle",
    "fullText": "Thousands of music fans gave Bob Weir a stirring send-off Saturday at the San Francisco “homecoming” for the Grateful Dead co-founder, who died last weekend.",
    "link": "https://www.sfchronicle.com/sf/article/bob-weir-memorial-grateful-dead-21297361.php"
  },
  {
    "text": "Janice Dickinson Spotted After Sharing Alleged Injuries From Reality Show Fall - TMZ",
    "fullText": "Janice Dickinson's still smiling despite everyone talking about a traumatic moment in her life this week ... looking happy after we posted photos of alleged injuries she says she sustained in a nasty fall.",
    "link": "https://www.tmz.com/2026/01/17/janice-dickinson-spotted-sharing-alleged-injuries-reality-show-fall/"
  },
  {
    "text": "'Not nothing': Former 49ers QB Alex Smith not buying downplay of Darnold injury - SFGATE",
    "fullText": "ESPN analyst Alex Smith, a former 49ers quarterback, says Seahawks quarterback Sam Darnold's injury is a cause for real concern.",
    "link": "https://www.sfgate.com/49ers/article/former-49ers-qb-not-buying-downplay-darnold-injury-21300397.php"
  },
  {
    "text": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
    "fullText": "The two men’s eyewitness accounts of the Jan. 3 death of Geraldo Lunas Campos at a Texas detention camp differ from the Department of Homeland Security’s account of the incident.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/17/detainee-death-witnesses-deported-dhsa/"
  },
  {
    "text": "Five takeaways from IU basketball’s loss to Iowa - Inside the Hall",
    "fullText": "IU basketball lost its third straight game, falling 74-57 on Saturday afternoon to Iowa at Simon Skjodt Assembly Hall.",
    "link": "https://www.insidethehall.com/2026/01/17/five-takeaways-from-iu-basketballs-loss-to-iowa/"
  },
  {
    "text": "Scientists find an interstellar 'tunnel' that connects our solar system to other stars - Earth.com",
    "fullText": "Astronomers found an interstellar \"tunnel\" - a cosmic channel that connects our solar system to distant stars, according to a recent study.",
    "link": "https://www.earth.com/news/local-hot-bubble-interstellar-cosmic-channel-connects-our-solar-system-to-other-stars/"
  },
  {
    "text": "Lucas: Cal Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the visit to Cal.",
    "link": "https://goheels.com/news/2026/1/17/mens-basketball-lucas-cal-rapid-reactions"
  },
  {
    "text": "After breaking up a fight, Mark Pope got doused in water after Kentucky's win at Tennessee - On3",
    "fullText": "The entertainment didn't stop at the buzzer after Kentucky's win at Tennessee, with Mark Pope breaking up a fight and getting drenched in water.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/kentucky-tennessee-mark-pope-postgame-fight-locker-room-celebration/"
  },
  {
    "text": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film Awards - Deadline",
    "fullText": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: \"He Will Lose It\" – European Film Awards",
    "link": "http://deadline.com/2026/01/norwegian-star-liv-ullmann-comments-trump-nobel-peace-prize-1236686028/"
  },
  {
    "text": "Five die in Austrian avalanches, rescuers say - BBC",
    "fullText": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
    "link": "https://www.bbc.com/news/articles/c3r1v7gqdp8o"
  },
  {
    "text": "Justice Dept. enters new territory with probe of Minnesota officials - The Washington Post",
    "fullText": "The agency is targeting critics during a moment of crisis in which protesters are clashing with federal agents on icy city streets.",
    "link": "https://www.washingtonpost.com/politics/2026/01/17/trump-walz-frey-investigation-minnesota-justice-department/"
  },
  {
    "text": "RFK-backed infant vaccine study in Africa to proceed despite backlash, U.S. says - The Washington Post",
    "fullText": "U.S. funding for a study on the timing of hepatitis B vaccine doses in infants in Guinea-Bissau has sparked confusion and ethics concerns.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/rfk-vaccine-trump-hepatitis-b-guinea-bissau-infant-trial/"
  },
  {
    "text": "Back-to-back winter storms hit the East this weekend with arctic blast behind them next week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/back-back-winter-storms-hit-east-weekend-arctic/story?id\\\\u003d129309541"
  },
  {
    "text": "Bank of America revamps Alphabet stock after Google enters two key partnerships - thestreet.com",
    "fullText": "Here’s what could be next for Alphabet stock.",
    "link": "https://www.thestreet.com/investing/stocks/bank-of-america-revamps-alphabet-stock-after-google-enters-two-key-partnerships"
  },
  {
    "text": "Soaring Electricity Costs Are Now a Hot Political Issue - The Wall Street Journal",
    "fullText": "Electricity-cost increases are outpacing other kinds of inflation, putting utility bills in the spotlight ahead of the midterms",
    "link": "https://www.wsj.com/business/energy-oil/soaring-electricity-costs-are-now-a-hot-political-issue-d0319a1d"
  }
]