[
  {
    "text": "Dow Jones Today: Major Indexes Jump as Oil Stocks Soar on Maduro's Capture; Dow Hits All-Time High - Investopedia",
    "fullText": "Major stock indexes finished sharply higher Monday, with the Dow Jones Industrial Average setting all-time intraday and closing records, after the U.S. military seized Venezuelan president Nicolás Maduro over the weekend.",
    "link": "https://www.investopedia.com/dow-jones-today-010526-11878921"
  },
  {
    "text": "Maduro declares 'I am innocent' and 'still president' in Manhattan court appearance - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/maduro-wife-manhattan-federal-court-monday/story?id\\\\u003d128903135"
  },
  {
    "text": "Lucrative online trades on Maduro ouster spur new bill to ban Polymarket insider trading - Axios",
    "fullText": "Rep. Ritchie Torres' bill would ban government officials from making prediction market trades based on insider information.",
    "link": "https://www.axios.com/2026/01/05/venezuela-polymarket-prediction-insider-trading"
  },
  {
    "text": "Gemini expands on Google TV, bringing Nano Banana and Veo models to your TV - Ars Technica",
    "fullText": "Google TV will let you generate and watch AI content on the big screen.",
    "link": "https://arstechnica.com/google/2026/01/gemini-expands-on-google-tv-bringing-nano-banana-and-veo-models-to-your-tv/"
  },
  {
    "text": "NASA’s Hubble Examines Cloud-9, First of New Type of Object - NASA Science (.gov)",
    "fullText": "A team using Hubble uncovered a new type of astronomical object — a starless, gas-rich, dark-matter cloud, a remnant of early galaxy formation.",
    "link": "https://science.nasa.gov/missions/hubble/nasas-hubble-examines-cloud-9-first-of-new-type-of-object/"
  },
  {
    "text": "Cardinals Move On From Jonathan Gannon As Head Coach - Arizona Cardinals",
    "fullText": "Team struggled all season after 2-0 start",
    "link": "https://www.azcardinals.com/news/cardinals-move-on-from-jonathan-gannon-as-head-coach"
  },
  {
    "text": "Flu season surged in the US over the holiday and already rivals last winter’s harsh epidemic - AP News",
    "fullText": "U.S. flu infections are still surging, and health officials are calling it a severe season that is likely to get worse. New government data posted Monday shows that by some measures this season is already surpassing the flu epidemic of last winter. That was o…",
    "link": "https://apnews.com/article/us-flu-cases-cdc-subclade-k-29cc5a68eb100585c8e0dbd2ec47b3eb"
  },
  {
    "text": "Qualcomm’s next-gen Snapdragon X2 laptops are here — and they brought a new friend - The Verge",
    "fullText": "Qualcomm has announced the Snapdragon X2 Plus, and says both it and the Snapdragon X2 Elite should be in PCs by end of Q1 2026.",
    "link": "https://www.theverge.com/tech/853851/qualcomm-snapdragon-x2-plus-elite-laptops-price-ces-2026"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Gets Updated Release Date And Pre-Order Deal - Forbes",
    "fullText": "New details confirm Samsung's updated Galaxy S26 release date and reveal a decision on Galaxy S26 pricing.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/01/05/samsung-galaxy-s26-release-date-price-leaks/"
  },
  {
    "text": "The Golden Globes are this week. Here's what to know about the first major show of awards season - AP News",
    "fullText": "The Golden Globes kick off Hollywood’s awards season on Sunday. This year’s 83rd edition of the show is hosted for the second year by comedian Nikki Glaser. It airs live at 8 p.m. Eastern on CBS and streams live on Paramount+. Acting nominees include Timothée…",
    "link": "https://apnews.com/article/golden-globes-2026-what-to-know-5c67be217f15e16da1b97c5d18fb8197"
  },
  {
    "text": "New federal screening guidance expands cervical cancer testing with an at-home HPV option - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-federal-screening-guidance-expands-cervical-cancer-testing/story?id\\\\u003d128891185"
  },
  {
    "text": "'Mayor Of Kingstown' To End; Renewed For 5th & Final Season -Exclusive - Deadline",
    "fullText": "'Mayor Of Kingstown' is ending. The Taylor Sheridan drama starring Jeremy Renner has been renewed for 8-episode fifth and final season by Paramount+.",
    "link": "http://deadline.com/2026/01/mayor-of-kingstown-renewed-end-final-season-5-episode-count-1236656539/"
  },
  {
    "text": "Minnesota Gov. Tim Walz ends campaign for reelection - Axios",
    "fullText": "The two-term governor has faced mounting pressure over fraud in state programs.",
    "link": "https://www.axios.com/local/twin-cities/2026/01/05/tim-walz-drop-out-minnesota-governor-race"
  },
  {
    "text": "Committee Releases Conferenced CJS, E&W, and Interior Bills - House Committee on Appropriations (.gov)",
    "fullText": "Washington, D.C. – Continuing its work to advance regular order and deliver results for the American people, the House Appropriations Committee today released the Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropria…",
    "link": "http://appropriations.house.gov/news/press-releases/committee-releases-conferenced-cjs-ew-and-interior-bills"
  },
  {
    "text": "Pentagon to cut Sen. Mark Kelly's military retirement pay over 'seditious' video: Hegseth - CNBC",
    "fullText": "Sen. Mark Kelly and other members of Congress on the video reminded members of the U.S. military that they can refuse to follow illegal orders.",
    "link": "https://www.cnbc.com/2026/01/05/pentagon-mark-kelly-video-hegseth.html"
  },
  {
    "text": "US oil companies gain after capture of Venezuela's Maduro - BBC",
    "fullText": "Investors bet the action may open opportunities to tap the country's oil wealth.",
    "link": "https://www.bbc.com/news/articles/crrnw08qvg7o"
  },
  {
    "text": "Amazon revamps Fire TV, launches its own ‘Artline’ televisions with frames at CES - TechCrunch",
    "fullText": "Fire TV's new interface focuses on your content and offers easier, speedier navigation, Amazon says.",
    "link": "https://techcrunch.com/2026/01/05/amazon-revamps-fire-tv-launches-its-own-artline-televisions-with-frames/"
  },
  {
    "text": "Security Council LIVE: World powers confront a ‘dangerous’ turning point in Venezuela - UN News",
    "fullText": "The Security Council is meeting in emergency session in New York to address the US rendition of Venezuela’s President Nicolás Maduro from Caracas, a move that has sent shockwaves through the region and beyond. The UN chief António Guterres told ambassadors th…",
    "link": "https://news.un.org/en/story/2026/01/1166700"
  },
  {
    "text": "Protest over AI, climate crisis leaves tens of thousands without power in Berlin - CNBC",
    "fullText": "A suspected arson attack in southwest Berlin has prompted a major power outage, with tens of thousands of households affected.",
    "link": "https://www.cnbc.com/2026/01/05/berlin-power-outage-officials-suspect-arson-attack.html"
  }
]