[
  {
    "text": "Trump says \"I didn't make a mistake\" after racist video of Obamas removed - Axios",
    "fullText": "The post was up on Trump's Truth Social account for about 12 hours.",
    "link": "https://www.axios.com/2026/02/06/trump-racist-video-barack-michelle-obama-truth-social"
  },
  {
    "text": "Quinton Aaron 'Excited' For Super Bowl in Positive Health Update - TMZ",
    "fullText": "Quinton Aaron is still in the hospital ... but it sure sounds like things are looking up, as TMZ just got a great update from his family.",
    "link": "https://www.tmz.com/2026/02/06/quinton-aaron-health-update/"
  },
  {
    "text": "Lakers optimistic Luka Dončić avoided major injury, out vs. Warriors - Silver Screen and Roll",
    "fullText": "It appears that Luka Dončić won’t miss a lot of time due to his recent hamstring injury.",
    "link": "https://www.silverscreenandroll.com/lakers-injury-report/107519/lakers-injury-report-luka-doncic-hamstring-warriors-status-doubtful-update"
  },
  {
    "text": "Stock Market Today: Dow Hits 50,000 For First Time — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-06-2026"
  },
  {
    "text": "Nothing could stop the U.S. figure skating team. Not even JD Vance’s motorcade. - The Washington Post",
    "fullText": "Alysa Liu and world champion dance team of Madison Chock and Evan Bates have the Americans leading the team event after day one.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/06/olympics-team-figure-skating-jd-vance/"
  },
  {
    "text": "Kelsea Ballerini & Chase Stokes Break Up Again - TMZ",
    "fullText": "Kelsea Ballerini and Chase Stokes have broken up ... and, if you're getting déjà vu by reading that, you're not alone -- but our sources say it's completely over this time.",
    "link": "https://www.tmz.com/2026/02/06/kelsea-ballerini-and-chase-stokes-break-up/"
  },
  {
    "text": "What caused the massive Bitcoin crash? Clues point to a blow-up at Hong Kong hedge funds - Fortune",
    "fullText": "What caused the massive Bitcoin crash? Clues point to a blow-up at Hong Kong hedge funds",
    "link": "https://fortune.com/2026/02/06/what-caused-the-massive-bitcoin-crash-clues-point-to-a-blow-up-at-hong-kong-hedge-funds/"
  },
  {
    "text": "Yasiel Puig found guilty of obstruction, lying to officials - ESPN",
    "fullText": "A jury has found ex-major league outfielder Yasiel Puig guilty of obstruction of justice and lying to federal officials, the U.S. Attorney's Office said Friday.",
    "link": "https://www.espn.com/mlb/story/_/id/47852596/ex-mlb-player-puig-guilty-obstruction-lying-officials"
  },
  {
    "text": "AI companies pour big money into Super Bowl battle - CNBC",
    "fullText": "Google, Amazon and Meta are among the companies advertising their AI tools during Super Bowl 60.",
    "link": "https://www.cnbc.com/2026/02/06/super-bowl-ai-companies-pour-big-money-into-ads.html"
  },
  {
    "text": "UNITED STATES-INDIA JOINT STATEMENT - The White House (.gov)",
    "fullText": "The United States of America (United States) and India are pleased to announce that they have reached a framework for an Interim Agreement regarding",
    "link": "https://www.whitehouse.gov/briefings-statements/2026/02/united-states-india-joint-statement/"
  },
  {
    "text": "Why a bump to $700 could be a \"death sentence\" for the Steam Machine - Ars Technica",
    "fullText": "Analysts expect Valve might be hit particularly hard by soaring RAM, storage prices.",
    "link": "https://arstechnica.com/gaming/2026/02/why-a-bump-to-700-could-be-a-death-sentence-for-the-steam-machine/"
  },
  {
    "text": "Exclusive | Justice Department Casts Wide Net on Netflix’s Business Practices in Merger Probe - The Wall Street Journal",
    "fullText": "As it probes bids for Warner, the department is asking if the streamer has engaged in conduct that could make it a monopoly",
    "link": "https://www.wsj.com/business/media/justice-department-casts-wide-net-on-netflixs-business-practices-in-merger-probe-fd30d7f8"
  },
  {
    "text": "NASA Sets Coverage for Agency’s SpaceX Crew-12 Launch, Docking - NASA (.gov)",
    "fullText": "NASA will stream live coverage of the upcoming prelaunch, launch, and docking activities for the agency’s SpaceX Crew-12 mission to the International Space",
    "link": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-agencys-spacex-crew-12-launch-docking/"
  },
  {
    "text": "Canada plants a flag in Greenland - Politico",
    "fullText": "Foreign Affairs Minister Anand insists Nuuk is a long-term Arctic play — with Anchorage up next.",
    "link": "https://www.politico.com/news/2026/02/06/canada-greenland-consulate-opens-flag-00769338"
  },
  {
    "text": "Trump’s harsh immigration tactics are taking a political hit - NPR",
    "fullText": "President Trump's popularity on one of his political strengths is in jeopardy.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5697026/trumps-harsh-immigration-tactics-are-taking-a-political-hit"
  },
  {
    "text": "Something Mysteriously Powerful Slammed Into Earth in 2023. Scientists Now Have a Theory - Gizmodo",
    "fullText": "The science here gets really dark.",
    "link": "https://gizmodo.com/something-unimaginably-powerful-slammed-into-earth-in-2023-scientists-now-have-a-theory-2000719040"
  },
  {
    "text": "Maine reports first measles case since 2019 - The Portland Press Herald",
    "fullText": "The case was confirmed by the Maine CDC on Thursday.",
    "link": "https://www.pressherald.com/2026/02/06/maine-reports-first-measles-case-since-2019-2/"
  },
  {
    "text": "Apple Plans to Allow Outside Voice-Controlled AI Chatbots in CarPlay - bloomberg.com",
    "fullText": "Apple Inc. is preparing to allow voice-controlled artificial intelligence apps from other companies in CarPlay, according to people familiar with the matter, a move that will let users query AI chatbots through its vehicle interface for the first time.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-06/apple-plans-to-allow-outside-voice-controlled-ai-chatbots-in-carplay"
  },
  {
    "text": "Learning neuroimaging models from health system-scale data - Nature",
    "fullText": "Prima is an AI foundation model for neuroimaging based on clinical magnetic resonance imaging that offers accurate and explainable diagnostics, worklist priority for radiologists and clinical referral recommendations with equitable performance on diverse grou…",
    "link": "https://www.nature.com/articles/s41551-025-01608-0"
  },
  {
    "text": "China Secretly Testing Nuclear Weapons And Covering Its Tracks, U.S. Alleges (Updated) - The War Zone",
    "fullText": "The new U.S. accusations about China come at a turbulent moment for nuclear arms control globally.",
    "link": "http://www.twz.com/nuclear/china-secretly-testing-nuclear-weapons-and-covering-its-tracks-u-s-alleges"
  }
]