[
  {
    "text": "Seahawks thump 49ers in playoff opener, advance to NFC Championship Game - The Seattle Times",
    "fullText": "In a game that felt over almost as soon as it started, the Seahawks thumped the 49ers 41-6 in their playoff opener and advance to the NFC Championship Game.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-thump-49ers-in-playoff-opener-advance-to-nfc-championship-game/"
  },
  {
    "text": "‘SNL’ Mocks Trump’s Nobel Prize Envy, Colin Jost’s Unhinged Pete Hegseth Promises ‘USA is Going to F—‘ Countries Around the World - Variety",
    "fullText": "'SNL' mocked President Trump's egomania around the Nobel Peace Prize and Kristi Noem's response to the ICE shooting in Minneapolis in its cold open.",
    "link": "https://variety.com/2026/tv/news/snl-trumps-nobel-prize-colin-josts-pete-hegseth-1236634114/"
  },
  {
    "text": "Bodybuilder Kali Muscle Hospitalized After Fainting at Gym - TMZ",
    "fullText": "Bodybuilder Kali Muscle was hospitalized after passing out while exercising at a California gym.",
    "link": "https://www.tmz.com/2026/01/17/bodybuilder-kali-muscle-hospitalized-after-fainting-at-gym/"
  },
  {
    "text": "Pennsylvania woman's final moments captured on home security video. Will it help prove she was murdered? - CBS News",
    "fullText": "Bruno Rocuba claims a freak accident while handling his gun caused the death of his wife, Melissa Rocuba. He was not arrested or charged with any crime. Years later, investigators uncover disturbing new evidence that challenges what really happened that night…",
    "link": "https://www.cbsnews.com/news/melissa-rocuba-bruno-rocuba-pennsylvania-shooting-death-home-security-video-48-hours/"
  },
  {
    "text": "\"Gaza is our show\": U.S. pushes its plan over Netanyahu's objections - Axios",
    "fullText": "\"If he wants us to deal with Gaza, it will have to be our way.\"",
    "link": "https://www.axios.com/2026/01/17/gaza-phase-two-netanyahu-trump-board"
  },
  {
    "text": "Fare thee well: Thousands give Bob Weir a stirring send-off at S.F. ‘homecoming’ - San Francisco Chronicle",
    "fullText": "Thousands of music fans gave Bob Weir a stirring send-off Saturday at the San Francisco “homecoming” for the Grateful Dead co-founder, who died last weekend.",
    "link": "https://www.sfchronicle.com/sf/article/bob-weir-memorial-grateful-dead-21297361.php"
  },
  {
    "text": "Broncos vs. Bills recap: Denver advances to AFC title game with OT win; loses Bo Nix - CBS Sports",
    "fullText": "The Broncos are one step closer to Super Bowl LX, but will have to carry on without their starting QB",
    "link": "https://www.cbssports.com/nfl/news/broncos-vs-bills-live-updates-can-josh-allen-lead-buffalo-to-another-road-playoff-victory/live/"
  },
  {
    "text": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
    "fullText": "The two men’s eyewitness accounts of the Jan. 3 death of Geraldo Lunas Campos at a Texas detention camp differ from the Department of Homeland Security’s account of the incident.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/17/detainee-death-witnesses-deported-dhsa/"
  },
  {
    "text": "Scientists find an interstellar 'tunnel' that connects our solar system to other stars - Earth.com",
    "fullText": "Astronomers found an interstellar \"tunnel\" - a cosmic channel that connects our solar system to distant stars, according to a recent study.",
    "link": "https://www.earth.com/news/local-hot-bubble-interstellar-cosmic-channel-connects-our-solar-system-to-other-stars/"
  },
  {
    "text": "Lucas: Cal Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the visit to Cal.",
    "link": "https://goheels.com/news/2026/1/17/mens-basketball-lucas-cal-rapid-reactions"
  },
  {
    "text": "Patriots rooting guide for divisional round: Saturday edition - Pats Pulpit",
    "fullText": "Who Patriots fans should be rooting for in the second round of the NFL playoffs.",
    "link": "https://www.patspulpit.com/new-england-patriots-opinion/119465/rooting-guide-nfl-divisional-round"
  },
  {
    "text": "EU Set to Halt US Trade Deal Over Trump’s New Tariff Threat - Bloomberg.com",
    "fullText": "European Union lawmakers are poised to halt approval of the EU’s trade deal with the US over President Donald Trump’s vow to impose tariffs on countries that supported Greenland in the face of American threats.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-17/eu-set-to-halt-us-trade-deal-over-trump-s-latest-tariff-threat"
  },
  {
    "text": "Five graphics that show Greenland’s importance to Trump - dw.com",
    "fullText": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
    "link": "https://www.dw.com/en/five-graphics-that-show-greenlands-importance-to-trump/a-75547831"
  },
  {
    "text": "‘Heavy’ snow could impact parts of central Georgia, metro Atlanta mostly spared - AJC.com",
    "fullText": "The state’s best chance for snow comes overnight Saturday into Sunday afternoon along a diagonal line from Columbus to Macon to Warrenton, the National Weather Service says.",
    "link": "https://www.ajc.com/news/2026/01/heavy-snow-could-impact-parts-of-central-georgia-metro-atlanta-mostly-spared/"
  },
  {
    "text": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film Awards - Deadline",
    "fullText": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: \"He Will Lose It\" – European Film Awards",
    "link": "http://deadline.com/2026/01/norwegian-star-liv-ullmann-comments-trump-nobel-peace-prize-1236686028/"
  },
  {
    "text": "Five die in Austrian avalanches, rescuers say - BBC",
    "fullText": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
    "link": "https://www.bbc.com/news/articles/c3r1v7gqdp8o"
  },
  {
    "text": "RFK-backed infant vaccine study in Africa to proceed despite backlash, U.S. says - The Washington Post",
    "fullText": "U.S. funding for a study on the timing of hepatitis B vaccine doses in infants in Guinea-Bissau has sparked confusion and ethics concerns.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/rfk-vaccine-trump-hepatitis-b-guinea-bissau-infant-trial/"
  },
  {
    "text": "Back-to-back winter storms hit the East this weekend with arctic blast behind them next week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/back-back-winter-storms-hit-east-weekend-arctic/story?id\\\\u003d129309541"
  }
]