[
  {
    "text": "New Zealand: Several people, including a child, missing after landslide hits campsite - BBC",
    "fullText": "Heavy rains and strong winds have triggered floods and landslides on New Zealand's North Island.",
    "link": "https://www.bbc.com/news/live/c0erdp8q1qyt"
  },
  {
    "text": "Supreme Court appears likely to allow Lisa Cook to remain on Fed board - The Washington Post",
    "fullText": "Such a decision, which would hold while a lawsuit challenging her removal plays out, would prevent Trump from exerting greater influence over the powerful central bank.",
    "link": "https://www.washingtonpost.com/politics/2026/01/21/fed-lisa-cook-supreme-court-trump/"
  },
  {
    "text": "Lucas: Notre Dame Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the last home game of the month.",
    "link": "https://goheels.com/news/2026/1/21/mens-basketball-lucas-notre-dame-rapid-reactions"
  },
  {
    "text": "ICE detains 5-year old Minnesota boy; lawyer says agents used him as ‘bait’ - mprnews.org",
    "fullText": "The Columbia Heights school district says federal agents have detained four children in their district. School officials and a lawyer for the family say agents used 5-year-old Liam Conejo Ramo as “bait” to try and lure family members from their home before ta…",
    "link": "https://www.mprnews.org/story/2026/01/21/ice-detains-5year-old-minnesota-boy-lawyer-says-agents-used-him-as-bait"
  },
  {
    "text": "Deloitte is overhauling job titles for its US workforce — here's why - Business Insider",
    "fullText": "The Big Four firm is giving its US employees a new job title, according to an internal presentation seen by Business Insider.",
    "link": "https://www.businessinsider.com/deloitte-gives-us-employees-new-job-titles-leader-role-2026-1"
  },
  {
    "text": "Japan's December exports growth drops to 5.1%, missing expectations, as shipments to U.S. plunge - CNBC",
    "fullText": "Reuters-polled analysts had estimated exports growth would remain unchanged from November at 6.1%.",
    "link": "https://www.cnbc.com/2026/01/22/japan-trade-data-december-exports-imports.html"
  },
  {
    "text": "Millions of people imperiled through sign-in links sent by SMS - Ars Technica",
    "fullText": "Even well-known services with millions of users are exposing sensitive data.",
    "link": "https://arstechnica.com/security/2026/01/millions-of-people-imperiled-through-sign-in-links-sent-by-sms/"
  },
  {
    "text": "As Trump talks tariffs, his Argentine ally welcomes a shipload of Chinese EVs for the first time - Yahoo Finance",
    "fullText": "Chinese automaker BYD has sped up its exports and undercut rivals the world over, alarming Washington, upsetting Western and Japanese auto giants, and...",
    "link": "https://finance.yahoo.com/news/trump-talks-tariffs-argentine-ally-231038284.html"
  },
  {
    "text": "Canada’s prime minister just declared the end of the world as we know it - vox.com",
    "fullText": "Canadian Prime Minister Mark Carney’s historic speech, explained.",
    "link": "https://www.vox.com/today-explained-newsletter/475992/canada-mark-carney-davos-speech"
  },
  {
    "text": "Judge blocks government from searching data seized from Post reporter - The Washington Post",
    "fullText": "Government officials may not examine electronic devices seized from a Post reporter until litigation stemming from the search of her home is settled, a judge rules.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/21/washington-post-hannah-natanson-search-court-filing/"
  },
  {
    "text": "Confidence increasing for snow in NYC area this weekend | Live updates - abc7ny.com",
    "fullText": "It is far too early to say with certainty just how much snow will fall, but governmental agencies across the Tri-State area are taking the threat seriously.",
    "link": "https://abc7ny.com/live-updates/winter-storm-weekend-nyc-area-northeast-prepare-potential-snow-extreme-cold/18443469/"
  },
  {
    "text": "Israel kills 3 journalists in Gaza, including CBS News contributor - The Washington Post",
    "fullText": "The journalists were killed Wednesday in a strike on their car in central Gaza. Israel’s military said it struck “several suspects” who were operating a drone.",
    "link": "https://www.washingtonpost.com/world/2026/01/21/israel-strike-journalists-gaza-cbs-news/"
  },
  {
    "text": "Gov. McMaster Declares State of Emergency Ahead of Winter Storm - governor.sc.gov",
    "fullText": null,
    "link": "https://governor.sc.gov/news/2026-01/gov-mcmaster-declares-state-emergency-ahead-winter-storm"
  },
  {
    "text": "Seven more countries agree to join Trump's Board of Peace - BBC",
    "fullText": "Seven Muslim-majority countries accept an invitation to Trump's new organisation, while Russia's Putin says he's considering joining.",
    "link": "https://www.bbc.com/news/articles/cn8jek4vv8ko"
  },
  {
    "text": "Final Oscar Nominations Predictions via Feinberg Forecast - hollywoodreporter.com",
    "fullText": "The Hollywood Reporter's executive editor of awards coverage projects that the field will be led by 'Sinners' (with a record-breaking 15 noms), 'One Battle After Another' (12), Frankenstein (11) and 'Hamnet' (11).",
    "link": "http://www.hollywoodreporter.com/lists/final-oscar-nominations-predictions-feinberg-forecast/"
  },
  {
    "text": "‘Legally Blonde’ Prequel Series ‘Elle’ Sets Release Date, Amazon Renews Show for Season 2 - Variety",
    "fullText": "The \"Legally Blonde\" prequel series has set its official premiere date on Prime Video, with the streamer also renewing the show for a second season.",
    "link": "https://variety.com/2026/tv/news/legally-blonde-prequel-elle-release-date-renewed-season-2-1236637143/"
  },
  {
    "text": "‘Beef’ Season 2 First Look: Charles Melton Lifts Weights, Carey Mulligan Considers a Facelift and More - Variety",
    "fullText": "Charles Melton lifts weights shirtless, Carey Mulligan considers a facelift and more in first-look images of Netflix's 'Beef' Season 2, due in April.",
    "link": "https://variety.com/2026/tv/news/beef-season-2-photos-1236637110/"
  },
  {
    "text": "Ex-UFC fighter arrested on felony false imprisonment charge - MMA Fighting",
    "fullText": "Jairzinho Rozenstruik was arrested after he allegedly ‘bit’ his partner after she called him a ‘nasty beast’",
    "link": "https://www.mmafighting.com/ufc/467067/ex-ufc-fighter-jairzinho-rozenstruik-arrested-on-felony-false-imprisonment-charge"
  },
  {
    "text": "2026 Indiana Fever Regular Season Schedule Announced - Indiana Fever",
    "fullText": "Fever to open the season at home on May 9 against Dallas Wings  INDIANAPOLIS (Jan. 21, 2026) — The Indiana Fever has unveiled its complete, 44-game schedule for the 2026 WNBA season. Select tickets will go on sale at 2 p.m. ET on Thursday, Jan. 22. Fans can a…",
    "link": "https://fever.wnba.com/news/2026-indiana-fever-regular-season-schedule-announced"
  },
  {
    "text": "When was the last time Charlotte had a significant ice storm? - wcnc.com",
    "fullText": "It's been over 20 years since Charlotte experienced a crippling ice storm. This weekend could be the next chapter of historic weather events.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/ice-storm-forecast-charlotte-historic-winter-weather-north-carolina-brad-panovich/275-04dd6dd2-5c3f-4e22-8db4-3057748a5861"
  }
]