[
  {
    "text": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors - AP News",
    "fullText": "Gisèle Pelicot has released a memoir that recounts her drugging and mass rape case and sends a powerful message of hope and support to victims of sexual abuse. On Tuesday, her book comes out worldwide in 22 languages. Pelicot says writing it helped her reflec…",
    "link": "https://apnews.com/article/gisele-pelicot-book-france-dominique-rape-4cd6f5bacc7fa9d483d610a3b38551a5"
  },
  {
    "text": "Trump Suffers Record Low Polling on Key MAGA Policy - The Daily Beast",
    "fullText": "Americans continue to sour on the president as he delivers on a major campaign promise.",
    "link": "https://www.thedailybeast.com/trump-suffers-record-low-polling-on-key-maga-policy/"
  },
  {
    "text": "Shooter killed ex-wife and a son in Rhode Island ice rink attack, police say - AP News",
    "fullText": "Authorities say the person who opened fire during a youth hockey game at an ice rink in Rhode Island targeted and killed an ex-wife and one son. Pawtucket Chief of Police Tina Goncalves says the victims were the shooter’s ex-wife Rhonda Dorgan and adult son A…",
    "link": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-4e9c9df9c3a2b0a524f0e9bdd0908d45"
  },
  {
    "text": "Asia stocks rise as tech recoups some AI-fueled losses - Investing.com",
    "fullText": "Asia stocks rise as tech recoups some AI-fueled losses",
    "link": "https://www.investing.com/news/stock-market-news/asia-stocks-rise-as-tech-recoups-some-aifueled-losses-4510018"
  },
  {
    "text": "Alysa Liu Is So Mentally Healthy It’s Terrifying - Slate",
    "fullText": "When she says she's skating just to enjoy herself, I actually believe her.",
    "link": "https://slate.com/culture/2026/02/alysa-liu-kaori-sakamoto-ladies-figure-skating-short-program.html"
  },
  {
    "text": "‘Woke’ AI Feud Escalates Between Pentagon and Anthropic - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/national-security/woke-ai-spat-escalates-between-pentagon-and-anthropic-433b7c5c"
  },
  {
    "text": "U.S. offers more details on claim China conducted secret nuclear weapons test - The Washington Post",
    "fullText": "Remarks by a top administration official appeared to be aimed at dispelling skepticism of its assertions, as President Donald Trump vows to restart U.S. tests.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/17/china-nuclear-test-trump/"
  },
  {
    "text": "Cardiologists Wish You’d Do These 5 Things More Often - AOL.com",
    "fullText": "Small changes can yield powerful results!",
    "link": "https://www.aol.com/articles/cardiologists-wish-d-5-things-010000511.html"
  },
  {
    "text": "Microsoft confirms new Windows 11 feature drop coming next month - Windows Central",
    "fullText": "Windows 11's latest Release Preview Channel update has given us our first look at Microsoft's next feature drop for the OS that's expected to begin rolling out imminently.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-next-windows-11-feature-drop-with-new-taskbar-emoji-and-settings-updates-heres-whats-coming-to-your-pc-very-soon"
  },
  {
    "text": "Why California could be the big winner as EPA abandons climate policy - Politico",
    "fullText": "The federal government is walking away from its tailpipe emissions rules, sparking a legal debate over whether states can now write their own standards.",
    "link": "https://www.politico.com/news/2026/02/17/epa-abandoning-climate-regulatory-power-california-ev-goals-00785469"
  },
  {
    "text": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "fullText": "Tricia McLaughlin is leaving just over a year into Homeland Security Secretary Kristi L. Noem’s tenure leading the department.",
    "link": "https://www.washingtonpost.com/immigration/2026/02/17/tricia-mclaughlin-leaves-dhs/"
  },
  {
    "text": "Jelly Roll’s Wife Bunnie Xo Shares Emotional Family Update: ‘We’re Going to Raise These Babies in Love’ - Yahoo",
    "fullText": "‘I can’t wait to see a piece of me and him running around,’ the model said of the life-changing experience of bringing children into the world.",
    "link": "https://parade.com/news/jelly-rolls-wife-bunnie-xo-shares-emotional-family-update-were-going-to-raise-these-babies-in-love"
  },
  {
    "text": "Bird flu suspected as dead geese are found at multiple parks across New Jersey, officials say - NJ.com",
    "fullText": "The cause of the geese deaths is suspected to be bird flu, officials said.",
    "link": "https://www.nj.com/news/2026/02/bird-flu-suspected-as-dead-geese-are-found-at-multiple-parks-across-new-jersey-officials-say.html"
  },
  {
    "text": "GameHub will give Mac owners another imperfect way to play Windows games - Ars Technica",
    "fullText": "GameHub's existing Windows emulator on Android has its fair share of issues.",
    "link": "https://arstechnica.com/gaming/2026/02/gamehub-will-give-mac-owners-another-imperfect-way-to-play-windows-games/"
  },
  {
    "text": "Portland could get as much as 2 inches of snow starting Wednesday evening...or not - OregonLive.com",
    "fullText": "National Weather Service reports 45 to 60% chance of one to two inches or more of snowfall along the I-5 corridor, with travel impacts expected somewhere in the region.",
    "link": "https://www.oregonlive.com/weather/2026/02/portland-could-get-as-much-as-2-inches-of-snow-starting-wednesday-eveningor-not.html"
  },
  {
    "text": "Trump crackdown drives 80% plunge in immigrant employment, reshaping labor market, Goldman says - Fortune",
    "fullText": "Net immigration averaged approximately 1 million people per year during the 2010s. Not anymore.",
    "link": "https://fortune.com/2026/02/17/trump-immigration-unemployment-jobs-productivity-impact-on-labor-market-goldman-sachs/"
  },
  {
    "text": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy - CNN",
    "fullText": "Iranian and American negotiators departed their indirect talks in Geneva with an agreement to keep talking, doing little to ease fears of an impending regional war.",
    "link": "https://www.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy"
  },
  {
    "text": "Zendaya Reveals Her \"Telling\" Relationship \"Red Flags\" One Year After Tom Holland Engagement - instyle.com",
    "fullText": "One year after her engagement to Tom Holland, Zendaya revealed her biggest relationship \"red flags\" in a new interview. Learn more here.",
    "link": "https://www.instyle.com/zendaya-relationship-red-flags-year-after-tom-holland-engagement-11908170"
  },
  {
    "text": "How a ‘Stranger Things’ Star’s Netflix Journey Morphed into a Tragic ‘Industry’ Twist - The Hollywood Reporter",
    "fullText": "Charlie Heaton had just wrapped the Netflix saga when he signed onto the HBO series — joining the well-loved show for a very specific purpose.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/charlie-heaton-stranger-things-industry-death-interview-1236507590/"
  },
  {
    "text": "Two 'Love Is Blind' Season 10 Couples Get Married, Find Out Who - TMZ",
    "fullText": "Congrats are in order to a pair of \"Love Is Blind\" Season 10 couples ... because they made it all the way down the aisle and got hitched.",
    "link": "https://www.tmz.com/2026/02/17/love-is-blind-season-10-marriages-revealed/"
  }
]