[
  {
    "text": "Daytona 500 live updates, NASCAR leaderboard, weather forecast - Daytona Beach News-Journal",
    "fullText": "The 2026 Daytona 500 was in Stage 2 and has had the race's second significant wreck at Daytona International Speedway.",
    "link": "https://www.news-journalonline.com/story/sports/nascar/2026/02/15/daytona-500-live-updates-time-tv-streaming-schedule/88633398007/"
  },
  {
    "text": "Trump's border czar says 'small' security force will remain in Minnesota after enforcement drawdown - AP News",
    "fullText": "More than 1,000 immigration agents have left Minnesota’s Twin Cities area and hundreds more will depart in the days ahead as part of the Trump administration’s drawdown of its immigration enforcement surge. That word comes from White House border czar Tom Hom…",
    "link": "https://apnews.com/article/homan-immigration-agents-minnesota-enforcement-operation-drawdown-5a7940eb9b5100d46efc33a97f524da0"
  },
  {
    "text": "He spent decades perfecting his voice. Now he says Google stole it. - The Washington Post",
    "fullText": "NPR’s David Greene says he was “completely freaked out” when he heard an AI voice that sounded just like his own, and he’s suing over it.",
    "link": "https://www.washingtonpost.com/technology/2026/02/15/david-greene-google-ai-podcast/"
  },
  {
    "text": "Massie says he’s lost confidence in Pam Bondi after congressional hearing - Politico",
    "fullText": "The Attorney General sparred with Rep. Thomas Massie and other lawmakers over her handling of the Epstein files.",
    "link": "https://www.politico.com/news/2026/02/15/massie-lost-confidence-pam-bondi-00782632"
  },
  {
    "text": "Farmers Are Aging. Their Kids Don’t Want to Be in the Family Business. - The Wall Street Journal",
    "fullText": "Rising costs, weak prices and a trade hit are pushing more farms to the brink, and making the search for their successors harder than ever",
    "link": "https://www.wsj.com/business/family-farms-inheritance-44c9aa17"
  },
  {
    "text": "Gaza’s Nasser Hospital condemns MSF decision to suspend most services - AP News",
    "fullText": "Nasser Hospital in Gaza has condemned the decision by Doctors Without Borders to suspend most work at the facility due to concerns over armed men in the compound. MSF had said security breaches, arbitrary arrests and intimidation put staff and patients at ris…",
    "link": "https://apnews.com/article/israel-gaza-hamas-war-news-02-15-2026-345d17db61847356e5036407ed84a439"
  },
  {
    "text": "Indiana vs Illinois Predictions, Start Time, Odds: NCAAB Picks for Sunday, February 15 - Action Network",
    "fullText": "Read for Indiana vs Illinois predictions, picks and odds for their college basketball game on Sunday, February 15.",
    "link": "https://www.actionnetwork.com/ncaab/indiana-hoosiers-vs-illinois-fighting-illini-predictions-picks-odds-college-basketball-sunday-february-15"
  },
  {
    "text": "How Washington's crossing of the Delaware presaged a changing world - CBS News",
    "fullText": "On the evening of Christmas 1776, Gen. George Washington surprised the King's forces by leading the Continental Army in a surprise crossing of a near-frozen Delaware River - a watershed military maneuver that dramatized a changing America, and a changing clim…",
    "link": "https://www.cbsnews.com/news/climate-change-how-washingtons-crossing-of-the-delaware-presaged-a-changing-world/"
  },
  {
    "text": "Snakes keep evolving into cannibals — here's what scientists think is going on - Live Science",
    "fullText": "A review of over 500 reports of cannibalistic behavior in snakes finds it's appeared multiple times in different evolutionary lineages, leading researchers to hypothesize it's beneficial for snakes under certain circumstances.",
    "link": "https://www.livescience.com/animals/snakes/snakes-keep-evolving-into-cannibals-heres-what-scientists-think-is-going-on"
  },
  {
    "text": "Matt Brown doubts UFC pulls off biggest card ever for White House: ‘They don’t have the stars that they used to have’ - MMA Fighting",
    "fullText": "The UFC has promised the biggest card in history for the White House but is that even realistic?",
    "link": "https://www.mmafighting.com/ufc/471649/matt-brown-doubts-ufc-pulls-off-biggest-card-ever-for-white-house-they-dont-have-the-stars-that-they-used-to-have"
  },
  {
    "text": "Report: Apple’s upcoming low-cost MacBook will come in ‘fun colors,’ launch next month - 9to5Mac",
    "fullText": "Apple has long been rumored to be working on a new A18 Pro-powered MacBook, at an effort to gain marketshare...",
    "link": "https://9to5mac.com/2026/02/15/apple-cheaper-macbook-launching-next-month-with-a18-pro-chip-and-fun-colors/"
  },
  {
    "text": "'Major travel impacts' expected as winter storm watch issued for northern California - NPR",
    "fullText": "As people travel for the holiday weekend, much of Northern California is under a winter storm watch, with communities bracing for several feet of snow.",
    "link": "https://www.npr.org/2026/02/15/nx-s1-5715082/major-travel-impacts-winter-storm-watch-issued-northern-california"
  },
  {
    "text": "iOS 27 to include code cleanup and interface tweaks in hopes to boost battery life: report - 9to5Mac",
    "fullText": "In today’s edition of the Power On newsletter, Bloomberg’s Mark Gurman shared a number of new details about Apple’s upcoming...",
    "link": "https://9to5mac.com/2026/02/15/apple-code-cleanup-in-ios-27-for-better-battery-life-report/"
  },
  {
    "text": "This Is What Destroying the Vaccine Market Looks Like - The Bulwark",
    "fullText": "A shocking move by RFK Jr.’s team has the industry spooked—for good reason.",
    "link": "https://www.thebulwark.com/p/this-is-what-destroying-the-vaccine-market-looks-like-moderna-flu-prasad-fda"
  },
  {
    "text": "A Star-Studded Stink Bomb Lands in Berlin - Vulture",
    "fullText": "A star-studded stink bomb lands in Berlin: ‘Rosebush Pruning,’ starring Callum Turner, Riley Keough, and Elle Fanning, somehow makes its madness boring.",
    "link": "http://www.vulture.com/article/review-rosebush-pruning-is-a-star-studded-stink-bomb.html"
  },
  {
    "text": "Winter Olympics 2026: Johannes Hoesflot Klaebo wins record ninth gold medal in cross-country skiing - BBC",
    "fullText": "Johannes Hoesflot Klaebo, Norway's king of cross-country skiing, becomes the Winter Olympics' outright most successful athlete with a record ninth gold medal.",
    "link": "https://www.bbc.com/sport/articles/cy4wmyjnlz1o"
  },
  {
    "text": "Whether it's a mini-sabbatical or an adult gap year, more people are taking extended work breaks - AP News",
    "fullText": "The idea of taking more than a two-week vacation from work to recover from burnout or rethink life is slowly gaining supporters in the United States. Extended career breaks go by many names. Mini-sabbaticals. Adult gap years. Micro-retirement. They may involv…",
    "link": "https://apnews.com/article/gap-year-sabbatical-work-leave-98b462aebde4587be9b08747340a8181"
  },
  {
    "text": "In South Texas, the GOP immigration hard line is now political kryptonite - Politico",
    "fullText": "Texas Republicans bet on continuing to win over Latino voters. Then Trump began his aggressive deportation campaign.",
    "link": "https://www.politico.com/news/2026/02/15/south-texas-latino-republicans-immigration-00782129"
  },
  {
    "text": "Want a mortgage for under 3% in 2026? Meet the 'assumable mortgage' - NPR",
    "fullText": "Low mortgage rates from the COVID era might still be attainable for homebuyers, if they find the right house and have the cash.",
    "link": "https://www.npr.org/2026/02/15/nx-s1-5704697/assumable-mortgage-rates-housing-market"
  }
]