[
  {
    "text": "Trump sends ‘wartime prime minister’ Netanyahu back to Israel with a boost - The Washington Post",
    "fullText": "While meetings between the U.S. and Israeli leaders focused on pressing Middle East issues, for Prime Minister Netanyahu, they were also a domestic power play.",
    "link": "https://www.washingtonpost.com/world/2025/12/30/trump-netanyahu-iran-gaza/"
  },
  {
    "text": "Body found during search for missing 19-year-old Camila Mendoza Olmos, Bexar County sheriff says - KSAT",
    "fullText": null,
    "link": "https://www.ksat.com/news/local/2025/12/31/body-found-during-search-for-missing-19-year-old-camila-mendoza-olmos-bexar-county-sheriff-says/"
  },
  {
    "text": "HHS freezes all child care payments to Minnesota after viral fraud allegations - CBS News",
    "fullText": "The Department of Health and Human Services said Tuesday it has frozen federal child care funding for the state of Minnesota, citing viral fraud allegations.",
    "link": "https://www.cbsnews.com/news/hhs-freezes-child-care-payments-minnesota/"
  },
  {
    "text": "China launches largest military drills off Taiwan in 8 months with live-fire exercises caught on camera - Fox News",
    "fullText": "China launches biggest military encirclement of Taiwan in 8 months with live-fire drills, rockets and warships in massive 'Justice Mission 2025' exercise.",
    "link": "https://www.foxnews.com/world/china-launches-largest-military-drills-taiwan-8-months-live-fire-exercises-caught-camera"
  },
  {
    "text": "Premier League as it happened: Arsenal cruise to win over Villa - ESPN",
    "fullText": "Arsenal got a convincing win over Aston Villa to continue top of the Premier League table on a day full of exciting matches.",
    "link": "https://www.espn.com/soccer/story/_/id/47439115/premier-league-live-updates-chelsea-bournemouth-aston-villa-arsenal-man-united-wolverhampton-wanderers"
  },
  {
    "text": "New measles cases in South Carolina put U.S. on the verge of losing elimination status - NBC News",
    "fullText": "An uptick in measles cases in South Carolina has put the U.S. on the precipice of losing its elimination status for the highly contagious disease.",
    "link": "https://www.nbcnews.com/health/health-news/measles-south-carolina-us-elimination-status-rcna251515"
  },
  {
    "text": "Flu cases are surging and rates will likely get worse, new CDC data shows - NPR",
    "fullText": "Flu season is off to a rough start this year, according to new CDC data. The virus is spreading faster than in previous years and the surge is likely to get worse. Here's what you need to know.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/30/nx-s1-5661508/flu-cdc-health"
  },
  {
    "text": "Disney to pay $10m over alleged children's privacy law violations - BBC",
    "fullText": "Regulators accused Disney of failing to properly label kids' videos uploaded to YouYube, allowing for data collection and targeted advertising.",
    "link": "https://www.bbc.com/news/articles/crrnl94lq5vo"
  },
  {
    "text": "Judge orders Trump administration to continue to seek funding for the CFPB - NPR",
    "fullText": "The order is the latest in a complex legal battle over the fate of the Consumer Financial Protection Bureau, a watchdog agency.",
    "link": "https://www.npr.org/2025/12/30/nx-s1-5661581/cfpb-funding-order"
  },
  {
    "text": "3 hikers found dead during search and rescue effort on Mount Baldy in California, authorities say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/3-hikers-found-dead-search-rescue-effort-mount/story?id\\\\u003d128787732"
  },
  {
    "text": "Idaho company recalls nearly 3,000 pounds of ground beef for E. coli risk - ABC News",
    "fullText": "An Idaho company is recalling nearly 3,000 pounds of raw ground beef that may have been contaminated with E",
    "link": "https://abcnews.go.com/US/wireStory/idaho-company-recalls-3000-pounds-ground-beef-coli-128787767"
  },
  {
    "text": "Patriots star receiver Stefon Diggs faces strangulation and assault charges - NBC News",
    "fullText": "Star New England Patriots wide receiver Stefon Diggs, who recently welcomed a baby boy with girlfriend Cardi B, was accused of felony strangulation, court records revealed.",
    "link": "https://www.nbcnews.com/sports/nfl/patriots-star-receiver-stefon-diggs-faces-strangulation-assault-charge-rcna251545"
  },
  {
    "text": "Yvette Nicole Brown Appears to Put CNN Chevy Chase Doc on Blast: “Keep My Name Out of Your Mouth” - The Hollywood Reporter",
    "fullText": "The 'Community' actress, who is said to have had racially charged clashes with the 'SNL' star, posted a statement to Instagram.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/yvette-nicole-brown-cnn-chevy-chase-doc-on-blast-1236460945/"
  },
  {
    "text": "Five Trump ETFs Hit The Stock Exchange With 'Made In America Focus' - Investor's Business Daily",
    "fullText": "Trump Media & Technology announced early Tuesday that five Truth Social ETFs will hit the stock market at Tuesday's open.",
    "link": "https://www.investors.com/news/trump-truth-social-etfs-hit-the-stock-market-with-made-in-america-focus/"
  },
  {
    "text": "Artemis 2 moon astronauts rehearse for launch day (photos) - Space",
    "fullText": "NASA's first crewed lunar mission in more than 50 years moved one step closer to liftoff recently with a full launch day dress rehearsal in Florida.",
    "link": "https://www.space.com/space-exploration/artemis/artemis-2-moon-astronauts-rehearse-for-launch-day-photos"
  },
  {
    "text": "NFL Power Rankings, Week 18: Red-hot Jaguars soar to No. 3, while 49ers replace Bills in top five - NFL.com",
    "fullText": "Riding a seven-game win streak, the Jaguars have soared into the NFL spotlight. Just how high do Trevor Lawrence and Co. fly in Eric Edholm's Power Rankings? Check out the updated pecking order, 1-32, heading into the final weekend of the 2025 regular sea",
    "link": "https://www.nfl.com/news/nfl-power-rankings-week-18-2025-nfl-season"
  },
  {
    "text": "An escalation in Yemen threatens to reignite civil war and widen tensions in the Gulf - NPR",
    "fullText": "Saudi Arabia bombed Yemen's port city of Mukalla, targeting a shipment of weapons from the United Arab Emirates for separatist forces. The UAE later said it would withdraw its forces from Yemen.",
    "link": "https://www.npr.org/2025/12/30/g-s1-103991/yemen-conflict"
  }
]