[
  {
    "text": "2026 Winter Olympics live updates: Team USA results and medal count as Day 7 gets underway in Italy - CBS Sports",
    "fullText": "More medals will be handed out Friday from Milano Cortina, highlighted by figure skating phenom Ilia Malinin's quest for gold",
    "link": "https://www.cbssports.com/olympics/news/winter-olympics-2026-live-updates-day-7-results-highlights/live/"
  },
  {
    "text": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "fullText": "The San Francisco teachers strike is over as school district and union reach tentative agreement",
    "link": "https://www.sfchronicle.com/sf/article/sfusd-teachers-strike-over-21351605.php"
  },
  {
    "text": "Judge dismisses charges against men accused of assaulting ICE officer in Minneapolis shooting case - AP News",
    "fullText": "A federal judge in Minneapolis has ordered the dismissal of felony assault charges against two Venezuelan men, including one shot in the leg by an immigration officer. The charges were dropped Friday after a highly unusual filing the night before by the U.S. …",
    "link": "https://apnews.com/article/immigration-prosecutors-assault-shooting-minneapolis-charges-d713836a06471af9f38ee6ee8976a20c"
  },
  {
    "text": "Wendy’s will continue closing hundreds of stores through mid-2026 - CNN",
    "fullText": "Wendy’s is planning to close hundreds of locations across the United States as part of its turnaround plan.",
    "link": "https://www.cnn.com/2026/02/13/business/wendys-is-closing-6-of-its-stores-by-mid-2026"
  },
  {
    "text": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "fullText": "A small group of politically insulated members is causing headaches for party leaders and anxiety among their GOP colleagues.",
    "link": "https://www.politico.com/news/2026/02/13/republican-trump-congress-defections-00780479"
  },
  {
    "text": "S&P 500 bounces after light inflation data, but still heads for weekly loss: Live updates - CNBC",
    "fullText": "Major U.S. averages dropped on Thursday as fears around artificial intelligence disruption spread across the market.",
    "link": "https://www.cnbc.com/2026/02/12/stock-market-today-live-updates.html"
  },
  {
    "text": "Ocasio-Cortez, Rubio to offer dueling visions of world order in Munich - The Washington Post",
    "fullText": "German Chancellor Frederich Merz kicked off the conference on Friday saying the rules-based international order “no longer exists,” in a new era of “big power politics.”",
    "link": "https://www.washingtonpost.com/national-security/2026/02/12/munich-aoc-rubio/"
  },
  {
    "text": "In victory for Democrats, Virginia Supreme Court says redistricting vote can go forward - Democracy Docket",
    "fullText": "Voters will get to decide on a proposed “10-1” map that could deliver four more Democratic seats in Congress.",
    "link": "https://www.democracydocket.com/news-alerts/in-victory-for-democrats-virginia-supreme-court-says-redistricting-vote-can-go-forward/"
  },
  {
    "text": "Kelly B. Zafman, MD, MSCR, on the risks of stopping antidepressants during pregnancy - Contemporary OB/GYN",
    "fullText": "Kelly B. Zafman, MD, MSCR, shares findings from a study evaluating antidepressant discussion during pregnancy.\n\nClick here for more on this study.",
    "link": "https://www.contemporaryobgyn.net/shorts/kelly-b-zafman-md-mscr-on-the-risks-of-stopping-antidepressants-during-pregnancy"
  },
  {
    "text": "HBO and A24’s New Show Is Hilarious, Then Jaw-Dropping, Then Terrifying - Slate",
    "fullText": "The new series from the producers of Marty Supreme is alternately hilarious, jaw-dropping, and terrifying.",
    "link": "https://slate.com/culture/2026/02/neighbors-hbo-max-a24-show-review-trump-covid.html"
  },
  {
    "text": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record - AP News",
    "fullText": "Norway’s Johannes Hoesflot Klaebo has won an eighth gold medal in cross-country skiing at the Milan Cortina Olympics, tying an all‑time Winter Games record. The 29‑year‑old claimed victory Friday in the men’s 10 kilometer interval‑start race, for his third go…",
    "link": "https://apnews.com/article/milan-cortina-olympics-cross-country-klaebo-6d712004bd9250bf8921d3c1a8333312"
  },
  {
    "text": "How packaging and logistics companies are automating their warehouses - CNBC",
    "fullText": "Companies like UPS, FedEx and DHL are increasingly turning to automation in their warehouse processes to work toward greater efficiency and lower costs.",
    "link": "https://www.cnbc.com/2026/02/13/shipping-auotmation-logistics-labor.html"
  },
  {
    "text": "Google prepares a polished look for Android's Live Updates - Android Authority",
    "fullText": "Google is testing an enhanced look for Android's Live Updates with a recently released Android Canary build.",
    "link": "https://www.androidauthority.com/android-canary-live-updates-new-look-3640753/"
  },
  {
    "text": "Who will police Gaza, and how? - NPR",
    "fullText": "Under President Trump's Gaza ceasefire plan, Arab countries and the European Union are supposed to train a new police force in the Gaza Strip. But U.S. plans have run into serious challenges.",
    "link": "https://www.npr.org/2026/02/13/g-s1-109343/gaza-israel-police"
  },
  {
    "text": "Valentine’s Day sticker shock: Chocolate prices are spiking - CNN",
    "fullText": "Chocolate lovers are experiencing sticker shock this Valentine’s Day.",
    "link": "https://www.cnn.com/2026/02/13/business/chocolate-prices-valentines-day"
  },
  {
    "text": "Bangladesh Nationalist Party claims victory in country’s first election since 2024 uprising - AP News",
    "fullText": "The Bangladesh Nationalist Party has claimed victory in the country’s first election since the 2024 uprising, positioning itself to form the next government and potentially reshape Bangladesh’s political landscape after years of intense rivalry and disputed p…",
    "link": "https://apnews.com/article/bangladesh-election-hasina-tarique-rahman-bnp-8ec3a74b4488dfe998b3d1d232c3ba4f"
  },
  {
    "text": "Ukrainian forces say Russian troops paid them for a fake Starlink service that instead revealed battlefield locations - Business Insider",
    "fullText": "Ukrainian OSINT groups pushed the ruse by pretending to complain about a Russian Telegram bot actually run by Kyiv's troops, the division said.",
    "link": "https://www.businessinsider.com/ukraine-starlink-operation-cyber-assault-fake-registration-location-data-2026-2"
  },
  {
    "text": "Sister of North Korea’s leader says South Korea’s drone regret was sensible but insufficient - AP News",
    "fullText": "The sister of North Korean leader Kim Jong Un says it was “sensible” for a South Korean official to express regret for alleged civilian drone flights over North Korea but warned of counterattacks if they recur. The statement by Kim Yo Jong came after South Ko…",
    "link": "https://apnews.com/article/north-korea-kim-drone-flights-7b19eb7282aa2af2d7e7a1b640e96109"
  }
]