[
  {
    "text": "5 takeaways from the Republican-led hearing on ICE - The Washington Post",
    "fullText": "At least some in the GOP want ICE to tone it down.",
    "link": "https://www.washingtonpost.com/politics/2026/02/10/ice-hearing-takeaways/"
  },
  {
    "text": "Asian Stocks Set to Extend Rally as US Shares Slip: Markets Wrap - Bloomberg.com",
    "fullText": "Asian equities climbed to a record and the dollar declined ahead of Wednesday’s US jobs report after weak retail sales reinforced bets that the Federal Reserve will cut interest rates later this year.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-10/-stock-market-today-dow-s-p-live-updates"
  },
  {
    "text": "GOP revolt sinks effort to block votes on Trump’s tariffs - Politico",
    "fullText": "The procedural measure failed 217-214.",
    "link": "https://www.politico.com/live-updates/2026/02/10/congress/gop-revolt-sinks-effort-to-block-votes-on-trumps-tariffs-00775107"
  },
  {
    "text": "Lucas: Miami Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the visit to Coral Gables.",
    "link": "https://goheels.com/news/2026/2/10/mens-basketball-lucas-miami-rapid-reactions"
  },
  {
    "text": "China consumer inflation rises less than expected in January as producer price deflation persists - CNBC",
    "fullText": "China's consumer inflation rose less than expected in January while the deflation in producer prices persisted.",
    "link": "https://www.cnbc.com/2026/02/11/china-inflation-january-cpi-ppi-deflation.html"
  },
  {
    "text": "Shasta County outbreak drives Calif.'s first measles surge since 2020 - SFGATE",
    "fullText": "On Monday, the California Department of Public Health issued a warning about the surge in measles cases across the state.",
    "link": "https://www.sfgate.com/bayarea/article/shasta-county-outbreak-california-measles-21346144.php"
  },
  {
    "text": "‘Wuthering Heights’ To Seduce The World With $70M+ Opening – Box Office Preview - Deadline",
    "fullText": "The first big weekend of the 2026 box office arrives Friday with three major studio movies aimed at three different demos: women, families and guys over 25. However, the tallest of them all is the Jacob Elordi-Margot Robbie pic Wuthering Heights Warner Bros, …",
    "link": "http://deadline.com/2026/02/wuthering-heights-box-office-projection-jacob-elordi-1236714805/"
  },
  {
    "text": "The Swamp: What Kennedy Center Boss Really Knew About Trump’s Shutdown - The Daily Beast",
    "fullText": "The Kennedy Center’s imminent closure takes a surprise new twist, our must-read newsletter reveals.",
    "link": "https://www.thedailybeast.com/the-swamp-what-kennedy-center-boss-really-knew-about-trumps-shutdown/"
  },
  {
    "text": "EPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health - NBC News",
    "fullText": "The Environmental Protection Agency plans to repeal its endangerment finding, the legal framework that underpins its power to regulate greenhouse gas emissions.",
    "link": "https://www.nbcnews.com/science/climate-change/epa-to-repeal-endangerment-finding-climate-change-emissions-rcna258250"
  },
  {
    "text": "Dan Quinn acknowledges three empty press room seats for Washington Post reporters - NBC Sports",
    "fullText": "During last week's Radio Row ruckus, we neglected to mention that the Washington Post disbanded its sports department.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/dan-quinn-acknowledges-three-empty-press-room-seats-for-washington-post-reporters"
  },
  {
    "text": "A Study Just Found The Average Cost Americans Paid For Trump's Tariffs In 2025, And It's Expected To Get Worse - Yahoo Finance",
    "fullText": "\"The only thing Made in America here is the inflation.\"",
    "link": "https://www.buzzfeed.com/meganeliscomb/tariff-cost-for-americans"
  },
  {
    "text": "NASA's Artemis II Keeps Leaking Liquid Hydrogen, And It's Starting To Cause Problems - bgr.com",
    "fullText": "Artemis II was set to launch in February, but a leaky situation has caused a delay. Find out about the challenges NASA is facing with this moon mission.",
    "link": "https://www.bgr.com/2094400/nasa-artemis-ii-leaking-liquid-hydrogen-launch-delayed-march/"
  },
  {
    "text": "Snowboarder Chloe Kim is chasing an Olympic gold three-peat with a torn labrum - NPR",
    "fullText": "At 25, Chloe Kim could become the first halfpipe snowboarder to win three consecutive Olympic golds.",
    "link": "https://www.npr.org/2026/02/10/nx-s1-5709001/chloe-kim-olympics-halfpipe-snowboard"
  },
  {
    "text": "Exclusive: Trump says he opposes Israeli annexation steps in West Bank - Axios",
    "fullText": "\"We have enough things to think about now. We don't need to be dealing with the West Bank.\"",
    "link": "https://www.axios.com/2026/02/10/trump-israel-annex-west-bank-opposes-netanyahu"
  },
  {
    "text": "Pakistan-Afghanistan border closures paralyze trade along a key route - NPR",
    "fullText": "Trucks have been stuck at the closed border since October. Both countries are facing economic losses with no end in sight. The Taliban also banned all Pakistani pharmaceutical imports to Afghanistan.",
    "link": "https://www.npr.org/2026/02/10/g-s1-107945/pakistan-afghanistan-border-closed-trade-taliban"
  },
  {
    "text": "iPhone 18 Pro: Three new design updates are coming this year - 9to5Mac",
    "fullText": "iPhone 18 Pro and Pro Max will reportedly bring three new design changes for users. Here’s what the latest rumors say.",
    "link": "https://9to5mac.com/2026/02/10/iphone-18-pro-three-new-design-updates-are-coming-this-year/"
  },
  {
    "text": "The calculations behind Netanyahu’s emergency meeting with Trump - JNS.org",
    "fullText": "Nuclear negotiations with Iran may serve as an effective smokescreen, providing cover as Washington and Jerusalem again join forces together toward a definitive war.",
    "link": "https://www.jns.org/the-calculations-behind-netanyahus-emergency-meeting-with-trump/"
  }
]