[
  {
    "text": "Stock Market Today: Dow falls 300 points as bank stocks struggle; S&P 500 wavers, tech-heavy Nasdaq rises; U.S. stocks mostly on pace for weekly losses - MarketWatch",
    "fullText": "U.S. stocks were mixed Friday afternoon, with the S&P 500 heading for a weekly loss despite rebounding from Tuesday's selloff sparked by worries over Greenland. Banks stocks were under pressure Friday, with Goldman Sachs among the Dow's worst performers in af…",
    "link": "https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p-500-and-nasdaq-set-to-advance-as-gold-nears-5-000"
  },
  {
    "text": "Ex-NFL player Kevin Johnson fatally stabbed in Los Angeles homeless encampment - NBC News",
    "fullText": "Former NFL player Kevin Johnson, who played with the Philadelphia Eagles and Oakland Raiders, was beaten and stabbed to death in a Los Angeles homeless encampment.",
    "link": "https://www.nbcnews.com/news/us-news/ex-nfl-player-kevin-johnson-fatally-stabbed-homeless-encampment-rcna255617"
  },
  {
    "text": "Indonesian Influencer Lula Lahfah Found Dead at 26 - TMZ",
    "fullText": "Tragic news out of Indonesia -- Popular internet personality Lula Lahfah has died at the age of 26.",
    "link": "https://www.tmz.com/2026/01/23/lula-lahfah-indonesian-influencer-dead/"
  },
  {
    "text": "Patriots vs. Broncos Friday injury report: Harold Landry III out, three questionable - Pats Pulpit",
    "fullText": "Game statuses for the AFC Championship Game at Mile High.",
    "link": "https://www.patspulpit.com/new-england-patriots-news/120187/patriots-vs-broncos-friday-injury-report-harold-landry-iii-out-afc-championship-game"
  },
  {
    "text": "Trump administration weighs naval blockade to halt Cuban oil imports - Politico",
    "fullText": "“Energy is the chokehold to kill” the Cuban regime, said a person familiar with the discussions.",
    "link": "https://www.politico.com/news/2026/01/23/trump-administration-weighs-naval-blockade-to-halt-cuban-oil-imports-00744708"
  },
  {
    "text": "‘Mercy’ Mints $1.5M Previews, Eyes $12M+ Opening, But Monster Winter Storm Could Snow Cinemas In - Deadline",
    "fullText": "There's one major studio wide entry this weekend, Amazon MGM Studios' $60M dystopian future thriller, Mercy starring Chris Pratt, and while it did $1.5M in previews in yesterday, the entire 3-day outlook could be impacted by the looming winter storm that's hi…",
    "link": "http://deadline.com/2026/01/box-office-mercy-chris-pratt-1236694631/"
  },
  {
    "text": "Philadelphia sues after slavery exhibits were taken down from President's House site - NBC News",
    "fullText": "The city of Philadelphia sued the Department of the Interior and the acting director of the National Park Service on Thursday over reports that slavery exhibits were being dismantled in the city’s historic district",
    "link": "https://www.nbcnews.com/news/us-news/philadelphia-sues-slavery-exhibits-taken-presidents-house-site-rcna255535"
  },
  {
    "text": "On Greenland, Europe stood up, Trump blinked, and the E.U. learned a lesson - The Washington Post",
    "fullText": "For some in the often fractured E.U., Trump’s retreat on the Arctic territory proves that retaliation — not conciliation — is the answer to his hardball tactics.",
    "link": "https://www.washingtonpost.com/world/2026/01/23/europe-trump-greenland-pushback-nato/"
  },
  {
    "text": "UFC fighter Cameron Smotherman collapses after making weight - ESPN",
    "fullText": "UFC bantamweight Cameron Smotherman collapsed moments after making weight Friday in a disturbing scene for the sport of mixed martial arts.",
    "link": "https://www.espn.com/mma/story/_/id/47706166/ufc-fighter-cameron-smotherman-collapses-making-weight"
  },
  {
    "text": "Mets Notes: Peralta, Senga, Benge - MLB Trade Rumors",
    "fullText": "The Mets have shaken things up quite a bit this month. MLBTR looks at some of the latest developments.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-notes-peralta-senga-benge.html"
  },
  {
    "text": "ARC Raiders Roadmap: January - April 2026 - arcraiders.com",
    "fullText": "ARC Raiders is a multiplayer extraction adventure, set in a lethal future earth, ravaged by a mysterious mechanized threat known as ARC.",
    "link": "https://arcraiders.com/news/roadmap-january-april-2026"
  },
  {
    "text": "Google Photos’ latest feature lets you meme yourself - TechCrunch",
    "fullText": "The new feature lets you insert yourself into a meme in Google Photos.",
    "link": "https://techcrunch.com/2026/01/23/google-photos-latest-feature-lets-you-meme-yourself/"
  },
  {
    "text": "Jamie Dimon is learning what happens when a CEO dares to defy Trump - CNN",
    "fullText": "Top Wall Street bankers during the Trump 2.0 era have tread carefully around the subject of politics generally and President Donald Trump specifically. The consensus has generally been: Smile and nod, stay in your lane, don’t become a target.",
    "link": "https://www.cnn.com/2026/01/23/business/jamie-dimon-donald-trump"
  },
  {
    "text": "Target is once again caught in a political firestorm. Here's what HR is telling staff. - Business Insider",
    "fullText": "In a memo to staff, chief human resources officer Melissa Kremer said the company is \"listening and working to de-escalate where possible.\"",
    "link": "https://www.businessinsider.com/targets-hr-chief-memo-expected-disruptions-from-ice-minneapolis-2026-1"
  },
  {
    "text": "The Math on AI Agents Doesn’t Add Up - WIRED",
    "fullText": "A research paper suggests AI agents are mathematically doomed to fail. The industry doesn’t agree.",
    "link": "https://www.wired.com/story/ai-agents-math-doesnt-add-up/"
  },
  {
    "text": "Renée Fleming cancels Kennedy Center appearances - AP News",
    "fullText": "Renée Fleming is withdrawing from two May appearances at the Kennedy Center. This follows a wave of cancellations since President Trump ousted the previous leadership and announced the venue's renaming. Fleming was set to perform with conductor James Gaffigan…",
    "link": "https://apnews.com/article/renee-fleming-kennedy-center-cancellations-9ed539d9e42c47d700196e72beb5ca26"
  },
  {
    "text": "Iran protests: Eyewitness tells of people getting shot - BBC",
    "fullText": "An Iranian who got out of the country describes scenes of chaos as security forces opened fire in her home town.",
    "link": "https://www.bbc.com/news/articles/c9dvvzzpwylo"
  },
  {
    "text": "Monster Neutrino Could Be a Messenger of Ancient Black Holes - Quanta Magazine",
    "fullText": "Primordial black holes could rewrite our understanding of dark matter and the early universe. A record-breaking detection at the bottom of the Mediterranean Sea has some physicists wondering if we just spotted one.",
    "link": "https://www.quantamagazine.org/monster-neutrino-could-be-a-messenger-of-ancient-black-holes-20260123/"
  },
  {
    "text": "Live updates: Minnesota ‘economic blackout’ planned in protest of ICE as immigration crackdown fuels tensions - CNN",
    "fullText": "There are heightened tensions over the Trump administration’s expansive immigration crackdown. Follow for live updates.",
    "link": "https://www.cnn.com/us/live-news/ice-minnesota-minneapolis-maine-immigration-01-23-26"
  }
]