[
  {
    "text": "Free HIV drugs save lives. Why one state is restricting access for thousands. - The Washington Post",
    "fullText": "An estimated 16,000 HIV and AIDS patients in Florida might lose free medication, health care as the state dramatically rolls back a decades-old program.",
    "link": "https://www.washingtonpost.com/health/2026/02/01/florida-hiv-adap-cuts/"
  },
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA prepares to load propellant in critical fueling test - Space",
    "fullText": "Monday, Feb. 2, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-2-2026"
  },
  {
    "text": "Stock futures fall after silver, bitcoin sell off; questions loom over AI trade: Live updates - CNBC",
    "fullText": "More than 100 S&P 500 companies are due to report this week, including Amazon, Alphabet and Disney.",
    "link": "https://www.cnbc.com/2026/02/01/stock-market-today-live-updates.html"
  },
  {
    "text": "UPDATE! An X8.1 (Strong) flare from Region 4366 - NOAA (National Oceanic and Atmospheric Administration) (.gov)",
    "fullText": null,
    "link": "https://www.swpc.noaa.gov/news/update-x81-strong-flare-region-4366"
  },
  {
    "text": "The House races to end shutdown. And, Trump wants to close Kennedy Center for 2 years - NPR",
    "fullText": "Lawmakers are racing to end a partial government shutdown after Congress missed its funding deadline on Friday. And, Trump wants to close the Kennedy Center for two years for renovations.",
    "link": "https://www.npr.org/2026/02/02/g-s1-108304/up-first-newsletter-partial-government-shutdown-minneapolis-kennedy-center-grammys-education-department"
  },
  {
    "text": "“Mark Zuckerberg helped buy a ballroom for a fascist. Perhaps it is not surprising that he killed Supernatural - The Verge",
    "fullText": "‘I despise Meta.’",
    "link": "https://www.theverge.com/tech/871250/supernatural-meta-vr-fitness-community"
  },
  {
    "text": "Hemp and marijuana are the same species. So why all the different laws? - NPR",
    "fullText": "Farmers in the U.S. have grown cannabis since the 1600s — but policymakers are still figuring out how to regulate two famous types of Cannabis sativa. A historian calls the plant \"incredibly cryptic.\"",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5633438/hemp-marijuana-cannabis-thc-cbd-farm-bill"
  },
  {
    "text": "Investors are betting on robots to replace blue collar workers - Axios",
    "fullText": "Building AI brains for blue-collar jobs",
    "link": "https://www.axios.com/2026/02/02/blue-collar-ai-robots"
  },
  {
    "text": "The Education Department's efforts to fire staff cost over $28 million, watchdog says - NPR",
    "fullText": "A new report from the U.S. Government Accountability Office calculates the cost of efforts to fire civil rights staff, and questions the department's ability to enforce federal civil rights laws.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5690188/cost-trump-layoffs-civil-rights-complaints-department-education-gao"
  },
  {
    "text": "US futures and world shares slip as worries over Trump's Fed chief pick and AI weigh on markets - AP News",
    "fullText": "Wild swings that swept through financial markets overnight are calming as Wall Street opens for trading. U.S. stocks are holding relatively steady on Monday following gains in Europe and sharp drops in Asia, while gold and silver prices rallied back from seve…",
    "link": "https://apnews.com/article/stocks-markets-gold-oil-trump-fed-585ed1a8046d34fa3dedbb4854451681"
  },
  {
    "text": "The under-the-radar risk that could sink America's economy - Business Insider",
    "fullText": "The quality and availability of economic data is declining. That could end up with a lot of unemployed Americans and increase the chance of recession.",
    "link": "https://www.businessinsider.com/disappearing-economic-data-bad-economy-recession-unemployment-bls-jobs-report-2026-2"
  },
  {
    "text": "These AI notetaking devices can help you record and transcribe your meetings - TechCrunch",
    "fullText": "These physical notetakers transcribe audio and give users summaries and action items of meetings using AI. Some even offer live translation.",
    "link": "https://techcrunch.com/2026/02/02/ai-notetaker-hardware-devices-pins-pendants-record-transcribe/"
  },
  {
    "text": "Trump plans to close Kennedy Center for about two years, starting in July - The Washington Post",
    "fullText": "Under a proposal by President Donald Trump, the closure could begin July 4, with construction beginning immediately.",
    "link": "https://www.washingtonpost.com/style/2026/02/01/kennedy-center-trump-closure-construction/"
  },
  {
    "text": "Venezuela's first shipment of liquefied petroleum gas has left Venezuela bound for the US - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/venezuelas-shipment-liquefied-petroleum-gas-left-venezuela-bound/story?id\\\\u003d129768949"
  },
  {
    "text": "LeBron James’ potential MSG swan song is reminder of one of his biggest mistakes - New York Post",
    "fullText": "At 41, the Lakers’ LeBron James has aged better than Michael Jordan did, better than Father Time has allowed for superstars outside of Tom Brady.",
    "link": "https://nypost.com/2026/02/01/sports/lebron-james-potential-msg-swan-song-reminder-of-his-lakers-mistake/"
  },
  {
    "text": "Nipah Virus Outbreak Has Asia on High Alert Amid Deaths in India - ScienceAlert",
    "fullText": "An outbreak of the deadly Nipah virus in India has put many countries in Asia on high alert, given the fatality rate in humans can be between 40% and 75%.",
    "link": "https://www.sciencealert.com/nipah-virus-outbreak-has-asia-on-high-alert-amid-deaths-in-india"
  },
  {
    "text": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "fullText": "The nor’easter, which became a bomb cyclone offshore of North Carolina late Saturday, will go down as the biggest snowstorm in decades for parts of the state.",
    "link": "https://www.washingtonpost.com/weather/2026/02/01/winter-storm-north-carolina-florida-snow-impacts/"
  },
  {
    "text": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters - AP News",
    "fullText": "The mayor of Portland, Oregon, has demanded that U.S. Immigration and Customs Enforcement leave his city after federal agents launched tear gas at demonstrators — including young children — outside an ICE facility during a weekend protest. Mayor Keith Wilson …",
    "link": "https://apnews.com/article/portland-protest-tear-gas-mayor-keith-wilson-1f21fc3d3d4b7a2874239a29ece52c06"
  }
]