[
  {
    "text": "Ole Miss stuns Georgia: Late field goal in Sugar Bowl lifts Rebels to CFP semifinals appearance - CBS Sports",
    "fullText": "Led by star QB Trinidad Chambliss, Ole Miss knocked off Georgia to continue its storybook season",
    "link": "https://www.cbssports.com/college-football/news/georgia-ole-miss-live-updates-sugar-bowl-score-result-analysis-college-football-playoff/live/"
  },
  {
    "text": "Tommy Lee Jones’ daughter found dead at San Francisco hotel, reports say - San Francisco Chronicle",
    "fullText": "Victoria Jones, the daughter of actor Tommy Lee Jones, was found dead at San Francisco’s Fairmont Hotel on New Year’s Day, according to reports.",
    "link": "https://www.sfchronicle.com/sf/article/tommy-lee-jones-daughter-hotel-death-21272105.php"
  },
  {
    "text": "NYT Connections hints and answers for January 2, Tips to solve 'Connections' #936. - Mashable",
    "fullText": "Everything you need to solve 'Connections' #936.",
    "link": "https://mashable.com/article/nyt-connections-hint-answer-today-january-2-2026"
  },
  {
    "text": "Japan PM joins fight for more female toilets in parliament - BBC",
    "fullText": "Japan's parliament building was built in 1936, a decade before women were given the right to vote.",
    "link": "https://www.bbc.com/news/articles/c8e5lxd2gwgo"
  },
  {
    "text": "Maduro says Venezuela open to US talks on drug trafficking - BBC",
    "fullText": "In an interview with state TV, the Venezuelan president also evaded a question about an attack in his country claimed by the US.",
    "link": "https://www.bbc.com/news/articles/clyg23lj057o"
  },
  {
    "text": "Goodman: Curt Cignetti calls out Alabama’s toughness after Rose Bowl - AL.com",
    "fullText": "And just what the heck was Tide coach Kalen DeBoer thinking on that fourth-down call?",
    "link": "https://www.al.com/alabamafootball/2026/01/goodman-curt-cignetti-calls-out-alabamas-toughness-after-rose-bowl.html"
  },
  {
    "text": "China AI chipmaker Biren soars over 100% on Hong Kong debut as IPO wave builds - Yahoo Finance",
    "fullText": "Shares of Chinese AI chip designer Shanghai Biren Technology closed up 76% in their Hong Kong debut on Friday, the financial hub's first listing of 2026. The...",
    "link": "https://finance.yahoo.com/news/china-ai-chipmaker-biren-surges-014634385.html"
  },
  {
    "text": "Mamdani revokes nine Eric Adams executive orders issued after his corruption indictment - New York Daily News",
    "fullText": "In one of his first acts as mayor, Zohran Mamdani revoked nine executive orders his predecessor, Eric Adams, issued after the date of his federal corruption indictment, on issues from antisemitism …",
    "link": "https://www.nydailynews.com/2026/01/01/mamdani-revokes-nine-eric-adams-executive-orders-corruption-indictment/"
  },
  {
    "text": "5 takeaways from Trump's defiant WSJ interview on his health - Axios",
    "fullText": "Trump told the WSJ he had a CT scan during a recent medical exam and not an MRI scan, as he previously claimed.",
    "link": "https://www.axios.com/2026/01/02/trump-health-interview-wall-street-journal"
  },
  {
    "text": "McGuire: TTU not using layoff as excuse for loss - ESPN",
    "fullText": "Texas Tech's Joey McGuire didn't use the team's layoff ahead of Thursday's game as an excuse, instead pointing to inefficient early-down execution and costly turnovers as the primary reasons for a loss to \"the best defense we've faced\" in Oregon.",
    "link": "https://www.espn.com/college-football/story/_/id/47476762/mcguire-texas-tech-cfp-woes-vs-oregon-not-rooted-bye"
  },
  {
    "text": "‘Stranger Things 5’: Duffer Brothers Unpack Emotional Series Finale From [SPOILER]’s Death To That 40-Minute Epilogue, Those Needle Drops & A Spinoff Hint - Deadline",
    "fullText": "Stranger Things creators Matt and Ross Duffer spoke with Deadline about crafting the series finale of the beloved Netflix series",
    "link": "http://deadline.com/2026/01/stranger-things-5-finale-explained-creators-interview-1236659749/"
  },
  {
    "text": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/1/QF-Cotton-recap.aspx"
  },
  {
    "text": "Tipster reveals 10 spectacular upgrades for the Galaxy S26 Ultra - PhoneArena",
    "fullText": "The top-of-the-line Samsung Galaxy S26 Ultra will be much improved over last year's model.",
    "link": "https://www.phonearena.com/news/tipster-lists-10-upgrades-for-the-galaxy-s26-ultra_id176988"
  },
  {
    "text": "Deaths reported during widening protests in Iran sparked by ailing economy - NPR",
    "fullText": "The protests began due to economic pressures, with Iran's currency rapidly depreciating. Demonstrators have also chanted against the country's theocracy.",
    "link": "https://www.npr.org/2026/01/01/g-s1-104241/iran-protests-deaths-economy"
  },
  {
    "text": "Health subsidies expire, launching millions of Americans into 2026 with steep insurance hikes - ABC7 Los Angeles",
    "fullText": "Enhanced tax credits that have helped Americans offset the cost of Affordable Care Act health insurance for the last four years expired overnight.",
    "link": "https://abc7.com/post/health-subsidies-expire-launching-millions-americans-2026-steep-insurance-hikes/18339659/"
  },
  {
    "text": "Astronomers Measure The Mass of a Planet With No Star For The First Time - ScienceAlert",
    "fullText": "Not all planets are lucky enough to live in a neighborhood like our Solar System – some are doomed to roam the cosmos alone.",
    "link": "https://www.sciencealert.com/astronomers-measure-the-mass-of-a-planet-with-no-star-for-the-first-time"
  },
  {
    "text": "Este Haim Tied the Knot on New Year’s Eve at a Star-Studded Ceremony - Rolling Stone",
    "fullText": "Este Haim married tech entrepreneur Jonathan Levin on New Year's Eve in California in a swanky ceremony.",
    "link": "http://www.rollingstone.com/music/music-news/este-haim-jonathan-levin-married-1235493232/"
  },
  {
    "text": "Here’s (Almost) Everything Wall Street Expects in 2026 - Bloomberg.com",
    "fullText": "Over 700 key calls on how AI spending and government policies are set to fuel growth, inflation may prove hard to beat, private assets will continue their rise and the dollar will extend its decline.",
    "link": "https://www.bloomberg.com/graphics/2026-investment-outlooks/"
  }
]