[
  {
    "text": "Your daily horoscope: December 29, 2025 - The Globe and Mail",
    "fullText": "Your daily horoscope for Monday, December 29, 2025",
    "link": "https://www.theglobeandmail.com/life/horoscopes/article-your-daily-horoscope-december-29-2025/"
  },
  {
    "text": "Labriola on the loss to the Browns - Steelers.com",
    "fullText": "Unlike the 3 previous games, they didn't make the plays to engineer a victory",
    "link": "https://www.steelers.com/news/labriola-on-the-loss-to-the-browns-x1462"
  },
  {
    "text": "China to hold military drills around Taiwan as warning to 'separatist forces' - BBC",
    "fullText": "The drills come days after the US announced the sale of one of its largest weapons packages to Taiwan.",
    "link": "https://www.bbc.com/news/articles/c87l7xjp235o"
  },
  {
    "text": "NYT Connections hints and answers for December 29, Tips to solve 'Connections' #932. - Mashable",
    "fullText": "Everything you need to solve 'Connections' #932.",
    "link": "https://mashable.com/article/nyt-connections-hint-answer-today-december-29-2025"
  },
  {
    "text": "10 takeaways from the Eagles’ thrilling 13-12 win over the Bills | Spadaro - Philadelphia Eagles",
    "fullText": "The Eagles' defense shined and came up clutch late as Philadelphia got a gutsy road victory.",
    "link": "https://www.philadelphiaeagles.com/news/spadaro-10-takeaways-from-the-eagles-thrilling-13-12-win-over-the-bills"
  },
  {
    "text": "US-Nigeria strikes: Living in fear of Lakurawa - the militant group Trump targeted - BBC",
    "fullText": "\"We cannot live freely. You cannot even play music\" - residents tell the BBC of militants' rule.",
    "link": "https://www.bbc.com/news/articles/cy7vr76l521o"
  },
  {
    "text": "Trump says Russia and Ukraine are 'maybe very close' to peace deal after Zelenskyy meeting - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/volodymyr-zelenskyy-arrives-mar-lago-peace-talks-president/story?id\\\\u003d128736611"
  },
  {
    "text": "Seahawks Look To Week 18 Following Win Over Panthers: ‘The Whole Team Is Fired Up’ - Seattle Seahawks",
    "fullText": "With Seattle’s win against the Panthers and the 49ers win during Sunday Night Football, the Seahawks will be playing for the NFC West title and NFC No. 1 seed in Week 18.",
    "link": "https://www.seahawks.com/news/seahawks-look-to-week-18-following-win-over-panthers-the-whole-team-is-fired-up"
  },
  {
    "text": "Kosovo's ruling party wins election after months of political deadlock - BBC",
    "fullText": "The decisive victory for the Albanian nationalist Vetevendosje party means a third term for leader Albin Kurti.",
    "link": "https://www.bbc.com/news/articles/ce3z3w4wy0go"
  },
  {
    "text": "Midair helicopter crash in New Jersey leaves 1 dead and another critically injured - AP News",
    "fullText": "Officials say two helicopters have crashed midair in southern New Jersey on Sunday, killing one person and leaving another critically injured. Hammonton Police Chief Kevin Friel said rescuers responded to a report of an aviation crash at about 11:25 a.m. on S…",
    "link": "https://apnews.com/article/hammonton-new-jersey-helicopter-crash-68717ae773636de9142e03e8b5dbd6f1"
  },
  {
    "text": "Bears vs. 49ers live updates: Score, highlights, key moments for 'Sunday Night Football' - CBS Sports",
    "fullText": "Purdy's second consecutive game with five total touchdowns propels 49ers to precipice of NFC's No. 1 seed",
    "link": "https://www.cbssports.com/nfl/news/49ers-vs-bears-live-updates-score-highlights-key-moments-sunday-night-football/live/"
  },
  {
    "text": "Why are young people leaving Britain to work abroad? - BBC",
    "fullText": "Three young Britons explain why they are building their futures overseas.",
    "link": "https://www.bbc.com/news/articles/c1kpv1z372lo"
  },
  {
    "text": "Box Office: ‘Avatar 3’ Dominates Christmas With $88M for $760M Global Crown, Timothée Chalamet Strikes Again - The Hollywood Reporter",
    "fullText": "As a troubled box office year comes to a close, at least Christmas revenue hit a post-pandemic best thanks to an eclectic mix of films that offered something for everyone, led by 'Marty Supreme' and including 'Anaconda,' 'The Housemaid' and faith-based 'David…",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/avatar-3-dominates-christmas-box-office-marty-supreme-timothee-chalamet-1236460003/"
  },
  {
    "text": "Bondi Beach shooting hero says he just wanted to stop the assailant from killing more innocent people - CBS News",
    "fullText": "Ahmed al Ahmed, the man hailed as a hero for disarming one of the gunmen behind a deadly antisemitic attack on Australia's Bondi Beach, says he just wanted to save innocent people.",
    "link": "https://www.cbsnews.com/news/bondi-beach-hero-ahmed-al-ahmed/"
  },
  {
    "text": "LG announces new UltraGear evo gaming monitors with AI upscaling - The Verge",
    "fullText": "Even your gaming monitor isn’t safe from the buzz of AI.",
    "link": "https://www.theverge.com/tech/850572/lg-announces-new-ultragear-evo-gaming-monitors-with-ai-upscaling"
  },
  {
    "text": "‘Bomb cyclone’ forecasted to bring heavy snow, blizzard conditions and dangerous travel - NPR",
    "fullText": "A 'bomb cyclone' is intensifying severe winter weather for millions of people across the U.S. The system is expected to knock out power and disrupt holiday travel.",
    "link": "https://www.npr.org/2025/12/28/nx-s1-5659746/bomb-cyclone-blizzard-dangerous-travel"
  },
  {
    "text": "A guide to choosing the right Apple Watch - TechCrunch",
    "fullText": "The gap between Apple's standard and budget smart watches has never felt smaller.",
    "link": "https://techcrunch.com/2025/12/28/is-the-apple-watch-se-3-a-good-deal/"
  },
  {
    "text": "Suriname: Nine people, including five children, stabbed to death - BBC",
    "fullText": "Police detained the male suspect after shooting him in the leg, while two others are seriously injured.",
    "link": "https://www.bbc.com/news/articles/cp8966ew7y7o"
  }
]