[
  {
    "text": "Opinion | Canada will regret cozying up with China to troll Trump - The Washington Post",
    "fullText": "But global trade is going to happen with or without the United States.",
    "link": "https://www.washingtonpost.com/opinions/2026/01/20/canada-carney-china-xi-trade/"
  },
  {
    "text": "Final Oscar Predictions: ‘Sinners,’ ‘One Battle After Another’ and Warner Bros. Poised to Make History and Break Records - Variety",
    "fullText": null,
    "link": "https://variety.com/2026/film/news/final-academy-awards-predictions-2026-1236631556/"
  },
  {
    "text": "Drug pricing, patent losses and deals: Here's what pharma execs see ahead in the industry - CNBC",
    "fullText": "Big pharma is grappling with new drug pricing deals and roughly $300 billion in potential lost revenue from patent expirations of blockbuster drugs.",
    "link": "https://www.cnbc.com/2026/01/20/drug-pricing-patent-losses-deals-novo-nordisk-pfizer.html"
  },
  {
    "text": "Léa Seydoux Joins Mikey Madison in ‘The Masque of the Red Death’ - The Hollywood Reporter",
    "fullText": "Charlie Polinger is directing the re-imagining of the Edgar Allan Poe story for A24.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/lea-seydoux-mikey-madison-in-the-masque-of-the-red-death-1236478635/"
  },
  {
    "text": "Netflix reports earnings after the bell. Here's what to expect - CNBC",
    "fullText": "Netflix this week amended its offer for Warner Bros. Discovery assets amid a Paramount Skydance hostile takeover attempt.",
    "link": "https://www.cnbc.com/2026/01/20/netflix-nflx-earnings-q4-2025.html"
  },
  {
    "text": "2 Winners and 6 Losers from the 49ers loss to the Seahawks - Niners Nation",
    "fullText": "The 49ers 35-point loss means there won’t be many winners in this edition",
    "link": "https://www.ninersnation.com/san-francisco-49ers-news/155534/2-winners-and-6-losers-from-the-49ers-loss-to-the-seahawks"
  },
  {
    "text": "Anker’s tiny 45W charger adds a useful built-in display, and it’s now available [Hands-on] - 9to5Mac",
    "fullText": "At CES 2026, Anker unveiled a pretty neat new 45W charge brick with a smart display. You might’ve heard about...",
    "link": "https://9to5mac.com/2026/01/20/anker-45w-nano-charger-smart-display-ces-2026-hands-on/"
  },
  {
    "text": "Australian Open 2026: Naomi Osaka's jellyfish-inspired outfit steals show in win over Antonia Ruzic - BBC",
    "fullText": "How Naomi Osaka's jellyfish-inspired outfit stole the show in her hard-fought Australian Open first-round win over Antonia Ruzic.",
    "link": "https://www.bbc.com/sport/tennis/articles/c8d0yq0neq5o"
  },
  {
    "text": "Russell Brand appears in court via videolink charged with further sex offences - BBC",
    "fullText": "The comedian and actor was charged with one more count of rape and one of sexual assault.",
    "link": "https://www.bbc.com/news/articles/cvgnk1x54zko"
  },
  {
    "text": "Letlow launches Trump-backed Senate bid against Cassidy - Politico",
    "fullText": "While Sen. Bill Cassidy has maintained he will win, Trump’s endorsement of Letlow is a particular blow.",
    "link": "https://www.politico.com/news/2026/01/20/letlow-senate-cassidy-trump-00736200"
  },
  {
    "text": "The first commercial space station, Haven-1, is now undergoing assembly for launch - Ars Technica",
    "fullText": "We have a very strong incentive to send a crew as quickly as we can safely do so.\"",
    "link": "https://arstechnica.com/space/2026/01/the-first-commercial-space-station-haven-1-is-now-undergoing-assembly-for-launch/"
  },
  {
    "text": "3 Stocks That Could Create Lasting Generational Wealth - The Motley Fool",
    "fullText": "There's seemingly never going to be a time when these three companies don't dominate their particular industries.",
    "link": "https://www.fool.com/investing/2026/01/20/stocks-that-create-lasting-generational-wealth/"
  },
  {
    "text": "California wildfire smoke exposure during pregnancy linked to autism risk in children - NBC News",
    "fullText": "Pregnant women's exposure to wildfire smoke — particularly in the third trimester — may increase the risk of autism in their children, according to new research.",
    "link": "https://www.nbcnews.com/health/health-news/california-wildfire-smoke-pregnancy-autism-risk-children-rcna254429"
  },
  {
    "text": "‘Night-time solar energy’ could one day power satellites - CNN",
    "fullText": "Scientists have developed a way to generate tiny amounts of solar energy at night. It’s true potential could be in space.",
    "link": "https://www.cnn.com/science/night-time-solar-energy-power-satellites-spc"
  },
  {
    "text": "DOJ civil rights chief blasts Don Lemon for covering anti-ICE protest inside church, vows charges against protesters - NBC News",
    "fullText": "The Justice Department \"will pursue charges\" related to a protest inside a St.",
    "link": "https://www.nbcnews.com/politics/justice-department/dhillon-don-lemon-anti-ice-protest-church-doj-charges-renee-good-rcna254815"
  },
  {
    "text": "Israeli crews begin bulldozing headquarters of UN agency for Palestinian refugees in East Jerusalem - AP News",
    "fullText": "Israeli forces have targeted two United Nations facilities as part of their crackdown on the U.N. agency for Palestinian refugees. On Tuesday, crews bulldozed the United Nations Relief and Works Agency's offices in Sheikh Jarrah and fired tear gas at a vocati…",
    "link": "https://apnews.com/article/israel-palestinians-gaza-east-jerusalem-unrwa-cc9c5b2cac2332f0207d485f381be53d"
  },
  {
    "text": "Trump’s a T-Rex and ‘pathetic’ leaders need to confront him, rages California’s Newsom - politico.eu",
    "fullText": "Leading Democrat launches broadside at politicians who bow to Trump: “You mate with him or he devours you, one or the other, and you need to stand up to it.”",
    "link": "https://www.politico.eu/article/gavin-newsom-world-leaders-pathetic-donald-trump/"
  },
  {
    "text": "2026 Baseball Hall of Fame ballot reveal: Everything to know - ESPN",
    "fullText": "From who can get in to who could get pushed off the ballot, we have your election day primer.",
    "link": "https://www.espn.com/mlb/story/_/id/47631822/mlb-2026-hall-fame-ballot-reveal-beltran-jones-utley"
  }
]