[
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test - Space",
    "fullText": "Sunday, Feb. 1, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-1-2026"
  },
  {
    "text": "Kylie Jenner and Travis Scott Celebrate Stormi and Aire's Birthday Bash - TMZ",
    "fullText": "Travis Scott and Kylie Jenner know how to throw a party ... and their kids' joint birthday celebration was nothing short of epic.",
    "link": "https://www.tmz.com/2026/02/01/travis-scott-kylie-jenner-celebrate-stormi-aire-birthday/"
  },
  {
    "text": "SNL mocks Trump’s border czar and Minneapolis ICE operations - The Washington Post",
    "fullText": "Pete Davidson returned to “Saturday Night Live” as Tom Homan lecturing hapless ICE agents in the cold open. Alexander Skarsgard hosted, and Cardi B performed.",
    "link": "https://www.washingtonpost.com/entertainment/tv/2026/02/01/snl-nbc-tom-homan-ice-minneapolis/"
  },
  {
    "text": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
    "fullText": "Medical charity Medicine Sans Frontières said it would not share the list as it had not been able to ensure staff would remain safe.",
    "link": "https://www.bbc.com/news/articles/cvg1ymmkpkro"
  },
  {
    "text": "We asked retired astronauts about their favorite space movies, and this is what they shared with us - CNN",
    "fullText": "Ahead of the launch of Artemis II, the first crewed mission to the moon in more than 50 years, astronauts share the movies that capture the danger, teamwork, and wonder of spaceflight. Their picks offer cinematic glimpses into the real challenges and triumphs…",
    "link": "https://www.cnn.com/2026/02/01/entertainment/astronauts-favorite-space-movies"
  },
  {
    "text": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown - Axios",
    "fullText": "\"We want Republicans to carry the water,\" one House Democrat told Axios.",
    "link": "https://www.axios.com/2026/01/31/mike-johnson-democrats-shutdown-jeffries-ice-dhs"
  },
  {
    "text": "How Chinese Speculators Set the Stage for Gold and Silver Crash - Bloomberg.com",
    "fullText": "In the history of the silver market, prices had traded above $40 an ounce for only a handful of brief periods before last year. On Friday, exhausted traders watched in shock as the precious metal plunged by that much in less than twenty hours.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-01/how-chinese-speculators-set-the-stage-for-gold-and-silver-crash"
  },
  {
    "text": "RFK Jr. is now a wellness guru for Republicans in Washington - Politico",
    "fullText": "Conservatives in the capital are taking up the health secretary’s advice, eating their vegetables and eschewing pharmaceuticals.",
    "link": "https://www.politico.com/news/2026/02/01/rfk-wellness-republicans-maha-washington-dc-00757417"
  },
  {
    "text": "WWE Royal Rumble 2026 Results, Winners, Live Grades, Reaction and Highlights - Bleacher Report",
    "fullText": "Welcome to Bleacher Report's live coverage of the 2026 WWE Royal Rumble in Riyadh, Saudi Arabia.",
    "link": "https://bleacherreport.com/articles/25379215-wwe-royal-rumble-2026-results-winners-live-grades-reaction-and-highlights"
  },
  {
    "text": "French tech company Capgemini to sell U.S. unit linked to ICE - CNBC",
    "fullText": "French lawmakers had asked Capgemini to explain its U.S. unit's contract with ICE.",
    "link": "https://www.cnbc.com/2026/02/01/french-tech-company-capgemini-to-sell-us-unit-linked-to-ice.html"
  },
  {
    "text": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics - CNN",
    "fullText": "In the wake of a horrific shooting that shocked the nation, President Donald Trump starkly broke with pro-gun groups in off-the-cuff remarks: “Take the guns first, go through due process second,” Trump said during a televised meeting with lawmakers.",
    "link": "https://www.cnn.com/2026/02/01/politics/gun-politics-trump-second-amendment"
  },
  {
    "text": "At a clown school near Paris, failure is the lesson - NPR",
    "fullText": "For decades, students at the Ecole Philippe Gaulier have been paying to bomb onstage. The goal isn't laughs — it's learning how to take the humiliation and keep going.",
    "link": "https://www.npr.org/2026/02/01/nx-s1-5683115/france-gaulier-clown-school"
  },
  {
    "text": "Are the Cavs done making moves ahead of the trade deadline? - Cleveland.com",
    "fullText": null,
    "link": "https://www.cleveland.com/cavs/2026/02/are-the-cavs-done-making-moves-ahead-of-the-trade-deadline.html"
  },
  {
    "text": "Before Any Strike on Iran, U.S. Needs to Bolster Air Defenses in Mideast - The Wall Street Journal",
    "fullText": "The Pentagon is taking steps to better protect Israel, Arab allies and American forces if Iran retaliates",
    "link": "https://www.wsj.com/world/middle-east/before-any-strike-on-iran-u-s-needs-to-bolster-air-defenses-in-mideast-faca35a9"
  },
  {
    "text": "Minnesota citizens detained by ICE are left rattled, even weeks later - NPR",
    "fullText": "The number of immigration agents in Minnesota may be reduced, but they'll leave leave behind a changed community, including many U.S. citizens questioned and detained in recent weeks.",
    "link": "https://www.npr.org/2026/02/01/nx-s1-5689031/minnesota-citizens-detained-ice"
  },
  {
    "text": "Is it really possible to 'bank' sleep for later? - BBC",
    "fullText": "From helping you to focus more to improving sports performance, some scientists believe 'depositing' sleep for later use can bring a range of benefits.",
    "link": "https://www.bbc.com/future/article/20260130-is-it-really-possible-to-bank-sleep-for-later"
  },
  {
    "text": "How Chinese short-video streaming firms are reshaping Latin America's media landscape - CNBC",
    "fullText": "Short-drama apps, many with Chinese origins, are making significant inroads in Latin America as the region becomes more affluent, research shows.",
    "link": "https://www.cnbc.com/2026/02/01/how-chinas-short-video-streamers-are-reshaping-latin-americas-media.html"
  },
  {
    "text": "The Week That Was, The Week Ahead: Macro and Markets, Feb. 1 - TipRanks",
    "fullText": "U.S. stocks ended the week lower as pressure from rates and commodities weighed on risk appetite. The Dow Jones Industrial Average (DJIA) fell 0.36% to $48,892.47, the S&P 500 ($SPY)",
    "link": "https://www.tipranks.com/news/the-week-that-was-the-week-ahead-macro-and-markets-feb-1"
  },
  {
    "text": "Regulators OK ESPN's deal for NFL Network, RedZone rights from NFL - ESPN",
    "fullText": "ESPN's purchase of NFL Network and other league digital assets has been finalized after government regulators approved the transaction.",
    "link": "https://www.espn.com/espn/story/_/id/47793895/regulators-ok-espn-purchase-nfl-network-redzone-rights-nfl-equity-stake"
  }
]