[
  {
    "text": "Spanberger takes further steps to remove Virginia from ICE operations - The Washington Post",
    "fullText": "Virginia Gov. Abigail Spanberger (D) on Wednesday ordered state law enforcement agencies to dissolve any partnership agreements with federal immigration enforcement.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/02/05/virginia-spanberger-ice-trump-immigration/"
  },
  {
    "text": "UPDATE! An X8.1 (Strong) flare from Region 4366 - Space Weather Prediction Center (.gov)",
    "fullText": null,
    "link": "https://www.swpc.noaa.gov/news/update-x81-strong-flare-region-4366"
  },
  {
    "text": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "fullText": "New START is the last major guardrail constraining the nuclear arsenals of the two countries that together hold some 85% of the world's warheads.",
    "link": "https://www.axios.com/2026/02/05/new-start-arms-control-us-russia-extend"
  },
  {
    "text": "ECB holds rates but it's not a 'non-event,' economists say. Here's why - CNBC",
    "fullText": "Economists believe the central bank will be comfortable with the inflation rate where it is, for now, but are watching for signs of disinflation.",
    "link": "https://www.cnbc.com/2026/02/05/ecb-rate-decision-economists-analysts-next-move.html"
  },
  {
    "text": "Where billionaires' investment firms placed their bets in January - CNBC",
    "fullText": "David Blitzer's family office bought a motorcycle racing team, but 2026 deal-making is not off to a roaring start.",
    "link": "https://www.cnbc.com/2026/02/05/billionaire-investing-family-office.html"
  },
  {
    "text": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks - Axios",
    "fullText": "\"The main feeling among members is a lack of trust in his strength and ability to strike a hard bargain.\"",
    "link": "https://www.axios.com/2026/02/05/democrats-schumer-ice-government-shutdown"
  },
  {
    "text": "Statement on postponement of Olympic women's ice hockey game between Finland and Canada - Milano Cortina 2026",
    "fullText": "The game between Team Finland and Team Canada in the women’s Olympic ice hockey competition scheduled to take place today has been postponed.",
    "link": "https://www.olympics.com/en/milano-cortina-2026/news/statement-on-postponement-of-olympic-women-s-ice-hockey-game-between-finland-and-canada"
  },
  {
    "text": "Peloton posts weak holiday quarter after splashy product overhaul fails to land - CNBC",
    "fullText": "Peloton's product overhaul was designed to bring in new customers and encourage existing members to trade up. Instead, shoppers turned away from higher prices.",
    "link": "https://www.cnbc.com/2026/02/05/peloton-pton-earnings-q2-2026.html"
  },
  {
    "text": "Angelic face of Italian prime minister wiped from fresco - CNN",
    "fullText": "The face of Italian prime minister Giorgia Meloni that was painted on a cherub in a church in Rome has been removed following outrage and an investigation by the country’s cultural ministry.",
    "link": "https://www.cnn.com/2026/02/05/europe/meloni-face-removed-church-scli-intl"
  },
  {
    "text": "David Ellison Warns of “Monopolistic” Netflix in Open Letter to U.K. Creatives - The Hollywood Reporter",
    "fullText": "The letter from the Paramount mogul, in which he committed to theatrical windows and \"preserving HBO,\" was aimed at swaying British officials towards his hostile Warner Bros. bid.",
    "link": "http://www.hollywoodreporter.com/business/business-news/david-ellison-hbo-theatrical-windo-wbd-netflix-uk-letter-1236495679/"
  },
  {
    "text": "Stock-market winners suffered their worst day in six years. Here’s what made the move really unusual, according to Goldman. - MarketWatch",
    "fullText": null,
    "link": "https://www.marketwatch.com/story/stock-market-winners-suffered-their-worst-day-in-six-years-what-made-the-move-unusual-according-to-goldman-2e692c0e"
  },
  {
    "text": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade - Cleveland.com",
    "fullText": "There have been mixed emotions over the last 24 hours. It’s natural when a trade occurs. But the overriding feeling in the Cleveland locker room is enthusiasm.",
    "link": "https://www.cleveland.com/cavs/2026/02/our-ceiling-is-higher-donovan-mitchell-opens-up-about-james-harden-darius-garland-trade.html"
  },
  {
    "text": "Sean Baker, Michelle Yeoh's New Film 'Sandiwara' to Premiere at Berlin - Variety",
    "fullText": "Sean Baker and Michelle Yeoh have secretly teamed up for a new project, which will have its world premiere at the Berlin Film Festival this month.",
    "link": "https://variety.com/2026/film/festivals/sean-baker-michelle-yeoh-new-film-sandiwara-premiere-berlin-1236653277/"
  },
  {
    "text": "Fallout Fans Rejoice As Surprise Launch Confirmed, Pre-Orders Open Today - GAMINGbible",
    "fullText": null,
    "link": "https://www.gamingbible.com/news/fallout-surprise-launch-confirmed-pre-orders-open-today-586256-20260205"
  },
  {
    "text": "Poll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement - NPR",
    "fullText": "A new NPR/PBS News/Marist poll finds a jump in disapproval of the agency among Democrats and independents, but Republicans are standing by ICE and the president.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5699413/poll-trump-ice-immigration-economy-approval"
  },
  {
    "text": "Ex-Celtics Coach ‘Embarrassed’ By Rockets’ Disastrous Loss To Boston - NESN",
    "fullText": "Houston Rockets head coach Ime Udoka was ashamed of his team's awful performance against the Boston Celtics on Wednesday.",
    "link": "https://nesn.com/2026/02/ex-celtics-coach-embarrassed-by-rockets-disastrous-loss-to-boston/"
  },
  {
    "text": "ICE can't make warrantless arrests in Oregon unless there's risk of escape, judge rules - NPR",
    "fullText": "U.S. immigration agents in Oregon must stop arresting people without warrants unless there's a likelihood of escape, a federal judge ruled Wednesday.",
    "link": "https://www.npr.org/2026/02/05/g-s1-108778/ice-agents-warrantless-arrests-oregon"
  },
  {
    "text": "Nintendo Direct Partner Showcase Announced For Today, 5th February 2026 - Nintendo Life",
    "fullText": "Howdy, partners!",
    "link": "https://www.nintendolife.com/news/2026/02/nintendo-direct-partner-showcase-announced-for-today-5th-february-2026"
  },
  {
    "text": "Measles case confirmed in Northern Virginia; find out where the exposure sites are believed to be - WUSA9",
    "fullText": "Virginia health officials confirmed a measles case in an adult, prompting alerts for potential exposure sites in Fairfax County. Stay vigilant for symptoms.",
    "link": "https://www.wusa9.com/article/news/health/measles-case-northern-virginia-exposure-sites/65-329d7f68-e385-4431-9e0e-8639a5b79336"
  }
]