[
  {
    "text": "AMD Reports Fourth Quarter and Full Year 2025 Financial Results - AMD",
    "fullText": "SANTA CLARA, Calif., Feb. 03, 2026 (GLOBE NEWSWIRE) -- AMD (NASDAQ:AMD) today announced financial results for the fourth quarter and full year…...",
    "link": "https://ir.amd.com/news-events/press-releases/detail/1276/amd-reports-fourth-quarter-and-full-year-2025-financial-results"
  },
  {
    "text": "‘The Last Of Us’ Adds Clea DuVall, Jorge Lendeborg Jr. Takes Over Manny Role In Season 3 - Deadline",
    "fullText": "Clea Duvall (Poker Face) and Jorge Lendeborg Jr. (Spider-Man: No Way Home) have joined the cast of HBO's The Last of Us for its upcoming third season.",
    "link": "http://deadline.com/2026/02/the-last-of-us-clea-duvall-jorge-lendeborg-jr-manny-s3-1236707696/"
  },
  {
    "text": "With caviar McNuggets and heart-shaped pizza, fast food chains hope to win Valentine's diners - AP News",
    "fullText": "It’s a tale as old as time, or at least as old as TikTok: chicken nuggets lovingly topped with a dab of caviar. McDonald’s is embracing the trend this Valentine’s Day with a limited-time McNugget Caviar kit. The free kit, which will be available on McNuggetCa…",
    "link": "https://apnews.com/article/mcdonalds-caviar-mcnuggets-fast-food-valentines-day-87a2002409008e376dc56f307b20f751"
  },
  {
    "text": "The U.K. investigates its ex-ambassador to the U.S. over alleged leaks to Epstein - NPR",
    "fullText": "The U.K. government says newly released files related to Jeffrey Epstein suggest that the former British ambassador to the U.S. may have shared market-sensitive information with Epstein.",
    "link": "https://www.npr.org/2026/02/03/g-s1-108529/epstein-files-uk-peter-mandelson"
  },
  {
    "text": "Saif al-Islam Gaddafi, son of former leader, killed in Libya - Al Jazeera",
    "fullText": "Saif al-Islam Gaddafi had been considered the number two in Libya before the 2011 death of his father, Muammar Gaddafi.",
    "link": "https://www.aljazeera.com/news/2026/2/3/saif-al-islam-gaddafi-son-of-former-leader-killed-in-libya"
  },
  {
    "text": "Bitcoin breaks below $73,000 to lowest since November 2024 as heavy selling resumes - CNBC",
    "fullText": "Bitcoin fell below $73,000 on Tuesday as investors sold the asset to hedge against heightened geopolitical and economic uncertainties.",
    "link": "https://www.cnbc.com/2026/02/03/bitcoin-price-today.html"
  },
  {
    "text": "A new generation revives 'The Muppet Show' and it's as delightful as ever - NPR",
    "fullText": "This isn't the first reincarnation of Jim Henson's crew, but it's one of the best in a very long time. Seth Rogen is an executive producer, and Maya Rudolph and Sabrina Carpenter guest star.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697369/the-muppet-show-review"
  },
  {
    "text": "Ken Griffin Says CEOs Don’t Like ‘Sucking Up’ to US Presidents - Bloomberg.com",
    "fullText": "Citadel’s Ken Griffin said the Trump administration’s tendency to reward loyalists doesn’t play well with business executives and criticized the president’s willingness to enrich his family while in office.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-03/ken-griffin-says-ceos-don-t-like-sucking-up-to-us-presidents"
  },
  {
    "text": "Don’t tune into the Super Bowl hoping for a break from politics - AP News",
    "fullText": "The NFL says the federal security presence at the Super Bowl will be consistent with past games and Immigration and Customs Enforcement won't be there. The NFL has faced pressure to take a stance against President Donald Trump's immigration policies ahead of …",
    "link": "https://apnews.com/article/super-bowl-bad-bunny-trump-politics-1447163cfa820cbb0c96973c20ccd976"
  },
  {
    "text": "New Mexico warns against consuming raw milk after newborn dies from listeria - NBC News",
    "fullText": "Health officials in New Mexico are warning against consuming raw dairy products after a newborn baby in the state died from a listeria infection that they say was likely contracted when the baby's mother drank raw milk during pregnancy",
    "link": "https://www.nbcnews.com/news/us-news/new-mexico-warns-consuming-raw-milk-newborn-dies-listeria-rcna257252"
  },
  {
    "text": "Did we just see a black hole explode? Physicists think so—and it could explain (almost) everything - Phys.org",
    "fullText": "In 2023, a subatomic particle called a neutrino crashed into Earth with such a high amount of energy that it should have been impossible. In fact, there are no known sources anywhere in the universe capable of producing such energy—100,000 times more than the…",
    "link": "https://phys.org/news/2026-02-black-hole-physicists.html"
  },
  {
    "text": "Don Lemon says a dozen agents came to arrest him even though he offered to turn himself in - AP News",
    "fullText": "Independent journalist Don Lemon says about a dozen federal agents came to his Los Angeles hotel to arrest him last week. Lemon told ABC late-night host Jimmy Kimmel on Monday that the arrest happened even though his attorney told authorities he would turn hi…",
    "link": "https://apnews.com/article/don-lemon-jimmy-kimmel-arrest-5ea86785951237e39ed641571f792316"
  },
  {
    "text": "Iran wants to change venue and format of nuclear talks with U.S. - Axios",
    "fullText": "The demands risk pushing Trump closer to military action.",
    "link": "https://www.axios.com/2026/02/03/iran-us-nuclear-negotiations-format"
  },
  {
    "text": "Gemini app Tools menu adds ‘Labs’ section, Personal Intelligence toggle - 9to5Google",
    "fullText": null,
    "link": "http://9to5google.com/2026/02/03/gemini-tools-menu-labs/"
  },
  {
    "text": "Ex-No. 1 NFL Pick Explains Why Super Bowl Coaches Were ‘The Smartest in My Career’ - Sports Illustrated",
    "fullText": "Much of how Seattle’s Mike Macdonald and Mike Vrabel operate is in contrast to each other. Plus, a retired Olympic surfer defends Sam Darnold and more in Greg Bishop’s newsletter.",
    "link": "https://www.si.com/nfl/why-super-bowl-coaches-were-smartest-in-my-career-mike-vrabel-mike-macdonald"
  },
  {
    "text": "More than one-third of cancer cases are preventable, massive study finds - Nature",
    "fullText": "Many cancers are linked to two modifiable habits: tobacco smoking and alcohol consumption.",
    "link": "https://www.nature.com/articles/d41586-026-00333-1"
  },
  {
    "text": "FX's 'Love Story': JFK Jr and Carolyn Bessette's Sex, Lies and Politics - Variety",
    "fullText": "FX's 'Love Story' stars Paul Kelly and Sarah Pidgeon grace the cover of Variety and brings readers inside the romance of JFK JR and Carolyn Bessette.",
    "link": "https://variety.com/2026/tv/features/love-story-fx-jfk-jr-carolyn-bessette-sex-politics-1236648235/"
  },
  {
    "text": "Nick Diaz plans to continue fighting following Mexico rehab stint: ‘I see myself becoming world champion’ - MMA Fighting",
    "fullText": "Nick Diaz is sober and wants to be a champion again.",
    "link": "https://www.mmafighting.com/ufc/469095/nick-diaz-plans-to-continue-fighting-following-mexico-rehab-stint-i-see-myself-becoming-world-champion"
  }
]