[
  {
    "text": "Joint Statement on the Trilateral Meeting Between the Governments of the United States of America, the State of Israel, and the Syrian Arab Republic - U.S. Department of State (.gov)",
    "fullText": "The text of the following statement was released by the Governments of the United States of America, the State of Israel, and the Syrian Arab Republic. Begin Text. Under the auspices of the United States, senior Israeli and Syrian officials met in Paris. Pres…",
    "link": "https://www.state.gov/releases/office-of-the-spokesperson/2026/01/joint-statement-on-the-trilateral-meeting-between-the-governments-of-the-united-states-of-america-the-state-of-israel-and-the-syrian-arab-republic"
  },
  {
    "text": "Republican Rep. LaMalfa dies, further narrowing GOP’s House majority - The Washington Post",
    "fullText": "The death of the seven-term congressman, coupled with Rep. Marjorie Taylor Greene vacating her seat Tuesday, means Republicans are likely to face trouble advancing partisan legislation.",
    "link": "https://www.washingtonpost.com/politics/2026/01/06/lamalfa-death-house-republicans/"
  },
  {
    "text": "Uvalde officer was told location of gunman but he failed to act, prosecutors say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/opening-statements-begin-former-uvalde-school-officers-trial/story?id\\\\u003d128941754"
  },
  {
    "text": "Dread Pap smears? Federal guidelines now allow for a self-swab HPV test - NBC News",
    "fullText": "Federal guidelines are expanding the options for cervical cancer screenings beyond the often-disliked Pap smear",
    "link": "https://www.nbcnews.com/health/health-news/hpv-self-swab-test-pap-smears-federal-guidelines-rcna251757"
  },
  {
    "text": "Sydney Sweeney box-office hit ‘The Housemaid’ to get a sequel - AP News",
    "fullText": "After just two and half weeks of release, the Sydney Sweeney box-office hit “The Housemaid” is getting a sequel. Lionsgate announced Tuesday that it will start production on “The Housemaid’s Secret” later this year. The film will be based on the second of Fre…",
    "link": "https://apnews.com/article/sydney-sweeney-housemaid-sequel-157a777a7fa309f1418ffe9a504d1df8"
  },
  {
    "text": "Jellyfish sleep like humans — even though they don’t have brains - Nature",
    "fullText": "Studying ancient sea creatures’ snoozing habits could shed light on the origins of sleep.",
    "link": "https://www.nature.com/articles/d41586-026-00044-7"
  },
  {
    "text": "Target 'divisive' Reform in 2026, Keir Starmer tells ministers - BBC",
    "fullText": "The PM says Labour needs to contrast its \"renewal\" of the country with Reform's \"grievance and division\".",
    "link": "https://www.bbc.com/news/articles/c150z39e705o"
  },
  {
    "text": "Lego unveils tech-filled Smart Bricks - to play experts' dismay - BBC",
    "fullText": "Lego says its new tech-enabled products are its \"most revolutionary innovation\" since it launched its mini-figurines in 1978.",
    "link": "https://www.bbc.com/news/articles/crmlnmnwzk2o"
  },
  {
    "text": "Backyard flock in Franklin County tests positive for bird flu - WRAL",
    "fullText": "The North Carolina Department of Agriculture & Consumer Services says a 'backyard flock' has tested positive for High Path Avian Influenza (HPAI) in Franklin County.",
    "link": "https://www.wral.com/news/local/avian-flu-franklin-county-january-2026/"
  },
  {
    "text": "LG’s fastest and brightest OLED gaming monitor is $999.99 - The Verge",
    "fullText": "LG is launching a new OLED gaming monitor that can do 720Hz or 520Hz modes. The GX7 is LG’s fastest and brightness OLED gaming monitor yet.",
    "link": "https://www.theverge.com/news/856173/lg-27gx790b-oled-monitor-720hz-540hz-modes"
  },
  {
    "text": "Attempting to predict the economy in 2026 : Planet Money - NPR",
    "fullText": "Economists may have a pretty dismal record with predictions. But we're still interested in what they see in their non-existent crystal balls.",
    "link": "https://www.npr.org/sections/planet-money/2026/01/06/g-s1-104281/attempting-to-predict-the-economy-in-2026"
  },
  {
    "text": "Tom Brady’s Latest Hail Mary: Saving the Raiders - The Wall Street Journal",
    "fullText": "The seven-time Super Bowl winner is the newest sports legend to attempt to replicate his on-field success as a front-office executive at the NFL’s most dysfunctional franchise",
    "link": "https://www.wsj.com/sports/football/tom-brady-raiders-pete-carroll-996f6184"
  },
  {
    "text": "Pope Leo XIV closes 2025 Holy Year with critique of consumerism and xenophobia - NBC News",
    "fullText": "Pope Leo XIV on Tuesday closed out the Vatican’s 2025 Holy Year by denouncing today’s consumerist and anti-foreigner sentiment, capping a Jubilee that saw some 33 million pilgrims flock to Rome and a historic transition to the first American pontiff",
    "link": "https://www.nbcnews.com/world/pope-leo-xiv/pope-leo-xiv-closes-2025-holy-year-critique-consumerism-xenophobia-rcna252520"
  },
  {
    "text": "Ashley Tisdale says she quit her 'toxic mom group' - BBC",
    "fullText": "The High School Musical actress says she left the group of new mothers after being \"brought to tears\".",
    "link": "https://www.bbc.com/news/articles/c4g09l286e2o"
  },
  {
    "text": "2025 Final Grades for AFC Teams: Ravens and Chiefs Fall From Grace - Sports Illustrated",
    "fullText": "Baltimore and Kansas City receive failing grades, with both teams falling short of their lofty preseason expectations.",
    "link": "https://www.si.com/nfl/2025-final-grades-afc-teams-ravens-chiefs-fall-from-grace"
  },
  {
    "text": "First Call: Stunning stat about Steelers-Ravens final kick; Russell Wilson’s potentially costly comment - TribLIVE.com",
    "fullText": "Tuesday&rsquo;s &ldquo;First Call&rdquo; has some trash talk from Le&rsquo;Veon Bell toward a current Steelers defensive back. A former Pitt standout thinks the Steelers have little hope in their next game against Houston. Russell Wilson may have cost his cur…",
    "link": "https://triblive.com/sports/first-call-stunning-stat-about-steelers-ravens-final-kick-russell-wilsons-potentially-costly-comment/"
  },
  {
    "text": "Can China and South Korea reset complex ties after Xi-Lee summit? - Al Jazeera",
    "fullText": "Analysts say both countries increasingly rely on each other for economic and security reasons amid geopolitical churn.",
    "link": "https://www.aljazeera.com/news/2026/1/6/can-china-and-south-korea-reset-complex-ties-after-xi-lee-summit"
  },
  {
    "text": "‘Mexico should indeed be concerned’: Trump’s threats rattle Mexican officials, businesses - Politico",
    "fullText": "Trump’s rhetoric, including his suggestion over the weekend that Washington may have to “do something” about cartels that are “running Mexico,” is reviving fears in Mexico City.",
    "link": "https://www.politico.com/news/2026/01/06/after-venezuela-trumps-cartel-threats-put-mexico-on-edge-00711703"
  },
  {
    "text": "How competitive is Drake Maye? Tales from the Patriots locker room - MassLive",
    "fullText": "Patriots players talk about Drake Maye's uber-competitiveness and hatred of losing at anything.",
    "link": "https://www.masslive.com/patriots/2026/01/how-competitive-is-drake-maye-tales-from-the-patriots-locker-room.html"
  }
]