[
  {
    "text": "Tommy Lee Jones’s daughter ‘found dead in hotel room’, aged 34 - thetimes.com",
    "fullText": "Emergency services attended the Fairmont hotel in San Francisco in the early hours of New Year’s Day",
    "link": "https://www.thetimes.com/us/news-today/article/tommy-lee-jones-daughter-found-dead-hotel-room-bzqn2s3xk"
  },
  {
    "text": "Indiana throttles Alabama: Hoosiers leave no doubt en route to CFP semifinal berth vs. Oregon - CBS Sports",
    "fullText": "Indiana looked every bit the part of a No. 1 seed in a dominant victory over Alabama in the Rose Bowl College Football Playoff quarterfinal",
    "link": "https://www.cbssports.com/college-football/news/alabama-indiana-live-updates-rose-bowl-score-result-analysis-college-football-playoff/live/"
  },
  {
    "text": "McGuire: TTU not using layoff as excuse for loss - ESPN",
    "fullText": "Texas Tech's Joey McGuire didn't use the team's layoff ahead of Thursday's game as an excuse, instead pointing to inefficient early-down execution and costly turnovers as the primary reasons for a loss to \"the best defense we've faced\" in Oregon.",
    "link": "https://www.espn.com/college-football/story/_/id/47476762/mcguire-texas-tech-cfp-woes-vs-oregon-not-rooted-bye"
  },
  {
    "text": "‘Stranger Things 5’: Duffer Brothers Unpack Emotional Series Finale From [SPOILER]’s Death To That 40-Minute Epilogue, Those Needle Drops & A Spinoff Hint - Deadline",
    "fullText": "Stranger Things creators Matt and Ross Duffer spoke with Deadline about crafting the series finale of the beloved Netflix series",
    "link": "http://deadline.com/2026/01/stranger-things-5-finale-explained-creators-interview-1236659749/"
  },
  {
    "text": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/1/QF-Cotton-recap.aspx"
  },
  {
    "text": "Ole Miss vs Georgia in Sugar Bowl: Trinidad Chambliss vs Gunner Stockton see top photos - The Clarion-Ledger",
    "fullText": "Ole Miss Rebels football vs Georgia Bulldogs in Sugar Bowl CFP quarterfinals on Jan. 1, 2026, at Caesars Superdome in New Orleans, Louisiana",
    "link": "https://www.clarionledger.com/picture-gallery/sports/college/ole-miss/2026/01/01/ole-miss-football-georgia-sugar-bowl-trinidad-chambliss-gunner-stockton/87976839007/"
  },
  {
    "text": "Tipster reveals 10 spectacular upgrades for the Galaxy S26 Ultra - PhoneArena",
    "fullText": "The top-of-the-line Samsung Galaxy S26 Ultra will be much improved over last year's model.",
    "link": "https://www.phonearena.com/news/tipster-lists-10-upgrades-for-the-galaxy-s26-ultra_id176988"
  },
  {
    "text": "Deaths reported during widening protests in Iran sparked by ailing economy - NPR",
    "fullText": "The protests began due to economic pressures, with Iran's currency rapidly depreciating. Demonstrators have also chanted against the country's theocracy.",
    "link": "https://www.npr.org/2026/01/01/g-s1-104241/iran-protests-deaths-economy"
  },
  {
    "text": "Here’s (Almost) Everything Wall Street Expects in 2026 - Bloomberg.com",
    "fullText": "Over 700 key calls on how AI spending and government policies are set to fuel growth, inflation may prove hard to beat, private assets will continue their rise and the dollar will extend its decline.",
    "link": "https://www.bloomberg.com/graphics/2026-investment-outlooks/"
  },
  {
    "text": "Congress failed to extend Obamacare subsidies. This Democrat says Trump can save them - NPR",
    "fullText": "Sen. Peter Welch, D-Vt., says he thinks the Senate can pass a \"retroactive\" Affordable Care Act subsidy extension, but \"we need President Trump.\"",
    "link": "https://www.npr.org/2026/01/01/g-s1-104216/obamacare-subsidies-congress-peter-welch"
  },
  {
    "text": "Response to China’s Military Exercise Near Taiwan - U.S. Department of State (.gov)",
    "fullText": "China’s military activities and rhetoric toward Taiwan and others in the region increase tensions unnecessarily. We urge Beijing to exercise restraint, cease its military pressure against Taiwan, and instead engage in meaningful dialogue. The United States su…",
    "link": "https://www.state.gov/releases/office-of-the-spokesperson/2026/01/response-to-chinas-military-exercise-near-taiwan"
  },
  {
    "text": "What we know about a Minneapolis day care center that was highlighted in video about alleged fraud - CNN",
    "fullText": "Quality Learning Center, a focus of a video looking at Somali businesses in Minneapolis, has a history of code violations, but none that suggested fraud.",
    "link": "https://www.cnn.com/2026/01/01/us/minnesota-daycare-fraud-allegations-somali"
  },
  {
    "text": "Will Smith sued by tour violinist for retaliation, sexual harassment - USA Today",
    "fullText": "Will Smith is being sued by a violinist on his Based on a True Story tour, after the musician claims he was fired for reporting sexual harassment.",
    "link": "https://www.usatoday.com/story/entertainment/celebrities/2026/01/01/will-smith-lawsuit-brian-king-joseph/87984124007/"
  },
  {
    "text": "January’s full wolf supermoon and the Quadrantid meteor shower will start off the new year - CNN",
    "fullText": "Catch the wolf supermoon and Quadrantid meteor shower as January’s night sky puts on a celestial double feature.",
    "link": "https://www.cnn.com/2026/01/01/science/january-full-moon-quadrantid-meteor-shower"
  },
  {
    "text": "Federal travel ban update: New Trump-ordered restrictions now in effect - ABC7 Chicago",
    "fullText": "Individuals from seven countries will not be able to travel to the United States starting Thursday, according to updated CBP guidance.",
    "link": "https://abcnews.go.com/US/new-trump-ordered-immigration-restrictions-effect-jan-1/story?id=128812891"
  },
  {
    "text": "Despite rain, 137th Rose Parade makes its way down Colorado Boulevard in Pasadena - ABC7 Los Angeles",
    "fullText": "For the first time in 20 years, it rained as the 137th edition of the Rose Parade made its way down Colorado Boulevard in Pasadena, but the inclement weather didn't dampen the spirit of spectators.",
    "link": "https://abc7.com/post/despite-rain-137th-rose-parade-make-down-colorado-boulevard-pasadena/18338547/"
  },
  {
    "text": "Kelsea Ballerini and Chase Stokes Get Back Together After a 'Messy Year for the Heart' - TODAY.com",
    "fullText": "Kelsea Ballerini and Chase Stokes seemingly got back together. Here's what they said about their relationship and getting back together 3 months after their split.",
    "link": "https://www.today.com/popculture/kelsea-ballerini-chase-stokes-back-together-rcna251715"
  },
  {
    "text": "15 skywatching events you won't want to miss in 2026 - Space",
    "fullText": "Our 2026 skywatching guide includes a total solar eclipse, a \"blood moon\" and a festive supermoon. Here are the dates you need to know.",
    "link": "https://www.space.com/stargazing/15-skywatching-events-you-wont-want-to-miss-in-2026"
  },
  {
    "text": "An Engineer Says He’s Found a Way to Overcome Earth’s Gravity - Yahoo! Tech",
    "fullText": "This new propulsion system could rewrite the rules of spaceflight—not to mention completely defy conventional physics.",
    "link": "https://www.popularmechanics.com/space/rockets/a69897524/engineer-can-overcome-earths-gravity/"
  }
]