[
  {
    "text": "A high-stakes State of the Union just got harder for Trump - Politico",
    "fullText": "Trump heads to the Hill for a primetime address to Congress on Tuesday amid a torrent of negative news.",
    "link": "https://www.politico.com/news/2026/02/21/a-high-stakes-state-of-the-union-just-got-even-harder-for-trump-00791753"
  },
  {
    "text": "Government considers removing Andrew from royal line of succession - BBC",
    "fullText": "The former Duke of York is eighth in line to the throne meaning he remains eligible to be King.",
    "link": "https://www.bbc.com/news/articles/c1kgv837wvdo"
  },
  {
    "text": "Simple, day-to-day tasks may delay Alzheimer’s and dementia, scientists say - The Washington Post",
    "fullText": "The survey, one of the largest of its kind, promotes the idea that the texture of daily life can leave a measurable imprint on the aging brain.",
    "link": "https://www.washingtonpost.com/health/2026/02/21/alzheimers-busy-mind-study-delay/"
  },
  {
    "text": "Former top general calls military's removal of trans troops a costly mistake - NPR",
    "fullText": "As several global tensions simmer, the Pentagon is removing thousands of transgender troops under an anti-DEI push. How might a focus on gender identity distract from mission readiness?",
    "link": "https://www.npr.org/2026/02/21/nx-s1-5720178/trump-military-ban-rights-transgender-troops"
  },
  {
    "text": "'RHOC's Meghan King Accuses Jim Edmonds of Leaking Her Number to Sex Workers - TMZ",
    "fullText": "'Real Housewives of Orange County' alum Meghan King accused her ex-husband Jim Edmonds of leaking her cell phone to sex workers to harass her years ago ... something she mentioned to cops while reporting recent harassing phone threats from an unknown person -…",
    "link": "https://www.tmz.com/2026/02/21/meghan-king-claims-jim-edmonds-gave-her-number-to-sex-workers/"
  },
  {
    "text": "Four years on, Russia is still paying for a fatal miscalculation in Ukraine - CNN",
    "fullText": "In the early hours of February 24 2022, standing on the freezing roof of a hotel in Kyiv, the idea that Russia would launch a full-scale assault on Ukraine, despite a troop buildup on the border, still seemed almost impossible to imagine.",
    "link": "https://www.cnn.com/2026/02/21/europe/russia-putin-ukraine-war-intl"
  },
  {
    "text": "Chaos, confusion and $200 billion dreams: What I saw at India’s AI summit - CNBC",
    "fullText": "India hosted one of the world's biggest AI events this week, but it was marred by impossible traffic and a lack of organization.",
    "link": "https://www.cnbc.com/2026/02/21/ai-summit-india-tech.html"
  },
  {
    "text": "Genesis Invitational: Rory McIlroy hunts leaders Marco Penge & Jacob Bridgeman - BBC",
    "fullText": "World number two Rory McIlroy is one shot off leaders Marco Penge and Jacob Bridgeman at the halfway stage of the Genesis Invitational.",
    "link": "https://www.bbc.com/sport/golf/articles/c626v1qpz5zo"
  },
  {
    "text": "Anker’s X1 Pro shouldn’t exist, but I’m so glad it does - The Verge",
    "fullText": "Anker’s Soundcore Nebula X1 Pro is a 400W Dolby Atmos party speaker combined with a very bright 4K, nearly-silent projector running Google TV.",
    "link": "https://www.theverge.com/tech/881788/soundcore-nebula-x1-pro-review-comparison-x1"
  },
  {
    "text": "What we learned from Day 3 of the second Bahrain test - Formula 1",
    "fullText": "F1.com's Lawrence Barretto analyses the third and final day of the second pre-season test at the Bahrain International Circuit.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-3-of-the-second-2026-pre-season-test-in-bahrain.1Yj0sE1VV0cN416M5Vs1OD"
  },
  {
    "text": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates - 6abc Philadelphia",
    "fullText": "A Winter Storm Watch will go into effect on Sunday for a system that could bring snow to our area well into Monday.",
    "link": "https://6abc.com/live-updates/winter-storm-set-bring-foot-snow-parts-philadelphia-region-live-updates/18625971/"
  },
  {
    "text": "Forget Greenland: This Arctic NATO Island Already Has a Russian Presence - The Wall Street Journal",
    "fullText": "Concerns are mounting in Svalbard that President Trump’s focus on the Arctic will upend decades of tense calm in the High North",
    "link": "https://www.wsj.com/world/forget-greenland-this-arctic-nato-island-already-has-a-russian-presence-bbb19d13"
  },
  {
    "text": "Even Stephen Amell Had to Run After ‘Baywatch’ Lead Role (But Not in Slow Motion) - The Hollywood Reporter",
    "fullText": "“No matter how hard I work, we are going to cast someone in their early 20s on this show and they’ll be able to roll out of bed with an eight-pack and there’s not a thing I can do about it,” jokes Amell.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/baywatch-reboot-stephen-amell-fox-1236510851/"
  },
  {
    "text": "Why There's Simply No Need For A Password Manager Anymore - bgr.com",
    "fullText": "With OS-level password managers, passkeys, and biometric authentication technology, there's no longer much need for third-party password managers.",
    "link": "https://www.bgr.com/2102887/why-no-one-needs-password-managers-anymore/"
  },
  {
    "text": "North Carolina vs East Carolina - East Carolina University Athletics",
    "fullText": "East Carolina University Athletics",
    "link": "https://ecupirates.com/sports/baseball/stats/2026/north-carolina/boxscore/14046"
  },
  {
    "text": "‘Face/Off’ Sequel Loses Director Adam Wingard - The Hollywood Reporter",
    "fullText": null,
    "link": "http://www.hollywoodreporter.com/movies/movie-news/face-off-2-sequel-director-adam-wingard-exits-cage-travolta-1236511178/"
  },
  {
    "text": "A Galaxy Composed Almost Entirely of Dark Matter Has Been Confirmed - WIRED",
    "fullText": "What scientists thought were four separate star clusters are actually part of one nearly invisible system.",
    "link": "https://www.wired.com/story/a-galaxy-composed-almost-entirely-of-dark-matter-has-been-confirmed/"
  },
  {
    "text": "WWE SmackDown Spoiler Lineup for February 20, 2026: Full Match Card and Backstage Notes Revealed - Ringside News",
    "fullText": "WWE SmackDown is set to deliver an exciting night of action on February 20, 2026 with a lineup featuring thrilling matches and intense rivalries. Fans can",
    "link": "https://www.ringsidenews.com/wwe-smackdown-spoiler-lineup-for-february-20-2026-full-match-card-and-backstage-notes-revealed/"
  },
  {
    "text": "Stocks Rally On Trump Tariff Ruling; Iran, Nvidia In Focus - Investor's Business Daily",
    "fullText": "S&P 500 regains 50-day line, but up-and-down market tough to handle.",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-trump-tariff-ruling-iran-news-nvidia-earnings/"
  }
]