[
  {
    "text": "FBI opened probe on Minneapolis shooting; none exists now, Justice Dept. says - The Washington Post",
    "fullText": "After the death of Renée Good in Minneapolis, FBI agents launched a civil rights probe into the shooting. The Justice Department says no such case now exists.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/18/fbi-minnesota-shooting-civil-rights-investigation/"
  },
  {
    "text": "Rams end the Bears’ magical run and the Patriots ease past the Texans to set up NFL’s final four - CNN",
    "fullText": "The Rams and Patriots are moving on to the conference championship round after victories on Sunday in the NFL playoffs",
    "link": "https://www.cnn.com/sport/live-news/nfl-playoffs-texans-patriots-rams-bears-01-18-26"
  },
  {
    "text": "Texans’ C.J. Stroud Makes Unfortunate NFL History With Wild Run of Turnovers in Playoffs - Sports Illustrated",
    "fullText": "C.J. Stroud’s turnover numbers this postseason are unlike anything the NFL has ever seen.",
    "link": "https://www.si.com/nfl/texans-cj-stroud-unfortunate-nfl-history-turnovers-in-playoffs"
  },
  {
    "text": "Man detained in Minneapolis dies in ICE custody in Texas - MPR News",
    "fullText": "A man arrested by immigration officials in Minneapolis died in federal detention in Texas.",
    "link": "https://www.mprnews.org/story/2026/01/18/man-detained-in-minneapolis-dies-in-ice-custody-in-texas"
  },
  {
    "text": "Canada’s Tariff Cut Just Made This High-Tech Chinese EV 50% Cheaper - InsideEVs",
    "fullText": "A high-end electric performance SUV that's made in China is about to get dramatically cheaper for Canadians.",
    "link": "https://insideevs.com/news/784754/lotus-eletre-price-cut-canada-tariff-chinese-evs/"
  },
  {
    "text": "Center left wins Portugal presidential election first round, setting up showdown with far right - politico.eu",
    "fullText": "António José Seguro will face far-right leader André Ventura in a runoff ballot Feb. 8.",
    "link": "https://www.politico.eu/article/far-right-wins-portugal-presidential-election-first-round-exit-poll-says/"
  },
  {
    "text": "Homeless warming fire ignites Portland Red Robin, firefighters say - OregonLive.com",
    "fullText": "Firefighters managed to quench the blaze before it engulfed the whole building.",
    "link": "https://www.oregonlive.com/crime/2026/01/homeless-warming-fire-ignites-portland-red-robin-firefighters-say.html"
  },
  {
    "text": "Oregon man buys four 'refurbished' video game consoles from Temu and opens them up to see if they're legit - supercarblondie.com",
    "fullText": "This Oregon man got his hands on four refurbished video game consoles from Temu to have a closer look at whether or not they were worth the investment",
    "link": "https://supercarblondie.com/are-refurbished-video-game-consoles-temu-legit/"
  },
  {
    "text": "Millions use the Epic Games Store, but almost nobody buys games there - Windows Central",
    "fullText": "Epic’s free game strategy worked for sign‑ups, but trained users to never buy, leaving revenue growth nearly nonexistent.",
    "link": "https://www.windowscentral.com/gaming/pc-gaming/epic-games-store-grew-from-108m-to-295m-users-but-third-party-revenue-barely-moved"
  },
  {
    "text": "7 police officers killed in attacks in Guatemala after prison crackdown on gangs - CBS News",
    "fullText": "The killings occurred a day after gang member inmates took 46 people hostage in three prisons across the country, officials said.",
    "link": "https://www.cbsnews.com/news/police-officers-killed-guatemala-prison-crackdown/"
  },
  {
    "text": "Syria, SDF agree ceasefire and integration deal - BBC",
    "fullText": "President Ahmed al-Sharaa said the deal would allow the Syrian state to reassert control over most areas.",
    "link": "https://www.bbc.com/news/articles/c4gwk37ewvwo"
  },
  {
    "text": "Colin Jost Reacts to Wife Scarlett Johansson Losing Top-Grossing Title - Yahoo",
    "fullText": "Colin Jost hilariously reacted to Zoe Saldaña surpassing his wife Scarlett Johansson as the highest-grossing star of all time during the Jan. 17 episode of...",
    "link": "https://www.eonline.com/news/1427471/colin-jost-on-scarlett-johansson-replaced-as-highest-grossing-star?cmpid=sn-syndicate-aolfeed-us-"
  },
  {
    "text": "5 Clever Uses For Your Old PlayStation 3 - bgr.com",
    "fullText": "Even though the PlayStation 3 is going on 20 years old, turning it into an emulator or media server can breathe new life into that old console.",
    "link": "https://www.bgr.com/2074854/uses-for-your-old-ps3/"
  },
  {
    "text": "Why is flu season so bad this year? - Live Science",
    "fullText": "Flu season in the U.S. is particularly bad this year, and a new branch of the flu family tree may be to blame.",
    "link": "https://www.livescience.com/health/flu/why-is-flu-season-so-bad-this-year"
  },
  {
    "text": "Indiana football is one win from joining the greatest sports stories ever - CBS Sports",
    "fullText": "Indiana football is one win from a place usually reserved for miracles, movies and legends",
    "link": "https://www.cbssports.com/college-football/news/indiana-football-greatest-sports-stories/"
  },
  {
    "text": "NASA Caught The Ocean Turning Strange Colors Around These Islands - The Daily Galaxy",
    "fullText": "A glowing ring just appeared in the Pacific, and NASA caught it on camera.",
    "link": "https://dailygalaxy.com/2026/01/nasa-ocean-strange-colors-around-islands/"
  },
  {
    "text": "Ketsu Battler adds Narmaya from Granblue Fantasy Versus: Rising - Gematsu",
    "fullText": "Ketsu Battler, the one-on-one butt shaking fighting game, has added Narmaya from Granblue Fantasy Versus: Rising as a free guest character today alongside the previously announced Beelzebub via its…",
    "link": "https://www.gematsu.com/2026/01/ketsu-battler-adds-narmaya-from-granblue-fantasy-versus-rising"
  },
  {
    "text": "Trump suffers major losses in his war on offshore wind - Politico",
    "fullText": "The administration’s arguments that offshore wind farms present a national security risk failed to convince judges in three separate courts.",
    "link": "https://www.politico.com/news/2026/01/18/trump-offshore-wind-problems-00734850"
  }
]