[
  {
    "text": "'Today' show host Savannah Guthrie's mother reported missing in Arizona: Sheriff - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/today-show-host-savannah-guthries-mother-reported-missing/story?id\\\\u003d129770864"
  },
  {
    "text": "Groundhog Day puts Punxsutawney Phil's forecast about winter's length in the spotlight - NPR",
    "fullText": "When Phil is said to have seen his shadow upon emergence from a tree stump in rural Pennsylvania, that's considered a forecast for six more weeks of winter. If he doesn't see his shadow, an early spring is said to be on the way.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5696304/groundhog-day-punxsutawney-phil-forecast-winter-length"
  },
  {
    "text": "Trump plans to close Kennedy Center for about two years, starting in July - The Washington Post",
    "fullText": "Under a proposal by President Donald Trump, the closure could begin July 4, with construction beginning immediately.",
    "link": "https://www.washingtonpost.com/style/2026/02/01/kennedy-center-trump-closure-construction/"
  },
  {
    "text": "Venezuela's first shipment of liquefied petroleum gas has left Venezuela bound for the US - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/venezuelas-shipment-liquefied-petroleum-gas-left-venezuela-bound/story?id\\\\u003d129768949"
  },
  {
    "text": "Disney beats Wall Street expectations propelled by theme parks and streaming - CNBC",
    "fullText": "In the background of Disney's earnings report on Monday is the question of who will be named the successor to CEO Bob Iger.",
    "link": "https://www.cnbc.com/2026/02/02/disney-dis-earnings-q1-26.html"
  },
  {
    "text": "Nipah Virus Outbreak Has Asia on High Alert Amid Deaths in India - ScienceAlert",
    "fullText": "An outbreak of the deadly Nipah virus in India has put many countries in Asia on high alert, given the fatality rate in humans can be between 40% and 75%.",
    "link": "https://www.sciencealert.com/nipah-virus-outbreak-has-asia-on-high-alert-amid-deaths-in-india"
  },
  {
    "text": "Diamondbacks Interested In Carlos Santana - MLB Trade Rumors",
    "fullText": "The former All-Star and Gold Glover is on Arizona's radar. Visit MLB Trade Rumors for more on how Santana would fit into Arizona's plans.",
    "link": "https://www.mlbtraderumors.com/2026/02/diamondbacks-interested-in-carlos-santana.html"
  },
  {
    "text": "Jeremy Swayman And Andrei Vasilevskiy Create Instant Classic Outdoor Game Moment With Goalie Fight - OutKick",
    "fullText": "The Stadium Series matchup between the Boston Bruins and Tampa Bay Lightning in Florida featured one of the rarest occurrences in hockey: a goalie fight.",
    "link": "https://www.outkick.com/sports/jeremy-swayman-andrei-vasilevskiy-create-instant-classic-outdoor-game-moment-goalie-fight"
  },
  {
    "text": "Oracle to Raise Up to $50 Billion in 2026 for Cloud Buildup - Bloomberg.com",
    "fullText": "Oracle Corp. plans to raise $45 billion to $50 billion this year through a combination of debt and equity sales to build additional cloud infrastructure capacity, reflecting the scale of financing needed to feed AI’s growth.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-01/oracle-to-raise-up-to-50-billion-this-year-for-cloud-investment"
  },
  {
    "text": "ICE halts \"all movement\" at Texas detention facility due to measles infections - CBS News",
    "fullText": "The measles​ cases at the Dilley Immigration Processing Center were detected Friday, Department of Homeland Security spokesperson Tricia McLaughlin said in a statement to CBS News.",
    "link": "https://www.cbsnews.com/news/ice-dilley-center-texas-measles-cases/"
  },
  {
    "text": "Russian Offensive Campaign Assessment, February 1, 2026 - Institute for the Study of War",
    "fullText": "Russian drones struck a maternity hospital and a bus carrying miners on February 1, causing significant civilian casualties.",
    "link": "https://understandingwar.org/research/russia-ukraine/russian-offensive-campaign-assessment-february-1-2026/"
  },
  {
    "text": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "fullText": "The nor’easter, which became a bomb cyclone offshore of North Carolina late Saturday, will go down as the biggest snowstorm in decades for parts of the state.",
    "link": "https://www.washingtonpost.com/weather/2026/02/01/winter-storm-north-carolina-florida-snow-impacts/"
  },
  {
    "text": "5 Zodiac Signs With Good Horoscopes On February 2, 2026 - YourTango",
    "fullText": "Five zodiac signs have good horoscopes on February 2, 2026. They are: Pisces, Libra, Taurus, Virgo, and Gemini.",
    "link": "https://www.yourtango.com/2026394363/zodiac-signs-good-horoscopes-february-2-2026"
  },
  {
    "text": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters - AP News",
    "fullText": "The mayor of Portland, Oregon, has demanded that U.S. Immigration and Customs Enforcement leave his city after federal agents launched tear gas at demonstrators — including young children — outside an ICE facility during a weekend protest. Mayor Keith Wilson …",
    "link": "https://apnews.com/article/portland-protest-tear-gas-mayor-keith-wilson-1f21fc3d3d4b7a2874239a29ece52c06"
  },
  {
    "text": "Farmers Insurance Open: Justin Rose secures record-breaking victory - BBC",
    "fullText": "England's Justin Rose clinches an utterly dominant win at the Farmers Insurance Open in a new tournament record score.",
    "link": "https://www.bbc.com/sport/golf/articles/c74wk9g2272o"
  },
  {
    "text": "Lakers vs Knicks Prediction, Odds, NBA Picks for Sunday, Feb. 1 - Action Network",
    "fullText": "Find Los Angeles Lakers vs New York Knicks predictions, odds, and NBA picks for Sunday, February 1.",
    "link": "https://www.actionnetwork.com/nba/los-angeles-lakers-vs-new-york-knicks-prediction-pick-odds-sunday-february-1"
  },
  {
    "text": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says - Politico",
    "fullText": "“It doesn't matter if you happen to be a former CNN journalist,\" he argued.",
    "link": "https://www.politico.com/news/2026/02/01/don-lemon-todd-blanche-press-religion-00759255"
  },
  {
    "text": "Space Weather Activity Story for the Week of 1-7 February, 2026 - NOAA (National Oceanic and Atmospheric Administration) (.gov)",
    "fullText": null,
    "link": "https://www.swpc.noaa.gov/news/space-weather-activity-story-week-1-7-february-2026"
  },
  {
    "text": "Pokémon GO Events This Week: February 2 to February 8, 2026 - Pokémon GO Hub",
    "fullText": "Pokémon GO’s February 2 to February 8 week has us entering the final month of Precious Paths! Get ready for carnival with the debut of Flamigo, and show off your catching skills with Oricorio. Plus the weekly rotating Spotlight and Raid Hours, Dynamax Battles…",
    "link": "https://pokemongohub.net/post/event/pokemon-go-events-this-week-february-2-to-february-8-2026/"
  }
]