[
  {
    "text": "Live updates: Minneapolis residents challenge local and state leaders at CNN town hall - CNN",
    "fullText": "CNN is hosting a Minneapolis town hall with officials and community leaders, including Mayor Jacob Frey. Follow for live news updates.",
    "link": "https://www.cnn.com/us/live-news/minneapolis-ice-trump-01-28-26"
  },
  {
    "text": "Los Angeles Chargers Agree to Terms with Chris O’Leary - Chargers.com",
    "fullText": "The Los Angeles Chargers today agreed to terms with Chris O’Leary as the team’s defensive coordinator. O’Leary, who spent the 2024 season as the team’s safeties coach under Head Coach Jim Harbaugh, returns to the Bolts after spending last year as the defe",
    "link": "https://www.chargers.com/news/agree-to-terms-chris-oleary-defensive-coordinator-2026"
  },
  {
    "text": "Futures: Meta Jumps, Microsoft Skids; Tesla CapEx To Soar - Investor's Business Daily",
    "fullText": "Fed chief Jerome Powell said rates may be on pause for longer.",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-tesla-meta-microsoft-earnings/"
  },
  {
    "text": "A Battered Iran Is Still Able to Mount a Deadly Response to U.S. Strikes - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/middle-east/a-battered-iran-is-still-able-to-mount-a-deadly-response-to-u-s-strikes-6331080f"
  },
  {
    "text": "Indonesian stocks tumble as Goldman warning adds to MSCI concerns - Financial Times",
    "fullText": "Jakarta Composite index falls 10% as investors worry about potential reclassification",
    "link": "https://www.ft.com/content/ae6fd19e-df76-4855-8a1c-2e1099a91851"
  },
  {
    "text": "Judge slams ICE while backing off contempt threat for agency’s director - The Washington Post",
    "fullText": "A federal judge cited a list of 96 orders he said Immigration and Customs Enforcement had ignored in more than 70 cases since the agency launched its immigration crackdown in Minnesota.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/28/minnesota-judge-cancels-ice-contempt-threat/"
  },
  {
    "text": "Kenan Thompson Sued By Landlord Over Breach of Lease - TMZ",
    "fullText": "Kenan Thompson is being dragged to court by a landlord, who claims he owes over $34,000 for breaking his lease on a rental home.",
    "link": "https://www.tmz.com/2026/01/28/kenan-thompson-sued-breach-of-lease/"
  },
  {
    "text": "Trump officials trade blame as political pressure mounts over Minneapolis - Politico",
    "fullText": "The attempts to shift liability show the White House views the shooting as a major political vulnerability.",
    "link": "https://www.politico.com/news/2026/01/28/trump-officials-trade-blame-as-political-pressure-mounts-over-minneapolis-00754139"
  },
  {
    "text": "Microsoft’s Earnings Surge Is Overshadowed by Data-Center Spending - The Wall Street Journal",
    "fullText": "Higher-than-anticipated capital spending and slower growth in cloud computing weigh on shares",
    "link": "https://www.wsj.com/tech/ai/microsofts-earnings-surge-elevated-by-cloud-business-251829c2"
  },
  {
    "text": "Officials warn of 'moderate' risk after TB outbreak in SF high school - SFGATE",
    "fullText": "Three active cases have been reported at Archbishop Riordan High School since last November.",
    "link": "https://www.sfgate.com/bayarea/article/san-francisco-tuberculosis-school-21320252.php"
  },
  {
    "text": "‘NCIS: Origins’ Co-Showrunner Gina Lucita Monreal Leaving CBS Series After 2 Seasons - Deadline",
    "fullText": "'NCIS: Origins' Co-Showrunner Gina Lucita Monreal Leaving CBS Series After 2 Seasons",
    "link": "http://deadline.com/2026/01/ncis-origins-co-showrunner-gina-lucita-monreal-leaving-1236700570/"
  },
  {
    "text": "Bruce Springsteen sings out against Trump in ‘Streets of Minneapolis’ - AP News",
    "fullText": "Bruce Springsteen has released a new song, “Streets of Minneapolis,” criticizing President Donald Trump's immigration enforcement. The song describes Minneapolis as “a city aflame” under “King Trump’s private army.” Springsteen says he wrote and recorded it o…",
    "link": "https://apnews.com/article/bruce-springsteen-song-minneapolis-2f4232553bef164d02b1474627dd3b5f"
  },
  {
    "text": "House Republicans fume at Kristi Noem as impeachment push looms - Axios",
    "fullText": "For vulnerable Republicans, the prospect of an impeachment vote tied to enforcement efforts would be particularly painful.",
    "link": "https://www.axios.com/2026/01/28/republicans-congress-noem-impeachment"
  },
  {
    "text": "NASA and SpaceX move up launch of Crew-12 astronauts to Feb. 11 as relief crew after ISS medical evacuation - Space",
    "fullText": "That's four days earlier than originally planned.",
    "link": "https://www.space.com/space-exploration/human-spaceflight/nasa-and-spacex-move-up-launch-of-crew-12-astronauts-to-feb-11-as-relief-crew-after-iss-medical-evacuation"
  },
  {
    "text": "A 'bomb cyclone' and 'nor'easter' could be in the forecast for the East Coast this weekend. What are they, exactly? - Yahoo",
    "fullText": null,
    "link": "https://www.yahoo.com/news/weather-news/article/a-bomb-cyclone-and-noreaster-could-be-in-the-forecast-for-the-east-coast-this-weekend-what-are-they-exactly-222536911.html"
  },
  {
    "text": "Teenage girl who lived in Italy 12,000 years ago had a rare form of dwarfism, DNA study shows - Live Science",
    "fullText": "In 1963, researchers unearthed two Stone Age skeletons that were buried in an embraced position in a cave in Italy. Now, DNA testing has revealed that one of them had a rare genetic condition.",
    "link": "https://www.livescience.com/archaeology/teenage-girl-who-lived-in-italy-12-000-years-ago-had-a-rare-form-of-dwarfism-dna-study-shows"
  },
  {
    "text": "First pediatric flu death in Washington state highlights rising cases across the state - komonews.com",
    "fullText": "A school-age teenager has died after becoming ill from influenza last week, marking the first pediatric influenza death in the state this season.",
    "link": "https://komonews.com/news/local/snohomish-county-teen-flu-season-death-health-department-vaccine-washington-state-department-of-health-covid-rsv-hospital-flu-cases-across-western-washington"
  },
  {
    "text": "Brandon Sanderson’s Literary Fantasy Universe ‘Cosmere’ Picked Up by Apple TV (Exclusive) - hollywoodreporter.com",
    "fullText": "It's an unprecedented deal for the author, whose 'Mistborn' series and 'The Stormlight Archive' are being eyed for film and television adaptation, respectively.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/brandon-sandersons-mistborn-stormlight-archive-movie-tv-1236487271/"
  }
]