[
  {
    "text": "Hoyer endorses former campaign manager in race to succeed him in Congress - The Washington Post",
    "fullText": "The longtime congressman and No. 2 House Democrat is backing Adrian Boafo, a member of the Maryland House of Delegates representing Prince George’s County.",
    "link": "https://www.washingtonpost.com/politics/2026/01/23/steny-hoyer-house-seat-maryland/"
  },
  {
    "text": "On Greenland, Europe stood up, Trump blinked, and the E.U. learned a lesson - The Washington Post",
    "fullText": "For some in the often fractured E.U., Trump’s retreat on the Arctic territory proves that retaliation — not conciliation — is the answer to his hardball tactics.",
    "link": "https://www.washingtonpost.com/world/2026/01/23/europe-trump-greenland-pushback-nato/"
  },
  {
    "text": "Winter storm updates: Heavy snow, crippling ice and frigid temperatures forecast to hit more than 2 dozen states this weekend - Yahoo",
    "fullText": "Meteorologists say it could be one of the most significant winter events this season.",
    "link": "https://www.yahoo.com/news/weather-news/live/winter-storm-updates-heavy-snow-crippling-ice-and-frigid-temperatures-forecast-to-hit-more-than-2-dozen-states-this-weekend-154833002.html"
  },
  {
    "text": "ARC Raiders Roadmap: January - April 2026 - arcraiders.com",
    "fullText": "ARC Raiders is a multiplayer extraction adventure, set in a lethal future earth, ravaged by a mysterious mechanized threat known as ARC.",
    "link": "https://arcraiders.com/news/roadmap-january-april-2026"
  },
  {
    "text": "Google Photos’ latest feature lets you meme yourself - TechCrunch",
    "fullText": "The new feature lets you insert yourself into a meme in Google Photos.",
    "link": "https://techcrunch.com/2026/01/23/google-photos-latest-feature-lets-you-meme-yourself/"
  },
  {
    "text": "5 arrested in connection with shooting of Indiana judge and his wife - NBC News",
    "fullText": "Police have arrested five people as part of a multi-state investigation into the shooting of an Indiana judge and his wife while they were at home on Sunday",
    "link": "https://www.nbcnews.com/news/us-news/5-arrested-connection-shooting-indiana-judge-wife-rcna255555"
  },
  {
    "text": "Spanish track was fractured before high-speed train disaster, report finds - BBC",
    "fullText": "The preliminary report into the crash that left 45 people dead finds evidence of a fracture more than two hours earlier.",
    "link": "https://www.bbc.com/news/articles/c1m77dmxlvlo"
  },
  {
    "text": "One in five Americans can’t afford their heating bills this winter as people are blindsided by utility costs - MarketWatch",
    "fullText": "A huge winter storm this weekend could be just the latest strain on Americans’ utility expenses",
    "link": "https://www.marketwatch.com/story/one-in-five-americans-cant-afford-their-heating-bills-this-winter-as-the-seasonal-cost-nears-1-000-on-average-17cd6edc"
  },
  {
    "text": "Monster Neutrino Could Be a Messenger of Ancient Black Holes - Quanta Magazine",
    "fullText": "Primordial black holes could rewrite our understanding of dark matter and the early universe. A record-breaking detection at the bottom of the Mediterranean Sea has some physicists wondering if we just spotted one.",
    "link": "https://www.quantamagazine.org/monster-neutrino-could-be-a-messenger-of-ancient-black-holes-20260123/"
  },
  {
    "text": "Live updates: Minnesota ‘economic blackout’ planned in protest of ICE as immigration crackdown fuels tensions - CNN",
    "fullText": "There are heightened tensions over the Trump administration’s expansive immigration crackdown. Follow for live updates.",
    "link": "https://www.cnn.com/us/live-news/ice-minnesota-minneapolis-maine-immigration-01-23-26"
  },
  {
    "text": "Ex-lineman Kevin Johnson killed at L.A. encampment, examiner says - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nfl/story/_/id/47704777/ex-lineman-kevin-johnson-killed-la-encampment-examiner-says"
  },
  {
    "text": "NATO veterans say Trump 'crossed red line' questioning their Afghan service - NBC News",
    "fullText": "Veterans from across Europe hit back at U.S.",
    "link": "https://www.nbcnews.com/world/united-kingdom/trump-comments-nato-troops-deeply-disappointing-uk-officials-rcna255563"
  },
  {
    "text": "Will Seahawks beat Rams? Rounding up national media predictions - The Seattle Times",
    "fullText": "The Seahawks are riding high as we head toward Sunday's NFC Championship Game. But pundits are expecting plenty of drama.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-vs-rams-national-media-predict-who-will-win-nfc-championship-game/"
  },
  {
    "text": "NASA is about to send people to the moon — in a spacecraft not everyone thinks is safe to fly - CNN",
    "fullText": "As the four-person crew of Artemis II prepares to launch on a historic mission around the moon as soon as February, some experts are worried about the spacecraft’s heat shield.",
    "link": "https://www.cnn.com/2026/01/23/science/artemis-2-orion-capsule-heat-shield"
  },
  {
    "text": "Davos is back — but the world it once championed is gone - politico.eu",
    "fullText": "This year’s World Economic Forum featured big names and a sharp shift in focus.",
    "link": "https://www.politico.eu/article/world-economic-forum-davos-global-order/"
  },
  {
    "text": "Trump covets mineral-rich Greenland, but what natural resources does it actually have? - BBC",
    "fullText": "Greenland's natural resources include large reserves of rare earth deposits.",
    "link": "https://www.bbc.com/news/articles/cly9230yw15o"
  },
  {
    "text": "The Battle Between Tom Brady’s Heirs for a Spot in the Super Bowl - The Wall Street Journal",
    "fullText": "Jarrett Stidham was once drafted as a potential successor to the New England quarterback. Instead, he’ll be lining up against Drake Maye and the Patriots in Sunday’s AFC Championship.",
    "link": "https://www.wsj.com/sports/football/jarrett-stidham-denver-broncos-drake-maye-e835ec17"
  },
  {
    "text": "Chicago weather today: Wind chill temperatures become frigid; school closings in place amid Cook County, IL Extreme Cold Warning - abc7chicago.com",
    "fullText": "The U.S. is bracing for major winter storm, which could bring snow to parts of the Chicago area.",
    "link": "https://abc7chicago.com/post/chicago-weather-today-wind-chill-temperatures-become-frigid-school-closings-place-amid-cook-county-il-extreme-cold-warning/18453572/"
  },
  {
    "text": "Trump’s war on Wall Street landlords could raise your rent - vox.com",
    "fullText": "Donald Trump signed an executive order this week restricting institutional investment in single-family homes. But his war on Wall Street landlords could backfire.",
    "link": "https://www.vox.com/politics/476101/trump-ban-institutional-investors-wall-street-corporate-single-family-homes"
  }
]