[
  {
    "text": "Trump says U.K. ‘stupidity’ on Chagos Islands justifies Greenland demands - The Washington Post",
    "fullText": null,
    "link": "https://www.washingtonpost.com/world/2026/01/20/trump-britain-greenland-chagos-islands/"
  },
  {
    "text": "Trump tariffs live updates: Trump heads to Davos as Greenland threats roil world, markets - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-trump-heads-to-davos-as-greenland-threats-roil-world-markets-152657810.html"
  },
  {
    "text": "Dow slides 870 points, S&P 500 drops 2% for worst day since October on Trump tariff threat over Greenland: Live updates - cnbc.com",
    "fullText": "Treasury yields spiked and the U.S. dollar declined as Trump's threat caused a flight from U.S. assets.",
    "link": "https://www.cnbc.com/2026/01/19/stock-market-today-live-updates.html"
  },
  {
    "text": "United Airlines could hit record earnings after strong start to 2026 - cnbc.com",
    "fullText": "United Airlines said 2026 is off to a strong start, both for premium seats and no-frills tickets, as it reported fourth-quarter earnings.",
    "link": "https://www.cnbc.com/2026/01/20/united-airlines-ual-4q-2025-earnings.html"
  },
  {
    "text": "Turner Classic Movies: The Unexpected Wrinkle that Sent Warner Bros. Discovery Stock (NASDAQ:WBD) Slipping - TipRanks",
    "fullText": null,
    "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOaVFNYWRNX3VZN1RaZXZJNlVhaW5FTnFvaS1xZ1plblNBNDZnbnFwOTdqS0pVTDZycS1ON1Bqbk1seXdTOEtld2xfYlM5QkxuRnNsczBDd3NCdTRtLWdWNm9qU09GTzNacXk3cjVFZVpxdHR5XzZBcFVxeV8xcEY3czNFdnNZYUhYb0pwUnJfRFNoeUtYbFJvdEoxSzFqNklRYjRaTUlsUjlSWmo0NFJpWHVKRTlHMG9qMEhfTWE4czNjS29BcUs4TzdZMA?oc=5"
  },
  {
    "text": "‘Free America Walkout’ brings protesters to downtown Columbus in bitter cold - dispatch.com",
    "fullText": "Roughly 150 demonstrators gathered at 2 p.m. Jan. 20 as part of a nationwide protest marking the anniversary of President Trump’s inauguration.",
    "link": "https://www.dispatch.com/story/news/local/2026/01/20/free-america-walkout-planned-columbus-cities-ohio-protest/88264188007/"
  },
  {
    "text": "Man City stunned by tiny Bodø/Glimt in huge Champions League upset and Arsenal into round of 16 - AP News",
    "fullText": "Manchester City has lost 3-1 at tiny Norwegian club Bodø/Glimt in one of the most humiliating upsets in Champions League history, while defending champion Paris Saint-Germain was also on the end of an unexpected defeat at Sporting Lisbon. Vinícius Júnior turn…",
    "link": "https://apnews.com/article/champions-league-madrid-psg-arsenal-man-city-scores-92e27633e5d3026b422fbca3df384b22"
  },
  {
    "text": "China meets initial soybean purchase goal, but Trump's shifting trade policy could disrupt deal - Yahoo Finance",
    "fullText": "China has fulfilled its initial commitment to buy 12 million metric tons of soybeans from the U.S., but it's not clear if the trade agreement announced in...",
    "link": "https://finance.yahoo.com/news/china-meets-initial-soybean-purchase-200231069.html"
  },
  {
    "text": "Judge bans Trump loyalist Lindsey Halligan from 'masquerading' as top federal prosecutor - NBC News",
    "fullText": "WASHINGTON — A federal judge has barred Trump loyalist Lindsey Halligan from \"masquerading\" as the top federal prosecutor in the Eastern District of Virginia, but said he would allow her to avoid attorney disciplinary proceedings for now \"in light of her inex…",
    "link": "https://www.nbcnews.com/politics/justice-department/judge-posts-job-opening-top-prosecutor-spot-doj-claims-lindsey-halliga-rcna254982"
  },
  {
    "text": "Even George R.R. Martin Was Surprised by That Poop Scene in 'A Knight of the Seven Kingdoms' - Gizmodo",
    "fullText": "Toilet humor arrives early in the series premiere of HBO's new 'Game of Thrones' spinoff.",
    "link": "https://gizmodo.com/knight-of-the-seven-kingdoms-poop-scene-george-rr-martin-2000712028"
  },
  {
    "text": "'It Ends With Us' Actresses Back Up Lively's 'False Ally' Claims About Baldoni - TMZ",
    "fullText": "As Blake Lively continues her legal battle against her \"It Ends With Us\" co-star Justin Baldoni concerning alleged inappropriate behavior, we now have evidence several more women associated with the film's production had huge issues with Baldoni at the time.",
    "link": "https://www.tmz.com/2026/01/20/it-ends-with-us-jenny-slate-others-justin-baldoni/"
  },
  {
    "text": "The US is on the verge of losing its measles elimination status. Here’s why that matters - AP News",
    "fullText": "International health officials will meet in a few months to reevaluate the United States’ measles-free status. Experts fear the vaccine-preventable virus has regained a foothold and that the U.S. may soon follow Canada in losing the achievement of having elim…",
    "link": "https://apnews.com/article/us-measles-elimination-mexico-6f0bc8f7ef31d5ef82492e42ccb38e47"
  },
  {
    "text": "NASA Unlocks Golden Age of Innovation, Exploration in Trump’s First Year - NASA (.gov)",
    "fullText": "One year into President Donald J. Trump’s second term, NASA is delivering measurable progress across human spaceflight, science, aeronautics, and cutting-edge",
    "link": "https://www.nasa.gov/news-release/nasa-unlocks-golden-age-of-innovation-exploration-in-trumps-first-year/"
  },
  {
    "text": "Drug pricing, patent losses and deals: Here's what pharma execs see ahead in the industry - CNBC",
    "fullText": "Big pharma is grappling with new drug pricing deals and roughly $300 billion in potential lost revenue from patent expirations of blockbuster drugs.",
    "link": "https://www.cnbc.com/2026/01/20/drug-pricing-patent-losses-deals-novo-nordisk-pfizer.html"
  }
]