[
  {
    "text": "What to know about widespread snowfall in north Georgia - WSB-TV",
    "fullText": "Accumulating snow will move into north Georgia and metro Atlanta on Saturday.",
    "link": "https://www.wsbtv.com/news/local/what-know-about-widespread-snowfall-north-georgia/GNEI6YFFDBHYJKEDUZLL7FMTVQ/"
  },
  {
    "text": "The latest Instax printer is a pricey but worthy upgrade - The Verge",
    "fullText": "Fujifilm’s most expensive Instax Mini Link+ printer improves contrast, color, and detail but doesn’t seem to enhance text-heavy illustrations as claimed.",
    "link": "https://www.theverge.com/tech/870603/fujifilm-instax-mini-link-plus-reivew-improved-photos"
  },
  {
    "text": "Unrivaled players rave over record crowd at Philly tour stop - ESPN",
    "fullText": "Unrivaled co-founder Napheesa Collier said it was \"unbelievable\" to see a record 21,490 fans attend the 3-on-3 league's inaugural tour stop in Philadelphia.",
    "link": "https://www.espn.com/wnba/story/_/id/47784462/unrivaled-players-rave-record-crowd-philly-tour-stop"
  },
  {
    "text": "Trump taps career staffer to lead statistics agency whose chief he fired - The Washington Post",
    "fullText": "The agency has been without a permanent leader since August when Trump fired its previous commissioner Erika McEntarfer over a weaker-than-expected jobs report.",
    "link": "https://www.washingtonpost.com/business/2026/01/30/trump-nominates-matsumoto-bls/"
  },
  {
    "text": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "fullText": "Some tense moments unfolded as police declared a dispersal order following the \"ICE Out\" protest in downtown L.A. on Friday.",
    "link": "https://abc7.com/live-updates/live-updates-protesters-clash-officers-during-ice-protest-downtown-la/18511419/"
  },
  {
    "text": "Hawaii health officials investigate chickenpox outbreak at Kauai school - Honolulu Star-Advertiser",
    "fullText": "The Hawaii Department of Health today said it is investigating an outbreak of chickenpox at Kilauea Elementary School on Kauai.",
    "link": "https://www.staradvertiser.com/2026/01/30/breaking-news/hawaii-health-officials-investigate-chickenpox-outbreak-at-kauai-school/"
  },
  {
    "text": "4 takeaways from No. 3 Michigan Basketball’s win at No. 7 MSU - Maize n Brew",
    "fullText": "Michigan Basketball just won at Michigan State for the first time since 2018. Here are 4 takeaways from the Wolverines’ huge win:",
    "link": "https://www.maizenbrew.com/michigan-mens-basketball/105025/michigan-basketball-takeaways-michigan-state-yaxel-lendeborg-jeremy-fears-dusty-may-tom-izzo"
  },
  {
    "text": "Pushed by Trump, US allies are resetting relations with China - AP News",
    "fullText": "Leaders from Canada, the United Kingdom, Finland and other countries have recently visited China, while more are planning to go. In a major shift to the world order since President Donald Trump took office again, America’s closest allies are exploring opportu…",
    "link": "https://apnews.com/article/china-trump-europe-allies-trade-greenland-ff445f3c6e2c52d6229d05441aae23f0"
  },
  {
    "text": "Measles case identified in traveler at Seattle-Tacoma International Airport - KOMO",
    "fullText": "A measles case has been identified in a traveler who passed through Seattle-Tacoma International Airport, health officials said.SEE ALSO |Snohomish County meas",
    "link": "https://komonews.com/news/local/measles-case-identified-in-traveler-at-seattle-tacoma-international-airport-washington-state-measles-outbreak-snohomish-county-measles-king-county-health"
  },
  {
    "text": "Doncic makes history in nation’s capital after dominating performance - New York Post",
    "fullText": "Luka Doncic could do no wrong in the nation’s capital.",
    "link": "https://nypost.com/2026/01/30/sports/lakers-doncic-beat-wizards-142-111-friday-night/"
  },
  {
    "text": "Scoop: Saudi defense minister says Trump not bombing Iran would embolden regime - Axios",
    "fullText": "\"At this point, if this doesn't happen, it will only embolden the regime.\"",
    "link": "https://www.axios.com/2026/01/31/saudi-us-strike-iran-kbs-trump"
  },
  {
    "text": "NASA Selects Axiom Space for Fifth Private Mission to Space Station - NASA (.gov)",
    "fullText": "NASA and Axiom Space have signed an order for the fifth private astronaut mission to the International Space Station, targeted to launch no earlier than",
    "link": "https://www.nasa.gov/news-release/nasa-selects-axiom-space-for-fifth-private-mission-to-space-station/"
  },
  {
    "text": "NASA's Artemis 2 mission to the moon puts Crew-12 SpaceX launch in delicate dance - Space",
    "fullText": "Artemis seems to be NASA's primary focus.",
    "link": "https://www.space.com/space-exploration/human-spaceflight/nasas-artemis-2-mission-to-the-moon-puts-crew-12-spacex-launch-in-delicate-dance"
  },
  {
    "text": "Natasha Cloud has stern warning for WNBA with tense CBA talk set to resume - New York Post",
    "fullText": "The league’s key figures are set to participate in the high-stakes, in-person meeting Monday that some believe could be an inflection point in negotiations.",
    "link": "https://nypost.com/2026/01/30/sports/natasha-cloud-has-stern-warning-for-wnba-with-cba-talks-set-to-resume/"
  },
  {
    "text": "Trump says Iran wants a deal rather than face military action - BBC",
    "fullText": "Tehran has said it will never negotiate on its missile and defence systems, but that it is open to talks.",
    "link": "https://www.bbc.com/news/articles/cd9ew2kwj0lo"
  },
  {
    "text": "Judges across the country rebuke ICE for defying court orders - Politico",
    "fullText": "They are increasingly castigating what they say are systematic legal and constitutional abuses by the administration.",
    "link": "https://www.politico.com/news/2026/01/30/ice-immigration-court-orders-00757894"
  },
  {
    "text": "Large Hadron Collider reveals 'primordial soup' of the early universe was surprisingly soupy - Space",
    "fullText": "Waiter, there's a quark in my soup!",
    "link": "https://www.space.com/science/particle-physics/large-hadron-collider-reveals-primordial-soup-of-the-early-universe-was-surprisingly-soupy"
  },
  {
    "text": "GameStop's Ryan Cohen eyes 'very big' consumer megadeal that could increase company's value tenfold - CNBC",
    "fullText": "Ryan Cohen wouldn't say whether he would sell GameStop's bitcoin to try to pull off a major acquisition.",
    "link": "https://www.cnbc.com/2026/01/30/gamestop-ceo-ryan-cohen-targets-consumer-mega-deal.html"
  },
  {
    "text": "New triple-drug treatment stops pancreatic cancer in its tracks, a mouse study finds - Live Science",
    "fullText": "By targeting three key growth pathways at once, researchers eliminated pancreatic tumors in multiple mouse models and prevented the cancer from returning, a promising step toward overcoming treatment resistance.",
    "link": "https://www.livescience.com/health/cancer/new-triple-drug-treatment-stops-pancreatic-cancer-in-its-tracks-a-mouse-study-finds"
  }
]