[
  {
    "text": "Super Bowl LX menu includes outrageous $180 burger as fans forced to spend $17 on beer - themirror.com",
    "fullText": "Creative Bay Area-themed dishes will await hungry NFL fans at the Levi's Stadium concession stands, although the feast won't come cheap",
    "link": "https://www.themirror.com/sport/american-football/super-bowl-food-drinks-prices-1669777"
  },
  {
    "text": "'Killjoy' - did VAR get late drama in Liverpool v Man City right? - BBC",
    "fullText": "Manchester City's win at Liverpool ended in complete chaos - but did the referee and the VAR get Dominik Szoboszlai's red card right?",
    "link": "https://www.bbc.com/sport/football/articles/c5yjkgyxk2mo"
  },
  {
    "text": "Moderate Republican willing to break with party is set to lead ICE hearing - The Washington Post",
    "fullText": "Rep. Andrew Garbarino (R-New York) faces the challenge of leading the questioning of top immigration officials at the peril of angering the White House.",
    "link": "https://www.washingtonpost.com/politics/2026/02/08/andrew-garbarino-house-ice-hearing/"
  },
  {
    "text": "Trump cut science funding. Small businesses are paying the price. - Politico",
    "fullText": "Some federal contractors are feeling the squeeze after the president slashed support for climate programs and other research efforts.",
    "link": "https://www.politico.com/news/2026/02/08/trump-cut-science-funding-now-small-businesses-are-paying-the-price-00765051"
  },
  {
    "text": "‘Melania’ falls steeply and ‘Send Help’ holds steady at No. 1 on a quiet weekend in theaters - AP News",
    "fullText": "Hollywood is largely ceding attention to football this weekend. The survival thriller “Send Help” repeated as the weekend's No. 1 film at the box office and the Melania Trump documentary “Melania” fell sharply in its second weekend. Super Bowl weekend is typi…",
    "link": "https://apnews.com/article/box-office-scream-7-melania-f0d26c19af33c0e5ded9a1c6b8ae79d0"
  },
  {
    "text": "“The Moment” is Charli xcx’s disturbing sellout fantasy - Salon.com",
    "fullText": "In her concept film, the \"Brat\" singer succumbs to a world where success isn't enough. It looks a lot like our own.",
    "link": "https://www.salon.com/2026/02/08/the-moment-is-charli-xcxs-disturbing-sellout-fantasy/"
  },
  {
    "text": "‘I think I could be done’: Jon Jones gives update on UFC future - MMA Fighting",
    "fullText": "Jon Jones appears to be leaning towards retirement for good from UFC competition.",
    "link": "https://www.mmafighting.com/ufc/471030/i-think-i-could-be-done-jon-jones-gives-update-on-ufc-future"
  },
  {
    "text": "Former MLB, Mets OF Terrance Gore dies at 34 - SNY",
    "fullText": "Former Mets outfielder and eight-year MLB veteran Terrance Gore has died at the age of 34.",
    "link": "https://sny.tv/articles/former-mlb-mets-terrance-gore-dies-34"
  },
  {
    "text": "Andrew shared confidential information with Epstein as trade envoy, files suggest - BBC",
    "fullText": "Under official guidance, trade envoys have a duty of confidentiality over sensitive, commercial, or political information.",
    "link": "https://www.bbc.com/news/articles/c99j01p1yjro"
  },
  {
    "text": "Fetterman: 'I absolutely would expect' another government shutdown - Politico",
    "fullText": "The Democratic senator said he doesn’t see a path toward a deal on Homeland Security funding.",
    "link": "https://www.politico.com/news/2026/02/08/fetterman-government-shutdown-00770652"
  },
  {
    "text": "Wes Moore suggests race may be why he was not invited to gov dinner with Trump - Politico",
    "fullText": "The nation’s only sitting Black governor was not invited to a traditionally bipartisan event involving the National Governors Association and the White House.",
    "link": "https://www.politico.com/news/2026/02/08/wes-moore-race-governors-trump-00770586"
  },
  {
    "text": "Morgan McSweeney quits as PM's chief of staff following Mandelson scandal - BBC",
    "fullText": "Keir Starmer and McSweeney decided it was the right time for him to leave, the BBC understands, as Jill Cuthbertson and Vidhya Alakeson are appointed acting chiefs of staff.",
    "link": "https://www.bbc.com/news/live/c74wd01egvyt"
  },
  {
    "text": "NYC temperatures could cause frostbite in minutes this weekend - Gothamist",
    "fullText": "At least 17 people have died in the cold since Jan. 24.",
    "link": "https://gothamist.com/news/nyc-temperatures-could-cause-frostbite-in-minutes-saturday-night-and-sunday"
  },
  {
    "text": "Apple Prepares to Kick Off 2026 With the iPhone 17e, New iPads and Macs - Bloomberg.com",
    "fullText": "Apple is going to begin a 2026 product blitz with the iPhone 17e, updated iPads and fresh Macs. Also: Here’s exactly what CEO Tim Cook told employees about immigration, artificial intelligence and the company’s 50th anniversary during an all-hands meeting. La…",
    "link": "https://www.bloomberg.com/news/newsletters/2026-02-08/apple-readies-iphone-17e-new-siri-entry-level-ipad-ipad-air-and-macbook-pro-mldr3hpk"
  },
  {
    "text": "These 6 apps make my Google Pixel feel complete - Android Police",
    "fullText": "The Pixel starter pack",
    "link": "https://www.androidpolice.com/these-apps-make-pixel-feel-complete/"
  },
  {
    "text": "Who's singing the national anthem at the 2026 Super Bowl? All about Charlie Puth - cbsnews.com",
    "fullText": "Charlie Puth has called the national anthem \"one of the most beautiful pieces of music.\" But he's also described it as \"the hardest to sing.\"",
    "link": "https://www.cbsnews.com/news/charlie-puth-super-bowl-national-anthem-2026/"
  },
  {
    "text": "Bill Gates is shedding houses that are part of his $132 million Xanadu 2.0 compound - Fortune",
    "fullText": "The latest listing goes to show how much of the exclusive hillside neighborhood Gates has acquired during the past three decades.",
    "link": "https://fortune.com/2026/02/08/bill-gates-house-for-sale-xanadu-2-seattle-washington-reversal-on-downsizing/"
  }
]