[
  {
    "text": "When did humanity take its first step? Scientists say they now know. - The Washington Post",
    "fullText": "A new analysis of fossils uncovered in Central Africa offers additional evidence that a human ancestor walked upright 7 million years ago.",
    "link": "https://www.washingtonpost.com/science/2026/01/02/human-ancestor-biped/"
  },
  {
    "text": "Earthquake with 6.5 magnitude rattles southern and central Mexico killing 2 - NBC News",
    "fullText": "MEXICO CITY — A strong earthquake rattled southern and central Mexico on Friday, interrupting President Claudia Sheinbaum ’s first press briefing of the new year as seismic alarms sounded and leaving at least two people dead",
    "link": "https://www.nbcnews.com/world/mexico/earthquake-65-magnitude-rattles-southern-central-mexico-killing-2-rcna252008"
  },
  {
    "text": "California's open carry ban unconstitutional, appeals court rules - NBC News",
    "fullText": "Judge Lawrence VanDyke, a Trump appointee, said in the 2-1 decision that the state law could not stand under the Supreme Court’s 2022 landmark gun rights ruling.",
    "link": "https://www.nbcnews.com/politics/politics-news/california-open-carry-ban-unconstitutional-appeals-court-rules-rcna252007"
  },
  {
    "text": "Is Trump taking too much aspirin? Here's what experts say - NPR",
    "fullText": "Trump takes four times the recommended dose of aspirin for cardiac prevention. Even low-dose aspirin is no longer recommended for people over 60 who don't have heart disease.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/02/nx-s1-5665112/trump-aspirin-325-81-mg-low-dose-cardiac-stroke-heart-attack-bleeding"
  },
  {
    "text": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Sugar-recap.aspx"
  },
  {
    "text": "Missing Alabama boy, 4, found dead 2 miles from home: Police - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/missing-alabama-boy-4-found-dead-2-miles/story?id\\\\u003d128845278"
  },
  {
    "text": "Anthrax nearly kills healthy 18-year-old welder amid puzzling pattern - Ars Technica",
    "fullText": "Welder's Anthrax\" was first coined in 2022, when seven cases had been identified.",
    "link": "https://arstechnica.com/health/2026/01/anthrax-nearly-kills-healthy-18-year-old-welder-amid-puzzling-pattern/"
  },
  {
    "text": "Mamdani defends eliminating executive orders on antisemitism, boycotting Israel - Politico",
    "fullText": "The mayor incurred criticism from local Jewish organizations and the Israeli government over the move.",
    "link": "https://www.politico.com/news/2026/01/02/mamdani-defends-eliminating-executive-orders-on-antisemitism-boycotting-israel-00709472"
  },
  {
    "text": "Ohio police seek suspect after dentist and his wife found shot to death at home - CBS News",
    "fullText": "Officers in Columbus, Ohio, were dispatched to the couple's home on the morning Dec. 30 for a welfare check and found them dead at the scene.",
    "link": "https://www.cbsnews.com/news/columbus-ohio-dentist-shot-killed-spencer-tepe-wife-monique/"
  },
  {
    "text": "49ers take 7-1 record vs. Seahawks into showdown for No. 1 seed - NBC Sports",
    "fullText": "The Seahawks have the better record, at 13-3.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/49ers-take-7-1-record-vs-seahawks-into-showdown-for-no-1-seed"
  },
  {
    "text": "Stock Market Today: Dow Up With 'January Barometer' On Watch; Nvidia Stock Climbs (Live Coverage) - Investor's Business Daily",
    "fullText": "Stock Market Today: The Dow Jones index traded mixed Friday. Tesla stock fell after weak fourth-quarter delivery news.",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-tesla-stock-tsla-deliveries-2/"
  },
  {
    "text": "Victoria Jones, daughter of Tommy Lee Jones, found dead in San Francisco hotel. She was 34 - ABC7 Los Angeles",
    "fullText": "An investigation is underway after Victoria Jones, the daughter of Tommy Lee Jones, was found dead at the Fairmont San Francisco hotel. She was 34.",
    "link": "https://abc7.com/post/victoria-jones-daughter-tommy-lee-found-dead-san-francisco-hotel-she-was-34/18343281/"
  },
  {
    "text": "Tesla sales fall to lowest point since 2022 - Axios",
    "fullText": "Vehicle sales are critical to funding CEO Elon Musk's AI ambitions.",
    "link": "https://www.axios.com/2026/01/02/tesla-sales-ev-elon-musk"
  },
  {
    "text": "DHS hypes worksite enforcement as fraud allegations rip through Minnesota - Axios",
    "fullText": "Sec. Noem says there's \"more coming\" as ICE focuses on businesses.",
    "link": "https://www.axios.com/2026/01/02/dhs-noem-minnesota-fraud"
  },
  {
    "text": "Elon Musk's Grok under fire for generating explicit AI images of minors - Axios",
    "fullText": "One user asked Grok to remove clothing from an image of a 14-year-old \"Stranger Things\" actress.",
    "link": "https://www.axios.com/2026/01/02/elon-musk-grok-ai-child-abuse-images-stranger-things"
  },
  {
    "text": "31 Of The Biggest And Coolest 2026 Games We Can't Wait To Play - Kotaku",
    "fullText": "Grand Theft Auto 6, Wolverine, Slay The Spire 2, Resident Evil Requiem, and much, much more are set to arrive this year",
    "link": "https://kotaku.com/2026-game-releases-most-anticipated-batman-gta-6-wolverine-2000656197"
  },
  {
    "text": "New York reports record-breaking number of flu hospitalizations in a single week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-york-reports-record-breaking-number-flu-hospitalizations/story?id\\\\u003d128849108"
  }
]