[
  {
    "text": "Trump leaves Republicans guessing on midterms plans as outlook darkens - The Washington Post",
    "fullText": "The president is said to be eager to increase his involvement but has yet to approve a spending plan for his $300 million-plus war chest.",
    "link": "https://www.washingtonpost.com/politics/2026/02/09/trump-midterm-plans/"
  },
  {
    "text": "Column | Want to lose weight? Here’s why exercise probably won’t help. - The Washington Post",
    "fullText": "The benefits of exercise are numerous, but losing weight isn’t one of them. Here are some better motivations to add regular exercise to your routine.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/09/exercise-weight-loss/"
  },
  {
    "text": "2026 NFL Mock Draft 1.0: Raiders take Fernando Mendoza, Steelers land Ty Simpson - NBC Sports",
    "fullText": "Connor Rogers' first 2026 NFL Mock Draft has two quarterbacks going in the first round, including Fernando Mendoza at No. 1.",
    "link": "https://www.nbcsports.com/nfl/news/2026-nfl-mock-draft-fernando-mendoza-jeremiyah-love-ty-simpson"
  },
  {
    "text": "Exclusive | Kroger Names an Ex-Walmart Executive as Its Next CEO - The Wall Street Journal",
    "fullText": "Greg Foran takes over big grocer as it deals with cash-strapped shoppers and seeks to expand its footprint",
    "link": "https://www.wsj.com/business/retail/kroger-ceo-greg-foran-walmart-c4885390"
  },
  {
    "text": "Bonobos are capable of pretend play, just like human children - cnn.com",
    "fullText": "Children love to play pretend, holding imaginary tea parties, educating classrooms of teddies or running their own grocery stores.  Now, a new study suggests that such make-believe play is not a uniquely human talent, but a skill that great apes also possess.",
    "link": "https://www.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli"
  },
  {
    "text": "Capitol agenda: Republicans prepare DHS punt - Politico",
    "fullText": "It's highly unlikely all sides can agree to a full-year Department of Homeland Security revamp by Friday at midnight.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/dhs-shutdown-funding-bill-continuing-resolution-00771028"
  },
  {
    "text": "Chris Mason: Starmer's predicament is dire and now he faces future without top aides - BBC",
    "fullText": "Sir Keir Starmer's administration appears rudderless after the loss of two key aides, writes Chris Mason.",
    "link": "https://www.bbc.com/news/articles/ce3g8e7n07jo"
  },
  {
    "text": "She's not old enough for a driver's license. But at 15, she's the youngest U.S. Olympian. - NBC News",
    "fullText": "To understand how the freestyle skier Abby Winterberger became, at just 15 years old, the youngest member of Team USA at the Milan Cortina Winter Olympics, it’s necessary to understand her fearlessness",
    "link": "https://www.nbcnews.com/sports/olympics/not-old-enough-drivers-license-15-youngest-us-olympian-rcna257416"
  },
  {
    "text": "Novo Nordisk sues Hims & Hers over cheaper copycat versions of Wegovy pill, injections - CNBC",
    "fullText": "Novo is asking the court to permanently ban Hims from selling compounded versions of its drugs that infringe patents, and is seeking to recover damages.",
    "link": "https://www.cnbc.com/2026/02/09/novo-nordisk-sues-hims-hers-compounded-obesity-drugs.html"
  },
  {
    "text": "‘Don’t jump in them': Olympic athletes’ medals break during celebrations - AP News",
    "fullText": "Handle with care. That’s the message from gold medalist Breezy Johnson at the Milan Cortina Winter Olympics after she and other athletes found their medals broke within hours. Olympic organizers are investigating with “maximum attention” after a spate of meda…",
    "link": "https://apnews.com/article/winter-olympics-broken-medals-breezy-johnson-liu-bcda5ba297fe0b0da618e38f0f53d93a"
  },
  {
    "text": "Treasuries Fall as China Banks Asked to Limit Bond Holdings - Yahoo Finance",
    "fullText": "Treasuries extended losses after Chinese regulators were said to have advised the nation's financial institutions to rein in their holdings of US government ...",
    "link": "https://finance.yahoo.com/news/treasuries-fall-china-banks-asked-081715745.html"
  },
  {
    "text": "Eritrea accuses Ethiopia of fabricating report its troops had crossed the border - BBC",
    "fullText": "Ethiopia had alleged that Eritrean soldiers were on its territory and supporting rebels in the north.",
    "link": "https://www.bbc.com/news/articles/cn87lzrj1l7o"
  },
  {
    "text": "A 'Shark Tank' alum needed cash to pay tariffs. This shadowy lending world was ready - NPR",
    "fullText": "How about $350,000 within hours? The pitches flood small businesses: \"No hidden fees, No BS.\" These financial lifelines are barely regulated and can turn into trip wires.",
    "link": "https://www.npr.org/2026/02/09/nx-s1-5628425/shark-tank-tariffs-loans-cash-advance"
  },
  {
    "text": "Inside the ‘Cigar SCIF:' How Tom Cole pulled off a House appropriations miracle - Politico",
    "fullText": "From his clubby Capitol office, the 76-year-old Appropriations chair managed demanding colleagues and political headwinds — and pulled off a seemingly impressive feat.",
    "link": "https://www.politico.com/news/2026/02/09/tom-cole-house-appropriations-profile-00770360"
  },
  {
    "text": "Albert Breer’s Super Bowl Takeaways: Patriots’ Path Will Get Tougher in 2026 - Sports Illustrated",
    "fullText": "After a season that went further than anyone imagined, New England will turn its attention to what’s ahead. Plus, news from around the league.",
    "link": "https://www.si.com/nfl/albert-breer-super-bowl-takeaways-patriots-surprised-themselves-with-success"
  },
  {
    "text": "Hong Kong’s Jimmy Lai sentenced to 20 years in prison after landmark national security trial - cnn.com",
    "fullText": "Former Hong Kong media tycoon Jimmy Lai has been sentenced to 20 years in prison, ending a years-long legal battle that has come to define Beijing’s transformational crackdown on the once-freewheeling financial hub.",
    "link": "https://www.cnn.com/2026/02/08/china/jimmy-lai-sentenced-20-years-intl-hnk"
  },
  {
    "text": "No deal: S.F. teachers strike is on - San Francisco Chronicle",
    "fullText": "San Francisco teachers strike will strike Monday, with no additional talks scheduled until noon.",
    "link": "https://www.sfchronicle.com/bayarea/article/sfusd-teachers-schools-strike-21340667.php"
  }
]