[
  {
    "text": "Trump threatens 200% tariff on French wines as Macron reportedly snubs 'Board of Peace' seat - CNBC",
    "fullText": "Trump also reiterated his plans to control Greenland, saying that European leaders \"won't push back too much.\"",
    "link": "https://www.cnbc.com/2026/01/20/trump-threatens-200percent-tariff-on-french-wines-and-champagnes-.html"
  },
  {
    "text": "Lawsuit contests RFK Jr.’s new vaccine guidance for children - The Washington Post",
    "fullText": "Several public health organizations accused the health secretary of packing a key advisory committee with vaccine skeptics, arguing its latest guidance should be voided.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/rfk-childhood-vaccines-lawsuit/"
  },
  {
    "text": "In San Antonio, the nation's largest MLK march takes on added meaning - Texas Public Radio | TPR",
    "fullText": "The nation’s largest Martin Luther King Jr. Day march carries special significance in San Antonio, where a small Black community helped build a tradition that now draws hundreds of thousands each year.",
    "link": "https://www.tpr.org/arts-culture/2026-01-19/in-san-antonio-the-nations-largest-mlk-march-takes-on-added-meaning"
  },
  {
    "text": "Japan 40-Year Bond Yield Hits 4% for First Time Since 2007 Debut - Bloomberg.com",
    "fullText": "The yield on Japan’s 40-year government bond hit 4%, the highest since its debut in 2007 and a first for any maturity of the nation’s sovereign debt in more than three decades.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-20/japan-40-year-bond-yield-hits-4-for-first-time-since-2007-debut-mkluxpba"
  },
  {
    "text": "How to take pictures of the Northern Lights with Google Pixel and other Android phones - 9to5Google",
    "fullText": "The Northern Lights are the most visible they've been in decades, and you can capture it with a picture from Android or Google Pixel phones.",
    "link": "http://9to5google.com/2026/01/19/how-to-take-pictures-northern-lights-android-google-pixel/"
  },
  {
    "text": "After Further Review: Breaking Down the Patriots Defense's Playoff Breakout, Maye Review, and Quick-Hit Notes From Divisional Round Win vs. Texans - New England Patriots",
    "fullText": "The Patriots advanced to the AFC Championship Game thanks to another great defensive performance vs. the Texans on Sunday. Here's how they did it.",
    "link": "https://www.patriots.com/news/after-further-review-breaking-down-the-patriots-defense-s-playoff-breakout-maye-review-and-quick-hit-notes-from-divisional-round-win-vs-texans"
  },
  {
    "text": "ICE Continues to Remove the Worst of the Worst from Minneapolis Streets as DHS Law Enforcement Marks 3,000 Arrests During Operation Metro Surge - Homeland Security (.gov)",
    "fullText": "The U.S. Department of Homeland Security (DHS) released the following statement and information regarding U.S. Immigration and Customs Enforcement (ICE) arrests of dangerous criminal illegal aliens in Minneapolis, Minnesota over the weekend including murderer…",
    "link": "https://www.dhs.gov/news/2026/01/19/ice-continues-remove-worst-worst-minneapolis-streets-dhs-law-enforcement-marks-3000"
  },
  {
    "text": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case - AP News",
    "fullText": "Federal Reserve Chair Jerome Powell will attend the Supreme Court’s oral arguments Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair. The high court is considering whether Presid…",
    "link": "https://apnews.com/article/federal-reserve-jerome-powell-lisa-cook-supreme-court-7f135bd222013d4fe61eb8f03c663676"
  },
  {
    "text": "'Absolutely Rolled': U.S. Officials Blast Canada's Cheap Chinese EV Deal - InsideEVs",
    "fullText": "China Inc.'s biggest move into North America yet has industry officials and politicians on edge. But affordability concerns take center stage.",
    "link": "https://insideevs.com/news/784813/us-china-canada-ev-tariff-recation/"
  },
  {
    "text": "The fastest human spaceflight mission in history crawls closer to liftoff - Ars Technica",
    "fullText": "After a remarkably smooth launch campaign, Artemis II reached its last stop before the Moon.",
    "link": "https://arstechnica.com/space/2026/01/nasas-artemis-ii-rocket-rolls-to-launch-pad-but-key-test-looms-ahead/"
  },
  {
    "text": "Updates: Denmark, Greenland float NATO mission on island - dw.com",
    "fullText": "Denmark's defense minister said he and Greenland's defense minister raised the possibility of a NATO surveillance mission in Greenland in a meeting with the NATO chief Mark Rutte.",
    "link": "https://www.dw.com/en/greenland-updates-denmark-floats-nato-mission-on-island/live-75558976"
  },
  {
    "text": "Chiefs plan to bring back longtime assistant Eric Bieniemy as next OC - NFL.com",
    "fullText": "The Kansas City Chiefs are set to bring back a familiar face to their coaching staff. The Chiefs plan to hire longtime assistant Eric Bieniemy as their next offensive coordinator, NFL Network Insider Tom Pelissero reported on Monday.",
    "link": "https://www.nfl.com/news/chiefs-plan-to-bring-back-longtime-assistant-eric-bieniemy-as-next-oc"
  },
  {
    "text": "Physicists uncover hidden magnetic order in the mysterious pseudogap phase - Phys.org",
    "fullText": "Physicists have uncovered a link between magnetism and a mysterious phase of matter called the pseudogap, which appears in certain quantum materials just above the temperature at which they become superconducting. The findings could help researchers design ne…",
    "link": "https://phys.org/news/2026-01-physicists-uncover-hidden-magnetic-mysterious.html"
  },
  {
    "text": "What deep sea mud is revealing about giant earthquakes along the Pacific Coast - Phys.org",
    "fullText": "Marine turbidites are layers of mud and sand deposited on the deep ocean floor by massive underwater landslides and are often used as a historical record for reconstructing earthquake histories.",
    "link": "https://phys.org/news/2026-01-deep-sea-mud-revealing-giant.html"
  },
  {
    "text": "\"We will be ungovernable\": Resistance 2.0 pivots to disruption - Axios",
    "fullText": "\"Our folks want to do more than just mass mobilization,\" one organizer said.",
    "link": "https://www.axios.com/2026/01/19/trump-administration-protests-resistance"
  },
  {
    "text": "Finger prick blood test trial 'could revolutionise' Alzheimer's diagnosis, say experts - Ground News",
    "fullText": "A new trial has been launched which could see a finger prick blood test \"revolutionise\" the diagnosis of Alzheimer's, experts have said.",
    "link": "https://ground.news/article/alzheimers-finger-prick-blood-test-could-transform-diagnosis-experts-say_2db12a"
  },
  {
    "text": "Gleb Savchenko Makes Out With Mystery Girl in L.A. After Brooks Nader Split - TMZ",
    "fullText": "The produce wasn't the only thing getting fresh at the Farmer's Market over the weekend ... Gleb Savchenko was snapped getting hot and heavy with a new lady!",
    "link": "https://www.tmz.com/2026/01/19/gleb-kissing-mystery-girl-after-brooks-nader-split/"
  },
  {
    "text": "Zurich submits improved proposal to acquire 100% of specialist insurer Beazley - Reinsurance News",
    "fullText": "Zurich Insurance Group has submitted an improved proposal of 1,280 pence in cash per share to acquire specialist insurer Beazley after the latter's Board",
    "link": "https://www.reinsurancene.ws/zurich-submits-improved-proposal-to-acquire-100-of-specialist-insurer-beazley/"
  },
  {
    "text": "Is Curt Cignetti Delivering the Greatest Coaching Performance in Sports History? - The Ringer",
    "fullText": "How does Cignetti’s turnaround at Indiana compare to the all-time great coaching jobs in sports, from Bill Belichick with the Patriots to Claudio Ranieri with Leicester City? We created a system to find out.",
    "link": "https://www.theringer.com/2026/01/19/college-football/curt-cignetti-greatest-coaching-performances-turnarounds-all-time"
  }
]