[
  {
    "text": "Golden Globes 2026 Red Carpet: See Every Look From Last Night’s Event - Vogue",
    "fullText": "See what all your favorite stars wore on the 2026 Golden Globes red carpet.",
    "link": "https://www.vogue.com/slideshow/golden-globes-2026-fashion-live-from-the-red-carpet"
  },
  {
    "text": "Meta names former Trump advisor Dina Powell McCormick as president, vice chair - CNBC",
    "fullText": "Powell McCormick will serve as a member of Meta's management team and will help guide its strategy and execution, the company said.",
    "link": "https://www.cnbc.com/2026/01/12/meta-dina-powell-mccormick-trump.html"
  },
  {
    "text": "Here are Monday's biggest analyst calls: Nvidia, Apple, Tesla, Palantir, Zoom, Microsoft, Roku, Netflix & more - CNBC",
    "fullText": "Here are Monday's biggest calls on Wall Street.",
    "link": "https://www.cnbc.com/2026/01/12/mondays-biggest-analyst-calls-on-wall-street.html"
  },
  {
    "text": "5 lines from Nikki Glaser that sum up her night as Golden Globes host - Yahoo",
    "fullText": "The Emmy-nominated comedian and actress roasted A-list celebs and the network airing the show.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/5-lines-from-nikki-glaser-that-sum-up-her-night-as-golden-globes-host-045957049.html"
  },
  {
    "text": "Ho hum holiday: Retail's early results show modest growth in critical shopping season - CNBC",
    "fullText": "The 2025 holiday season was solid for some retailers as they posted modest growth, but results failed to blow away expectations.",
    "link": "https://www.cnbc.com/2026/01/12/retails-early-holiday-2025-results-show-modest-growth.html"
  },
  {
    "text": "Dow futures fall 300 points as Trump's DOJ opens criminal investigation into Fed Chair Powell: Live updates - CNBC",
    "fullText": "Traders are preparing for the kickoff of earnings season, with major Wall Street banks set to report results in the days ahead.",
    "link": "https://www.cnbc.com/2026/01/11/stock-market-today-live-updates.html"
  },
  {
    "text": "It Was the Craziest NFL Playoff Weekend Ever—and These Numbers Prove It - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/sports/football/nfl-playoffs-wild-card-weekend-192fc1a5"
  },
  {
    "text": "Ofcom investigates Elon Musk's X over Grok AI sexual deepfakes - BBC",
    "fullText": "The watchdog said it had received reports of the platform's Grok AI chatbot creating undressed images of people.",
    "link": "https://www.bbc.com/news/articles/cwy875j28k0o"
  },
  {
    "text": "Jim Harbaugh on OC Greg Roman: We weren’t good enough as a team - NBC Sports",
    "fullText": "The Chargers have advanced to the playoffs in each of their first two seasons under head coach Jim Harbaugh, but they've scored just 15 points in two dispiriting losses once they've gotten to the postseason.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jim-harbaugh-on-oc-greg-roman-we-werent-good-enough-as-a-team"
  },
  {
    "text": "Hearings on whether Myanmar committed genocide against the Rohingya opens at top UN court - ABC News",
    "fullText": "Myanmar heard accusations that it is responsible for genocide against the Rohingya ethnic minority at the top court of the United Nations, as long-awaited hearings began on Monday",
    "link": "https://abcnews.go.com/International/wireStory/court-begin-hearings-myanmar-committed-genocide-rohingya-129122831"
  },
  {
    "text": "This Dead Star With a Glowing Shock Wave Shouldn’t Exist - Gizmodo",
    "fullText": "The recent discovery has left astronomers dumbfounded.",
    "link": "https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244"
  },
  {
    "text": "This GOP senator says reviving Obamacare subsidies would be ‘putting America first’ - Politico",
    "fullText": "Ohio Sen. Bernie Moreno is part of an unlikely new generation of Senate dealmakers.",
    "link": "https://www.politico.com/news/2026/01/12/bernie-moreno-obamacare-talks-00719585"
  },
  {
    "text": "Exercise is as effective as medication in treating depression, study finds - NPR",
    "fullText": "New research shows exercise is as effective as medication at reducing symptoms of depression. And you don't need to run a marathon to see benefits. So how much is enough?",
    "link": "https://www.npr.org/2026/01/12/nx-s1-5667599/exercise-is-as-effective-as-medication-in-treating-depression-study-finds"
  },
  {
    "text": "Trump threatens to sideline Exxon from Venezuela's oil: 'They're playing too cute’ - CNBC",
    "fullText": "His comments come shortly after Exxon CEO Darren Woods said the Venezuelan market is \"uninvestable\" in its current state.",
    "link": "https://www.cnbc.com/2026/01/12/oil-trump-venezuela-exxon-mobil-darren-woods.html"
  },
  {
    "text": "Spencer and Monique Tepe: What we know about the Ohio dentist and his wife found dead in their home - CNN",
    "fullText": "Years before Monique Tepe and her husband, Spencer, were gunned down in their Columbus, Ohio, home, the mother of two had a brief marriage to a doctor named Michael David McKee.",
    "link": "https://www.cnn.com/2026/01/12/us/ohio-mom-parents-dead"
  },
  {
    "text": "Celebrities wear pins protesting ICE at the Golden Globes - NPR",
    "fullText": "Some celebrities donned anti-ICE pins at the Golden Globes on Sunday in tribute to Renee Good, who was shot and killed by an Immigration and Customs Enforcement officer last week in Minneapolis.",
    "link": "https://www.npr.org/2026/01/12/g-s1-105659/celebrities-pins-protesting-ice-golden-globes"
  },
  {
    "text": "Seahawks Will Host 49ers Saturday In Divisional Round - Seattle Seahawks",
    "fullText": "The Seahawks will host the 49ers on Saturday in the divisional round of the playoffs.",
    "link": "https://www.seahawks.com/news/2025-26-seahawks-divisional-round-playoff-opponent"
  },
  {
    "text": "SEPTA Regional Rail's morning express service will resume Monday - 6abc Philadelphia",
    "fullText": "SEPTA resumed services Monday for thousands of riders who take regional rail morning express from the suburbs to Philadelphia and T-trolley routes through the Center City trolley tunnel.",
    "link": "https://6abc.com/post/septa-regional-rails-morning-express-service-will-resume-monday/18389196/"
  }
]