[
  {
    "text": "Trump, in retreat, praises U.K. troops after royal family expresses hurt - The Washington Post",
    "fullText": "President Donald Trump’s comments belittling the role of NATO allies in Afghanistan sparked outrage in Britain, which lost 457 soldiers in the U.S.-led war.",
    "link": "https://www.washingtonpost.com/world/2026/01/25/trump-british-troops-afghanistan-charles/"
  },
  {
    "text": "Sources: Packers agree to hire Jonathan Gannon as DC - ESPN",
    "fullText": "The Packers have agreed to terms with former Cardinals coach Jonathan Gannon to be their defensive coordinator, sources told ESPN.",
    "link": "https://www.espn.com/nfl/story/_/id/47724577/sources-packers-agree-hire-jonathan-gannon-dc"
  },
  {
    "text": "6 Performance Cars You Probably Didn't Know Used Yamaha Engines - Jalopnik",
    "fullText": "Yamaha is renowned for its high-performance motorcycles, but lesser known is the legendary builder has also put together some impressive car engines.",
    "link": "https://www.jalopnik.com/2081530/performance-cars-use-yamaha-engine/"
  },
  {
    "text": "Kylie Jenner and Timothée Chalamet Spotted on Intimate Mexico Dinner Date - TMZ",
    "fullText": "Kylie Jenner and Timothée Chalamet took their romance south of the border ... ’cause the couple was spotted enjoying a low-key but very cozy dinner date in Mexico this week.",
    "link": "https://www.tmz.com/2026/01/25/timothee-chalamet-kylie-jenner-mexico-date/"
  },
  {
    "text": "How Americans are using AI at work, according to a new Gallup poll - AP News",
    "fullText": "A new Gallup poll finds that American workers have adopted artificial intelligence into their work lives at a remarkable pace over the past few years. Some 12% of employed adults say they use AI daily in their job, while nearly half say they've used it at lea…",
    "link": "https://apnews.com/article/ai-workplace-gemini-chatgpt-poll-4934bc61d039508db32bc49f85d63d99"
  },
  {
    "text": "Auto executives are hoping for the best and planning for the worst in 2026 - CNBC",
    "fullText": "Automakers are entering a new phase of uncertainty as they deal with affordability issues and slowing consumer demand.",
    "link": "https://www.cnbc.com/2026/01/25/auto-industry-2026.html"
  },
  {
    "text": "Box Office: Chris Pratt’s ‘Mercy’ Topples ‘Avatar 3’ With $11.2M But Can’t Outrun Brutal Winter Storm - hollywoodreporter.com",
    "fullText": "The movie's opening number was revised downwards as hundreds of theaters closed across the county.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/chris-pratt-mercy-box-office-unseats-avatar-1236483753/"
  },
  {
    "text": "Here's how 'shared decision making' for childhood vaccines could limit access - NPR",
    "fullText": "Robert F. Kennedy Jr.'s new approach to six shots that were formerly given routinely will introduce new hurdles for getting kids immunized. And it could have a chilling effect on doctors.",
    "link": "https://www.npr.org/2026/01/25/nx-s1-5686622/cdc-childhood-vaccines-shared-decision-rfk"
  },
  {
    "text": "Ilia Topuria Mocks Paddy Pimblett After Brutal UFC 324 Loss - MMA Mania",
    "fullText": "Ilia Topuria blasts Paddy Pimblett after his first UFC loss at UFC 324, claiming he lost the biggest payday of his career",
    "link": "https://www.mmamania.com/ufc-324-news-results-paramount-streaming-updates-mma/417650/ilia-topuria-mocks-little-sausage-paddy-pimblett-for-ufc-324-defeat-you-just-lost-the-biggest-paycheck-of-your-life"
  },
  {
    "text": "40 years after Challenger: Lingering guilt and lessons learned - NPR",
    "fullText": "Forty years after the Challenger disaster, NPR explores the engineers' last-minute efforts to stop the launch, their decades of guilt and the vital lessons that remain critical for NASA today.",
    "link": "https://www.npr.org/2026/01/25/g-s1-106940/40-years-after-challenger"
  },
  {
    "text": "AJ Styles and Shinsuke Nakamura had a moment after their final match - Cageside Seats",
    "fullText": "A touching spot at Saturday Night’s Main Event.",
    "link": "https://www.cagesideseats.com/wwe/413173/aj-styles-shinsuke-nakamura-moment-final-match-wwe-saturday-nights-main-event"
  },
  {
    "text": "StormTracker8: Snow and sleet tonight, freezing rain all day Sunday - wric.com",
    "fullText": null,
    "link": "https://www.wric.com/weather/daily-forecast/stormtracker8-winter-storm-to-arrive-this-afternoon-bringing-snow-ice/"
  },
  {
    "text": "Surging Cavs continue vaulting up the standings with 119-105 win over Magic - cleveland.com",
    "fullText": "Cleveland has won five of its last six games — a recent surge that has vaulted them up the Eastern Conference standings.",
    "link": "https://www.cleveland.com/cavs/2026/01/surging-cavs-continue-vaulting-up-the-standings-with-119-105-win-over-magic.html"
  },
  {
    "text": "Let public buy war bonds to raise £20bn for defence, say Lib Dems - BBC",
    "fullText": "Liberal Democrat leader Sir Ed Davey says the bonds would \"give ordinary people the opportunity to contribute to Britain's security\".",
    "link": "https://www.bbc.com/news/articles/cq5y7edg169o"
  },
  {
    "text": "Governor Lamont Declares State of Emergency, Limits Commercial Vehicle Travel Ahead of Approaching Major Winter Storm - portal.ct.gov",
    "fullText": "",
    "link": "https://portal.ct.gov/governor/news/press-releases/2026/01-2026/governor-lamont-declares-state-of-emergency-limits-commercial-vehicle-travel"
  },
  {
    "text": "As we return to a pre-WW2 order, the middle powers face a challenge - BBC",
    "fullText": "With economic stagnation and extremes of inequality comes corrosion of trust in democratic institutions. So Trump may be a symptom, not a cause, of what Carney called a \"rupture\" with the post-WW2 order.",
    "link": "https://www.bbc.com/news/articles/c99kkerr93ko"
  },
  {
    "text": "How Tennessee basketball altered Alabama travel plans due to winter weather - On3",
    "fullText": "Tennessee basketball changed travel plans following its game at Alabama on Saturday due to winter weather and will not return to Knoxville.",
    "link": "https://www.on3.com/teams/tennessee-volunteers/news/tennessee-basketball-alabama-travel-weather-georgia/"
  },
  {
    "text": "New Jersey Transit announces suspension plans for Sunday amid winter storm - abc7ny.com",
    "fullText": "With a winter storm expected to impact New Jersey, NJ Transit announced it will temporarily suspend most service systemwide to keep riders and employees safe.",
    "link": "https://abc7ny.com/post/new-jersey-transit-announces-suspension-plans-sunday-amid-winter-storm/18464897/"
  },
  {
    "text": "Italy protests, recalls ambassador to Switzerland after New Year's bar fire suspect released - KSL.com",
    "fullText": "Italy formally protested on Saturday the release on bail of the owner of a Swiss bar engulfed in a ​deadly New Year's Day fire and recalled its ambassador to Switzerland, as the court's decision came under criticism in both countries.",
    "link": "https://www.ksl.com/article/51437797/italy-protests-recalls-ambassador-to-switzerland-after-new-years-bar-fire-suspect-released"
  }
]