[
  {
    "text": "Trump threatens to block opening of bridge between U.S. and Canada - The Washington Post",
    "fullText": "As the Gordie Howe bridge nears completion, Trump, in his latest salvo against Canada, suggested he would “not allow” it to open, saying Canada had treated the U.S. “very unfairly.”",
    "link": "https://www.washingtonpost.com/politics/2026/02/10/trump-us-canada-michigan-ontario-bridge/"
  },
  {
    "text": "ICE chief, immigration officials defend mass deportation campaign at House hearing - cbsnews.com",
    "fullText": "The leaders of three major immigration agencies defended the Trump administration's deportations in testimony before lawmakers on Tuesday.",
    "link": "https://www.cbsnews.com/live-updates/ice-hearing-cbp-uscis-congress-immigration/"
  },
  {
    "text": "How this French building behemoth wants to solve the U.S. housing dilemma - CNBC",
    "fullText": "Saint-Gobain is focusing on speed and affordability in construction through materials, assembly and other tools, according to North America CEO Mark Rayfield.",
    "link": "https://www.cnbc.com/2026/02/10/saint-gobain-us-housing-dilemma.html"
  },
  {
    "text": "Donovan Mitchell, James Harden clutch late as Cavs punctuate road trip with 119-117 win over Nuggets - Cleveland.com",
    "fullText": "Going into the game, Cavs coach Kenny Atkinson knew what Cleveland was up against.",
    "link": "https://www.cleveland.com/cavs/2026/02/donovan-mitchell-james-harden-come-through-in-clutch-as-cavs-punctuate-road-trip-with-119-117-win-over-nuggets.html"
  },
  {
    "text": "Democrats add five red-leaning House seats to their battleground map - Politico",
    "fullText": "The DCCC is targeting new seats in Colorado, Minnesota, Montana, South Carolina and Virginia.",
    "link": "https://www.politico.com/live-updates/2026/02/10/congress/house-democrats-battleground-list-new-seats-00772976"
  },
  {
    "text": "Ryan Coogler Goes Deep on Shattering Oscar Records, Losing Chadwick and Battling Imposter Syndrome - The Hollywood Reporter",
    "fullText": "The ‘Sinners' director silenced skeptics by scoring big at the box office and making the most nominated film ever. After a decade of hitmaking, is he finally ready to admit that this is where he deserves to be?",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/ryan-coogler-interview-sinners-oscars-chadwick-boseman-1236500968/"
  },
  {
    "text": "YouTube rolls out an AI playlist generator for Premium users - TechCrunch",
    "fullText": "YouTube Music is rolling out a new AI-powered playlist-generation feature that allows Premium users on iOS and Android to use text prompts to create playlists.",
    "link": "https://techcrunch.com/2026/02/10/youtube-rolls-out-an-ai-playlist-generator-for-premium-users/"
  },
  {
    "text": "Spotify Stock Jumps On Improved Profitability, User Growth - Investor's Business Daily",
    "fullText": "The streaming music leader beat estimates for subscribers and total users in Q4.",
    "link": "https://www.investors.com/news/technology/spotify-stock-spot-q4-2025-earnings/"
  },
  {
    "text": "U.S. government borrowed $43.5 billion a week in the first four months of the fiscal year - Fortune",
    "fullText": "The CBO's latest reporting showed for the first four months of FY26, the U.S. government operated at a deficit, and so needed to borrow, $696 billion.",
    "link": "https://fortune.com/2026/02/10/government-borrowing-cbo-report-deicit-lending-interest/"
  },
  {
    "text": "How much power does the Fed chair really have? : Planet Money - NPR",
    "fullText": "On paper, the Fed chair is just one vote among many. In practice, the job carries far more influence. We analyze what gives the Fed chair power.",
    "link": "https://www.npr.org/sections/planet-money/2026/02/10/g-s1-109375/how-much-power-does-the-fed-chair-really-have"
  },
  {
    "text": "ICE is cracking down on people who follow them in their cars - Yahoo",
    "fullText": "By Ted Hesson, Kristina Cooke and Brad Heath WASHINGTON, Feb 10 (Reuters) - Becky Ringstrom was heading home after following federal immigration officers in ...",
    "link": "https://www.yahoo.com/news/articles/ice-cracking-down-people-them-110401522.html"
  },
  {
    "text": "Opinion | We may be doing breast cancer screening all wrong - The Washington Post",
    "fullText": "This test may be crucial for breast cancer screening. It’s not a mammogram.",
    "link": "https://www.washingtonpost.com/opinions/2026/02/10/breast-cancer-screening-mammograms/"
  },
  {
    "text": "AMA joins effort to launch vaccine science review amid CDC turmoil - The Washington Post",
    "fullText": "The American Medical Association and a partner group are taking on a new role in reviewing vaccine safety and effectiveness as the CDC’s review process faces criticism.",
    "link": "https://www.washingtonpost.com/health/2026/02/10/new-vaccine-review-system-launched/"
  },
  {
    "text": "How the Trump administration skirts — and defies — court rulings on ICE detentions - Politico",
    "fullText": "A POLITICO review of hundreds of cases brought by ICE detainees shows a pattern of noncompliance that has frustrated judges across the country.",
    "link": "https://www.politico.com/news/2026/02/10/ice-immigration-detention-court-orders-00771727"
  },
  {
    "text": "National Cancer Institute studying ivermectin’s ‘ability to kill cancer cells,’ alarming career scientists - statnews.com",
    "fullText": "The National Cancer Institute is studying ivermectin as a potential cancer treatment, according to its top official, alarming career scientists.",
    "link": "https://www.statnews.com/2026/02/10/ivermectin-for-cancer-national-cancer-institute-preclinical-study/"
  },
  {
    "text": "Office Hours: Is Trump Really, Truly, Finally Losing His Mind? - Robert Reich | Substack",
    "fullText": "Here are the views of some experts about what’s wrong and what we can expect. What do you think?",
    "link": "https://robertreich.substack.com/p/office-hours-is-trump-really-truly"
  },
  {
    "text": "Exynos 2700 To Enter Mass Production In H2 2026, Analyst Says SoC’s Adoption In Galaxy S27 Will Increase Drastically - Wccftech",
    "fullText": "An analyst believes that the Exynos 2700 will enter full-scale mass production in the second half of 2026 and will be utilized in increased Galaxy S27 shipments",
    "link": "https://wccftech.com/exynos-2700-enter-mass-production-h2-2026-increased-adopting-in-galaxy-s27/"
  },
  {
    "text": "2025 Corruption Index flags drops in Western nations - dw.com",
    "fullText": "Once seen as anti-graft strongholds, the US, UK, Canada and Sweden are slipping into decline due to a lack of political leadership, Transparency International's Corruption Perception Index has revealed.",
    "link": "https://www.dw.com/en/2025-corruption-index-flags-drops-in-western-nations/a-75838368"
  },
  {
    "text": "Rivian launching Apple Watch app with remote controls and Gen 1 digital key feature - 9to5Mac",
    "fullText": "Back in December, Rivian released support for using an Apple Watch as a digital key. Next, the EV maker is...",
    "link": "https://9to5mac.com/2026/02/09/rivian-launching-apple-watch-app-with-remote-controls-and-gen-1-digital-key-feature/"
  },
  {
    "text": "Photos of Beirut’s ‘Mother of Cats’ who rescues felines - apnews.com",
    "fullText": "HADATH, Lebanon (AP) — Diana Abadi is known in the southern suburbs of Beirut as the “Mother of Cats.”",
    "link": "https://apnews.com/photo-gallery/cat-shelter-lebanon-7926637e314576714136621e6751911e"
  }
]