[
  {
    "text": "Eric Dane, 'Grey's Anatomy' and 'Euphoria' star, dies at 53 nearly 1 year after revealing ALS diagnosis - Yahoo",
    "fullText": "The actor revealed in April 2025 that he had been diagnosed with the rare neurodegenerative disease.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/eric-dane-greys-anatomy-and-euphoria-star-dies-at-53-nearly-1-year-after-revealing-als-diagnosis-023808459.html"
  },
  {
    "text": "U.S. economic growth slowed sharply at the end of 2025, dragging down the year - The Washington Post",
    "fullText": "The U.S. economy experienced a slowdown in 2025, with the rate of GDP growth dropping because of tariffs and a government shutdown.",
    "link": "https://www.washingtonpost.com/business/2026/02/20/gdp-2025-economy-tariffs-trade/"
  },
  {
    "text": "Trump gets his Board of Peace, even as bigger countries steer clear - Politico",
    "fullText": "America’s traditional allies are taking a backseat on the effort — which has raised billions in new commitments.",
    "link": "https://www.politico.com/news/2026/02/19/trump-gets-his-board-of-peace-even-as-bigger-countries-steer-clear-00789617"
  },
  {
    "text": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say - AP News",
    "fullText": "Four years into its full-scale invasion, Russia controls about 20% of Ukrainian territory, where an estimated 3 million to 5 million people live. Life in shattered cities and villages alike remains difficult, with residents facing problems with housing, water…",
    "link": "https://apnews.com/article/russia-war-ukraine-occupation-putin-cf2ca7071c54da307650c3b9e2fa8f07"
  },
  {
    "text": "How extreme cold is affecting Americans’ lives, according to a new AP-NORC poll - AP News",
    "fullText": "A new AP-NORC poll shows more Americans say extreme cold has affected their lives after frigid weather engulfed much of North America at the beginning of 2026. The survey found that 57% of U.S. adults report severe cold or winter storms in the past five years…",
    "link": "https://apnews.com/article/weather-extreme-cold-climate-electricity-24b241dab67c022d9ddfdf172b2033f1"
  },
  {
    "text": "Bath & Body Works starts selling on Amazon as more brands embrace its logistics network - CNBC",
    "fullText": "Bath & Body Works CEO Daniel Heaf told CNBC the Amazon launch is about meeting customers where they are and leveraging Amazon's fast and free shipping.",
    "link": "https://www.cnbc.com/2026/02/20/bath-body-works-amazon-brands-embrace-logistics-network.html"
  },
  {
    "text": "Tracking flu cases in the US through maps and charts - CNN",
    "fullText": "The current flu season has seen the highest rate of doctor’s visits for flu-like symptoms since the US began collecting data through a national surveillance network. CNN is tracking these case rates and hospitalizations across the country.",
    "link": "https://www.cnn.com/2026/02/20/health/us-flu-cases-tracking-maps-vis"
  },
  {
    "text": "Scientists worry about lasting damage from Potomac sewage spill - NPR",
    "fullText": "Drinking water around the District of Columbia hasn't been contaminated. But scientists say the environmental damage could be severe.",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5719779/environment-washington-dc-sewer-spill-sewage-potomac-river"
  },
  {
    "text": "What worked and what didn't with a cellphone ban at a Kentucky school - NPR",
    "fullText": "Keeping students off their devices is the new norm in many schools. We talked to students and educators at one Kentucky school to see how it's working.",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5675979/school-education-kentucky-cell-phone-ban-consequences"
  },
  {
    "text": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen' - BBC",
    "fullText": "The US is surging forces to the Middle East amid negotiations with the Islamic Republic over its nuclear programme.",
    "link": "https://www.bbc.com/news/articles/c86yjnw4x49o"
  },
  {
    "text": "U.S. fighter jets intercept Russian warplanes off Alaskan coast - CBS News",
    "fullText": "Two Russian Tu-95s bombers, two Su-35s fighter planes and an A-50 spy plane were detected in the Alaskan Air Defense Identification Zone, NORAD said.",
    "link": "https://www.cbsnews.com/news/u-s-fighter-jets-intercept-russian-warplanes-off-alaskan-coast/"
  },
  {
    "text": "Iran dangles investment proposals as off-ramp from Trump's gunboat diplomacy - CBS News",
    "fullText": "President Trump has one bright red line for Iran's nuclear program and some areas of flexibility as he weighs military strikes or a possible deal in the coming days.",
    "link": "https://www.cbsnews.com/news/iran-dangles-investment-proposals-as-off-ramp-from-trumps-gunboat-diplomacy/"
  },
  {
    "text": "Cavs pick up where they left off prior to the break, obliterate helpless Brooklyn Nets, 112-84 - Cleveland.com",
    "fullText": "The surging Cavs picked up where they left off more than a week ago, crushing the lottery-bound Brooklyn Nets, 112-84, on Thursday night inside Rocket Arena.",
    "link": "https://www.cleveland.com/cavs/2026/02/cavs-pick-up-where-they-left-off-prior-to-the-break-obliterate-brooklyn-nets-112-84.html"
  },
  {
    "text": "William Foege obituary: epidemiologist in smallpox success - The Times",
    "fullText": "Global health expert who played a key role in the eradication of smallpox using a ‘ring vaccination’ technique, dies aged 89",
    "link": "https://www.thetimes.com/uk/obituaries/article/william-foege-obituary-epidemiologist-in-smallpox-success-ff3j9j2jv"
  },
  {
    "text": "Apple and Jon Prosser coordinating deposition in iOS 26 leak case - 9to5Mac",
    "fullText": "In a joint status report to the court, Apple disclosed new details about its efforts to depose Prosser as part of the iOS 26 leak case.",
    "link": "https://9to5mac.com/2026/02/19/apple-and-jon-prosser-coordinating-deposition-in-ios-26-leak-case/"
  },
  {
    "text": "Governors group skips White House meeting after Trump refused to invite two Democrats - PBS",
    "fullText": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors, undercutting one of Washington's few remaining bipartisan gatherings.",
    "link": "https://www.pbs.org/newshour/politics/governors-group-skips-white-house-meeting-after-trump-refused-to-invite-two-democrats"
  },
  {
    "text": "Amanda Nunes responds to Sean Strickland’s sexist comments: ‘Don’t cry, man’ - mmafighting.com",
    "fullText": "Amanda Nunes fired back at Sean Strickland’s anti-WMMA tirade",
    "link": "https://www.mmafighting.com/ufc/472301/amanda-nunes-responds-to-sean-stricklands-sexist-comments-dont-cry-man"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  }
]