[
  {
    "text": "2026 NBA All-Star Game live updates: Results, scores, highlights of new USA vs. World format - CBS Sports",
    "fullText": "It's the USA vs. the World ... vs. USA as the NBA gives a new All-Star Game format a go in Los Angeles",
    "link": "https://www.cbssports.com/nba/news/2026-nba-all-star-game-updates-results-scores-highlights/live/"
  },
  {
    "text": "Spirit Awards: Winners List (Updating Live) - The Hollywood Reporter",
    "fullText": "'Train Dreams' won three awards, including best feature. 'Adolescence,' 'The Secret Agent,' 'Sorry, Baby' and 'The Perfect Neighbor' also were among the winners.",
    "link": "http://www.hollywoodreporter.com/lists/2026-independent-spirit-awards-winners-list/"
  },
  {
    "text": "California storms are about to hit. Here’s a timeline of their most severe impacts - San Francisco Chronicle",
    "fullText": "From San Francisco to Los Angeles, California faces back-to-back storms that will bring rain, flooding, heavy snow and high winds across the state.",
    "link": "https://www.sfchronicle.com/weather-forecast/article/rain-snow-storm-california-21354012.php"
  },
  {
    "text": "OpenClaw creator Peter Steinberger joins OpenAI - TechCrunch",
    "fullText": "OpenAI said OpenClaw will live on as an open source project.",
    "link": "https://techcrunch.com/2026/02/15/openclaw-creator-peter-steinberger-joins-openai/"
  },
  {
    "text": "No clear path to ending the partial government shutdown as lawmakers dig in over DHS oversight - AP News",
    "fullText": "Lawmakers and the White House are offering no signs of compromise in their battle over oversight of federal immigration officers. That impasse has led to a pause in funding for the Department of Homeland Security. A partial government shutdown began Saturday …",
    "link": "https://apnews.com/article/government-shutdown-homeland-security-democrats-ice-bd2b84b6f38f1c916637b205854a3c83"
  },
  {
    "text": "Democrats’ struggles could be partly because they’re just too old, says Obama - Politico",
    "fullText": "“There is an element of, at some point, you age out,” the former president said.",
    "link": "https://www.politico.com/news/2026/02/15/obama-democrats-problems-too-old-00782719"
  },
  {
    "text": "Former UFC champ Cain Velasquez released from prison on parole - ESPN",
    "fullText": "Former UFC heavyweight champion Cain Velasquez has been released on parole from California state prison.",
    "link": "https://www.espn.com/mma/story/_/id/47940244/former-ufc-champ-cain-velasquez-released-prison-parole"
  },
  {
    "text": "Mets Claim Ben Rortvedt Off Waivers From Dodgers - MLB Trade Rumors",
    "fullText": "The Mets claimed a depth catcher off waivers from the Dodgers this afternoon. Visit MLB Trade Rumors to read more.",
    "link": "https://www.mlbtraderumors.com/2026/02/mets-claim-ben-rortvedt-off-waivers-from-dodgers.html"
  },
  {
    "text": "Heated Rivalry’s Hudson Williams Hard Launches Girlfriend on Valentine’s Day - Vulture",
    "fullText": "‘Heated Rivalry’ star Hudson Williams dedicated a Valentine’s Day collage on Instagram Stories to the girlfriend he’s been with ‘since my 2000 gold Mazda Protégé smoked and squealed and I had no job.”",
    "link": "http://www.vulture.com/article/heated-rivalry-hudson-williams-girlfriend.html"
  },
  {
    "text": "RFK Jr.’s battle with the public health establishment has turned to trench warfare - Politico",
    "fullText": "The health secretary turned his agencies toward skepticism of processed food and vaccines, but he’s faced pushback at every turn — including from Republicans.",
    "link": "https://www.politico.com/news/2026/02/15/rfk-health-secretary-maha-vaccines-food-00776630"
  },
  {
    "text": "Andrew's time as trade envoy should be investigated, says Vince Cable - BBC",
    "fullText": "The former prince's alleged actions were \"totally unacceptable\", the ex-business secretary says.",
    "link": "https://www.bbc.com/news/articles/cp32j7v2dy5o"
  },
  {
    "text": "He spent decades perfecting his voice. Now he says Google stole it. - The Washington Post",
    "fullText": "NPR’s David Greene says he was “completely freaked out” when he heard an AI voice that sounded just like his own, and he’s suing over it.",
    "link": "https://www.washingtonpost.com/technology/2026/02/15/david-greene-google-ai-podcast/"
  },
  {
    "text": "Massie says he’s lost confidence in Pam Bondi after congressional hearing - Politico",
    "fullText": "The Attorney General sparred with Rep. Thomas Massie and other lawmakers over her handling of the Epstein files.",
    "link": "https://www.politico.com/news/2026/02/15/massie-lost-confidence-pam-bondi-00782632"
  },
  {
    "text": "Ukraine's ex-energy minister arrested while attempting to leave country - BBC",
    "fullText": null,
    "link": "https://www.bbc.com/news/articles/c4g5380xwqjo"
  },
  {
    "text": "NBA's effort to stop tanking is 'not working,' Adam Silver says - NBC News",
    "fullText": "NBA Commissioner Adam Silver conceded Saturday that the league is still struggling for solutions to punish teams that lose intentionally for long-term gain — the hated practice of “tanking.”",
    "link": "https://www.nbcnews.com/sports/nba/nba-adam-silver-tanking-all-star-game-rcna259092"
  },
  {
    "text": "Northern Lights Forecast: Aurora Could Be Visible in These 15 States - Forbes",
    "fullText": "Minor to moderate geomagnetic storms could make the aurora visible further south, forecasters said.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/02/15/northern-lights-could-be-visible-from-these-15-states-sunday/"
  },
  {
    "text": "Report: Apple’s upcoming low-cost MacBook will come in ‘fun colors,’ launch next month - 9to5Mac",
    "fullText": "Apple has long been rumored to be working on a new A18 Pro-powered MacBook, at an effort to gain marketshare...",
    "link": "https://9to5mac.com/2026/02/15/apple-cheaper-macbook-launching-next-month-with-a18-pro-chip-and-fun-colors/"
  },
  {
    "text": "iOS 27 to include code cleanup and interface tweaks in hopes to boost battery life: report - 9to5Mac",
    "fullText": "In today’s edition of the Power On newsletter, Bloomberg’s Mark Gurman shared a number of new details about Apple’s upcoming...",
    "link": "https://9to5mac.com/2026/02/15/apple-code-cleanup-in-ios-27-for-better-battery-life-report/"
  },
  {
    "text": "A Star-Studded Stink Bomb Lands in Berlin - Vulture",
    "fullText": "A star-studded stink bomb lands in Berlin: ‘Rosebush Pruning,’ starring Callum Turner, Riley Keough, and Elle Fanning, somehow makes its madness boring.",
    "link": "http://www.vulture.com/article/review-rosebush-pruning-is-a-star-studded-stink-bomb.html"
  }
]