[
  {
    "text": "Stocks rebound from big sell-off after Trump rules out military action on Greenland: Live updates - CNBC",
    "fullText": "All three major U.S. stock indexes logged their worst daily performances since Oct. 10 as Trump escalated his Greenland tariff threats.",
    "link": "https://www.cnbc.com/2026/01/20/stock-market-today-live-updates.html"
  },
  {
    "text": "Divisions emerge among western European nations over Trump’s Board of Peace for Gaza - AP News",
    "fullText": "Divisions have emerged over Donald Trump’s Board of Peace envisaged in the U.S. president’s peace plan for Gaza, with some western European countries declining to join while others remain noncommittal. Wednesday's development underscores European concerns ove…",
    "link": "https://apnews.com/article/mideast-wars-gaza-board-of-peace-trump-1-21-2026-2f0e063d03babbd3276f31289ba5f2a2"
  },
  {
    "text": "Berkshire prepares to exit 28% stake in Kraft Heinz as new CEO aims to move on from rare Buffett gaffe - CNBC",
    "fullText": "The move underscores Greg Abel's willingness to look past a deal that has long stood out as a rare blemish in Buffett's otherwise storied record.",
    "link": "https://www.cnbc.com/2026/01/21/berkshire-set-to-exit-28percent-stake-in-kraft-heinz-after-rare-buffett-blunder.html"
  },
  {
    "text": "EU lawmakers vote to hold up Mercosur trade agreement over legal concerns - AP News",
    "fullText": "European Union lawmakers have voted to hold up a major free trade agreement with the Mercosur group of South American countries over concerns about the legality of the deal. In a vote in Strasbourg, France, the lawmakers narrowly approved sending the EU-Merco…",
    "link": "https://apnews.com/article/mercosur-eu-deal-vote-court-36db5285a4b22c61da15c5bee02ef43e"
  },
  {
    "text": "Mets solve CF puzzle by acquiring Robert Jr. in trade with White Sox - MLB.com",
    "fullText": "NEW YORK -- The Mets made a major move to finalize their outfield late Tuesday night, acquiring center fielder Luis Robert Jr. from the White Sox for infielder Luisangel Acuña and right-handed pitching prospect Truman Pauley, the clubs announced.\nTalks regard…",
    "link": "https://www.mlb.com/news/luis-robert-jr-mets-white-sox-trade"
  },
  {
    "text": "Trump’s Greenland crusade pushes European allies to a breaking point - The Washington Post",
    "fullText": "President Donald Trump’s ultimatum — give up Greenland or face a trade war — has convinced some European officials that retaliation, rather than conciliation, is the answer.",
    "link": "https://www.washingtonpost.com/world/2026/01/21/trump-greenland-europe-allies-nato/"
  },
  {
    "text": "‘Falling apart in real time.’ Former star Fidelity manager warns on OpenAI, tells investors to shelter in these assets. - MarketWatch",
    "fullText": "George Noble says ‘the low-hanging fruit is gone’",
    "link": "https://www.marketwatch.com/story/falling-apart-in-real-time-former-star-fidelity-manager-warns-on-openai-tells-investors-to-shelter-in-these-assets-8a436d7c"
  },
  {
    "text": "Why ‘aspirational clutter’ is some of the hardest to part with - The Washington Post",
    "fullText": "The idea of who we are doesn’t always align with reality — and that’s often reflected in our unused stuff.",
    "link": "https://www.washingtonpost.com/home/2026/01/21/what-is-aspirational-clutter/"
  },
  {
    "text": "Trump, AI at Davos: Living history — and the future - Axios",
    "fullText": "Trump, AI at Davos: Living history — and the future",
    "link": "https://www.axios.com/2026/01/21/davos-2026-ai-trump-canada-greenland-nato-crisis"
  },
  {
    "text": "House committee set to approve resolutions holding Clintons in contempt of Congress - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/house-committee-set-approve-resolutions-holding-clintons-contempt/story?id\\\\u003d129381902"
  },
  {
    "text": "Trump tariffs live updates: Bessent brushes off Danish Treasury sales as ‘irrelevant’; Trump arrives in Davos as Greenland threats roil world, markets - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-bessent-brushes-off-danish-treasury-sales-as-irrelevant-trump-arrives-in-davos-152657055.html"
  },
  {
    "text": "6 daily habits to slow aging, from a Harvard brain expert - The Washington Post",
    "fullText": "Harvard scientist Rudolph Tanzi shares his plan for brain health and aging well, including habits for sleep, stress and social interaction.",
    "link": "https://www.washingtonpost.com/health/2026/01/21/brain-aging-tips-harvard/"
  },
  {
    "text": "Trump administration claims offshore wind poses a threat. But it won't say how. - NPR",
    "fullText": "The Interior Department said pausing construction of offshore wind farms would allow the government agencies to work with project developers to mitigate potential risks. But wind companies say the administration isn't sharing information about newly-discovere…",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5678635/trump-offshore-wind-national-security-climate-change"
  },
  {
    "text": "A failed galaxy could solve the dark matter mystery : Short Wave - NPR",
    "fullText": null,
    "link": "https://www.npr.org/2026/01/21/nx-s1-5677276/space-stars-dark-matter-galaxy"
  },
  {
    "text": "UK inflation rises to 3.4% in December, above forecasts - CNBC",
    "fullText": "The U.K. inflation rate rose to 3.4% in December, above forecasts of 3.3% from economists polled by Reuters.",
    "link": "https://www.cnbc.com/2026/01/21/uk-inflation-december-2025-uk-prices.html"
  },
  {
    "text": "Horoscope for Wednesday, January 21, 2026 - chicago.suntimes.com",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/21/horoscopes-today-wednesday-january-21-2026"
  },
  {
    "text": "Chinyelu, Gators Smash Glass, Tigers for Fifth Straight Win - Florida Gators",
    "fullText": "Junior center Rueben Chinyelu did historic things Tuesday night, namely grab 21 rebounds and post a fourth consecutive double-double, in UF's 79-61 defeat of...",
    "link": "https://floridagators.com/news/2026/1/20/mens-basketball-chinyelu-gators-smash-glass-tigers-for-fifth-straight-win-jan-20-2026"
  },
  {
    "text": "Russia Cheers the Growing NATO Rift Over Greenland - WSJ - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/russia/russia-cheers-the-growing-nato-rift-over-greenland-51821b55"
  },
  {
    "text": "Greenland should be prepared for 'everything,' prime minister says, not ruling out U.S. military action - CNBC",
    "fullText": "While the scenario is unlikely, Greenland has to be prepared as \"the other side\" has not ruled out the use of military force.",
    "link": "https://www.cnbc.com/2026/01/21/greenland-us-trump-military-takeover-nato.html"
  },
  {
    "text": "Kim Petras Asks Republic Records to Drop Her Over Album Delays - hollywoodreporter.com",
    "fullText": "\"I’m tired of having no control over my own life or career,\" Petras wrote on X Tuesday.",
    "link": "http://www.hollywoodreporter.com/music/music-industry-news/kim-petras-asks-republic-records-drop-her-1236479275/"
  }
]