[
  {
    "text": "Rivian Adds A Sport Mode To All R1 EVs On The Road - InsideEVs",
    "fullText": "Plus, there’s a dedicated Apple Watch app that allows Gen 1 owners to leave their car key and smartphone at home.",
    "link": "https://insideevs.com/news/787692/rivian-sport-mode-all-r1-evs-apple-watch-app/"
  },
  {
    "text": "In rare move, Veterans Affairs pulls back on controversial disability rule - The Washington Post",
    "fullText": "Veterans groups had warned that the change would have disadvantaged veterans who need medication.",
    "link": "https://www.washingtonpost.com/politics/2026/02/19/veteran-affairs-disability-rule/"
  },
  {
    "text": "Kim lauds North Korea’s economy and regional standing as major party meeting opens - AP News",
    "fullText": "North Korean leader Kim Jong Un has lauded his nation’s improving economy and regional standing as he opened the country’s most important political event. Kim is expected to set his domestic and foreign policy agenda for the next five years at the Workers’ Pa…",
    "link": "https://apnews.com/article/north-korea-party-congress-kim-jong-un-nuclear-13331f3c040c01f92cabc0cd14972765"
  },
  {
    "text": "Missing Bay Area skier Colin Kang found dead at Northstar California Resort, marking 3rd death this month - ABC7 San Francisco",
    "fullText": "A skier who was reported missing Wednesday night at Northstar resort in Truckee was found dead Thursday morning by search crews, the Placer County Sheriff's Office said. Authorities identified the man as 21-year-old Colin Kang of Fremont, who was an off-duty …",
    "link": "https://abc7news.com/post/missing-skier-found-dead-northstar-california-resort-marking-3rd-death-month/18622440/"
  },
  {
    "text": "Loretta Smith calls for open carry for Portland city councilors following latest protest - Oregon Public Broadcasting - OPB",
    "fullText": "The District 1 councilor said a Wednesday protest that ended in four arrests is the latest action at council meetings that has herself and her colleagues fearing for their safety.",
    "link": "https://www.opb.org/article/2026/02/19/loretta-smith-proposal-open-carry-portland/"
  },
  {
    "text": "Trump’s refusal to invite all governors to a White House meeting prompts group to back out - AP News",
    "fullText": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors. The Republican president is still expected to meet with governors at the White House on Friday …",
    "link": "https://apnews.com/article/governors-trump-meeting-counterweight-washington-5e078af4172aba3ea3c734c910e4e0c0"
  },
  {
    "text": "In a historic vote, Tennessee Volkswagen workers get their first union contract - NPR",
    "fullText": "Two years ago, the successful union drive at this plant was expected to spark victories throughout the South. But now, as members vote to make their contract official, momentum has fizzled.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5711458/union-uaw-volkswagen-tennessee-contract-vote"
  },
  {
    "text": "Cowboys to play a 3-4 base defense for first time since 2012 - NBC Sports",
    "fullText": "The Cowboys hired Christian Parker from the Eagles to turn around a defense that set the team record for points allowed in 2025.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/cowboys-to-play-a-3-4-base-defense-for-first-time-since-2012"
  },
  {
    "text": "Tariffs paid by midsize US companies tripled last year, a JPMorganChase Institute study shows - AP News",
    "fullText": "New research shows midsize U.S. companies pay far more in Trump-era tariffs, and the costs land at home. The JPMorganChase Institute study says tariff payments for these companies tripled over the past year. The report says these businesses may have to raise …",
    "link": "https://apnews.com/article/trump-tariffs-midsized-companies-costs-consumers-2a25158ff1d06bd7f72d909a8ec64f25"
  },
  {
    "text": "‘Landman’s Billy Bob Thornton Tells Great Robert Duvall Stories & Divulges The Deep Dark Secret He Never Told His Mentor - Deadline",
    "fullText": "'Landman' star Billy Bob Thornton tells great stories about his mentor, Robert Duvall, who died February 15 at 95.",
    "link": "http://deadline.com/2026/02/landman-billy-bob-thornton-tells-great-robert-duvall-tales-1236730026/"
  },
  {
    "text": "Epstein would 'name drop' Trump, Les Wexner says in deposition video - CNBC",
    "fullText": "Democrats on the House Oversight Committee have expressed skepticism about Wexner's insistence that he had virtually no social life with Epstein.",
    "link": "https://www.cnbc.com/2026/02/19/epstein-trump-les-wexner-deposition.html"
  },
  {
    "text": "Illinois Democrat tries to bleep her way through a tough Senate primary with a new expletive-laden anti-Trump ad - NBC News",
    "fullText": "Illinois Democratic Senate candidate Juliana Stratton's new ad full of F-bombs is the latest move in a contest that has centered on Trump.",
    "link": "https://www.nbcnews.com/politics/2026-election/illinois-democrat-juliana-stratton-senate-primary-trump-ad-rcna259761"
  },
  {
    "text": "Bank of America commits $25bn to private credit lending - Financial Times",
    "fullText": "Move follows similar initiatives by other Wall Street institutions but comes as concerns mount about sector’s health",
    "link": "https://www.ft.com/content/faedf9f9-6e73-457c-b073-bcd46ed780c7"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "‘Knight of the Seven Kingdoms’ Averaging Nearly 13 Million Viewers Per Episode, ‘The Pitt’ Season 2 at 12 Million - Variety",
    "fullText": "HBO and HBO Max programming can take an early victory lap, with both \"A Knight of the Seven Kingdoms\" and \"The Pitt\" Season 2 nabbing huge audiences",
    "link": "https://variety.com/2026/tv/ratings/knight-of-the-seven-kingdoms-the-pitt-season-2-viewership-1236667803/"
  },
  {
    "text": "Closing in on a universal vaccine: Nasal spray protects mice from respiratory viruses, bacteria and allergens - Medical Xpress",
    "fullText": "In the realm of medical advancements, a universal vaccine that can protect against any pathogen has long been a Holy Grail—and about as elusive as a mythological vessel. But Stanford Medicine researchers and collaborators have taken an astonishing step forwar…",
    "link": "https://medicalxpress.com/news/2026-02-universal-vaccine-nasal-spray-mice.html"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  },
  {
    "text": "Cats give genetic clues to better cancer treatments - Financial Times",
    "fullText": "Similarities between pet and human tumours suggest new ideas for targeting both",
    "link": "https://www.ft.com/content/807ac68a-d96a-4da0-bdfc-5970c3c5a836"
  }
]