[
  {
    "text": "Sources: Grizzlies open to offers on Morant move - ESPN",
    "fullText": "The Grizzlies are entertaining offers to potentially trade Ja Morant, sources told ESPN's Shams Charania. Morant, 26, is eligible to sign up to a three-year, $178 million extension this summer.",
    "link": "https://www.espn.com/nba/story/_/id/47561697/grizzlies-entertaining-ja-morant-trade-offers-sources-say"
  },
  {
    "text": "Owner of Swiss ski resort bar held in custody after deadly New Year's Eve fire - BBC",
    "fullText": "Jacques Moretti is being held as a potential flight risk, Swiss media reports say.",
    "link": "https://www.bbc.com/news/articles/c4g0mq520zeo"
  },
  {
    "text": "Russia uses its new ballistic missile in a major attack on Ukraine and a warning to West - AP News",
    "fullText": "Russia has launched a massive overnight attack on Ukraine, using hundreds of drones and dozens of missiles. Officials say at least four people have been killed. For only the second time in the nearly 4-year-old war, it used a powerful, new hypersonic missile …",
    "link": "https://apnews.com/article/russia-ukraine-war-drones-missile-kyiv-56655401d55ab4818800c43b7035b2a9"
  },
  {
    "text": "Amazon Pharmacy starts offering Novo Nordisk's Wegovy weight-loss pill - CNBC",
    "fullText": "Eligible customers with insurance can pay as little as $25 for a one-month supply of the drug, while cash-paying options start at $149 a month, Amazon said.",
    "link": "https://www.cnbc.com/2026/01/09/amazon-pharmacy-starts-offering-novo-nordisks-wegovy-weight-loss-pill.html"
  },
  {
    "text": "NFL Playoffs head coach rankings for 2026, from No. 1 to No. 14 - SB Nation",
    "fullText": "Let’s rank every head coach in the 2026 NFL Playoffs.",
    "link": "https://www.sbnation.com/nfl/1099230/nfl-playoffs-head-coach-rankings-for-2026-ben-johnson-kyle-shanahan"
  },
  {
    "text": "Everything We Learned About Divinity From Larian's Reddit AMA - IGN",
    "fullText": "Larian’s Reddit AMA on Divinity has concluded, and with it comes a number of new details on the Baldur’s Gate 3 developer’s next game. Here's everything revealed.",
    "link": "https://www.ign.com/articles/everything-we-learned-about-divinity-from-larians-reddit-ama"
  },
  {
    "text": "Here’s what’s happening now with mortgage rates after Trump's latest push on housing affordability - CNBC",
    "fullText": "President Donald Trump posted on social media Thursday that he is instructing mortgage giants Fannie Mae and Freddie Mac to buy $200 billion in mortgage bonds.",
    "link": "https://www.cnbc.com/2026/01/09/heres-whats-happening-now-with-mortgage-rates-.html"
  },
  {
    "text": "‘Black Mirror’ Renewed For Season 8 At Netflix - Deadline",
    "fullText": "'Black Mirror' Season 8 is coming to Netflix from Charlie Brooker, announced as Rashida Jones and Paul Giamatti head to the Golden Globes.",
    "link": "http://deadline.com/2026/01/black-mirror-season-8-coming-to-netflix-charlie-brooker-1236677316/"
  },
  {
    "text": "Winter storm slams UK and France as cold snap spreads across Europe - AP News",
    "fullText": "Thousands of homes and businesses across northern France and southern England are without power and residents faced widespread travel delays after a storm swept in off the Atlantic. The low-pressure system named Storm Goretti brought high winds, rain and snow…",
    "link": "https://apnews.com/article/britain-france-goretti-storm-d9d2d60fcc34a7a3be8033c5d739e843"
  },
  {
    "text": "Snow and wind in the forecast for Soldier Field on Saturday night - NBC Sports",
    "fullText": "The forecast for Chicago on Saturday night indicates that Soldier Field will have exactly the kind of weather a Packers-Bears playoff game deserves.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/snow-and-wind-in-the-forecast-for-soldier-field-on-saturday-night"
  },
  {
    "text": "BAFTA Film Awards 2026: ‘One Battle After Another’ Leads Longlists, Ahead of ‘Hamnet’ and ‘Sinners’ - The Hollywood Reporter",
    "fullText": "Josh Safdie and Timothée Chalamet's ping-pong caper 'Marty Supreme' is right behind them, as the Brits weigh in on the 2026 awards race.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/bafta-film-awards-2026-longlists-one-battle-hamnet-sinners-1236468206/"
  },
  {
    "text": "Bill Gates warns the world going is ‘backwards’ and gives 5-year deadline before we enter a new Dark Age - Fortune",
    "fullText": "In his annual letter, Microsoft co-founder Bill Gates said over the next five years the world needs to get \"back on track.\"",
    "link": "https://fortune.com/2026/01/09/bill-gates-world-backwards-funding-fears-dark-ages/"
  },
  {
    "text": "Pope Leo says ‘war is back in vogue’ in major address to global envoys - CNN",
    "fullText": "Pope Leo XIV has said the prohibition on countries violating one another’s borders has been “completely undermined,” in an important speech to diplomats gathered in the Vatican.",
    "link": "https://www.cnn.com/2026/01/09/europe/pope-leo-state-of-world-address-envoys-intl"
  },
  {
    "text": "Massive iconic iceberg turns blue and is \"on the verge of complete disintegration,\" NASA says - CBS News",
    "fullText": "Scientists say all signs indicate the so-called \"megaberg\" could be just days or weeks from totally disintegrating.",
    "link": "https://www.cbsnews.com/news/iceberg-a23a-turns-blue-verge-of-complete-disintegration-nasa/"
  },
  {
    "text": "DHS Launches Landmark USCIS Fraud Investigation in Minnesota - USCIS (.gov)",
    "fullText": "The Department of Homeland Security and U.S. Citizenship and Immigration Services have launched Operation PARRIS in Minnesota, a sweeping initiative reexamining thousands of refugee cases through new background checks and intensive verification of refugee cla…",
    "link": "https://www.uscis.gov/newsroom/news-releases/dhs-launches-landmark-uscis-fraud-investigation-in-minnesota"
  },
  {
    "text": "Venezuela releases imprisoned opposition figures, which Trump says U.S. requested - NPR",
    "fullText": "Venezuela released a number of imprisoned high-profile opposition figures, activists and journalists, in what the government described as a gesture to \"seek peace\".",
    "link": "https://www.npr.org/2026/01/09/nx-s1-5672325/venezuela-releases-imprisoned-opposition-figures-trump-says-us-requested"
  },
  {
    "text": "Submarine Vanishes Beneath Antarctic Ice After Uncovering Mysterious Hidden Structures Scientists Can't Explain - The Daily Galaxy",
    "fullText": "A groundbreaking Antarctic mission revealed bizarre hidden structures beneath a melting ice shelf, then the research robot vanished without a trace.",
    "link": "https://dailygalaxy.com/2026/01/antarctic-submarine-vanish-after-discovering-mysterious-structures/"
  },
  {
    "text": "Scientists find new clues to why female fertility declines with age - The Washington Post",
    "fullText": "New studies are shedding light on one of the biggest mysteries of human reproduction and what can be done to combat it.",
    "link": "https://www.washingtonpost.com/health/2026/01/09/ivf-fertility-aging-eggs/"
  },
  {
    "text": "RFK Jr. Just Made Another Huge Move—and It’s Going to Send Parents Everywhere Scrambling - Slate",
    "fullText": "There's about to be more illness going around at day cares.",
    "link": "https://slate.com/technology/2026/01/rfk-jr-day-care-illness-working-parents-vaccines.html"
  }
]