[
  {
    "text": "Switzerland: All victims of bar fire disaster identified - DW",
    "fullText": "More than half of those who died at a Swiss ski resort celebrating the New Year were under 18 years of age, with two as young as 14. Switzerland will hold a day of mourning on Friday in memory of the victims.",
    "link": "https://www.dw.com/en/switzerland-bar-fire-all-victims-of-new-years-fire-identified/a-75387162"
  },
  {
    "text": "Stock futures are higher after U.S. attacks Venezuela, captures Nicolas Maduro: Live updates - CNBC",
    "fullText": "Global markets reacted to the U.S.' attack on Venezuela and capture of leader Nicolas Maduro.",
    "link": "https://www.cnbc.com/2026/01/04/stock-market-today-live-updates.html"
  },
  {
    "text": "Trial begins for former Uvalde officer charged in Robb Elementary shooting response - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/trial-begins-former-uvalde-officer-charged-robb-elementary/story?id\\\\u003d128898094"
  },
  {
    "text": "New redesigned coins marking nation's 250th birthday begin circulating today - NPR",
    "fullText": "New coins marking the United States' 250th anniversary begin circulating this week. The Trump administration tweaked the design of some coins and is considering a dollar coin featuring the president.",
    "link": "https://www.npr.org/2026/01/05/nx-s1-5660747/new-redesigned-coins-250th-anniversary"
  },
  {
    "text": "Rams -9.5 among four road teams favored in the wild card round - NBC Sports",
    "fullText": "Only two home teams are favored in the first round of the playoffs.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/rams-9-5-among-four-road-teams-favored-in-the-wild-card-round"
  },
  {
    "text": "What the Steelers Said After Beating Ravens in Wild Fashion - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Here’s what the Steelers said after defeating the Ravens at the buzzer of the AFC North title game.",
    "link": "https://www.baltimoreravens.com/news/mike-tomlin-aaron-rodgers-patrick-queen-steelers-said-ravens-afc-north-title"
  },
  {
    "text": "China Asks Banks to Report Exposure to Venezuela After US Raid - Bloomberg.com",
    "fullText": "China’s top financial regulator asked its policy banks and other major lenders to report their lending exposure to Venezuela after the US ousted the South American country’s Beijing-friendly leader, according to people familiar with the matter.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-05/china-asks-banks-to-report-exposure-to-venezuela-after-us-raid"
  },
  {
    "text": "Actor Mickey Rourke turns to fans to help pay back rent, avoid eviction - ABC7 Los Angeles",
    "fullText": "Actor Mickey Rourke is turning to GoFundMe to pay more than $59,000 in back rent. The page says the money raised will help prevent his eviction, along with giving him some stability during a stressful time.",
    "link": "https://abc7.com/post/actor-mickey-rourke-turns-fans-help-pay-back-rent-avoid-eviction/18353856/"
  },
  {
    "text": "U.S. plan to ‘run’ Venezuela clouded in confusion and uncertainty - The Washington Post",
    "fullText": "In Washington and Caracas, the vision for administering Venezuela in the weeks and months ahead appears uncertain and stubbornly complex.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/04/us-venezuela-plan-trump-rubio-miller/"
  },
  {
    "text": "Who controls Venezuela's oil now? What Maduro's arrest means for energy markets - CNBC",
    "fullText": "The arrest of Nicolás Maduro has thrown Venezuela's politically fraught oil industries back into focus.",
    "link": "https://www.cnbc.com/2026/01/05/venezuela-oil-sour-crude-control-chevron-post-maduro-arrest.html"
  },
  {
    "text": "Cuba says 32 Cuban officers were killed in US operation in Venezuela that captured Nicolás Maduro - ABC7 Los Angeles",
    "fullText": "\"You know, a lot of Cubans were killed yesterday... No death on our side,\" President Donald Trump said.",
    "link": "https://abc7.com/post/cuba-says-32-cuban-officers-were-killed-us-operation-venezuela/18353414/"
  },
  {
    "text": "LG’s Wallpaper OLED TV returns to CES, and it’s wafer thin - The Verge",
    "fullText": "The W6 Wallpaper TV from LG will have a Zero Connect Box and use LG’s new Hyper Radiant Color Technology and Brightness Booster Ultra.",
    "link": "https://www.theverge.com/tech/853886/lgs-wallpaper-oled-tv-returns-to-ces-and-its-wafer-thin"
  },
  {
    "text": "Timothée Chalamet Thanks Kylie Jenner, Wins Best Actor at Critics Choice Awards - Variety",
    "fullText": "Timothée Chalamet won big at the Critics Choice Awards for his role in \"Marty Supreme.\"",
    "link": "https://variety.com/2026/film/awards/timothee-chalamet-kylie-jenner-best-actor-critics-choice-awards-1236623421/"
  },
  {
    "text": "American tourists stranded across the Caribbean after airspace closed for Maduro capture - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/american-tourists-stranded-caribbean-after-airspace-closed-maduro/story?id\\\\u003d128891191"
  },
  {
    "text": "CES 2026 Live: Tech's Big Event Kicks Off From Las Vegas - CNET",
    "fullText": "Follow us all week as we cover the biggest technology conference of the year, including new reveals and intriguing concepts that will all lead up to CNET officially choosing the best of CES 2026.",
    "link": "https://www.cnet.com/news-live/ces-2026-news-live-updates/"
  },
  {
    "text": "Critics Choice Awards: Winners List (Updating Live) - The Hollywood Reporter",
    "fullText": "Among the winners so far are 'Sinners,' 'KPop Demon Hunters,' 'The Studio,' 'Adolescence' and 'Jimmy Kimmel Live!'",
    "link": "http://www.hollywoodreporter.com/lists/critics-choice-awards-2026-winners-list-full/"
  }
]