[
  {
    "text": "Dow is little changed as investor enthusiasm for better-than-expected jobs data wanes: Live updates - CNBC",
    "fullText": "Traders reacted to the release of the delayed January jobs report, which showed a gain of 130,000 on the month.",
    "link": "https://www.cnbc.com/2026/02/10/stock-market-today-live-updates.html"
  },
  {
    "text": "Pam Bondi clashes with House Democrats over Epstein files at DOJ oversight hearing - NPR",
    "fullText": "The attorney general's appearance before the House Judiciary Committee comes one year into her tenure, a period marked by a striking departure from traditions and norms at the Justice Department.",
    "link": "https://www.npr.org/2026/02/11/nx-s1-5707280/pam-bondi-oversight-hearing-department-of-justice"
  },
  {
    "text": "FBI combs through thick desert terrain in search for clues in Nancy Guthrie’s disappearance - AP News",
    "fullText": "FBI agents are fanning out across an Arizona neighborhood not far from Nancy Guthrie’s home. They're knocking on doors and searching through thick desert terrain. This comes a day after authorities investigating Guthrie's disappearance detained a man who says…",
    "link": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-6f1016e390e2c59d82604731f795a8ba"
  },
  {
    "text": "IRS improperly disclosed confidential immigrant tax data to DHS - The Washington Post",
    "fullText": "The tax agency only recently discovered it improperly disclosed tax information on thousands of the wrong people to immigration enforcement.",
    "link": "https://www.washingtonpost.com/business/2026/02/11/immigrants-irs-dhs-tax-data/"
  },
  {
    "text": "Apple releases iOS 26.3 for iPhone, here’s what’s new - 9to5Mac",
    "fullText": "There’s a new software update available for iPhone. Apple has released iOS 26.3, the third big update to Apple’s redesigned...",
    "link": "https://9to5mac.com/2026/02/11/apple-releases-ios-26-3-for-iphone-heres-whats-new/"
  },
  {
    "text": "[Update: Delayed] Google launches Android 17 Beta for Pixel - 9to5Google",
    "fullText": "The next major version of Google’s mobile OS is debuting as a Beta release. Android 17 Beta 1 is rolling out today to Pixel devices.",
    "link": "http://9to5google.com/2026/02/11/android-17-beta-1-pixel/"
  },
  {
    "text": "Klint Kubiak’s intent to call Tom Brady “a lot” highlights his conflict of interest - NBC Sports",
    "fullText": "If/when the Raiders become contenders, other teams will cry foul.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/klint-kubiaks-intent-to-call-tom-brady-a-lot-highlights-his-conflict-of-interest"
  },
  {
    "text": "Iran commemorates 1979 revolution as nation is squeezed by anger over crackdown and tensions with US - AP News",
    "fullText": "Iran marks the 47th anniversary of its 1979 Islamic Revolution as leaders face pressure from the U.S. and anger at home. On Wednesday, state TV shows huge pro-government rallies with chants against America. Witnesses in Tehran also report shouts of “Death to …",
    "link": "https://apnews.com/article/iran-revolution-anniversary-us-nuclear-talks-protests-4ffab53ef628073ca90b9c8707485577"
  },
  {
    "text": "GOP Senators rail at FDA after closed-door briefing on abortion drug - Politico",
    "fullText": "Republicans aren't confident the Trump administration is taking a promised review seriously.",
    "link": "https://www.politico.com/live-updates/2026/02/11/congress/bitter-pills-00775740"
  },
  {
    "text": "Corbin Carroll To Undergo Surgery For Hamate Fracture - MLB Trade Rumors",
    "fullText": "Diamondbacks superstar Corbin Carroll broke a bone during batting practice and will need surgery. Get more details over at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/02/dbacks-corbin-caroll-hamate-fracture-surgery.html"
  },
  {
    "text": "AI’s threat to white-collar jobs just got more real - vox.com",
    "fullText": "You’ve become more replaceable.",
    "link": "https://www.vox.com/politics/478794/ai-economy-claude-code-jobs-openai-anthropic"
  },
  {
    "text": "Inside the Secret Smear Machine That’s Targeting Hollywood - The Hollywood Reporter",
    "fullText": "A shadowy network of anonymous slander sites is attacking players in high-profile entertainment scandals — from Blake vs. Baldoni to a Rebel Wilson film fiasco to an ugly K-pop feud. Critics allege they’re all the handiwork of a small circle of operatives.",
    "link": "http://www.hollywoodreporter.com/business/business-news/inside-hollywood-smear-campaign-scandals-1236501807/"
  },
  {
    "text": "Greetings from Mexico City's iconic boulevard, where a dog on a bike steals the show - NPR",
    "fullText": "Every week, more than 100,000 people ride bikes, skates and rollerblades past some of the best-known parts of Mexico's capital. And sometimes their dogs join them too.",
    "link": "https://www.npr.org/2026/02/11/nx-s1-5699414/mexico-city-sunday-paseo-de-la-reforma"
  },
  {
    "text": "New York Fashion Week 2026: the key trends and styles - The Times",
    "fullText": "The American dream meets Game of Thrones as Ralph Lauren kicks off fashion month",
    "link": "https://www.thetimes.com/life-style/fashion/article/new-york-fashion-week-2026-aw-lnqcl02zn"
  },
  {
    "text": "Andrew sent Epstein UK briefing on Afghan investments, document suggests - BBC",
    "fullText": "The briefing which includes \"high value commercial opportunities\" in Helmand province, appears in the Epstein files.",
    "link": "https://www.bbc.com/news/articles/cjd95r1k279o"
  },
  {
    "text": "Gunman takes hostages after firing shots at school in southern Thailand - NBC News",
    "fullText": "A gunman who fired shots at a school in Hat Yai district in southern Thailand has been detained and all the people who were held hostage have been freed.",
    "link": "https://www.nbcnews.com/world/thailand/thailand-gunman-school-shots-hostages-hat-yai-rcna258507"
  },
  {
    "text": "What a cardiologist eats in a day for better heart health - The Washington Post",
    "fullText": "Dariush Mozaffarian is a leader in the food-is-medicine movement. This is exactly what he eats — and yes, dessert is on the list.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/11/what-cardiologist-eats-heart-health/"
  },
  {
    "text": "Eight Lessons We Learned During the 2025 NFL Season: Defense Reigns Supreme - Sports Illustrated",
    "fullText": "After years of innovative offenses dominating, defenses got their revenge. Plus, why patience pays off for quarterbacks and more of what this season taught us.",
    "link": "https://www.si.com/nfl/eight-lessons-we-learned-during-2025-nfl-season-defense-reigns-supreme"
  }
]