[
  {
    "text": "Israel reopens Gaza's key Rafah border crossing with Egypt - BBC",
    "fullText": "Only dozens of Palestinians and no goods will be able to cross in both directions each day.",
    "link": "https://www.bbc.com/news/articles/c99kdjdj9l8o"
  },
  {
    "text": "Albert Breer’s Takeaways: Three Lessons From Sam Darnold’s Rise in Seattle - Sports Illustrated",
    "fullText": "The Seahawks took an unorthodox swing at quarterback that paid off big-time. Plus, why the Vikings fired Kwesi Adofo-Mensah and more.",
    "link": "https://www.si.com/nfl/albert-breer-takeaways-three-lessons-from-sam-darnold-seattle-rise"
  },
  {
    "text": "After a snowy month, Punxsutawney Phil predicts more winter ahead - The Washington Post",
    "fullText": "Punxsutawney Phil’s Groundhog Day prediction of more winter follows an exceptionally snowy month across the eastern U.S.",
    "link": "https://www.washingtonpost.com/weather/2026/02/02/groundhog-day-punxsutawney-phil-winter-snow-prediction/"
  },
  {
    "text": "Earthquake shakes Bay Area - San Francisco Chronicle",
    "fullText": "Multiple earthquakes were detected in an area southeast of San Ramon, according to data from the U.S. Geological Survey.",
    "link": "https://www.sfchronicle.com/california/article/earthquake-21248591.php"
  },
  {
    "text": "New iPhone Fold specs revealed, including design, cameras, more - 9to5Mac",
    "fullText": "New details have been shared by another leaker on several aspects of the iPhone Fold’s design, features, and more",
    "link": "https://9to5mac.com/2026/02/02/new-iphone-fold-specs-revealed-including-design-cameras-more/"
  },
  {
    "text": "Ex-Israeli Military Advocate General Denies Criminality of Abuse Video Leak - Haaretz",
    "fullText": "Ukraine Informs Israel That It Will Designate Iran's Revolutionary Guards as Terrorist Organization. U.K. Imposes Sanctions on Ten Individuals Involved in Suppressing Iran Protests, Including Iranian Interior Minister. RECAP: Iranian FM and U.S. Special Envoy…",
    "link": "https://www.haaretz.com/israel-news/2026-02-02/ty-article-live/.premium/idf-says-it-struck-hezbollah-militant-in-southern-lebanon/0000019c-1c63-d3f5-a5fd-dc6bd52d0005"
  },
  {
    "text": "U.S.-Iran nuclear talks planned for Friday amid military buildup - Axios",
    "fullText": "This would be the first meeting since the war in June.",
    "link": "https://www.axios.com/2026/02/02/iran-nuclear-talks-trump-military"
  },
  {
    "text": "Ukraine updates: Russia steps up attacks on transport routes - dw.com",
    "fullText": "Ukraine's Zelenskyy says Russia is focusing on attacking \"primarily railway infrastructure.\" Meanwhile, the Kremlin has said talks with Ukraine will continue in Abu Dhabi on Wednesday. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-russia-steps-up-attacks-on-transport-routes/live-75766331"
  },
  {
    "text": "Elephant kills tourist at national park in Thailand, third fatality linked to the same animal - CBS News",
    "fullText": "The victim's wife managed to escape after park rangers scared the animal away, officials said.",
    "link": "https://www.cbsnews.com/news/elephant-kills-tourist-thailand-third-fatality-same-animal/"
  },
  {
    "text": "Google releases ‘Desktop Camera’ app that’s seemingly for Android PCs - 9to5Google",
    "fullText": "Google has quietly released a new \"Desktop Camera\" app that's seemingly meant for future Android PCs on the new desktop experience.",
    "link": "http://9to5google.com/2026/02/02/google-android-desktop-camera-app/"
  },
  {
    "text": "Grammys 2026 full coverage: Bad Bunny takes home Album of the Year, Kendrick Lamar and SZA win Record of the Year - Yahoo",
    "fullText": "It was a star-studded night at the Crypto.com Arena.",
    "link": "https://www.yahoo.com/entertainment/music/live/grammys-2026-winners-and-live-updates-sabrina-carpenter-lady-gaga-and-justin-bieber-set-to-perform-on-musics-biggest-night-150041626.html"
  },
  {
    "text": "‘Michael’ Trailer: Michael Jackson Biopic Chronicles Rise From Child Star to King of Pop - Variety",
    "fullText": "Lionsgate has released the full trailer for the Michael Jackson biopic, 'Michael.'",
    "link": "https://variety.com/2026/film/news/michael-trailer-michael-jackson-biopic-1236625431/"
  },
  {
    "text": "UFC 325 fight grades: Why Volkanovski vs. Lopes didn't earn an A - ESPN",
    "fullText": "Which fights were the standouts from UFC 325? Andreas Hale grades all the matchups from Saturday's fight card in Sydney.",
    "link": "https://www.espn.com/mma/story/_/id/47802626/ufc-325-fight-grades-alexander-volkanovski-vs-diego-lopes-did-not-earn-a"
  },
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA prepares to load propellant in critical fueling test - Space",
    "fullText": "Monday, Feb. 2, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-2-2026"
  },
  {
    "text": "Sun unleashes extraordinary solar flare barrage as new volatile sunspot turns toward Earth - Space",
    "fullText": "A rapidly growing sunspot has fired off at least 18 M-class and three X-class flares in just 24 hours, including an intense X8.3 eruption.",
    "link": "https://www.space.com/astronomy/sun/sun-unleashes-extraordinary-solar-flare-barrage-as-new-volatile-sunspot-turns-toward-earth"
  },
  {
    "text": "The 2026 Winter Olympics Will Give an Untraditionally Italian Region Its Moment - Sports Illustrated",
    "fullText": "Milan and Cortina will be the first cohost cities in Olympic history, setting the stage for a diverse Games that will showcase 116 events and myriad cultures in Northern Italy.",
    "link": "https://www.si.com/winter-olympics/2026-milan-cortina-games-will-give-untraditionally-italian-region-its-moment"
  },
  {
    "text": "Devon, Coterra merge to create U.S. shale giant in $58 billion deal - CNBC",
    "fullText": "This deal is the largest tie-up in the U.S. shale industry since Diamondback acquired Endeavor Energy Resources for about $26 billion in 2024.",
    "link": "https://www.cnbc.com/2026/02/02/us-shale-producers-devon-and-coterra-to-merge-in-a-58-billion-deal.html"
  },
  {
    "text": "Wetzel: NFL should look into Giants co-owner Steve Tisch - ESPN",
    "fullText": "Steve Tisch isn't accused of violating any law, but commissioner Roger Goodell should ask lots of questions.",
    "link": "https://www.espn.com/nfl/story/_/id/47800278/nfl-look-giants-co-owner-steve-tisch"
  },
  {
    "text": "Samsung says its 2026 OLED TVs and Odyssey monitors are now NVIDIA G-SYNC Compatible - VideoCardz.com",
    "fullText": "Samsung brings NVIDIA G-SYNC Compatible and AMD FreeSync Premium Pro to 2026 OLED TVs Samsung Electronics says the 2026 OLED TV range and its next Odyssey",
    "link": "https://videocardz.com/newz/samsung-says-its-2026-oled-tvs-and-odyssey-monitors-are-now-nvidia-g-sync-compatible"
  }
]