[
  {
    "text": "Stock futures rise after major averages rebound on easing tariff fears: Live updates - CNBC",
    "fullText": "Major U.S. stock averages immediately jumped after President Donald Trump said he would no longer impose his new Europe tariffs that were set to begin Feb. 1.",
    "link": "https://www.cnbc.com/2026/01/21/stock-market-today-live-updates.html"
  },
  {
    "text": "Brewers Trade Freddy Peralta To Mets - MLB Trade Rumors",
    "fullText": "Freddy Peralta is a New York Met. Read up on the blockbuster move and all its implications at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/mets-trade-for-freddy-peralta.html"
  },
  {
    "text": "No. 7 Nebrasketball Tops Washington as Braden Frager Suffers Injury - Sports Illustrated",
    "fullText": "During the 23rd straight victory for Nebrasketball, freshman Braden Frager suffered an injury that knocked him out of the game after just four minutes of action.",
    "link": "https://www.si.com/college/nebraska/basketball/no-7-nebrasketball-tops-washington-as-braden-frager-suffers-injury-2026"
  },
  {
    "text": "Mysterious Giants Could Be a Whole New Kind of Life That No Longer Exists - ScienceAlert",
    "fullText": "Ever since their discovery more than 165 years ago, massive fossilized structures left by an organism known as Prototaxites have proven impossible to categorize.",
    "link": "https://www.sciencealert.com/mysterious-giants-could-be-a-whole-new-kind-of-life-that-no-longer-exists"
  },
  {
    "text": "Supreme Court appears likely to allow Lisa Cook to remain on Fed board - The Washington Post",
    "fullText": "Such a decision, which would hold while a lawsuit challenging her removal plays out, would prevent Trump from exerting greater influence over the powerful central bank.",
    "link": "https://www.washingtonpost.com/politics/2026/01/21/fed-lisa-cook-supreme-court-trump/"
  },
  {
    "text": "Exclusive | The U.S. Is Actively Seeking Regime Change in Cuba by the End of the Year - WSJ - The Wall Street Journal",
    "fullText": "After ousting Venezuela’s leader, the Trump administration is searching for Havana insiders who could cut a deal to end Communist rule",
    "link": "https://www.wsj.com/world/americas/the-u-s-is-actively-seeking-regime-change-in-cuba-by-the-end-of-the-year-1d0f178a"
  },
  {
    "text": "Lucas: Notre Dame Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the last home game of the month.",
    "link": "https://goheels.com/news/2026/1/21/mens-basketball-lucas-notre-dame-rapid-reactions"
  },
  {
    "text": "Four Observations from Bayern Munich’s 2-0 Champions League win over Union Saint-Gilloise - Bavarian Football Works",
    "fullText": "It was tough sledding, but FC Bayern has clinched a last 16 berth in Europe.",
    "link": "https://www.bavarianfootballworks.com/bayern-munich-match-observations/161452/bayern-munich-union-saint-gilloise-observations-match-analysis-champions-league-harry-kane-michael-olise"
  },
  {
    "text": "FBI reveals how mistaken identity by ICE led to chase, shooting of Venezuelan immigrant in north Minneapolis - Star Tribune",
    "fullText": "A federal affidavit details what precipitated the alleged broom attack of an agent that ended with him firing a single shot, wounding a man who was not the original target.",
    "link": "https://www.startribune.com/fbi-reveals-how-mistaken-identity-by-ice-led-to-chase-shooting-of-venezuelan-immigrant-in-north-minneapolis/601567978"
  },
  {
    "text": "Thurston County reports first flu-related death as state sees sharp rise in cases - komonews.com",
    "fullText": "PHSS said each year, hundreds of thousands of people in the United States are hospitalized with flu-related illnesses.",
    "link": "https://komonews.com/news/local/thurston-county-influenza-related-death-washington-state-death-flu-related-symptoms-phss-washington-state-department-of-health-statewide-illness"
  },
  {
    "text": "2027 Volvo EX60 Revealed: Long Range, Fast Charging, And A Tesla Port - Motor1.com",
    "fullText": "The Volvo EX60 is officially here with up to 400 miles of range and a native NACS port. It adds 173 miles after 10 minutes of charging.",
    "link": "https://www.motor1.com/news/785028/volvo-ex60-revealed-specs-photos/"
  },
  {
    "text": "EW's final Oscar nomination predictions — we debate who'll make the cut - Entertainment Weekly",
    "fullText": "From Best Picture to director and all the acting categories, EW's awards team make our final Oscar nomination predictions. See who we think will make the cut.",
    "link": "https://ew.com/final-oscar-nomination-predictions-awards-team-debate-awardist-podcast-11885801"
  },
  {
    "text": "Israel kills 3 journalists in Gaza, including CBS News contributor - The Washington Post",
    "fullText": "The journalists were killed Wednesday in a strike on their car in central Gaza. Israel’s military said it struck “several suspects” who were operating a drone.",
    "link": "https://www.washingtonpost.com/world/2026/01/21/israel-strike-journalists-gaza-cbs-news/"
  },
  {
    "text": "Final Oscar Nominations Predictions via Feinberg Forecast - hollywoodreporter.com",
    "fullText": "The Hollywood Reporter's executive editor of awards coverage projects that the field will be led by 'Sinners' (with a record-breaking 15 noms), 'One Battle After Another' (12), Frankenstein (11) and 'Hamnet' (11).",
    "link": "http://www.hollywoodreporter.com/lists/final-oscar-nominations-predictions-feinberg-forecast/"
  },
  {
    "text": "Clair Obscur: Expedition 33 leads resist calls to \"scale up,\" insist they \"love making games more than managing\" - GamesIndustry.biz",
    "fullText": "Clair Obscur: Expedition 33 developer Sandfall Interactive is resisting calls to \"scale up now [it has] a lot more mone…",
    "link": "https://www.gamesindustry.biz/clair-obscur-expedition-33-leads-resist-calls-to-scale-up-insist-they-love-making-games-more-than-managing"
  },
  {
    "text": "Trump's jibes are wearing thin for many of Europe's leaders - BBC",
    "fullText": "The ball is in the court of European leaders ahead of Thursday's emergency EU meeting in Brussels, writes Nick Beake.",
    "link": "https://www.bbc.com/news/articles/cd9ez1nj3n3o"
  },
  {
    "text": "SocGen to axe 1,800 jobs in France as chief steps up cost cuts - Financial Times",
    "fullText": "Investors have started to reward turnaround effort under Slawomir Krupa",
    "link": "https://www.ft.com/content/493fc3f1-50bc-4724-939f-d9ec2889459f"
  },
  {
    "text": "Trump and Zelenskyy to meet Thursday at Davos - Politico",
    "fullText": "The meeting comes amid an apparent standstill in negotiations to end the war in Ukraine.",
    "link": "https://www.politico.com/news/2026/01/21/trump-and-zelenskyy-to-meet-thursday-at-davos-00738835"
  },
  {
    "text": "Sundance prepares for its final Park City festival before moving to Boulder, Colo. - NPR",
    "fullText": "As the festival prepares to move to Colorado, filmmakers and cinephiles gather to celebrate its founder and the future of indie film.",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5631847/sundance-film-festival-park-city"
  }
]