[
  {
    "text": "Latest Trump news: Iran talks face uncertainty, DHS funding remains at impasse - CNN",
    "fullText": "US-brokered talks between Ukrainian and Russian delegations ended today in Geneva. In DC, the partial government shutdown continues as both parties remain deadlocked over DHS funding. Follow for live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-administration-news-02-18-26"
  },
  {
    "text": "Stephen Colbert uses his show to roast CBS in feud over FCC rules - The Washington Post",
    "fullText": "The FCC chief blasted the Texas Democrat whose interview with Colbert was allegedly blocked by CBS, while claiming Americans trust “gas station sushi” more than the news media.",
    "link": "https://www.washingtonpost.com/business/2026/02/18/colbert-james-talarico-fcc-segment-cbs/"
  },
  {
    "text": "Amber Glenn’s dreams were ‘smashed to pieces’ with just one mistake - The Washington Post",
    "fullText": "The three-time U.S. champion is picking up the pieces after a missed jump in the short program dropped her to 13th place.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/18/amber-glenn-olympics-figure-skating/"
  },
  {
    "text": "Russia hosts Cuban foreign minister and urges US not to blockade Cuba - Associated Press News",
    "fullText": "The Cuban foreign minister is visiting Moscow as the island faces blackouts and severe fuel shortages worsened by a U.S oil embargo. Cuban Foreign Minister Bruno Rodriguez held talks with his Russian counterpart Sergey Lavrov and later in the day with Preside…",
    "link": "https://apnews.com/article/russia-cuba-putin-rodriguez-lavrov-oil-embargo-80ed0a0ae6c50935e90f56feb15f7291"
  },
  {
    "text": "Nancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos made a plea Tuesday to the suspect in Nancy Guthrie’s disappearance, urging the individual to “just let her go.” He added that the investigation continues to be a rescue operation and not a recovery mission.",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-18-live-updates"
  },
  {
    "text": "The fuel set to propel NASA’s moon crew is notorious for leaking. So why use it? - CNN",
    "fullText": "NASA’s first crewed moon mission in decades was delayed as its engineers grapple with an all-too-familiar rocket problem: hydrogen leaks. Fixing the issue is even trickier than it may seem.",
    "link": "https://www.cnn.com/2026/02/18/science/artemis-2-nasa-hydrogen-leaks"
  },
  {
    "text": "Musk Rails Against ‘Woke And Sanctimonious’ AI Rivals—Insists ‘Grok Must Win’ - Forbes",
    "fullText": "Elon Musk argued his company xAI's chatbot Grok is a counter to rivals ChatGPT, Gemini and Claude, whom he labeled as “woke” and “weak sauce” on culture war issues.",
    "link": "https://www.forbes.com/sites/siladityaray/2026/02/18/musk-rails-against-woke-and-sanctimonious-ai-rivals-insists-grok-musk-win/"
  },
  {
    "text": "‘Heated Rivalry’ Star Hudson Williams Re-teams With Crave For Baba Yaga Drama - Deadline",
    "fullText": "'Heated Rivalry's Hudson Williams has been cast in Crave drama 'Yaga' opposite Carrie-Anne Moss, Noah Reid and Clark Backo.",
    "link": "http://deadline.com/2026/02/heated-rivalry-hudson-williams-crave-yaga-drama-series-1236728206/"
  },
  {
    "text": "Trump administration releases remaining Gateway funds — and then some - Politico",
    "fullText": "The stalled rail tunnel project between New York and New Jersey will resume construction next week.",
    "link": "https://www.politico.com/news/2026/02/18/trump-releases-gateway-tunnel-funds-00786335"
  },
  {
    "text": "DOT wants to block transit money to states that aid migrants - Politico",
    "fullText": "The administration hopes to insert the draft language in the upcoming highway bill reauthorization.",
    "link": "https://www.politico.com/news/2026/02/18/dot-wants-to-block-transit-money-to-states-that-aid-migrants-00775657"
  },
  {
    "text": "Trump would like the government he leads to pay him billions - NPR",
    "fullText": "President Trump is asking the federal government for billions of dollars in damages, putting his own Justice Department on the spot and creating an unprecedented ethical morass.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5702503/trump-government-lawsuits-pay-himself-billions"
  },
  {
    "text": "Alex Pereira reacts to Jon Jones’ ‘severe arthritis’ diagnosis, discusses options for next UFC fight - MMA Fighting",
    "fullText": "Alex Pereira reacts to Jon Jones’ recent health news that could impact a future clash between the two UFC stars.",
    "link": "https://www.mmafighting.com/ufc/472141/alex-pereira-reacts-to-jon-jones-severe-arthritis-diagnosis-discusses-options-for-next-ufc-fight"
  },
  {
    "text": "NFL free agency 2026: Are the Giants a potential Mike Evans landing spot? - Big Blue View",
    "fullText": "Could this future Hall of Famer fill the Giants need for wide receiver help?",
    "link": "https://www.bigblueview.com/new-york-giants-free-agency/154875/mike-evans-landing-spot-malik-nabers-wandale-robinson-jaxson-dart"
  },
  {
    "text": "In a golden masterclass, Norway’s Klaebo extends Winter Olympics medal record - Associated Press News",
    "fullText": "Norway’s Johannes Hoesflot Klaebo has won a 10th gold medal in cross country skiing at the Milan Cortina Olympics, setting another Winter Games record. The 29‑year‑old, racing with Einar Hedegart, won the men’s team sprint, for his fifth gold at the 2026 Game…",
    "link": "https://apnews.com/article/johannes-hoesflot-klaebo-cross-country-record-norway-f5a2e5150122de904f0de0e03fa45edf"
  },
  {
    "text": "Update regarding AJ Styles celebration planned for WWE Raw - F4W/WON",
    "fullText": "An update is available regarding the celebration planned for AJ Styles on Raw this week.",
    "link": "https://www.f4wonline.com/news/wwe/update-regarding-aj-styles-celebration-wwe-raw/"
  },
  {
    "text": "Russia's hybrid warfare rattles Poland and NATO - NPR",
    "fullText": "Russia is stepping up covert attacks across Europe — rail sabotage, drones, cyberstrikes — testing NATO. Polish officials warn \"disposable agents\" are sowing fear and weakening support for Ukraine.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5702706/russia-hybrid-warfare-poland"
  },
  {
    "text": "Microsoft to keep buying enough renewable energy to match all its electricity needs - Yahoo Finance",
    "fullText": "Microsoft has promised to keep buying enough renewable energy to match all its electricity needs after meeting that ‌goal for the first time last year, as...",
    "link": "https://finance.yahoo.com/news/microsoft-keep-buying-enough-renewable-160258881.html"
  },
  {
    "text": "Record scratch—Google’s Lyria 3 AI music model is coming to Gemini today - Ars Technica",
    "fullText": "With a simple prompt, you can generate 30 seconds of something like music.",
    "link": "https://arstechnica.com/google/2026/02/gemini-can-now-generate-ai-music-for-you-no-lyrics-required/"
  },
  {
    "text": "Takaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development - Associated Press News",
    "fullText": "Japanese Prime Minister Sanae Takaichi says she hopes to deepen her relationship with U.S. President Donald Trump. She wants to strengthen cooperation between the two countries in rare earths development and other areas of economic security when she visits Wa…",
    "link": "https://apnews.com/article/japan-takaichi-us-china-trump-defense-aa82f8a3b5a7120575072f390f30fb97"
  }
]