[
  {
    "text": "Jeanine Pirro Is Going After Powell, Heedless of Backlash - Bloomberg.com",
    "fullText": "Jeanine Pirro didn’t seek sign-off from her bosses at the Justice Department before subpoenaing the Federal Reserve and has no plans to back down from an investigation into Chairman Jerome Powell, according to a person familiar with the matter.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-13/jeanine-pirro-is-going-after-jerome-powell-heedless-of-backlash"
  },
  {
    "text": "Former sailor sentenced to 16 years after selling Navy secrets to China - The Washington Post",
    "fullText": "“I screwed up,”Jinchao Wei wrote in a note to the judge after being convicted of supplying photos and documents to his Chinese handler in exchange for $12,000.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/13/us-china-navy-spy-sentenced/"
  },
  {
    "text": "D-backs acquire Arenado in trade with Cardinals - ESPN",
    "fullText": "The Diamondbacks acquired third baseman Nolan Arenado in a trade with St. Louis, concluding the Cardinals' year-plus-long effort to deal the eight-time All-Star.",
    "link": "https://www.espn.com/mlb/story/_/id/47600142/diamondbacks-acquire-nolan-arenado-trade-cardinals"
  },
  {
    "text": "Le Pen blames European Parliament in appeal that could decide political fate - BBC",
    "fullText": "\"We had no sense of having committed an offence,\" France's far-right leader tells an appeal to overturn a ban from contesting the next election.",
    "link": "https://www.bbc.com/news/articles/c62vnvx2x2po"
  },
  {
    "text": "'The Thing' Actor T.K. Carter Had Recent Health Issues Before Death - TMZ",
    "fullText": "T.K. Carter died at his home after battling serious health issues ... according to his family and authorities.",
    "link": "https://www.tmz.com/2026/01/13/tk-carter-recent-health-issues-before-death/"
  },
  {
    "text": "Senators punt release of health package to end of January - Politico",
    "fullText": "A bipartisan group of senators had originally hoped to release a framework this week.",
    "link": "https://www.politico.com/live-updates/2026/01/13/congress/senators-punt-release-of-health-package-to-end-of-january-00725086"
  },
  {
    "text": "President Trump returns to Michigan for speech on the economy - The Detroit News",
    "fullText": "President Donald Trump toured Ford Motor Co.'s Dearborn Truck Plant before speaking at the Detroit Economic Club meeting in Detroit.",
    "link": "https://www.detroitnews.com/story/news/politics/2026/01/13/donald-trump-detroit-economic-club-speech-michigan-ford-motor-plant-tour/88144152007/"
  },
  {
    "text": "Ex-Justice Department special counsel Smith will testify publicly about his Trump investigations - AP News",
    "fullText": "Former Justice Department special counsel Jack Smith is set to testify publicly next week about his investigations into President Donald Trump that resulted in two indictments. The Republican chairman of the House Judiciary Committee, congressman Jim Jordan o…",
    "link": "https://apnews.com/article/congress-jack-smith-testifies-jordan-jan-6-49e4b35fc45f4e3b3affe5afdee46044"
  },
  {
    "text": "Older Women Are Sharing The \"Shocking\" Body Changes That Happened As They Aged - BuzzFeed",
    "fullText": null,
    "link": "https://www.buzzfeed.com/abbyzinman/older-women-shocking-body-changes"
  },
  {
    "text": "Latest science shows the moon has been stealing Earth’s atmosphere for billions of years - CNN",
    "fullText": "A new study suggests lunar soil contains elements that solar wind transported to the moon from Earth’s atmosphere, solving a long-standing astronomy puzzle.",
    "link": "https://www.cnn.com/2026/01/13/science/moon-stealing-earth-atmosphere-magnetic-field"
  },
  {
    "text": "Bears Notes: Where to Watch Divisional Round vs. Rams, Wild Packers Quotes, Rodgers Flops - Bleacher Nation",
    "fullText": "Details have emerged regarding how you can watch Sunday's Bears-Rams Divisional Round game.",
    "link": "https://www.bleachernation.com/bears/2026/01/13/bears-notes-jan-13-2026/"
  },
  {
    "text": "‘No shortage of wealth’: Mamdani, other Democrats chide NYC hospital executives over nurses’ strike - Politico",
    "fullText": "The NYC mayor said the historic strike is about “who deserves to benefit from this system.”",
    "link": "https://www.politico.com/news/2026/01/13/no-shortage-of-wealth-lawmakers-chide-nyc-hospital-executives-over-nurses-strike-00724577"
  },
  {
    "text": "Crypto Bill Draft Grants XRP, Solana and Dogecoin Same Legal Status as Bitcoin - Decrypt",
    "fullText": "The draft provision would treat tokens as “non-ancillary” assets, exempt from SEC securities rules, if they were in an ETF by 2026.",
    "link": "https://decrypt.co/354411/crypto-bill-draft-grants-xrp-solana-and-dogecoin-same-legal-status-as-bitcoin"
  },
  {
    "text": "Boeing outsold Airbus last year for first time since 2018, deliveries rise to 600 - CNBC",
    "fullText": "Boeing delivered 600 jetliners in 2025 with 63 in December alone, while net orders rose to 1,173 planes.",
    "link": "https://www.cnbc.com/2026/01/13/boeing-orders-deliveries.html"
  },
  {
    "text": "Scott Adams, ‘Dilbert’ creator who poked fun at bad bosses, dies at 68 - The Washington Post",
    "fullText": "His three-panel comic strip was published in more than 2,000 newspapers, only to fade from view after Mr. Adams made racist comments on a YouTube live stream.",
    "link": "https://www.washingtonpost.com/obituaries/2026/01/13/scott-adams-dead-dilbert/"
  },
  {
    "text": "The 20 Worst Dressed Stars At The 2026 Golden Globes After-Parties - Bored Panda",
    "fullText": "Stars at the 2026 Golden Globes kept the celebrations going after the ceremony came to a close, attending different after parties hosted by fellow celebrities or entertainment companies.",
    "link": "https://www.boredpanda.com/worst-dressed-stars-golden-globes-2026-after-parties/"
  },
  {
    "text": "Zoe Saldaña Becomes Highest-Grossing Actor of All Time With ‘Avatar: Fire and Ash’ - Variety",
    "fullText": "With 'Avatar: Fire and Ash,' Zoe Saldaña has become the highest-grossing actor of all time, overtaking Scarlett Johansson and Samuel L. Jackson.",
    "link": "https://variety.com/2026/film/news/zoe-saldana-highest-grossing-actor-of-all-time-avatar-3-1236619322/"
  },
  {
    "text": "Google Pixel 10a releasing in ‘mid February’ with ‘Berry’ color, leak claims - 9to5Google",
    "fullText": "Google’s Pixel 10a might be releasing much earlier than anyone expected, with a February release date in the works and...",
    "link": "http://9to5google.com/2026/01/13/google-pixel-10a-release-date-berry-leak/"
  },
  {
    "text": "Introducing Apple Creator Studio, an inspiring collection of creative apps - Apple",
    "fullText": "Apple Creator Studio is a collection of powerful creative apps for making music, video editing, creative imaging, and visual productivity.",
    "link": "https://www.apple.com/newsroom/2026/01/introducing-apple-creator-studio-an-inspiring-collection-of-creative-apps/"
  }
]