[
  {
    "text": "Iran warns it will target US troops and Israel if America strikes over protests - AP News",
    "fullText": "Iran’s parliament speaker warns the U.S. military and Israel could be “legitimate targets” if the U.S. strikes Iran over ongoing protests. The protests have challenged Iran’s theocracy, with demonstrators flooding the streets for over two weeks. Activists rep…",
    "link": "https://apnews.com/article/iran-protests-us-israel-war-nuclear-economy-ae5add408f0dbc724962d41cc37c939a"
  },
  {
    "text": "How ICE raids in Minnesota connect to a years-old fraud scandal - NBC News",
    "fullText": "The Trump administration is using a years-old scandal first prosecuted under the Biden administration to justify its immigration crackdown in Minnesota.",
    "link": "https://www.nbcnews.com/tech/internet/ice-raids-minnesota-connect-years-old-fraud-scandal-rcna253151"
  },
  {
    "text": "Linus Torvalds' Latest Open-Source Project Is AudioNoise - Made With The Help Of Vibe Coding - Phoronix",
    "fullText": "In addition to Linus Torvalds' recent comments around AI tooling documentation, it turns out in fact that Linus Torvalds has been using vibe coding himself",
    "link": "https://www.phoronix.com/news/Linus-Torvalds-Vide-Coding"
  },
  {
    "text": "Greenland’s harsh environment and lack of infrastructure have prevented rare earth mining - AP News",
    "fullText": "Greenland’s harsh environment, lack of key infrastructure and difficult geology have prevented anyone from building a mine to extract the sought-after rare earth elements that many high-tech products require. Those challenges won't go away even if President D…",
    "link": "https://apnews.com/article/denmark-greenland-trump-rare-earths-mining-3f47c0b2ae3edfb322a908ee39c42c05"
  },
  {
    "text": "Inside GM's new world headquarters: Modernized midcentury designs with artifacts, surprises from the American icon - CNBC",
    "fullText": "GM has filled its new Detroit headquarters with artifacts, design nods and \"Easter eggs\" tied to the Detroit automaker's history.",
    "link": "https://www.cnbc.com/2026/01/11/gm-hq-detroit-artifacts-company-history.html"
  },
  {
    "text": "A ghost town votes in Myanmar election’s second phase - Al Jazeera",
    "fullText": "Hpapun was once a bustling town with its own airport. Now it’s empty and Sunday’s election there is meaningless.",
    "link": "https://www.aljazeera.com/features/2026/1/11/a-ghost-town-votes-in-myanmar-elections-second-phase"
  },
  {
    "text": "NFL Playoff Bracket 2026 Updated Picture, Schedule After Saturday's Wild Card - Bleacher Report",
    "fullText": "Even after Saturday's round of NFC Wild Card games, there are still plenty of unknowns in the NFL playoff bracket.",
    "link": "https://bleacherreport.com/articles/25355569-nfl-playoff-bracket-2026-updated-picture-schedule-after-saturdays-wild-card"
  },
  {
    "text": "Smith seizes Matias' WBC belt with stunning KO - ESPN",
    "fullText": "Dalton Smith pulled off a stunning fifth-round knockout of Subriel Matias to become the WBC junior welterweight champion in a thrilling clash in Brooklyn.",
    "link": "https://www.espn.com/boxing/story/_/id/47577703/dalton-smith-stuns-subriel-matias-5th-round-ko-win-title"
  },
  {
    "text": "Kentucky 92-68 Mississippi State (Jan 10, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/mens-college-basketball/recap?gameId\\\\u003d401808163"
  },
  {
    "text": "Spurs 100-95 Celtics (Jan 10, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nba/recap?gameId\\\\u003d401810400"
  },
  {
    "text": "Colombian singer Yeison Jiménez among 6 dead after plane crash in central-eastern Colombia - ABC7 Los Angeles",
    "fullText": "A private plane crashed Saturday in central-eastern Colombia, killing all six people on board, including singer Yeison Jiménez, authorities confirmed.",
    "link": "https://abc7.com/post/colombian-singer-yeison-jimenez-among-6-dead-plane-crash-central-eastern-colombia/18384845/"
  },
  {
    "text": "'I had no electricity for six months': American families struggle with soaring energy prices - BBC",
    "fullText": "Rising electricity costs have emerged as a key cost-of-living concern, pushing families further into debt.",
    "link": "https://www.bbc.com/news/articles/c1dz0dz0zkvo"
  },
  {
    "text": "Top Univ. of Minn. grads are 'as good, maybe better' than Harvard's best: former Goldman Sachs CEO - Fortune",
    "fullText": "Despite being a Harvard alum himself, he recognized that superior talent can come from outside elite schools.",
    "link": "https://fortune.com/2026/01/10/university-of-minnesota-vs-harvard-college-degree-goldman-sachs-recruiting-lloyd-blankfein/"
  },
  {
    "text": "Cooler Temperatures Taking Over - KSAT",
    "fullText": "San Antonio is experiencing a cold front with gusty winds and wind chills, leading to elevated fire danger across South Central Texas. Temperatures will drop this weekend, with highs in the 50s and 60s and possible freezes. Next week will see a rebound in tem…",
    "link": "https://www.ksat.com/weather/2026/01/10/san-antonio-braces-for-chilly-weekend-temperatures/"
  },
  {
    "text": "US military strikes Islamic State group targets in Syria, officials say - BBC",
    "fullText": "US President Donald Trump ordered the \"large-scale strikes\" on Saturday, US Central Command announced.",
    "link": "https://www.bbc.com/news/articles/cly9597r4qpo"
  },
  {
    "text": "Trump seeks to stop courts, creditors from seizing Venezuelan oil revenue in the U.S. - CNBC",
    "fullText": "Any use of judicial process against the funds will interfere with efforts to \"ensure economic and political stability in Venezuela,\" the order says.",
    "link": "https://www.cnbc.com/2026/01/10/trump-venezuela-oil-revenue.html"
  },
  {
    "text": "As U.S. debt soars past $38 trillion, the flood of corporate bonds is a growing threat to the Treasury supply - Fortune",
    "fullText": "\"The significant increase in hyperscaler issuance raises questions about who will be the marginal buyer of IG paper.\"",
    "link": "https://fortune.com/2026/01/10/us-debt-ig-corporate-bonds-ai-boom-treasury-supply-bond-yields/"
  },
  {
    "text": "Security Alert Venezuela: January 10, 2026: Do Not Travel to Venezuela; Depart Immediately - U.S. Embassy in Venezuela (.gov)",
    "fullText": null,
    "link": "https://ve.usembassy.gov/security-alert-venezuela-january-10-2026-do-not-travel-to-venezuela-depart-immediately/"
  }
]