[
  {
    "text": "Sources: Cowboys move on from DC Eberflus - ESPN",
    "fullText": "The Dallas Cowboys have relieved Matt Eberflus of his duties as defensive coordinator, sources told ESPN Insider Adam Schefter on Tuesday.",
    "link": "https://www.espn.com/nfl/story/_/id/47526360/sources-matt-eberflus-cowboys-defensive-coordinator"
  },
  {
    "text": "Ford reports best annual U.S. vehicle sales since 2019 - CNBC",
    "fullText": "Ford reported sales of 2.2 million vehicles in 2025, including a 2.7% uptick to more than 545,200 units during the fourth quarter.",
    "link": "https://www.cnbc.com/2026/01/06/ford-f-2025-annual-sales.html"
  },
  {
    "text": "Venezuelan security forces detain journalists as armed police patrol streets - BBC",
    "fullText": "Venezuelans describe their fear of speaking out as 14 media workers are detained and police check people's social media.",
    "link": "https://www.bbc.com/news/articles/cd6w4y0eq70o"
  },
  {
    "text": "Ashley Tisdale says she quit her 'toxic mom group' - BBC",
    "fullText": "The High School Musical actress says she left the group of new mothers after being \"brought to tears\".",
    "link": "https://www.bbc.com/news/articles/c4g09l286e2o"
  },
  {
    "text": "The mother of one of Elon Musk's children says his AI bot won't stop creating sexualized images of her - NBC News",
    "fullText": "When Ashley St. Clair asked Grok, the generative artificial intelligence reply bot built into the X platform, to stop creating sexually suggestive pictures of her, Grok said it would stop.",
    "link": "https://www.nbcnews.com/tech/elon-musk/mother-one-elon-musks-children-says-ai-bot-wont-stop-creating-sexualiz-rcna252416"
  },
  {
    "text": "China bans certain rare earths and other exports to Japan for military purposes over Takaichi’s comments - CNN",
    "fullText": "China has banned exports of some rare earth elements and other items to Japan that could be used for military purposes, straining already tense relations between the two countries following the Japanese prime minister’s recent remarks on Taiwan.",
    "link": "https://www.cnn.com/2026/01/06/business/china-japan-export-controls-intl-hnk"
  },
  {
    "text": "ADHD drugs work, but not the way experts thought - The Washington Post",
    "fullText": "New brain research could reshape our understanding of ADHD and the most common drugs that treat it.",
    "link": "https://www.washingtonpost.com/health/2026/01/06/adhd-ritalin-sleep-children/"
  },
  {
    "text": "Trump administration sparks midterms vaccine war - Axios",
    "fullText": "Democrats immediately slammed Trump's overhaul of the childhood vaccine schedule.",
    "link": "https://www.axios.com/2026/01/06/trump-administration-rfk-midterms-vaccines-kids"
  },
  {
    "text": "Massachusetts doctors see ‘explosion of flu cases.’ Here’s why. - The Boston Globe",
    "fullText": "Low vaccination rates and a rapidly spreading influenza A strain are pushing toward an early, intense flu season.",
    "link": "https://www.bostonglobe.com/2026/01/06/metro/massachusetts-influenza-flu-subclade-k-surge-2026/"
  },
  {
    "text": "Macron hosts Ukraine and allies to try to cement security guarantees - BBC",
    "fullText": "The talks are held as Russia continues attacking Ukraine's energy sector and under the shadow of US threats to annex Greenland.",
    "link": "https://www.bbc.com/news/articles/c74vx4n003xo"
  },
  {
    "text": "Back in power 5 years later, Trump has all but erased the stain of Jan. 6 - Politico",
    "fullText": "In the years since the Capitol riot, Trump has learned it’s nearly impossible to punish a president who decides to test the limits of the Constitution.",
    "link": "https://www.politico.com/news/2026/01/06/january-6-anniversary-donald-trump-00711324"
  },
  {
    "text": "Tony Dokoupil Stumbles Through Segment Transition During ‘CBS Evening News’ Debut: ‘First Day, Big Problems Here’ - Yahoo News Canada",
    "fullText": "New 'CBS Evening News' anchor Tony Dokoupil experienced an on-air mishap during his official debut broadcast Monday, mixing up a segment transition.",
    "link": "https://variety.com/2026/tv/news/tony-dokoupil-mixes-up-segment-transition-cbs-evening-news-debut-1236624251/"
  },
  {
    "text": "Inside Tim Walz's dramatic political fall - Axios",
    "fullText": "It's a stunning downfall for a man who vaulted onto the national stage less than two years ago and had been flirting with a 2028 run for president.",
    "link": "https://www.axios.com/2026/01/06/tim-walz-fall-scandal-minnesota"
  },
  {
    "text": "Mickey Rourke’s Manager Reveals Details Behind Actor’s Controversial GoFundMe - The Hollywood Reporter",
    "fullText": "Closing in on its $100,000 goal in 24 hours, the star of 'The Wrestler' says he will return all the donations.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/mickey-rourke-manager-kimberly-hines-gofundme-interview-1236465352/"
  },
  {
    "text": "2,000 federal agents are being deployed to Minneapolis in an escalated immigration push. Here’s what we know - CNN",
    "fullText": "Around 2,000 federal agents are being deployed to Minneapolis as part of the Trump administration’s latest effort to crack down on immigration, two law enforcement officials told CNN, while the city and its officials are reeling from a welfare fraud scandal t…",
    "link": "https://www.cnn.com/2026/01/06/us/minneapolis-ice-crackdown-what-we-know"
  },
  {
    "text": "Venezuelan Oil Shunned by China as Offers Get More Expensive - Bloomberg.com",
    "fullText": "Chinese buyers shunned offers for Venezuelan crude this week, as a US blockade on the South American producer constrains exports and pushes up prices.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-06/venezuelan-oil-shunned-by-china-as-offers-get-more-expensive"
  },
  {
    "text": "Nvidia’s GeForce Now is getting native Linux and Fire TV apps - The Verge",
    "fullText": "Nvidia is launching new GeForce Now apps for Linux and Amazon’s Fire TV devices. It’s also adding flight control support to its streaming service.",
    "link": "https://www.theverge.com/tech/854688/nvidias-geforce-now-is-getting-native-linux-and-fire-tv-apps"
  },
  {
    "text": "DOJ says millions of Epstein files have yet to be released - Politico",
    "fullText": "The department says it’s released less than 1 percent of the total documents.",
    "link": "https://www.politico.com/news/2026/01/05/doj-epstein-files-timing-delays-00712169"
  }
]