[
  {
    "text": "Review | Bad Bunny conquered the world, but he wants to save Puerto Rico - The Washington Post",
    "fullText": "In “P FKN R,” Vanessa Díaz and Petra R. Rivera-Rideau explore the music and activism of Bad Bunny.",
    "link": "https://www.washingtonpost.com/books/2026/02/05/bad-bunny-book-review/"
  },
  {
    "text": "Some Public Health Service officers quit rather than serve in ICE detention centers - NPR",
    "fullText": "A special corps of health care workers have been called in to work with detained immigrants and many feel deeply conflicted about the assignment, saying they're not able to provide good care.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5698538/public-health-service-ice-detention-centers"
  },
  {
    "text": "Trump to launch TrumpRx drug discount site. Here's when - Axios",
    "fullText": "The site will offer discounted drug prices through special agreements with drug companies.",
    "link": "https://www.axios.com/2026/02/05/trump-trumprx-drug-price-discount-site-launch"
  },
  {
    "text": "Google teases AirDrop support for more Android phones, 'exciting' announcements 'very soon' - 9to5Google",
    "fullText": "A Google VP is teasing that Android's Quick Share tool will be adding support for AirDrop on more phones in the not-too-distant future.",
    "link": "http://9to5google.com/2026/02/05/google-teases-airdrop-support-for-more-android-phones-exciting-announcements-very-soon/"
  },
  {
    "text": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "fullText": "New START is the last major guardrail constraining the nuclear arsenals of the two countries that together hold some 85% of the world's warheads.",
    "link": "https://www.axios.com/2026/02/05/new-start-arms-control-us-russia-extend"
  },
  {
    "text": "ECB holds rates but it's not a 'non-event,' economists say. Here's why - CNBC",
    "fullText": "Economists believe the central bank will be comfortable with the inflation rate where it is, for now, but are watching for signs of disinflation.",
    "link": "https://www.cnbc.com/2026/02/05/ecb-rate-decision-economists-analysts-next-move.html"
  },
  {
    "text": "Winter Olympics 2026: Today’s schedule, results, medal counts and news - New York Post",
    "fullText": "The full Winter Olympics 2026 schedule, results and medal counts can be viewed by toggling the menu below. Here’s all the info on when to watch skiing, figure skating, hockey, snowboarding an…",
    "link": "https://nypost.com/2026/02/05/sports/winter-olympics-2026-todays-schedule-results-medal-counts-and-news/"
  },
  {
    "text": "Where billionaires' investment firms placed their bets in January - CNBC",
    "fullText": "David Blitzer's family office bought a motorcycle racing team, but 2026 deal-making is not off to a roaring start.",
    "link": "https://www.cnbc.com/2026/02/05/billionaire-investing-family-office.html"
  },
  {
    "text": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks - Axios",
    "fullText": "\"The main feeling among members is a lack of trust in his strength and ability to strike a hard bargain.\"",
    "link": "https://www.axios.com/2026/02/05/democrats-schumer-ice-government-shutdown"
  },
  {
    "text": "Iran, US to negotiate over proxy terror, ballistic missiles - The Jerusalem Post",
    "fullText": "The talks between Iran and US are still set to focus on Iran's nuclear program and capabilities, NYT noted, citing three Iranian officials and one Arab official.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-885729"
  },
  {
    "text": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade - Cleveland.com",
    "fullText": "There have been mixed emotions over the last 24 hours. It’s natural when a trade occurs. But the overriding feeling in the Cleveland locker room is enthusiasm.",
    "link": "https://www.cleveland.com/cavs/2026/02/our-ceiling-is-higher-donovan-mitchell-opens-up-about-james-harden-darius-garland-trade.html"
  },
  {
    "text": "Did astronomers see a black hole explode: An 'impossible' particle that hit Earth in 2023 may tell us - Space",
    "fullText": "\"If our hypothesized dark charge is true, then we believe there could be a significant population of primordial black holes, which would be consistent with other astrophysical observations, and account for all the missing dark matter in the universe.\"",
    "link": "https://www.space.com/astronomy/black-holes/did-astronomers-see-a-black-hole-explode-an-impossible-particle-that-hit-earth-in-2023-may-tell-us"
  },
  {
    "text": "Exclusive | Trump Administration to Make It Easier to Fire 50,000 Federal Workers - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/policy/trump-federal-employees-new-category-1051bc29"
  },
  {
    "text": "Northern Lights Alert: 11 States May See Aurora Thursday - Forbes",
    "fullText": "NOAA warns of likely G1-class geomagnetic storms on Thursday, Feb. 5, through Friday, Feb. 6, as a coronal mass ejection from a powerful X8-class solar flare approaches.",
    "link": "https://www.forbes.com/sites/jamiecartereurope/2026/02/05/northern-lights-alert-11-states-may-see-aurora-thursday/"
  },
  {
    "text": "Lindsey Graham is bringing main character energy to the DHS debate - Politico",
    "fullText": "Over the course of a decade, the South Carolina Republican has transformed into an outspoken advocate for hard-line border and enforcement policies.",
    "link": "https://www.politico.com/news/2026/02/05/lindsey-graham-dhs-immigration-sanctuary-cities-00766664"
  },
  {
    "text": "Paramount CEO David Ellison Takes Dig At “Monopolistic” Netflix In Open Letter To UK Creatives About Warner Deal - Deadline",
    "fullText": "David Ellison has written to the UK creative community, committing to investment and theatrical windows as Paramount pursues Warner Bros. Discovery.",
    "link": "http://deadline.com/2026/02/paramount-david-ellison-netflix-warner-open-letter-1236709783/"
  },
  {
    "text": "A new comet was just discovered. Will it be visible in broad daylight? - The Conversation",
    "fullText": "Comet MAPS has the potential to be one of the ‘Great Comets’ of this century.",
    "link": "https://theconversation.com/a-new-comet-was-just-discovered-will-it-be-visible-in-broad-daylight-274533"
  },
  {
    "text": "Measles case confirmed in Northern Virginia; find out where the exposure sites are believed to be - WUSA9",
    "fullText": "Virginia health officials confirmed a measles case in an adult, prompting alerts for potential exposure sites in Fairfax County. Stay vigilant for symptoms.",
    "link": "https://www.wusa9.com/article/news/health/measles-case-northern-virginia-exposure-sites/65-329d7f68-e385-4431-9e0e-8639a5b79336"
  },
  {
    "text": "Alphabet won’t talk about the Google-Apple AI deal, even to investors - TechCrunch",
    "fullText": "Alphabet CEO skipped an analyst's question about Apple on the company's earnings call.",
    "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/"
  },
  {
    "text": "The Wayback Machine debuts a new plug-in designed to fix the internet's broken links problem - TechCrunch",
    "fullText": "Should a linked web page go offline, the new feature will then redirect readers to the archived versions, so that there is no drop in service. The tool also archives a user's own posts, helping to ensure their longevity.",
    "link": "https://techcrunch.com/2026/02/04/the-wayback-machine-debuts-a-new-plugin-designed-to-fix-the-internets-broken-links-problem/"
  }
]