[
  {
    "text": "21-Year-Old Catwalk Model, Cristina Pérez Galcenco, Found Dead at Her Home: Reports - AOL.com",
    "fullText": "International catwalk model, Cristina Pérez Galcenco, has died at age 21, according to local media reports.",
    "link": "https://people.com/international-catwalk-model-cristina-perez-galcenco-dies-age-21-reports-11901006"
  },
  {
    "text": "YouTube TV offers some customers a $20 discount for four months – how to check - 9to5Google",
    "fullText": "Google is handing out a $20 discount to some YouTube TV subscribers which lasts for four months – a total...",
    "link": "http://9to5google.com/2026/02/07/youtube-tv-offers-some-customers-a-20-discount-for-four-months-how-to-check/"
  },
  {
    "text": "Amazon MGM Goes on Offense as ‘Melania’ Risks Getting Sacked at Super Bowl Box Office - The Hollywood Reporter",
    "fullText": "The first lady's documentary is falling off steeply in its second weekend, prompting Amazon MGM to go on the offensive and stress that the film is in it for the long game, whether theatrically or streaming.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/amazon-defends-melania-sacked-box-office-1236497985/"
  },
  {
    "text": "Zelensky says Russia is proposing huge economic deals with U.S. - The Washington Post",
    "fullText": "The Ukrainian president said the Trump administration was pushing for a June deadline to end Russia’s war.",
    "link": "https://www.washingtonpost.com/world/2026/02/07/ukraine-russia-us-economic-agreements-war/"
  },
  {
    "text": "Thailand election: Voters head to the polls in high-stakes election - BBC",
    "fullText": "Thai voters will elect a new parliament and also vote on a referendum about the country's constitution.",
    "link": "https://www.bbc.com/news/live/c4g31zlezp1t"
  },
  {
    "text": "Boxing: Nick Ball knocked out by Brandon Figueroa to lose world title fight in Liverpool - BBC",
    "fullText": "Nick Ball is beaten for the first time in his professional career in front of hometown fans in Liverpool, relinquishing his world title.",
    "link": "https://www.bbc.com/sport/boxing/articles/cwygyrn2elno"
  },
  {
    "text": "Japan votes in snap election as PM Takaichi takes a gamble - BBC",
    "fullText": "Observers say Sanae Takaichi's personal popularity may boost the ruling party's showing at the polls.",
    "link": "https://www.bbc.com/news/articles/cx2y7d2z29xo"
  },
  {
    "text": "Appeals court affirms Trump policy of jailing immigrants without bond - AP News",
    "fullText": "A federal appeals court has ruled that President Donald Trump's administration can continue detaining immigrants without bond. The 5th Circuit Court of Appeals decided on Friday that the Department of Homeland Security's policy aligns with the constitution an…",
    "link": "https://apnews.com/article/fifth-circuit-immigrant-detainees-denied-bond-f5265ecf771d1f8e9f20d48bddfb1a25"
  },
  {
    "text": "One Dietary Supplement Was Found to Reduce Aggression by Up to 28% - ScienceAlert",
    "fullText": "Keep calm and try omega-3.",
    "link": "https://www.sciencealert.com/one-dietary-supplement-was-found-to-reduce-aggression-by-up-to-28"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Nuclear sees tipping point as Meta makes deals with Bill Gates’ TerraPower, Sam Altman-backed Oklo - Fortune",
    "fullText": "Meta, Google, Amazon, and more all hope to lean on a nuclear construction boom to power AI.",
    "link": "https://fortune.com/2026/02/07/next-gen-nuclear-tipping-point-meta-hyperscalers-bill-gates-terrapower-sam-altman-oklo/"
  },
  {
    "text": "Teachers, others shocked to get SFUSD ‘assignments’ for strike day - Mission Local",
    "fullText": "On late Friday, workers were given 'redeployment assignments' to 'Staff Centers' opened because of Monday's school closures. They're confused.",
    "link": "http://missionlocal.org/2026/02/teachers-others-shocked-to-get-sfusd-assignments-for-strike-day/"
  },
  {
    "text": "Toddler hospitalized with respiratory failure was returned to ICE detention and denied prescribed medication, lawsuit says - NBC News",
    "fullText": "A federal lawsuit says an 18-month-old baby became critically ill in a South Texas immigration detention center, was hospitalized with respiratory failure, then sent back to detention without needed medication.",
    "link": "https://www.nbcnews.com/news/us-news/toddler-hospitalized-dilley-ice-detention-rcna257912"
  },
  {
    "text": "Wisconsin’s Greg Gard on OT loss to Indiana: ‘I’ve never seen anything like that’ - Yahoo Sports",
    "fullText": "Indiana beat Wisconsin in the closing seconds of overtime following two hotly debated foul calls on the Badgers.",
    "link": "https://www.crimsonquarry.com/indiana-hoosiers-mens-basketball/25672/wisconsins-greg-gard-on-ot-loss-to-indiana-ive-never-seen-anything-like-that"
  },
  {
    "text": "Netanyahu to hold urgent meeting with Trump Wednesday amid Iran negotiations - Axios",
    "fullText": "Netanyahu \"believes that any negotiations must include limits on Iran's ballistic missiles,\" the prime minister's office said.",
    "link": "https://www.axios.com/2026/02/07/netanyahu-trump-iran-negotiations"
  },
  {
    "text": "Amazon has a 4-pack of Apple AirTags on sale for 35% off this weekend - Mashable",
    "fullText": "They’re so useful.",
    "link": "https://mashable.com/article/feb-07-apple-airtag-1st-gen-4-pack-deal"
  },
  {
    "text": "Five off-the-radar Seahawks who could play big role in Super Bowl LX - The Seattle Times",
    "fullText": "Every Super Bowl somebody unexpected steps into the spotlight and plays a major role. Here are five Seahawks who could play that role Sunday.",
    "link": "https://www.seattletimes.com/sports/seahawks/super-bowl-lx-five-off-the-radar-seahawks-who-could-play-big-role/"
  },
  {
    "text": "Snow totals in Massachusetts for February 7, 2026 - cbsnews.com",
    "fullText": "Plowable snow fell in Massachusetts on Saturday. Here's how much your area has gotten.",
    "link": "https://www.cbsnews.com/boston/news/snow-totals-in-massachusetts-for-february-7-2026/"
  },
  {
    "text": "Box Office: 'Stray Kids' Rocks Out at No. 1; 'Send Help' Takes Second - Variety",
    "fullText": "Friday was wide open for the K-pop concert film 'Stray Kids: The dominATE Experience' to take the top spot.",
    "link": "https://variety.com/2026/film/news/box-office-stray-kids-send-help-iron-lung-solo-mio-1236652723/"
  },
  {
    "text": "Lana Del Rey Announces New Single \"White feather-hawk tail deer hunter\" - Consequence of Sound",
    "fullText": "Lana Del Rey announced that her new single, \"White feather-hawk tail deer hunter,\" will arrive on February 17th.",
    "link": "https://consequence.net/2026/02/lana-del-rey-white-feather-hawk-tail-deer-hunter/"
  }
]