[
  {
    "text": "Ledecka’s quest for Olympic snowboarding three-peat comes to a shocking halt - AP News",
    "fullText": "Ester Ledecka’s quest to become the first snowboarder to win gold medals in three straight Olympics came to a surprisingly early end. She lost her quarterfinal race in the sport’s parallel giant slalom by 0.06 seconds to Austria’s Sabine Payer. The 30-year-ol…",
    "link": "https://apnews.com/article/ledecka-winter-olympics-snowboard-75c1551954fbb0ec44190ee187d68f7b"
  },
  {
    "text": "Vladimir Alexeyev: Three suspects in shooting of Russian general named - BBC",
    "fullText": "The suspects include the alleged gunman, Lyubomir Korba, whom Russia says fled to the UAE after the attack.",
    "link": "https://www.bbc.com/news/articles/cy7j6xe8862o"
  },
  {
    "text": "‘The sugar high will be short lived’: Trump’s big bet on tax refunds might not pay off - Politico",
    "fullText": "While Trump and his top advisers have been banking on the increased refunds as a pocketbook proof point to voters, skeptics caution the money could be quickly swallowed up by stubbornly-high prices elsewhere.",
    "link": "https://www.politico.com/news/2026/02/08/the-sugar-high-will-be-short-lived-trumps-big-bet-on-tax-refunds-might-not-pay-off-00769459"
  },
  {
    "text": "RSV is spreading in N.J. See which counties have the highest levels. - NJ.com",
    "fullText": "RSV activity is elevated in New Jersey and across the country.",
    "link": "https://www.nj.com/healthfit/2026/02/rsv-is-spreading-in-nj-see-which-counties-have-the-highest-levels.html"
  },
  {
    "text": "Japan's ruling LDP certain to win lower house majority: exit polls - 毎日新聞",
    "fullText": "TOKYO (Kyodo) -- Japan's ruling camp won a two-thirds majority in the House of Representatives after Sunday's election, early returns and projections",
    "link": "https://mainichi.jp/english/articles/20260208/p2g/00m/0na/034000c"
  },
  {
    "text": "Iran's top diplomat strikes a hard line on US talks, saying Tehran's power comes from saying 'no' - AP News",
    "fullText": "Iran's top diplomat says Tehran's strength comes from its ability to “say no to the great powers.” Sunday's statement follows recent nuclear negotiations with the United States and nationwide protests that shook Iran. Speaking at a summit in Tehran, Foreign M…",
    "link": "https://apnews.com/article/iran-us-nuclear-talks-protests-araghchi-389531836ccaa4c126b5ee06c1d5b1f8"
  },
  {
    "text": "Andrei Arlovksi bludgeons Ben Rothwell in bloody BKFC heavyweight title fight at Knucklemania 6 - Yahoo Sports",
    "fullText": "Andrei Arlovski made it three in a row against Ben Rothwell, who was left battered, beaten and without a belt.",
    "link": "https://sports.yahoo.com/mma/breaking-news/live/andrei-arlovksi-bludgeons-ben-rothwell-in-bloody-bkfc-heavyweight-title-fight-at-knucklemania-6-063037486.html"
  },
  {
    "text": "Kentucky's comeback win over Tennessee made Rupp Arena history - On3",
    "fullText": "Kentucky made a little Rupp Arena history in its comeback win vs. Tennessee, which completed the regular-season sweep.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/kentucky-comeback-win-tennessee-rupp-arena-history/"
  },
  {
    "text": "Zelensky: Trump wants Russia-Ukraine peace deal by June, before midterms focus - Axios",
    "fullText": "\"We had very good talks today having to do with Russia-Ukraine. Something could be happening,\" Trump told reporters.",
    "link": "https://www.axios.com/2026/02/07/zelensky-trump-russia-ukraine-peace-deal"
  },
  {
    "text": "5 Handy Costco Gadgets To Upgrade Your Smart Home - SlashGear",
    "fullText": "Smart home devices are everywhere, but you don't need to visit more than one store in order to fully upgrade your home with the latest tech.",
    "link": "https://www.slashgear.com/2093793/costco-gadgets-to-upgrade-smart-home/"
  },
  {
    "text": "Kim expected to issue major policy goals at North Korea party congress in late February - AP News",
    "fullText": "North Korean state media says the country's leadership will convene a major political conference later this month. Kim Jong Un is expected to outline his domestic and foreign policies for the next five years at the ruling Workers’ Party congress. The official…",
    "link": "https://apnews.com/article/north-korea-workers-party-congress-kim-nuclear-a411f6429dcbfc720257b5023f3b78d1"
  },
  {
    "text": "Second measles case connected to Disneyland visitor reported by Orange County officials - cbsnews.com",
    "fullText": "Orange County officials confirm second measles case in Disneyland visitor",
    "link": "https://www.cbsnews.com/losangeles/news/measles-disneyland-california-adventure-traveler-orange-county-anaheim/"
  },
  {
    "text": "Amazon MGM Goes on Offense as ‘Melania’ Risks Getting Sacked at Super Bowl Box Office - The Hollywood Reporter",
    "fullText": "The first lady's documentary is falling off steeply in its second weekend, prompting Amazon MGM to go on the offensive and stress that the film is in it for the long game, whether theatrically or streaming.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/amazon-defends-melania-sacked-box-office-1236497985/"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Get Ready for Double Whammy of US Jobs and Inflation - Bloomberg.com",
    "fullText": "Investors and policymakers are gearing up for a busy week of US economic reports that includes arguably the two most consequential data snapshots — employment and inflation.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-07/get-ready-for-double-whammy-of-us-jobs-and-inflation"
  },
  {
    "text": "V12-Swapped Datsun Gets the F1 Exhaust Treatment and It Is Glorious - The Drive",
    "fullText": "Equal length headers should be mandatory on every Mercedes M120 engine.",
    "link": "http://www.thedrive.com/news/v12-swapped-datsun-gets-the-f1-exhaust-treatment-and-it-is-glorious"
  },
  {
    "text": "The 7 Best New Movies on Netflix in February 2026 - TheWrap",
    "fullText": "A Ryan Gosling romance, a Will Smith blockbuster, a popular fantasy franchise and one of the century's best sci-fi movies are on Netflix",
    "link": "https://www.thewrap.com/creative-content/what-to-watch/best-new-movies-on-netflix-february-2026/"
  },
  {
    "text": "Light-based Ising computer runs at room temperature and stays stable for hours - Phys.org",
    "fullText": "A team of researchers at Queen's University has developed a powerful new kind of computing machine that uses light to take on complex problems such as protein folding (for drug discovery) and number partitioning (for cryptography). Built from off-the-shelf co…",
    "link": "https://phys.org/news/2026-02-based-ising-room-temperature-stays.html"
  }
]