[
  {
    "text": "FBI: 1 arrested after protesters smash into unmarked federal vehicles allegedly containing federal documents - CBS News",
    "fullText": "The FBI says that a suspect is in custody after protests in north Minneapolis Wednesday evening culminated in vandalism and the apparent compromising of federal documents.",
    "link": "https://www.cbsnews.com/minnesota/news/fbi-1-arrested-after-protesters-smash-into-unmarked-federal-vehicles-allegedly-containing-federal-documents/"
  },
  {
    "text": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com",
    "fullText": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction"
  },
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "fullText": "The company said it had stopped Grok from undressing people on the X platform. Grok’s stand-alone app still does it.",
    "link": "https://www.washingtonpost.com/technology/2026/01/15/grok-ai-image-generator-sexualized/"
  },
  {
    "text": "Star Wars Shake-Up: Kathleen Kennedy Steps Down as George Lucas Protégé Dave Filoni, Exec Lynwen Brennan Take Over Lucasfilm - The Hollywood Reporter",
    "fullText": "The change in leadership may mean a new hope for the storied franchise or it could be an attack of the clones by giving fans more of the same.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/star-wars-kathleen-kennedy-steps-down-dave-filoni-1236465012/"
  },
  {
    "text": "“I am very annoyed”: Pharma execs blast RFK Jr.’s attack on vaccines - Ars Technica",
    "fullText": "Pharma execs had avoided conflict with Trump admin, but now join doctors in rebukes.",
    "link": "https://arstechnica.com/health/2026/01/big-pharma-is-openly-railing-against-rfk-jr-s-anti-vaccine-agenda/"
  },
  {
    "text": "Conor McGregor responds after UFC boss shoots down potential fight - MMA Fighting",
    "fullText": "Conor McGregor plans to return at the UFC White House card but his opponent is now suddenly a mystery.",
    "link": "https://www.mmafighting.com/ufc/466483/conor-mcgregor-responds-to-dana-white-nixing-fight-against-michael-chandler-at-ufc-white-house"
  },
  {
    "text": "Secret Lair: Rad Superdrop - Magic: The Gathering",
    "fullText": "Equip yourself with a Geiger counter and embrace that neon glow! Secret Lair's Rad Superdrop is bringing retro realness on January 26, 2026.",
    "link": "https://magic.wizards.com/en/news/announcements/secret-lair-rad-superdrop"
  },
  {
    "text": "At Detroit auto show, spotlight dims for EVs - AP News",
    "fullText": "The North American International Auto Show in Detroit once dedicated an entire track on its coveted show floor to getting consumers comfortable with electric vehicles and charging. It’s a different story at this year’s show amid President Donald Trump's anti-…",
    "link": "https://apnews.com/article/detroit-auto-show-electric-vehicles-evs-trump-7dda882748aea036821009340e6dbaa8"
  },
  {
    "text": "Finally, Some Good News in the Fight Against Cancer - Gizmodo",
    "fullText": "The American Cancer Society’s annual report found that 70% of patients now survive at least five years after diagnosis.",
    "link": "https://gizmodo.com/finally-some-good-news-in-the-fight-against-cancer-2000710820"
  },
  {
    "text": "White House Press Secretary Calls Reporter \"Left-Wing Hack\" Over ICE Question - Deadline",
    "fullText": "Karoline Leavitt said the reporter shouldn't have abriefing room seat, even though plenty of right wing outlets are in the press corps.",
    "link": "http://deadline.com/2026/01/trump-press-secretary-ice-shooting-1236684345/"
  },
  {
    "text": "Josh Allen off Bills injury report; Terrel Bernard and Ed Oliver questionable for Sunday - NBC Sports",
    "fullText": "Josh Allen moved up to full practice participation on Wednesday and the team confirmed that he's good to go for Saturday's game in Denver on Thursday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/josh-allen-off-bills-injury-report-terrel-bernard-and-ed-oliver-questionable-for-sunday"
  },
  {
    "text": "Rosters announced for 2026 AHL All-Star Classic - The American Hockey League",
    "fullText": null,
    "link": "https://theahl.com/news/rosters-announced-2026-ahl-all-star-classic"
  },
  {
    "text": "3 more Democratic lawmakers say they are under federal investigation over illegal orders social media video - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/3-democratic-lawmakers-federal-investigation-illegal-orders-social/story?id\\\\u003d129244803"
  },
  {
    "text": "Drug ring's \"monkey\" technique used young swimmers to stash cocaine on ships at sea, Spanish police say - CBS News",
    "fullText": "Police said they had busted a network that saw smugglers swim on the high seas to help stash Colombian cocaine on container ships and hijack vessels.",
    "link": "https://www.cbsnews.com/news/drug-ring-monkey-technique-swimmers-stash-cocaine-ships-spain-police/"
  },
  {
    "text": "College students and teens could be fueling the prediction markets boom - CNBC",
    "fullText": "Where sports betting is legal, it's often limited to those 21 years or older. Kalshi and Polymarket are open to anyone 18 or older, with some exceptions.",
    "link": "https://www.cnbc.com/2026/01/15/prediction-markets-college-students-teens-could-be-fueling-the-boom.html"
  },
  {
    "text": "Trump Suggests U.S. ‘Shouldn’t Even Have’ November Midterms - Forbes",
    "fullText": "The president previously claimed he’d be impeached if Republicans lose control of Congress.",
    "link": "https://www.forbes.com/sites/alisondurkee/2026/01/15/trump-suggests-us-shouldnt-even-have-november-midterms/"
  }
]