[
  {
    "text": "Janice Dickinson Spotted After Sharing Alleged Injuries From Reality Show Fall - TMZ",
    "fullText": "Janice Dickinson's still smiling despite everyone talking about a traumatic moment in her life this week ... looking happy after we posted photos of alleged injuries she says she sustained in a nasty fall.",
    "link": "https://www.tmz.com/2026/01/17/janice-dickinson-spotted-sharing-alleged-injuries-reality-show-fall/"
  },
  {
    "text": "Thousands of fans celebrate life of legendary Grateful Dead guitarist Bob Weir in San Francisco - AP News",
    "fullText": "Thousands of people gathered at San Francisco’s Civic Center to celebrate Bob Weir, the legendary Grateful Dead guitarist who died last week at 78. Musicians Joan Baez and John Mayer spoke on a makeshift stage. Fans passed around long-stemmed red roses, which…",
    "link": "https://apnews.com/article/bob-weir-grateful-dead-9a0e427a62c3ad77d22870fdaac5d2ae"
  },
  {
    "text": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
    "fullText": "The two men’s eyewitness accounts of the Jan. 3 death of Geraldo Lunas Campos at a Texas detention camp differ from the Department of Homeland Security’s account of the incident.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/17/detainee-death-witnesses-deported-dhsa/"
  },
  {
    "text": "Five takeaways from IU basketball’s loss to Iowa - Inside the Hall",
    "fullText": "IU basketball lost its third straight game, falling 74-57 on Saturday afternoon to Iowa at Simon Skjodt Assembly Hall.",
    "link": "https://www.insidethehall.com/2026/01/17/five-takeaways-from-iu-basketballs-loss-to-iowa/"
  },
  {
    "text": "Scientists find an interstellar 'tunnel' that connects our solar system to other stars - Earth.com",
    "fullText": "Astronomers found an interstellar \"tunnel\" - a cosmic channel that connects our solar system to distant stars, according to a recent study.",
    "link": "https://www.earth.com/news/local-hot-bubble-interstellar-cosmic-channel-connects-our-solar-system-to-other-stars/"
  },
  {
    "text": "After breaking up a fight, Mark Pope got doused in water after Kentucky's win at Tennessee - On3",
    "fullText": "The entertainment didn't stop at the buzzer after Kentucky's win at Tennessee, with Mark Pope breaking up a fight and getting drenched in water.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/kentucky-tennessee-mark-pope-postgame-fight-locker-room-celebration/"
  },
  {
    "text": "Broncos offensive lineman Frank Crum catches his first career pass, for a touchdown - NBC Sports",
    "fullText": "THe Broncos' first touchdown was scored by a backup offensive lineman.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/broncos-offensive-lineman-frank-crum-catches-his-first-career-pass-for-a-touchdown"
  },
  {
    "text": "EU Set to Halt US Trade Deal Over Trump’s New Tariff Threat - Bloomberg",
    "fullText": "European Union lawmakers are poised to halt approval of the EU’s trade deal with the US over President Donald Trump’s vow to impose tariffs on countries that supported Greenland in the face of American threats.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-17/eu-set-to-halt-us-trade-deal-over-trump-s-latest-tariff-threat"
  },
  {
    "text": "How Trump’s Insurrection Threat Is Backfiring: Wolff - The Daily Beast",
    "fullText": "Michael Wolff said the president’s desire for the spotlight could cause tangible consequences if the military gets involved.",
    "link": "https://www.thedailybeast.com/how-trumps-insurrection-threat-is-backfiring-wolff/"
  },
  {
    "text": "‘Heavy’ snow could impact parts of central Georgia, metro Atlanta mostly spared - AJC.com",
    "fullText": "The state’s best chance for snow comes overnight Saturday into Sunday afternoon along a diagonal line from Columbus to Macon to Warrenton, the National Weather Service says.",
    "link": "https://www.ajc.com/news/2026/01/heavy-snow-could-impact-parts-of-central-georgia-metro-atlanta-mostly-spared/"
  },
  {
    "text": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film Awards - Deadline",
    "fullText": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: \"He Will Lose It\" – European Film Awards",
    "link": "http://deadline.com/2026/01/norwegian-star-liv-ullmann-comments-trump-nobel-peace-prize-1236686028/"
  },
  {
    "text": "Five die in Austrian avalanches, rescuers say - BBC",
    "fullText": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
    "link": "https://www.bbc.com/news/articles/c3r1v7gqdp8o"
  },
  {
    "text": "Perrie Edwards Gives Birth to Second Child with Fiancé Alex Oxlade-Chamberlain - TMZ",
    "fullText": "Perrie Edwards is a mom of 2!",
    "link": "https://www.tmz.com/2026/01/17/perrie-edwards-gives-birth-to-second-child-little-mix/"
  },
  {
    "text": "Justice Dept. enters new territory with probe of Minnesota officials - The Washington Post",
    "fullText": "The agency is targeting critics during a moment of crisis in which protesters are clashing with federal agents on icy city streets.",
    "link": "https://www.washingtonpost.com/politics/2026/01/17/trump-walz-frey-investigation-minnesota-justice-department/"
  },
  {
    "text": "MediaTek’s Upcoming Dimensity 9600 Chip Is Likely To Be Quite Popular Among Chinese Flagship Smartphones - Wccftech",
    "fullText": "A number of smartphone OEMs are likely to turn to the Dimensity 9600 as a viable contender to the Snapdragon 8 Elite Gen 6-series chips.",
    "link": "https://wccftech.com/mediateks-upcoming-dimensity-9600-chip-is-likely-to-be-quite-popular-among-chinese-flagship-smartphones/"
  },
  {
    "text": "Back-to-back winter storms hit the East this weekend with arctic blast behind them next week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/back-back-winter-storms-hit-east-weekend-arctic/story?id\\\\u003d129309541"
  },
  {
    "text": "Bank of America revamps Alphabet stock after Google enters two key partnerships - thestreet.com",
    "fullText": "Here’s what could be next for Alphabet stock.",
    "link": "https://www.thestreet.com/investing/stocks/bank-of-america-revamps-alphabet-stock-after-google-enters-two-key-partnerships"
  },
  {
    "text": "Soaring Electricity Costs Are Now a Hot Political Issue - The Wall Street Journal",
    "fullText": "Electricity-cost increases are outpacing other kinds of inflation, putting utility bills in the spotlight ahead of the midterms",
    "link": "https://www.wsj.com/business/energy-oil/soaring-electricity-costs-are-now-a-hot-political-issue-d0319a1d"
  },
  {
    "text": "Iran's supreme leader admits thousands killed during recent protests - BBC",
    "fullText": "Ayatollah Ali Khamenei says some deaths were “inhuman” and “savage” but blames the US.",
    "link": "https://www.bbc.com/news/articles/ckglee733wno"
  }
]