[
  {
    "text": "Wolves 2-2 Arsenal: Gunners collapse late as title lead starts to slip away - NBC Sports",
    "fullText": "Arsenal were 2-0 up and coasting to a seven-point lead in the Premier League title race, before they shipped two goals in the final half-hour and drew last-place Wolves 2-2 at Molineux Stadium on Wednesday.",
    "link": "https://www.nbcsports.com/soccer/news/wolves-2-2-arsenal-video-highlights-analysis-recap"
  },
  {
    "text": "UN experts say destruction by Sudan's rebels in el-Fasher in October bears 'hallmarks of genocide' - Associated Press News",
    "fullText": "U.N.-backed investigators say Sudan’s paramilitary Rapid Support Forces have carried out a campaign in the city of el-Fasher in the Darfur region that shows “hallmarks of genocide” against non-Arab communities. The fact-finding mission says the group inflicte…",
    "link": "https://apnews.com/article/rsf-sudan-genocide-un-85b79539f9e4b18e25dd6ef82d5b53ee"
  },
  {
    "text": "Stock Market Today: Dow Futures Inch Lower; Oil Prices Rise — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on business and markets, including the Dow, the S&P 500 and the Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-19-2026"
  },
  {
    "text": "Blood tests show potential for predicting start of Alzheimer’s symptoms - The Washington Post",
    "fullText": "The technique is not yet precise enough to predict a patient’s exact trajectory but could help find long-sought preventive treatment.",
    "link": "https://www.washingtonpost.com/health/2026/02/19/alzheimers-tests-symptom-onset-predictions/"
  },
  {
    "text": "Column | 8 science-backed habits for a healthier heart - The Washington Post",
    "fullText": "People who focus on these things not only have better cardiovascular health, but are also protected against conditions such as diabetes, dementia and cancer.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/19/habits-for-heart-health/"
  },
  {
    "text": "Canadians kind of hate America now. Our new poll shows just how much. - Politico",
    "fullText": "It’s not just about the trade war. Nearly half of America’s neighbors to the north now think the U.S. is a bigger threat to world peace than Russia.",
    "link": "https://www.politico.com/news/2026/02/19/5-charts-show-just-how-badly-the-us-has-torpedoed-its-relationship-with-canada-00787084"
  },
  {
    "text": "Sepsis killed a Boston newlywed. What is it? - The Boston Globe",
    "fullText": "Anyone, even healthy adults, can contract sepsis after an infection, experts said.",
    "link": "https://www.bostonglobe.com/2026/02/19/metro/sepsis-newlywed-boston-globe-death/"
  },
  {
    "text": "How Epstein and Maxwell used an elite Midwest arts school to prey on girls - NPR",
    "fullText": "Jeffrey Epstein and Ghislaine Maxwell lavished money on the Interlochen Center for the Arts to gain access, documents show — even funding an on-campus lodge they stayed in. In the process, two teenagers were pulled into their orbit.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5707290/epstein-files-victims-interlochen-ghislaine-maxwell"
  },
  {
    "text": "Ilia Malinin says person who came to Olympics a few weeks ago is ‘dust’ - The Washington Post",
    "fullText": "Gone is the shy 21-year-old who talked effusively about figure skating, replaced by a young man whose words come in measured and concrete thoughts about a larger purpose.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/19/ilia-malinin-olympic-disappointment/"
  },
  {
    "text": "February 18, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "fullText": "Today Illinois governor J.B.",
    "link": "https://heathercoxrichardson.substack.com/p/february-18-2026"
  },
  {
    "text": "Horoscope for Thursday, February 19, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/19/horoscopes-today-thursday-february-19-2026"
  },
  {
    "text": "José María Balcázar becomes Peru’s eighth president in a decade - Associated Press News",
    "fullText": "José María Balcázar has become Peru's new interim president, replacing another interim leader who was removed over corruption allegations just four months into his term. Balcázar was elected late Wednesday with a majority in the 130-member legislature, defeat…",
    "link": "https://apnews.com/article/peru-president-congress-interim-election-c6f1e2d6c061ea8ba1cb0f4f467609bc"
  },
  {
    "text": "Trump heads to Georgia, a target of his election falsehoods, as Republicans look for midterm boost - Associated Press News",
    "fullText": "President Donald Trump is weighing military action against Iran, leading an immigration crackdown, and teasing a federal takeover of state elections. But on Thursday, White House insists he will focus on the economy when he visits battleground Georgia. The tr…",
    "link": "https://apnews.com/article/trump-georgia-economy-midterm-elections-greene-29075b0f22be1569aafe144ab7ca025b"
  },
  {
    "text": "Republican Gov Hits Back At Trump Official Trying to Limit States’ Rights: I’ll ‘Beat You In Court’ - Yahoo",
    "fullText": "“Let me be clear, I will use every resource within my disposal as governor of the sovereign state of Utah, and under the Constitution of the United States to...",
    "link": "https://www.mediaite.com/media/news/republican-gov-hits-back-at-trump-official-trying-to-limit-states-rights-ill-beat-you-in-court/"
  },
  {
    "text": "Trump meets with top Iran advisers as war threat grows - Axios",
    "fullText": "The Trump administration is closer to a major war in the Middle East than most Americans realize.",
    "link": "https://www.axios.com/2026/02/18/trump-iran-meeting-military-strike"
  },
  {
    "text": "USD fires Steve Lavin, seeks ‘new course of excellence’ for basketball program - San Diego Union-Tribune",
    "fullText": "Dismissing Steve Lavin now gives Toreros AD more time to install a replacement ahead of the impending transfer portal.",
    "link": "https://www.sandiegouniontribune.com/2026/02/18/steve-lavin-is-out-as-usds-basketball-coach/"
  },
  {
    "text": "Blue Owl permanently halts redemptions at private credit fund aimed at retail investors - Financial Times",
    "fullText": "New York investment group backtracks from earlier plan to reopen to withdrawals",
    "link": "https://www.ft.com/content/b2f299f6-2a82-4a43-bcbf-86cac3937550"
  },
  {
    "text": "Jordan Stolz pursues 1500m gold, sprint sweep as speed skating continues in Milan - NBC Olympics",
    "fullText": "With a win in the 1500m Thursday, Jordan Stolz could become just the second American to take gold thrice at a single Winter Games.",
    "link": "https://www.nbcolympics.com/news/jordan-stolz-pursues-1500m-gold-sprint-sweep-speed-skating-continues-milan"
  },
  {
    "text": "Minnesota weather: 2 to 3 feet of snow on North Shore; significant accumulations in the Twin Cities - MPR News",
    "fullText": "Prolific snowfall totals fell along Lake Superior’s North Shore region. Highs winds gusted to over 60 mph.",
    "link": "https://www.mprnews.org/story/2026/02/18/2-to-3-feet-of-snow-on-north-shore-significant-accumulations-in-the-twin-cities"
  },
  {
    "text": "Google Maps ‘limited view’ now hides reviews, images for signed-out users - 9to5Google",
    "fullText": "Google Maps is more than just a navigation app, as it contains a treasure trove of data about locations across...",
    "link": "http://9to5google.com/2026/02/18/google-maps-limited-view-signed-out/"
  }
]