[
  {
    "text": "LIVE: Houston and southeast Texas under ice and winter storm warnings, ABC13 Weather Alert activated - abc13.com",
    "fullText": "An ABC13 Weather Alert is active across Houston and Southeast Texas as icy accumulations are expected through the weekend, and travel disruptions and local power outages are possible. Follow live updates on ABC13.com.",
    "link": "https://abc13.com/live-updates/abc13-weather-alert-ice-winter-storm-warnings-issued-houston-most-southeast-texas/18465916/"
  },
  {
    "text": "StormTracker8: Snow and sleet tonight, freezing rain all day Sunday - wric.com",
    "fullText": null,
    "link": "https://www.wric.com/weather/daily-forecast/stormtracker8-winter-storm-to-arrive-this-afternoon-bringing-snow-ice/"
  },
  {
    "text": "Immigrant families protest inside Texas facility housing 5-year-old boy, father detained in Minnesota - texastribune.org",
    "fullText": "Liam Conejo Ramos and his father were detained in Minnesota in an incident that’s further inflamed tensions over the Trump administration’s hardline immigration enforcement.",
    "link": "http://www.texastribune.org/2026/01/24/immigration-facility-protest-texas-liam-conejo-ramos/"
  },
  {
    "text": "AJ Dybantsa just scored 43 points against Utah. Here’s how social media reacted - deseret.com",
    "fullText": "",
    "link": "https://www.deseret.com/sports/2026/01/24/aj-dybantsa-43-points-against-utah-social-media-reactions/"
  },
  {
    "text": "2026 Rolex 24 at Daytona live updates: Results, leaderboard, track map, teams, highlights, news - NBC Sports",
    "fullText": "It's the 64th running of the sports car classic, a 24-hour endurance event at the World Center of Racing.",
    "link": "https://www.nbcsports.com/motor-sports/news/2026-rolex-24-at-daytona-live-updates-results-leaderboard-track-map-teams-highlights-news-imsa"
  },
  {
    "text": "Iran Update, January 24, 2026 - Institute for the Study of War",
    "fullText": "The Syrian government and the SDF agreed to extend their ceasefire in northeastern Syria for 15 days on January 24.",
    "link": "https://understandingwar.org/research/middle-east/iran-update-january-24-2026/"
  },
  {
    "text": "Illinois Freshman Keaton Wagler, Once Overlooked, Drops 46 to Stun No. 4 Purdue - Sports Illustrated",
    "fullText": "The guard, who was getting Division II looks 18 months ago, delivered one of the season’s most eye-opening road performances, accelerating his rise from unknown to on NBA radars.",
    "link": "https://www.si.com/college-basketball/illinois-freshman-keaton-wagler-drops-46-to-stun-no-4-purdue"
  },
  {
    "text": "Governor Hochul Updates New Yorkers on State Preparations Ahead of Massive Winter Storm - governor.ny.gov",
    "fullText": "Governor Hochul updated New Yorkers on state preparations ahead of a massive winter storm system that has already brought bitterly cold temperatures to the entire state and is expected to bring at least a foot of snow to the majority of the state.",
    "link": "https://www.governor.ny.gov/news/governor-hochul-updates-new-yorkers-state-preparations-ahead-massive-winter-storm"
  },
  {
    "text": "Milo Ventimiglia and Wife Jarah Mariano Expecting Baby No. 2 - TMZ",
    "fullText": "Congrats are in order for Milo Ventimiglia -- he's going to be a dad of 2!",
    "link": "https://www.tmz.com/2026/01/24/milo-ventimiglia-wife-jarah-mariano-expecting-second-child/"
  },
  {
    "text": "How Tennessee basketball altered Alabama travel plans due to winter weather - On3",
    "fullText": "Tennessee basketball changed travel plans following its game at Alabama on Saturday due to winter weather and will not return to Knoxville.",
    "link": "https://www.on3.com/teams/tennessee-volunteers/news/tennessee-basketball-alabama-travel-weather-georgia/"
  },
  {
    "text": "Takeaways from the first Texas Senate Democratic primary debate - CNN",
    "fullText": "The first debate in the Texas Senate Democratic primary on Saturday revealed few policy differences between US Rep. Jasmine Crockett and state Rep. James Talarico. The contrast was instead between their styles and the approaches each would take to try to flip…",
    "link": "https://www.cnn.com/2026/01/24/politics/takeaways-from-the-first-debate-in-the-texas-senate-democratic-primary-race"
  },
  {
    "text": "A $40 ad blocker is protecting families for life - Mashable",
    "fullText": "Never see another ad.",
    "link": "https://mashable.com/article/jan-24-adguard-family-plan-lifetime-subscription"
  },
  {
    "text": "How much snow are Boston and Massachusetts getting this weekend? - CBS News",
    "fullText": "A major winter storm is heading to Massachusetts on Sunday. Here's how much snow you should expect to get in your area.",
    "link": "https://www.cbsnews.com/boston/news/how-much-snow-boston-massachusetts-storm-weekend-winter/"
  },
  {
    "text": "Stream live on WCNC+ | Ice storm coverage in Charlotte, across Carolinas - wcnc.com",
    "fullText": "Stream live ice storm updates on WCNC+. Download on your TV and watch for free.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/stream-live-ice-storm-coverage-wcnc-brad-panovich-charlotte-north-carolina-winter-weather/275-b7205542-1cc2-4c9c-8844-7858e6c88e9d"
  },
  {
    "text": "Amber Heard Returns in Sundance Doc About Women Silenced by Defamation Suits, Recalls Johnny Depp Trial: ‘I Didn’t Understand It Could Get So Much Worse For Me’ - Variety",
    "fullText": "Amber Heard made a surprise return at Sundance in the documentary 'Silenced,' which chronicles women in defamation cases.",
    "link": "https://variety.com/2026/film/news/amber-heard-johnny-depp-sundance-silenced-1236639996/"
  },
  {
    "text": "New Jersey Transit announces suspension plans for Sunday amid winter storm - abc7ny.com",
    "fullText": "With a winter storm expected to impact New Jersey, NJ Transit announced it will temporarily suspend most service systemwide to keep riders and employees safe.",
    "link": "https://abc7ny.com/post/new-jersey-transit-announces-suspension-plans-sunday-amid-winter-storm/18464897/"
  },
  {
    "text": "Heavy snow and ice are coming to Philly, and may stick around for a week, or more - inquirer.com",
    "fullText": "Up to 10 inches of snow is possible, followed by ice station Philly.",
    "link": "https://www.inquirer.com/weather/philadelphia-forecast-snow-storm-sleet-20260124.html"
  },
  {
    "text": "Wife of Uganda’s opposition leader describes moment armed men attacked her at home - AP News",
    "fullText": "Armed men entered the home of Ugandan opposition leader Bobi Wine and held his wife, Barbara Kyagulanyi, at gunpoint as they demanded to know his whereabouts. Speaking on Saturday from her hospital bed, she said she was assaulted when she refused to cooperate…",
    "link": "https://apnews.com/article/uganda-opposition-bobi-wine-wife-19ee8a1bce8d0f14e9d337eba561c286"
  }
]