[
  {
    "text": "Sources: Yankees, Cody Bellinger end stalemate with 5-year deal - ESPN",
    "fullText": "The Yankees and outfielder Cody Bellinger are ending their offseason standoff by agreeing to a five-year, $162.5 million contract, sources told ESPN.",
    "link": "https://www.espn.com/mlb/story/_/id/47682955/sources-yankees-cody-bellinger-end-stalemate-5-year-deal"
  },
  {
    "text": "Jamie Dimon hesitates to criticize Trump… except for one plan he says will create ‘an economic disaster’ - CNN",
    "fullText": "JPMorgan Chase CEO Jamie Dimon limited his criticism of President Donald Trump in a question-and-answer session at Davos on Wednesday – with one notable exception.",
    "link": "https://www.cnn.com/2026/01/21/business/dimon-davos-trump-credit-card"
  },
  {
    "text": "EU suspends approval of US trade deal - BBC",
    "fullText": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
    "link": "https://www.bbc.com/news/articles/c4gwp2me3gzo"
  },
  {
    "text": "They ransacked the U.S. Capitol and want the government to pay them back - The Washington Post",
    "fullText": "Last year, President Donald Trump pardoned almost 1,600 people charged in the Jan. 6, 2021, insurrection. Now many of them might get money back from the government.",
    "link": "https://www.washingtonpost.com/politics/2026/01/21/trump-january-6-pardon-refunds/"
  },
  {
    "text": "Everything you need to know about the 2026 Sundance Film Festival - AP News",
    "fullText": "The 42nd Sundance Film Festival kicks off this week in Park City, Utah. It marks the last edition in its longtime home and the first without founder Robert Redford, who died in September. Despite the changes, the festival remains vibrant with 90 features prem…",
    "link": "https://apnews.com/article/sundance-things-to-know-2026-7ac5fce635383dce045d879eb521b5d0"
  },
  {
    "text": "These 5 Kansas City area restaurants and bars are 2026 James Beard Award semifinalists - kcur.org",
    "fullText": "Some of Kansas City’s most highly regarded culinary figures are among this year's nomiees, including Helen Jo Leach and Johnny Leach at The Town Company. The list also includes several new area restaurants.",
    "link": "https://www.kcur.org/arts-life/2026-01-21/these-5-kansas-city-area-restaurants-and-bars-are-2026-james-beard-award-semifinalists"
  },
  {
    "text": "Big 12 Conference Announces 2026 Football Schedule - Big 12 Conference",
    "fullText": "IRVING, Texas – The Big 12 Conference has released its 2026 football schedule, which features all 16 programs playing nine conference games. Big 12 members will play a total of 13 non-conference games versus Power Four opponents and Notre Dame.",
    "link": "https://big12sports.com/news/2026/1/21/big-12-conference-announces-2026-football-schedule.aspx"
  },
  {
    "text": "Sony Unveils $230 Clip-On Earbuds, Joining a Growing Wave - Bloomberg.com",
    "fullText": "Sony Group Corp. introduced its latest pair of consumer earbuds, with a clip-on design that resembles recent efforts from Bose Corp., Lenovo Group Ltd.’s Motorola unit and Huawei Technologies Co.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-21/sony-announces-230-linkbuds-clip-earbuds-joining-a-growing-style-trend"
  },
  {
    "text": "Alix Earle To Star In Netflix Reality Series - Deadline",
    "fullText": null,
    "link": "http://deadline.com/2026/01/alix-earle-netflix-reality-series-1236691247/"
  },
  {
    "text": "Judge denies lawmaker request for ‘independent monitor’ to oversee Epstein files release - Politico",
    "fullText": "But the judge noted that his order didn’t foreclose the lawmakers’ right to sue.",
    "link": "https://www.politico.com/live-updates/2026/01/21/congress/epstein-files-release-request-00738707"
  },
  {
    "text": "Nvidia Stock (NVDA) Rallies on Reports of Increased GPU Prices - TipRanks",
    "fullText": "Nvidia stock gained on reports that the company has increased the price of its GPUs.",
    "link": "https://www.tipranks.com/news/nvidia-stock-nvda-rallies-on-reports-of-increased-gpu-prices"
  },
  {
    "text": "US Pending-Home Sales Plunge by Most Since Start of Pandemic - Bloomberg.com",
    "fullText": "Pending sales of US existing homes fell in December by the most since April 2020, an unusually large drop after the housing market appeared to be gaining some momentum.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-21/us-pending-home-sales-plunge-by-most-since-start-of-pandemic"
  },
  {
    "text": "Scoop: House Democratic Leader Hakeem Jeffries opposes bill funding DHS and ICE - Axios",
    "fullText": "Democrats are lining up against the bill.",
    "link": "https://www.axios.com/2026/01/21/hakeem-jeffries-dhs-ice-funding-democrats"
  },
  {
    "text": "A whopper storm could soon engulf a 2,000-mile stretch with snow and ice - The Washington Post",
    "fullText": "This weekend, hazardous wintry weather from the storm will affect dozens of cities, with the potential for dangerous travel conditions, downed trees and long-lasting power outages.",
    "link": "https://www.washingtonpost.com/weather/2026/01/21/winter-storm-forecast-snow-ice-travel-impacts/"
  },
  {
    "text": "Manchester City: Squad to refund ticket costs for fans after Champions League loss - BBC",
    "fullText": "The Manchester City squad will refund the ticket costs for 374 supporters who travelled to Norway to witness their side's shock 3-1 Champions League defeat at Bodo/Glimt on Tuesday.",
    "link": "https://www.bbc.com/sport/football/articles/c4gwp79rdz7o"
  },
  {
    "text": "Adobe Acrobat now lets you edit files using prompts, generate podcast summaries - TechCrunch",
    "fullText": "Adobe is adding AI tools to Acrobat, including the ability to generate podcast summaries of files, create presentations, and a way for users to edit files using prompts.",
    "link": "https://techcrunch.com/2026/01/21/adobe-acrobat-now-lets-you-edit-files-using-prompts-generate-podcast-summaries/"
  },
  {
    "text": "EU lawmakers vote to hold up Mercosur trade agreement over legal concerns - AP News",
    "fullText": "European Union lawmakers have voted to hold up a major free trade agreement with the Mercosur group of South American countries over concerns about the legality of the deal. In a vote in Strasbourg, France, the lawmakers narrowly approved sending the EU-Merco…",
    "link": "https://apnews.com/article/mercosur-eu-deal-vote-court-36db5285a4b22c61da15c5bee02ef43e"
  },
  {
    "text": "NASA to end support for planetary science groups - SpaceNews",
    "fullText": "NASA is ending financial support for several planetary science groups as part of a broader drawdown of the agency’s advisory structure.",
    "link": "http://spacenews.com/nasa-to-end-support-for-planetary-science-groups/"
  }
]