[
  {
    "text": "Benjamin Netanyahu to meet Donald Trump as differences over Gaza grow - Financial Times",
    "fullText": "Florida visit will be the Israeli PM’s sixth summit with US president this year, the most of any world leader",
    "link": "https://www.ft.com/content/31c4282f-9b46-41ab-9595-3b41762d307d"
  },
  {
    "text": "Sunday Night Football: 49ers beat Bears in thriller, set up battle for NFC West, No. 1 seed - NBC Sports",
    "fullText": "San Francisco needed every second to beat Chicago on Sunday night, and now will host Seattle next Saturday night with the opportunity to clinch the NFC West and the NFC's only bye.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/sunday-night-football-49ers-beat-bears-in-thriller-set-up-battle-for-nfc-west-no-1-seed"
  },
  {
    "text": "Train derails in southern Mexico, killing 13 and injuring dozens - Al Jazeera",
    "fullText": "Mexico’s Navy says the train was carrying 250 people when it derailed partially near the town of Nizanda in Oaxaca.",
    "link": "https://www.aljazeera.com/news/2025/12/29/train-derails-in-southern-mexico-killing-13-and-wounding-dozens"
  },
  {
    "text": "Labriola on the loss to the Browns - Steelers.com",
    "fullText": "Unlike the 3 previous games, they didn't make the plays to engineer a victory",
    "link": "https://www.steelers.com/news/labriola-on-the-loss-to-the-browns-x1462"
  },
  {
    "text": "China to hold military drills around Taiwan as warning to 'separatist forces' - BBC",
    "fullText": "The drills come days after the US announced the sale of one of its largest weapons packages to Taiwan.",
    "link": "https://www.bbc.com/news/articles/c87l7xjp235o"
  },
  {
    "text": "Top 3 things we learned from Bills vs. Eagles | Week 17 - Buffalo Bills Home | Buffalo Bills - buffalobills.com",
    "fullText": "Bills missed scoring chances, Eagles D sets the tone and a playoff outlook for Week 18",
    "link": "https://www.buffalobills.com/news/top-3-things-we-learned-from-bills-vs-eagles"
  },
  {
    "text": "DNC, RNC pipe bomb suspect said something \"snapped\" after 2020 election, DOJ alleges - Axios",
    "fullText": "He thought the election had been \"tampered with,\" DOJ alleges in filing submitted by  Jeanine Pirro, U.S. attorney for D.C.",
    "link": "https://www.axios.com/2025/12/29/jan-6-pipe-bomb-suspect-confessed-justice-department-alleges"
  },
  {
    "text": "NYT Connections hints and answers for December 29, Tips to solve 'Connections' #932. - Mashable",
    "fullText": "Everything you need to solve 'Connections' #932.",
    "link": "https://mashable.com/article/nyt-connections-hint-answer-today-december-29-2025"
  },
  {
    "text": "North Korea tests long-range cruise missiles: state media - DW",
    "fullText": "Kim Jong Un personally oversaw the launching drill for new long‑range cruise missiles, according to state media. The test marks the latest flashpoint in tensions over Pyongyang's expanding nuclear ambitions.",
    "link": "https://www.dw.com/en/north-korea-tests-long-range-cruise-missiles-state-media/a-75324531"
  },
  {
    "text": "US-Nigeria strikes: Living in fear of Lakurawa - the militant group Trump targeted - BBC",
    "fullText": "\"We cannot live freely. You cannot even play music\" - residents tell the BBC of militants' rule.",
    "link": "https://www.bbc.com/news/articles/cy7vr76l521o"
  },
  {
    "text": "Trump says Russia and Ukraine are 'maybe very close' to peace deal after Zelenskyy meeting - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/volodymyr-zelenskyy-arrives-mar-lago-peace-talks-president/story?id\\\\u003d128736611"
  },
  {
    "text": "Seahawks Look To Week 18 Following Win Over Panthers: ‘The Whole Team Is Fired Up’ - Seattle Seahawks",
    "fullText": "With Seattle’s win against the Panthers and the 49ers win during Sunday Night Football, the Seahawks will be playing for the NFC West title and NFC No. 1 seed in Week 18.",
    "link": "https://www.seahawks.com/news/seahawks-look-to-week-18-following-win-over-panthers-the-whole-team-is-fired-up"
  },
  {
    "text": "Box Office: ‘Avatar 3’ Dominates Christmas With $88M for $760M Global Crown, Timothée Chalamet Strikes Again - The Hollywood Reporter",
    "fullText": "As a troubled box office year comes to a close, at least Christmas revenue hit a post-pandemic best thanks to an eclectic mix of films that offered something for everyone, led by 'Marty Supreme' and including 'Anaconda,' 'The Housemaid' and faith-based 'David…",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/avatar-3-dominates-christmas-box-office-marty-supreme-timothee-chalamet-1236460003/"
  },
  {
    "text": "Bondi Beach shooting hero says he just wanted to stop the assailant from killing more innocent people - CBS News",
    "fullText": "Ahmed al Ahmed, the man hailed as a hero for disarming one of the gunmen behind a deadly antisemitic attack on Australia's Bondi Beach, says he just wanted to save innocent people.",
    "link": "https://www.cbsnews.com/news/bondi-beach-hero-ahmed-al-ahmed/"
  },
  {
    "text": "LG announces new UltraGear evo gaming monitors with AI upscaling - The Verge",
    "fullText": "Even your gaming monitor isn’t safe from the buzz of AI.",
    "link": "https://www.theverge.com/tech/850572/lg-announces-new-ultragear-evo-gaming-monitors-with-ai-upscaling"
  },
  {
    "text": "‘Bomb cyclone’ forecasted to bring heavy snow, blizzard conditions and dangerous travel - NPR",
    "fullText": "A 'bomb cyclone' is intensifying severe winter weather for millions of people across the U.S. The system is expected to knock out power and disrupt holiday travel.",
    "link": "https://www.npr.org/2025/12/28/nx-s1-5659746/bomb-cyclone-blizzard-dangerous-travel"
  },
  {
    "text": "Market ‘Will Punish People’ If Trump Influences Federal Reserve, Bank Of America CEO Warns - Forbes",
    "fullText": "Trump has long threatened to fire Federal Reserve chair Jerome Powell, raising fears about a non-independent Fed.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/12/28/market-will-punish-people-if-trump-influences-federal-reserve-bank-of-america-ceo-warns/"
  },
  {
    "text": "A guide to choosing the right Apple Watch - TechCrunch",
    "fullText": "The gap between Apple's standard and budget smart watches has never felt smaller.",
    "link": "https://techcrunch.com/2025/12/28/is-the-apple-watch-se-3-a-good-deal/"
  }
]