[
  {
    "text": "Eileen Gu overcomes an early fall in slopestyle to keep her Olympic dreams in tact - AP News",
    "fullText": "Freeski star Eileen Gu has overcome a poor start by laying down a strong second run to qualify for the women’s slopestyle final at the Winter Olympics. The pressure was on the reigning silver medalist Saturday after she fell coming off the first rail of the o…",
    "link": "https://apnews.com/article/eileen-gu-winter-womens-slopestyle-qualifying-olympics-fcbbef4e3efffd6d0bd73fd0dbb7197e"
  },
  {
    "text": "Members of Congress will have access to unredacted Epstein files - Axios",
    "fullText": "A top House Democrat asked to see the unredacted files to determine if the DOJ improperly withheld any information.",
    "link": "https://www.axios.com/2026/02/06/epstein-files-congress-unredacted-doj-raskin"
  },
  {
    "text": "LIVE! PFL Dubai Results: Nurmagomedov vs. Davis - MMA Fighting",
    "fullText": "Get PFL Dubai results for the Nurmagomedov vs. Davis event Saturday morning.",
    "link": "https://www.mmafighting.com/pfl/470516/pfl-dubai-results-nurmagomedov-vs-davis"
  },
  {
    "text": "Pressure mounts on American Airlines CEO as carrier lags rivals - CNBC",
    "fullText": "American Airlines made $111 million last year, while rivals Delta Air Lines and United Airlines, brought in $5 billion and $3.3 billion, respectively.",
    "link": "https://www.cnbc.com/2026/02/07/american-airlines-ceo-robert-isom.html"
  },
  {
    "text": "Woman shares unlikely survival journey after migraines led to glioblastoma diagnosis: \"I am truly an outlier\" - cbsnews.com",
    "fullText": "Becca Valle, then 37, enrolled in a cutting-edge clinical trial after surgery removed an aggressive tumor from her brain.",
    "link": "https://www.cbsnews.com/news/woman-unlikely-survival-journey-migraines-glioblastoma-diagnosis/"
  },
  {
    "text": "Russia launches more than 440 drones, missiles at Ukraine overnight, Zelenskyy says - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/russia-launches-440-drones-missiles-ukraine-overnight-zelenskyy/story?id\\\\u003d129944707"
  },
  {
    "text": "Medical Mystery: A baby with high fevers, hair loss and finally, a rare diagnosis - The Washington Post",
    "fullText": "A child's years-long medical mystery was finally solved.",
    "link": "https://www.washingtonpost.com/health/2026/02/07/medical-mystery-solved-genetic-test/"
  },
  {
    "text": "'It's about the loneliness we all feel': The painful scene that really makes Taxi Driver a classic - BBC",
    "fullText": "Martin Scorsese's groundbreaking New York thriller turns 50 this week. It remains a remarkable piece of work – though its truly defining moment is probably not the one you think.",
    "link": "https://www.bbc.com/culture/article/20260206-the-incredible-moment-that-really-makes-taxi-driver-a-classic"
  },
  {
    "text": "US gave Ukraine and Russia a June deadline to reach agreement to end war, Zelenskyy says - AP News",
    "fullText": "The U.S. has given Ukraine and Russia a June deadline to reach a peace deal, according to President Volodymyr Zelenskyy. He said the U.S. plans to pressure both sides to meet this timeline. Zelenskyy spoke to reporters on Friday, with comments released on Sat…",
    "link": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001"
  },
  {
    "text": "State Department will delete X posts from before Trump returned to office - NPR",
    "fullText": "The policy change orders the removal of any post made by official State Department accounts on X before President Trump returned to office in 2025.",
    "link": "https://www.npr.org/2026/02/07/nx-s1-5704785/state-department-trump-posts-x"
  },
  {
    "text": "DVDs and public transit: Boycott drives people to ditch Big Tech to protest ICE - NPR",
    "fullText": "A sweeping boycott has begun — targeting tech giants who participants believe are enabling President Trump and his immigration crackdown.",
    "link": "https://www.npr.org/2026/02/07/nx-s1-5704402/boycott-tech-ice-scott-galloway"
  },
  {
    "text": "Americans aren't flocking to Florida like they used to. Higher prices are a big reason. - Business Insider",
    "fullText": "Americans are still moving to Florida, but domestic migration has slowed. Insurance and housing costs are likely reasons.",
    "link": "https://www.businessinsider.com/americans-moving-to-florida-less-housing-prices-miami-insurance-2026-2"
  },
  {
    "text": "Trump envoys met directly with Iran foreign minister in Oman - Axios",
    "fullText": "The negotiations were almost called off earlier in the week, but went ahead on Friday.",
    "link": "https://www.axios.com/2026/02/06/iran-us-nuclear-talks-oman"
  },
  {
    "text": "It looks like either Cody Rhodes or Jacob Fatu will miss out on Elimination Chamber - Cageside Seats",
    "fullText": "WWE books a very interesting high stakes match for SmackDown’s move to SyFy.",
    "link": "https://www.cagesideseats.com/wwe/416547/wwe-books-smackdown-syfy-olympics-cody-rhodes-jacob-fatu-elimination-chamber-qualifiers"
  },
  {
    "text": "Apple's redesigned MacBook Pro can't come soon enough - Creative Bloq",
    "fullText": "It's what creatives have been waiting for.",
    "link": "https://www.creativebloq.com/design/product-design/apples-redesigned-macbook-pro-cant-come-soon-enough"
  },
  {
    "text": "Horoscope for Saturday, February 07, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/07/horoscopes-today-saturday-february-07-2026"
  },
  {
    "text": "Nothing could stop the U.S. figure skating team. Not even JD Vance’s motorcade. - The Washington Post",
    "fullText": "Alysa Liu and world champion dance team of Madison Chock and Evan Bates have the Americans leading the team event after day one.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/06/olympics-team-figure-skating-jd-vance/"
  },
  {
    "text": "Scoop: White House plans Board of Peace meeting in D.C. on Gaza reconstruction - Axios",
    "fullText": "\"It will be the first Board of Peace meeting and a fundraising conference for Gaza reconstruction,\" a U.S. official said.",
    "link": "https://www.axios.com/2026/02/07/gaza-board-peace-meeting-trump-dc"
  },
  {
    "text": "Luigi Mangione speaks out in protest as judge sets state murder trial for June 8 - AP News",
    "fullText": "Luigi Mangione spoke out in court against the prospect of back-to-back trials in the killing of UnitedHealthcare CEO Brian Thompson. The 27-year-old Mangione on Friday told the judge presiding of the New York case against him: “It’s the same trial twice. One …",
    "link": "https://apnews.com/article/mangione-murder-unitedhealthcare-trial-schedule-020afff8ebbe1e8fee0c183fe1312268"
  }
]