[
  {
    "text": "Column | U.S. Olympic athletes expressing their views is as American as it gets - The Washington Post",
    "fullText": "American athletes in Italy are trying to handle their response to questions about, well, being American, thoughtfully and carefully.",
    "link": "https://www.washingtonpost.com/sports/olympics/2026/02/09/trump-olympic-athletes-gus-kenworthy-hunter-hess/"
  },
  {
    "text": "Live updates: Lawmakers push back against calls for British PM Starmer to resign - AP News",
    "fullText": "British Prime Minister Keir Starmer’s battle to stay in post over revelations about his former ambassador’s ties to Jeffrey Epstein is bolstered by support from all Cabinet members.",
    "link": "https://apnews.com/live/uk-starmer-resign-epstein-mandelson-updates"
  },
  {
    "text": "Epstein associate Ghislaine Maxwell refuses to answer questions from Congress - BBC",
    "fullText": "Ghislaine Maxwell, the jailed associate of sex offender Jeffrey Epstein, invoked her Fifth Amendment right to avoid self-incrimination.",
    "link": "https://www.bbc.com/news/articles/cvgv5yre39zo"
  },
  {
    "text": "2026 Winter Olympics live updates: U.S. speed skating stars Bowe and Jackson sprint for women's 1000m gold - NBC Olympics",
    "fullText": "Visit NBCOlympics.com for Winter Olympics live streams, highlights, schedules, results, news, athlete bios and more from Milan Cortina 2026.",
    "link": "https://www.nbcolympics.com/news/live/2026-winter-olympics-live-updates-feb-9-highlights-scores-results"
  },
  {
    "text": "Eileen Gu narrowly denied slopestyle gold after fall on final run at 2026 Winter Olympics - New York Post",
    "fullText": "The Olympic slopestyle war between Mathilde Gremaud and Eileen Gu rages on.",
    "link": "https://nypost.com/2026/02/09/sports/mathilde-gremaud-denies-eileen-gu-of-slopestyle-olympic-gold-again/"
  },
  {
    "text": "A record 13 skiers, climbers and hikers died in Italian mountains over the last week - AP News",
    "fullText": "A record number of backcountry skiers, climbers, and hikers have died in the Italian mountains over the last week, according to alpine rescuers. Thirteen people have died, including 10 in avalanches triggered by unstable snowpack throughout Italy’s Alpine reg…",
    "link": "https://apnews.com/article/italy-mountain-avalanche-deaths-758e328f86bf005298a6c2012c2280b2"
  },
  {
    "text": "Trial against Meta in New Mexico focuses on dangers of child sexual exploitation on social media - AP News",
    "fullText": "A trial focused on whether Meta misrepresented the safety of its platforms when it comes to the dangers of child sexual exploitation is set to start in New Mexico. Opening statements are scheduled for Monday. It’s the first stand-alone trial from state prosec…",
    "link": "https://apnews.com/article/meta-new-mexico-child-exploitation-trial-19195fc680dba782fb971d68082e11a4"
  },
  {
    "text": "Trump leaves Republicans guessing on midterms plans as outlook darkens - The Washington Post",
    "fullText": "The president is said to be eager to increase his involvement but has yet to approve a spending plan for his $300 million-plus war chest.",
    "link": "https://www.washingtonpost.com/politics/2026/02/09/trump-midterm-plans/"
  },
  {
    "text": "Column | Want to lose weight? Here’s why exercise probably won’t help. - The Washington Post",
    "fullText": "The benefits of exercise are numerous, but losing weight isn’t one of them. Here are some better motivations to add regular exercise to your routine.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/09/exercise-weight-loss/"
  },
  {
    "text": "Discord will require a face scan or ID for full access next month - theverge.com",
    "fullText": "Starting in March, all Discord users will have a “teen” experience by default unless they complete age verification using a video selfie or ID.",
    "link": "https://www.theverge.com/tech/875309/discord-age-verification-global-roll-out"
  },
  {
    "text": "NBC camera operator nails perfect shot of Charlie Puth during national anthem - Awful Announcing",
    "fullText": "An NBC camera operator nailed a perfect shot of Charlie Puth during the national anthem as fighter jets conducted a flyover at Levi's Stadium.",
    "link": "https://awfulannouncing.com/nbc/camera-operator-nails-perfect-shot-charlie-puth-national-anthem.html"
  },
  {
    "text": "Exclusive | Kroger Names an Ex-Walmart Executive as Its Next CEO - The Wall Street Journal",
    "fullText": "Greg Foran takes over big grocer as it deals with cash-strapped shoppers and seeks to expand its footprint",
    "link": "https://www.wsj.com/business/retail/kroger-ceo-greg-foran-walmart-c4885390"
  },
  {
    "text": "Bonobos are capable of pretend play, just like human children - cnn.com",
    "fullText": "Children love to play pretend, holding imaginary tea parties, educating classrooms of teddies or running their own grocery stores.  Now, a new study suggests that such make-believe play is not a uniquely human talent, but a skill that great apes also possess.",
    "link": "https://www.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli"
  },
  {
    "text": "Japan’s Takaichi to pursue conservative agenda after election landslide - NPR",
    "fullText": "Japan's first female Prime Minister, Sanae Takaichi, brought the ruling Liberal Democratic Party its biggest-ever electoral victory, fueling her ambitions to pursue to a political agenda which she says could \"split public opinion.\"",
    "link": "https://www.npr.org/2026/02/09/nx-s1-5706602/japan-takaichi-conservative-agenda-election-landslide"
  },
  {
    "text": "Capitol agenda: Republicans prepare DHS punt - Politico",
    "fullText": "It's highly unlikely all sides can agree to a full-year Department of Homeland Security revamp by Friday at midnight.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/dhs-shutdown-funding-bill-continuing-resolution-00771028"
  },
  {
    "text": "The latest on the search for Nancy Guthrie. And, takeaways from Super Bowl 60 - NPR",
    "fullText": "The search for Nancy Guthrie enters a second week. And, the Seattle Seahawks win Super Bowl 60, beating the New England Patriots 29-13. Here are the highlights from the big game.",
    "link": "https://www.npr.org/2026/02/09/g-s1-109304/up-first-newsletter-nancy-guthrie-ghislane-maxwell-super-bowl-60-state-department"
  },
  {
    "text": "New York GOP’s midterm problem: No money, no bench — and Trump - Politico",
    "fullText": "The hard-knock life of a blue-state Republican looks even worse this midterm.",
    "link": "https://www.politico.com/news/2026/02/09/new-york-gop-midterm-problem-00769887"
  },
  {
    "text": "Eritrea accuses Ethiopia of fabricating report its troops had crossed the border - BBC",
    "fullText": "Ethiopia had alleged that Eritrean soldiers were on its territory and supporting rebels in the north.",
    "link": "https://www.bbc.com/news/articles/cn87lzrj1l7o"
  }
]