[
  {
    "text": "ICE agents fatally shoot woman in Minneapolis, DHS says - CNBC",
    "fullText": "A video shows ICE agents approaching a woman in a car on a Minneapolis street and telling her to exit the vehicle. She was shot as she pulls away.",
    "link": "https://www.cnbc.com/2026/01/07/ice-dhs-minneapolis-shooting.html"
  },
  {
    "text": "Separate and alone: How Nicolás Maduro and his wife can expect to be treated in jail - CNN",
    "fullText": "Nicolás Maduro and his wife, Cilia Flores, can reasonably expect two things to happen as they get accustomed to their new day-to-day life at the notorious Metropolitan Detention Center in Brooklyn, New York: They will be uncomfortable and kept out of harm’s w…",
    "link": "https://www.cnn.com/2026/01/07/us/nicolas-maduro-wife-treatment-jail-mdc"
  },
  {
    "text": "The best phone chargers and portable power solutions at CES 2026 - The Verge",
    "fullText": "Power to the people.",
    "link": "https://www.theverge.com/tech/855028/ces-2026-best-chargers-wireless-power-bank-qi"
  },
  {
    "text": "The number of available jobs in the US just hit its lowest level in more than a year - CNN",
    "fullText": "Finding a job continued to be a slog at the end of the year, new data shows: US businesses sought out fewer workers in November and hiring rates wilted even further.",
    "link": "https://www.cnn.com/2026/01/07/economy/us-jolts-job-openings-layoffs-november"
  },
  {
    "text": "In Maduro’s capture, Russia sees a great-power rival act with impunity - The Washington Post",
    "fullText": "The U.S. intervention in Venezuela distracts attention from Ukraine and signals a new era of great-power politics in which Russia can seek its own sphere of dominance.",
    "link": "https://www.washingtonpost.com/world/2026/01/07/russia-venezuela-great-power-politics/"
  },
  {
    "text": "Avelo To Exit Deportation Biz - New Haven Independent",
    "fullText": "Avelo Airlines plans to stop running deportation flights for the Trump administration later this month after deciding that its participation in the Department of Homeland Security (DHS) program is too complex and costly to continue.",
    "link": "http://www.newhavenindependent.org/2026/01/07/avelo-to-exit-deportation-biz/"
  },
  {
    "text": "Fact Sheet: Trump Administration Resets U.S. Nutrition Policy, Puts Real Food Back at the Center of Health - Department of Health and Human Services (HHS) (.gov)",
    "fullText": null,
    "link": "https://www.hhs.gov/press-room/fact-sheet-historic-reset-federal-nutrition-policy.html"
  },
  {
    "text": "The newest Fujifilm compact camera “time-travels” with an Eras Dial and a Super-8-inspired design. But, there’s a catch - Digital Camera World",
    "fullText": "The Fujifilm Instax Mini Evo Cinema has a dial to replicate looks from different decades, but it's only been announced in Japan",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/the-newest-fujifilm-compact-camera-time-travels-with-an-eras-dial-and-a-super-8-inspired-design-but-theres-a-catch"
  },
  {
    "text": "The Biggest Questions Ahead of ‘Industry’ Season 4 - The Ringer",
    "fullText": "The HBO series about finance and betrayal returns for a fourth season on Sunday. Here’s a refresher on where things stand with Pierpoint & Co.—and beyond.",
    "link": "https://www.theringer.com/2026/01/07/tv/industry-hbo-season-4-biggest-questions"
  },
  {
    "text": "Ryan Cohen could be in for a big payday, but he has to grow meme darling GameStop to $100 billion - CNBC",
    "fullText": "The board of GameStop granted Cohen performance-based stock options tied to a $100 billion market-capitalization target.",
    "link": "https://www.cnbc.com/2026/01/07/ryan-cohen-could-be-in-for-a-big-payday-but-he-has-to-grow-meme-darling-gamestop-to-100-billion.html"
  },
  {
    "text": "‘Beef’ Sets Season 2 Release Date At Netflix - Deadline",
    "fullText": "Netflix has set April 16 for the Season 2 premiere of Beef.",
    "link": "http://deadline.com/2026/01/beef-season-2-release-date-netflix-1236664783/"
  },
  {
    "text": "Kevin Stefanski had dinner with Giants Tuesday, will meet again on Wednesday - NBC Sports",
    "fullText": "The Giants have gotten the ball rolling on meetings with potential head coaches.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/kevin-stefanski-had-dinner-with-giants-tuesday-will-meet-again-on-wednesday"
  },
  {
    "text": "NASA Perseverance rover sees megaripples on Mars photo of the day for Jan. 7, 2026. - Space",
    "fullText": "Another view from Perseverance shows how windswept Mars' landscape truly is.",
    "link": "https://www.space.com/space-exploration/mars-rovers/nasa-perseverance-rover-sees-megaripples-on-mars-space-photo-of-the-day-for-jan-7-2026"
  },
  {
    "text": "\"Put up or shut up now\": Walz unleashed after announcing political exit - Axios",
    "fullText": "The governor predicted that Republicans will \"lose dramatically\" in November.",
    "link": "https://www.axios.com/local/twin-cities/2026/01/06/tim-walz-trump-republican-response-unleashed"
  },
  {
    "text": "Nick Reiner to be arraigned on murder charges after his parents were stabbed to death - NBC News",
    "fullText": "Nick Reiner, the son of Rob Reiner and Michele Singer Reiner, is set to be arraigned Wednesday on charges that he fatally stabbed his parents in their Southern California home last month.",
    "link": "https://www.nbcnews.com/news/us-news/nick-reiner-court-hearing-michele-rob-reiner-death-rcna252673"
  },
  {
    "text": "Top 5 storylines for Bills at Jaguars | AFC Wild Card Round - Buffalo Bills Home | Buffalo Bills - buffalobills.com",
    "fullText": "Josh Allen's playoff numbers, a best-on-best matchup, the reason behind the Jaguars win streak + more.",
    "link": "https://www.buffalobills.com/news/top-5-storylines-for-bills-at-jaguars-afc-wild-card-round"
  },
  {
    "text": "Greetings from a Paris park, where a lone sequoia tree is a marvel to behold - NPR",
    "fullText": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5662630/paris-france-sequoia-tree"
  },
  {
    "text": "Connelly breaks down Miami-Ole Miss, Oregon-Indiana - ESPN",
    "fullText": "Our deep dive into the semifinals dissects the matchups that will determine who moves on to the title game.",
    "link": "https://www.espn.com/college-football/story/_/id/47529117/cfp-semifinals-preview-miami-ole-miss-oregon-indiana"
  },
  {
    "text": "CDC staff ‘blindsided’ as child vaccine schedule unilaterally overhauled - The Washington Post",
    "fullText": "The Trump administration took unprecedented steps to recommend fewer vaccines for children without extensive consultations with career scientists.",
    "link": "https://www.washingtonpost.com/health/2026/01/07/cdc-vaccine-recommendations-schedule-revisions/"
  },
  {
    "text": "Century-old tumours could reveal why more young people are getting bowel cancer - BBC",
    "fullText": "Bowel cancer in people under the age of 50 is increasing worldwide and scientists are striving to find out why.",
    "link": "https://www.bbc.com/news/articles/cvgxpv9k822o"
  }
]