[
  {
    "text": "Polls open in second round of Portugal presidential election - Al Jazeera",
    "fullText": "The far right’s score will be watched closely, with the vote being held as heavy storms continue to lash the country.",
    "link": "https://www.aljazeera.com/news/2026/2/8/polls-open-in-second-round-of-portugal-presidential-election"
  },
  {
    "text": "3 takeaways from BYU’s loss to No. 8 Houston - Deseret News",
    "fullText": "BYU has its first 4-game losing skid of the Big 12 era.",
    "link": "https://www.deseret.com/sports/2026/02/07/byu-basketball-loses-against-houston-3-takeaways/"
  },
  {
    "text": "Andrei Arlovksi bludgeons Ben Rothwell in bloody BKFC heavyweight title fight at Knucklemania 6 - Yahoo Sports",
    "fullText": "Andrei Arlovski made it three in a row against Ben Rothwell, who was left battered, beaten and without a belt.",
    "link": "https://sports.yahoo.com/mma/breaking-news/live/andrei-arlovksi-bludgeons-ben-rothwell-in-bloody-bkfc-heavyweight-title-fight-at-knucklemania-6-063037486.html"
  },
  {
    "text": "Horoscope for Sunday, February 08, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/08/horoscopes-today-sunday-february-08-2026"
  },
  {
    "text": "James Harden makes mark in Cavs’ debut, helping Cleveland rally from behind in 132-126 win - Cleveland.com",
    "fullText": "Harden and the Cavs rallied in the fourth quarter to escape with a 132-126 win over the crumbling Sacramento Kings on Saturday night.",
    "link": "https://www.cleveland.com/cavs/2026/02/james-harden-makes-mark-in-cavs-debut-helping-cleveland-rally-from-behind-in-132-126-win.html"
  },
  {
    "text": "Pokemon Presents predictions for Pokemon Day 2026 - Nintendo Everything",
    "fullText": "We take a look at every possible announcement and update for the upcoming Pokemon Presents on February 27, 2026 for Pokemon Day.",
    "link": "https://nintendoeverything.com/pokemon-day-predictions-2026/"
  },
  {
    "text": "El Grande Americano attacks El Grande Americano in AAA - Cageside Seats",
    "fullText": "The feud continues.",
    "link": "https://www.cagesideseats.com/lucha-libre-aaa-cmll/416717/el-grande-americano-attacks-el-grande-americano-aaa-wwe"
  },
  {
    "text": "Quick hits: Illini win streak snapped in 85-82 overtime loss at No. 10 Michigan State - 247Sports",
    "fullText": "Jeremy Fears Jr outdueled Keaton Wagler in a top10 Big Ten showdown",
    "link": "https://247sports.com/college/illinois/article/illinois-fighting-illini-basketball-michigan-state-quick-hits-recap-273547872/"
  },
  {
    "text": "Democrat Chasity Verret Martinez wins District 60 seat, replacing Chad Brown - The Advocate",
    "fullText": "Martinez, a Democrat and Iberville Parish Council member won Saturday's special election with 62% of the vote against small business owner and port commission member Brad Daigle.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/elections/chasity-verret-martinez-wins-election/article_4215bf58-3e04-4797-bdf5-067053533090.html"
  },
  {
    "text": "Zelensky: Trump wants Russia-Ukraine peace deal by June, before midterms focus - Axios",
    "fullText": "\"We had very good talks today having to do with Russia-Ukraine. Something could be happening,\" Trump told reporters.",
    "link": "https://www.axios.com/2026/02/07/zelensky-trump-russia-ukraine-peace-deal"
  },
  {
    "text": "5 Handy Costco Gadgets To Upgrade Your Smart Home - SlashGear",
    "fullText": "Smart home devices are everywhere, but you don't need to visit more than one store in order to fully upgrade your home with the latest tech.",
    "link": "https://www.slashgear.com/2093793/costco-gadgets-to-upgrade-smart-home/"
  },
  {
    "text": "10 Mobile Apps You Should Be Using On Your Phone In 2026 - SlashGear",
    "fullText": "From smoother scrolling to smarter sharing, underrated apps can make your phone feel easier and more thoughtful to use every day.",
    "link": "https://www.slashgear.com/2090854/mobile-phone-apps-should-be-using-in-2026/"
  },
  {
    "text": "Nancy Pelosi set to endorse JFK's grandson for New York House seat, source says - NBC News",
    "fullText": "Former Speaker Nancy Pelosi, D-Calif., plans to endorse Jack Schlossberg, the grandson of the late President John F. Kennedy, in his run for the competitive House seat representing the 12th District of New York, a source familiar with the matter told NBC News.",
    "link": "https://www.nbcnews.com/politics/elections/nancy-pelosi-set-endorse-jfks-grandson-new-york-house-seat-source-says-rcna257968"
  },
  {
    "text": "Amazon MGM Goes on Offense as ‘Melania’ Risks Getting Sacked at Super Bowl Box Office - The Hollywood Reporter",
    "fullText": "The first lady's documentary is falling off steeply in its second weekend, prompting Amazon MGM to go on the offensive and stress that the film is in it for the long game, whether theatrically or streaming.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/amazon-defends-melania-sacked-box-office-1236497985/"
  },
  {
    "text": "Housing affordability crisis: Higher earners drive home prices, not lack of supply, researchers say - Fortune",
    "fullText": "Rather than a lack of supply, housing affordability \"may primarily be about differences in income growth at the top of the distribution relative to the middle.\"",
    "link": "https://fortune.com/2026/02/07/housing-affordability-crisis-home-prices-income-inequality-supply-growth-population/"
  },
  {
    "text": "Trump aims to hold the first meeting of his new Board of Peace in Washington this month - Politico",
    "fullText": "The meeting, proposed for Feb. 19, will seek to raise money for the reconstruction of Gaza.",
    "link": "https://www.politico.com/news/2026/02/07/trump-aims-to-hold-the-first-meeting-of-his-new-board-of-peace-in-washington-this-month-00770478"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Teachers, others shocked to get SFUSD ‘assignments’ for strike day - Mission Local",
    "fullText": "On late Friday, workers were given 'redeployment assignments' to 'Staff Centers' opened because of Monday's school closures. They're confused.",
    "link": "http://missionlocal.org/2026/02/teachers-others-shocked-to-get-sfusd-assignments-for-strike-day/"
  },
  {
    "text": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org",
    "fullText": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…",
    "link": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html"
  },
  {
    "text": "It feels like humanity has died in Sudan - The Times",
    "fullText": "Millions of people have fled slaughter and rape. In camps dominated by women and girls in Chad, their nightmare continues",
    "link": "https://www.thetimes.com/world/africa/article/sudan-civil-war-yvette-cooper-2pnkchv0l"
  }
]