[
  {
    "text": "Uvalde trial: Former school police officer Adrian Gonzales found not guilty on all counts - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/uvalde-trial-verdict-reached-case-former-school-police/story?id\\\\u003d129274833"
  },
  {
    "text": "Ashton Kutcher: Hollywood isn't to blame for pushing unrealistic beauty standards - BBC",
    "fullText": "The actor stars in The Beauty,  which explores the negative impact of a world full of beautiful people.",
    "link": "https://www.bbc.com/news/articles/cddgrp0yvg1o"
  },
  {
    "text": "Stock Market Today: Dow Gains 200 Points After Trump Speech — Live Updates - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/livecoverage/stock-market-today-fed-lisa-cook-trump-nvidia-01-21-2026"
  },
  {
    "text": "Millions of people imperiled through sign-in links sent by SMS - Ars Technica",
    "fullText": "Even well-known services with millions of users are exposing sensitive data.",
    "link": "https://arstechnica.com/security/2026/01/millions-of-people-imperiled-through-sign-in-links-sent-by-sms/"
  },
  {
    "text": "As Trump talks tariffs, his Argentine ally welcomes a shipload of Chinese EVs for the first time - Yahoo Finance",
    "fullText": "Chinese automaker BYD has sped up its exports and undercut rivals the world over, alarming Washington, upsetting Western and Japanese auto giants, and...",
    "link": "https://finance.yahoo.com/news/trump-talks-tariffs-argentine-ally-231038284.html"
  },
  {
    "text": "2027 Volvo EX60 Revealed: Long Range, Fast Charging, And A Tesla Port - Motor1.com",
    "fullText": "The Volvo EX60 is officially here with up to 400 miles of range and a native NACS port. It adds 173 miles after 10 minutes of charging.",
    "link": "https://www.motor1.com/news/785028/volvo-ex60-revealed-specs-photos/"
  },
  {
    "text": "Judge blocks government from searching data seized from Post reporter - The Washington Post",
    "fullText": "Government officials may not examine electronic devices seized from a Post reporter until litigation stemming from the search of her home is settled, a judge rules.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/21/washington-post-hannah-natanson-search-court-filing/"
  },
  {
    "text": "Rapoport lists top potential HC candidates for Bills in 2026 | 'Up to the Minute' - NFL.com",
    "fullText": "<p>NFL Network Insider Ian Rapoport lists the top potential head coaching candidates for the Buffalo Bills in 2026 on \"Up to the Minute\".</p>",
    "link": "https://www.nfl.com/videos/rapoport-lists-top-potential-hc-candidates-for-bills-in-2026-up-to-the-minute"
  },
  {
    "text": "Israel kills 3 journalists in Gaza, including CBS News contributor - The Washington Post",
    "fullText": "The journalists were killed Wednesday in a strike on their car in central Gaza. Israel’s military said it struck “several suspects” who were operating a drone.",
    "link": "https://www.washingtonpost.com/world/2026/01/21/israel-strike-journalists-gaza-cbs-news/"
  },
  {
    "text": "Weekend winter storm likely. Is it the ‘big one’ or just a big mess? It’s complicated - cardinalnews.org",
    "fullText": "The moisture and cold air look sufficiently deep for a big snow — if sleet and freezing rain don’t get heavily involved.",
    "link": "http://cardinalnews.org/2026/01/21/weekend-winter-storm-likely-is-this-the-big-one-maybe-but-its-complicated/"
  },
  {
    "text": "Seven more countries agree to join Trump's Board of Peace - BBC",
    "fullText": "Seven Muslim-majority countries accept an invitation to Trump's new organisation, while Russia's Putin says he's considering joining.",
    "link": "https://www.bbc.com/news/articles/cn8jek4vv8ko"
  },
  {
    "text": "Albert Breer’s NFL Mailbag: Favorites to Land the Dolphins’ OC Job - Sports Illustrated",
    "fullText": "Packers offensive coordinator Adam Stenavich’s name has drawn buzz this hiring cycle. Plus, what Mike McDaniel brings to the Chargers.",
    "link": "https://www.si.com/nfl/albert-breer-nfl-mailbag-favorites-land-dolphins-oc-job"
  },
  {
    "text": "‘Beef’ Season 2 First Look: Charles Melton Lifts Weights, Carey Mulligan Considers a Facelift and More - Variety",
    "fullText": "Charles Melton lifts weights shirtless, Carey Mulligan considers a facelift and more in first-look images of Netflix's 'Beef' Season 2, due in April.",
    "link": "https://variety.com/2026/tv/news/beef-season-2-photos-1236637110/"
  },
  {
    "text": "Federal officials launch ICE operation in Maine and begin arrests - The Washington Post",
    "fullText": "“Everyone is on high alert,” Portland Mayor Mark Dion said. His city and nearby Lewiston have seen an influx of migrants and asylum seekers in recent years.",
    "link": "https://www.washingtonpost.com/nation/2026/01/21/ice-immigration-operation-maine/"
  },
  {
    "text": "Ex-UFC fighter arrested on felony false imprisonment charge - MMA Fighting",
    "fullText": "Jairzinho Rozenstruik was arrested after he allegedly ‘bit’ his partner after she called him a ‘nasty beast’",
    "link": "https://www.mmafighting.com/ufc/467067/ex-ufc-fighter-jairzinho-rozenstruik-arrested-on-felony-false-imprisonment-charge"
  },
  {
    "text": "When was the last time Charlotte had a significant ice storm? - wcnc.com",
    "fullText": "It's been over 20 years since Charlotte experienced a crippling ice storm. This weekend could be the next chapter of historic weather events.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/ice-storm-forecast-charlotte-historic-winter-weather-north-carolina-brad-panovich/275-04dd6dd2-5c3f-4e22-8db4-3057748a5861"
  },
  {
    "text": "Federal agent opens fire in Willowbrook, California prompting massive response from authorities - abc7chicago.com",
    "fullText": "A shooting involving a federal agent on Wednesday morning in California prompted a large response from local and federal authorities.",
    "link": "https://abc7chicago.com/post/federal-agent-opens-fire-willowbrook-california-prompting-massive-response-authorities/18444109/"
  },
  {
    "text": "This Adorable Good Boy Just Got Rare, Life-Saving Brain Surgery - Gizmodo",
    "fullText": "Six-year-old Woody has recovered well enough to take his daily walks again.",
    "link": "https://gizmodo.com/this-adorable-good-boy-just-got-rare-life-saving-brain-surgery-2000712485"
  },
  {
    "text": "League Of Legends Fighter 2XKO Launches With Issues On PS5 - Kotaku",
    "fullText": "Screen tearing issues are marring 2XKO's console debut",
    "link": "https://kotaku.com/2xko-ps5-league-legends-fighting-game-issues-2000661845"
  }
]