[
  {
    "text": "Bills 12 , Eagles 13 | Final Score, recap + highlights - Buffalo Bills Home | Buffalo Bills - buffalobills.com",
    "fullText": "Buffalo’s second half defense, fourth quarter push + more.",
    "link": "https://www.buffalobills.com/news/bills-12-eagles-13-final-score-recap-highlights"
  },
  {
    "text": "Justice Department says Jan. 6 pipe bomb suspect believed election conspiracy theories - Politico",
    "fullText": "The DOJ said in a new filing that the suspect was not “openly political” but believed the 2020 election had been tampered with.",
    "link": "https://www.politico.com/news/2025/12/28/pipe-bomb-justice-department-jan-6-suspect-00707242"
  },
  {
    "text": "Bondi Beach shooting hero says he just wanted to stop the assailant from killing more innocent people - CBS News",
    "fullText": "Ahmed al Ahmed, the man hailed as a hero for disarming one of the gunmen behind a deadly antisemitic attack on Australia's Bondi Beach, says he just wanted to save innocent people.",
    "link": "https://www.cbsnews.com/news/bondi-beach-hero-ahmed-al-ahmed/"
  },
  {
    "text": "Game Observations: 8 Takeaways From the Patriots Dominant Win Over the Jets in Week 17 - Official website of the New England Patriots",
    "fullText": "The Patriots completed a perfect regular-season road slate with a dominant 42-10 victory over the Jets on Sunday.",
    "link": "https://www.patriots.com/news/game-observations-8-takeaways-from-the-patriots-dominant-win-over-the-jets-in-week-17"
  },
  {
    "text": "‘It’s Revenge of the Banks’ as Private Creditors Lose Their Edge - Bloomberg.com",
    "fullText": "Deregulation is giving bankers new swagger in their rivalry with asset managers",
    "link": "https://www.bloomberg.com/news/features/2025-12-28/citi-goldman-jpmorgan-lead-banks-revenge-on-private-equity"
  },
  {
    "text": "LG announces new UltraGear evo gaming monitors with AI upscaling - The Verge",
    "fullText": "Even your gaming monitor isn’t safe from the buzz of AI.",
    "link": "https://www.theverge.com/tech/850572/lg-announces-new-ultragear-evo-gaming-monitors-with-ai-upscaling"
  },
  {
    "text": "Browns stun Steelers 13-6, keep Ravens alive for AFC North title - NBC Sports",
    "fullText": "Pittsburgh and Baltimore will play for a division title next weekend after Cleveland won its fourth game of the season on Sunday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/browns-stun-steelers-13-6-keep-ravens-alive-for-afc-north-title"
  },
  {
    "text": "The 11 Big Trades of 2025: Bubbles, Cockroaches and a 367% Jump - Bloomberg.com",
    "fullText": "It was another year of high-conviction bets — and fast reversals.",
    "link": "https://www.bloomberg.com/news/features/2025-12-28/ai-bubbles-jamie-dimon-cockroaches-gold-11-big-trades-of-2025"
  },
  {
    "text": "'Diff'rent Strokes' Star Melanie Watson Dead at 57 - TMZ",
    "fullText": "Melanie Watson Bernhardt -- an actress known for her role on the hit TV show \"Diff'rent Strokes\" -- has died ... TMZ has learned.",
    "link": "https://www.tmz.com/2025/12/28/different-strokes-melanie-watson-dies/"
  },
  {
    "text": "2 helicopters collide in New Jersey; 1 person dead, another critically injured, say officials - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/2-helicopters-collide-new-jersey-1-person-dead/story?id\\\\u003d128735321"
  },
  {
    "text": "‘Super flu’ cases rising across US: What to know - NewsNation",
    "fullText": "The “super flu” is a variant of influenza A H3N2 called subclade K that doctors say is more severe and takes longer to recover from.",
    "link": "https://www.newsnationnow.com/health/super-flu-cases-what-to-know/"
  },
  {
    "text": "A guide to choosing the right Apple Watch - TechCrunch",
    "fullText": "The gap between Apple's standard and budget smart watches has never felt smaller.",
    "link": "https://techcrunch.com/2025/12/28/is-the-apple-watch-se-3-a-good-deal/"
  },
  {
    "text": "Trump, after Putin call, hosts Zelenskyy for latest round of peace talks - Politico",
    "fullText": "The president said he doesn’t have a hard deadline for ending the war as he welcomed Ukraine’s leader to Mar-a-Lago.",
    "link": "https://www.politico.com/news/2025/12/28/trump-zelenskyy-peace-talks-putin-00707152"
  },
  {
    "text": "Suriname: Nine people, including five children, stabbed to death - BBC",
    "fullText": "Police detained the male suspect after shooting him in the leg, while two others are seriously injured.",
    "link": "https://www.bbc.com/news/articles/cp8966ew7y7o"
  },
  {
    "text": "‘Avatar: Fire and Ash’ Leads Box Office Over Christmas Weekend—Here’s How Marty Supreme Did - Forbes",
    "fullText": "The James Cameron blockbuster has now grossed about $760 million at theaters worldwide.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/12/28/avatar-fire-and-ash-dominates-box-office-over-christmas-weekend-posting-88-million/"
  },
  {
    "text": "Rep. Mike Turner defends US strikes against ISIS targets in Nigeria - Politico",
    "fullText": "Turner called the strikes a “continuation” of America's conflict with ISIS.",
    "link": "https://www.politico.com/news/2025/12/28/mike-turner-us-strikes-isis-nigeria-00707090"
  },
  {
    "text": "New York subway ends its MetroCard era and switches fully to tap-and-go fares - AP News",
    "fullText": "The New York City transit system is retiring the MetroCard after more than 30 years. The gold-and-blue swipeable card was introduced in 1994 to replace the subway token, which had been used for half a century. The last sales and refills on MetroCards will be …",
    "link": "https://apnews.com/article/metrocard-retired-omny-pay-nyc-subway-512112eea4d6e082baab299d41e8171a"
  },
  {
    "text": "NASA Found This on Top of Mars’s Biggest Volcano - The Daily Galaxy",
    "fullText": "Its existence challenges what we know about planetary activity in the absence of tectonic plates.",
    "link": "https://dailygalaxy.com/2025/12/mars-biggest-volcano-olympus-mons/"
  }
]