[
  {
    "text": "Bills 27-24 Jaguars (Jan 11, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nfl/recap?gameId\\\\u003d401772977"
  },
  {
    "text": "See All of the Golden Globes 2026 Red Carpet Fashion - Vogue",
    "fullText": "See all of the stars on the 2026 Golden Globes red carpet—and check back throughout the night for updates.",
    "link": "https://www.vogue.com/slideshow/golden-globes-2026-fashion-live-from-the-red-carpet"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "GM unveils its new corporate Detroit headquarters. Take a look inside - The Detroit News",
    "fullText": "The pared-down space at Hudson's Detroit puts executives near local decision-makers while embracing CEO Mary Barra's strategy to go where talent is.",
    "link": "https://www.detroitnews.com/story/business/autos/general-motors/2026/01/11/gm-unveils-its-new-corporate-detroit-headquarters-take-a-look-inside/88105931007/"
  },
  {
    "text": "Irish deny battery allegation against Freeman - ESPN",
    "fullText": "Notre Dame has denied that Marcus Freeman made physical contact with anyone after the football coach was accused of battery in a police report filed Jan. 3.",
    "link": "https://www.espn.com/college-football/story/_/id/47582269/notre-dame-denies-battery-allegations-marcus-freeman"
  },
  {
    "text": "Beloved singer/songwriter dies with five others in plane crash - AL.com",
    "fullText": "He was 34.",
    "link": "https://www.al.com/news/2026/01/beloved-singersongwriter-dies-with-five-others-in-plane-crash.html"
  },
  {
    "text": "Man United 1-2 Brighton (Jan 11, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Manchester United vs. Brighton & Hove Albion English Fa Cup game from January 11, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/762498"
  },
  {
    "text": "DHS restricts congressional visits to ICE facilities in Minneapolis with new policy - NPR",
    "fullText": "A memo from Homeland Security Secretary Kristi Noem, obtained by NPR, instructs her staff that visits should be requested at least seven days in advance.",
    "link": "https://www.npr.org/2026/01/11/nx-s1-5673949/dhs-restricts-congressional-visits-to-ice-facilities-in-minneapolis-with-new-policy"
  },
  {
    "text": "Sunday Preview – Angron Transfigured stares down the new Skitarii - Warhammer Community",
    "fullText": "What’s coming up next week?",
    "link": "https://www.warhammer-community.com/articles/dcuclxww/sunday-preview-angron-transfigured-stares-down-the-new-skitarii"
  },
  {
    "text": "Portsmouth 1-4 Arsenal (Jan 11, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Portsmouth vs. Arsenal English Fa Cup game from January 11, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/762502"
  },
  {
    "text": "With YouTube and TikTok, dentists are trying to get Gen Z to show up - The Washington Post",
    "fullText": "Young adults are the most likely age group to skip dental care, with a recent study finding that one in three didn’t see a dentist during the previous year.",
    "link": "https://www.washingtonpost.com/nation/2026/01/11/dentists-gen-z-skipping-dental-care/"
  },
  {
    "text": "Myanmar holds second round of voting in first general election since military takeover - AP News",
    "fullText": "Myanmar has begun a second round of voting in its first general election since the military takeover five years ago. Critics argue the election is neither free nor fair, calling it a military attempt to legitimize its rule. Tom Andrews from the U.N. human rig…",
    "link": "https://apnews.com/article/myanmar-election-military-party-second-phase-6661c927e1b6079d899ccc022f0a981d"
  },
  {
    "text": "Google’s AI Inbox could be a glimpse of Gmail’s future - The Verge",
    "fullText": "We’ve tried Google’s AI Inbox, and while it has some promise, if you have a good email management system already, it may not change that.",
    "link": "https://www.theverge.com/tech/859864/google-gmail-ai-inbox-hands-on"
  },
  {
    "text": "Sen. Rand Paul warns bombing Iran 'not the answer' to protests against regime - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/sen-rand-paul-warns-bombing-iran-answer-protests/story?id\\\\u003d129100786"
  },
  {
    "text": "Trump tells Cuba to 'make a deal, before it is too late' - BBC",
    "fullText": "Trump has been turning his attention to Cuba since US forces seized Venezuelan leader Nicolás Maduro.",
    "link": "https://www.bbc.com/news/articles/cx2kv2gn62vo"
  },
  {
    "text": "From Merrill Lynch to wok station: the daughter of San Francisco's Chinese food dynasty who defied her parents—by working alongside them - Fortune",
    "fullText": "House of Nanking's Kathy Fang talked to Fortune about her new cookbook, quitting corporate life, and when her dad embarrassed her in front of Keanu Reeves.",
    "link": "https://fortune.com/2026/01/11/house-of-nanking-cookbook-kathy-fang-interview-keanu-reeves-san-francisco-chinatown/"
  },
  {
    "text": "20 More People Who Are Having A Way, Way, Way, Way, Way, Way, Way, Way, Way, Way, Way Worse Start To 2026 Than You - BuzzFeed",
    "fullText": "That's not great at all.",
    "link": "https://www.buzzfeed.com/daves4/tough-week-january-11-2026"
  },
  {
    "text": "It's One Of The Fastest-Growing Snacks In The Nation. It Also Comes With A Concerning Risk. - HuffPost",
    "fullText": "Food journalist Elizabeth Dunn tells the hosts of HuffPost's \"Am I Doing It Wrong?\" podcast why they should consider steering clear of this beloved food.",
    "link": "https://www.huffpost.com/entry/protein-rich-snack-meat-sticks-carcinogen_l_6961173ee4b0120ab25d18a4"
  }
]