[
  {
    "text": "Luka Dončić leaves Sixers game with left leg soreness injury, will get imaging on hamstring - Silver Screen and Roll",
    "fullText": null,
    "link": "https://www.silverscreenandroll.com/lakers-injury-report/107418/lakers-injury-report-luka-doncic-hamstring-sixers-status-update"
  },
  {
    "text": "New Jersey House Primary Special Election 2026 Live Results - NBC News",
    "fullText": "View results from the 2026 New Jersey House Special Election. Follow live outcomes as votes are added up after the election.",
    "link": "https://www.nbcnews.com/politics/2026-primary-special-elections/new-jersey-house-results"
  },
  {
    "text": "US military kills two people in latest attack on vessel in the Pacific - Al Jazeera",
    "fullText": "US says two people were killed in strike on a vessel in the Pacific Ocean, continuing a campaign denounced as illegal.",
    "link": "https://www.aljazeera.com/news/2026/2/6/us-military-kills-two-people-in-latest-attack-on-vessel-in-the-pacific"
  },
  {
    "text": "Trump endorses Japan's Takaichi ahead of snap election - BBC",
    "fullText": "It is rare for US presidents to publicly back candidates in foreign elections.",
    "link": "https://www.bbc.com/news/articles/c5yd14r2mgno"
  },
  {
    "text": "Democrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station - Axios",
    "fullText": "\"There is no point in yielding to his ever-changing ransom demands,\" said one Democrat.",
    "link": "https://www.axios.com/2026/02/06/trump-schumer-dulles-penn-gateway-democrats-nyc"
  },
  {
    "text": "Bears OL Joe Thuney wins first-ever NFL Protector of the Year award - NFL.com",
    "fullText": "Chicago Bears offensive lineman Joe Thuney was awarded the inaugural Protector of the Year at NFL Honors in San Francisco.",
    "link": "https://www.nfl.com/news/bears-ol-joe-thuney-first-ever-nfl-protector-of-the-year-award"
  },
  {
    "text": "Trump Takes Fresh Jab at Kennedys After Deciding to Destroy Center - The Daily Beast",
    "fullText": "The president made the comment days after announcing the temporary closure of the iconic venue.",
    "link": "https://www.thedailybeast.com/trump-takes-fresh-jab-at-kennedys-after-deciding-to-destroy-center/"
  },
  {
    "text": "Mike White Gives ‘The White Lotus’ Season 4 Update During ‘Survivor 50’ Return: “I Can’t Pass This Up” - Deadline",
    "fullText": "Although Season 4 of 'The White Lotus' is headed to the south of France, creator Mike White has to survive Fiji first.",
    "link": "http://deadline.com/2026/02/mike-white-white-lotus-season-4-update-survivor-50-1236710840/"
  },
  {
    "text": "Donors give over $3 million to boost tech-friendly California governor candidate - Politico",
    "fullText": "The cash infusion could help the moderate San Jose Mayor Matt Mahan make up ground after a late entry into the governor’s race.",
    "link": "https://www.politico.com/news/2026/02/05/mahan-tech-donors-white-00767433"
  },
  {
    "text": "Bezalel Zini, brother of Israel’s security chief, arrested in bust of alleged Gaza smuggling ring - cnn.com",
    "fullText": "The brother of Israel’s security chief was arrested along with 14 others in a major police bust of an alleged smuggling ring accused of shipping crates of illegal goods into the Gaza Strip.",
    "link": "https://www.cnn.com/2026/02/05/middleeast/brother-shin-bet-chief-gaza-israel-smuggling-latam-intl"
  },
  {
    "text": "The Switch 2 is getting a new Virtual Console (kind of) - Ars Technica",
    "fullText": "Hamster Corp.'s new \"Console Archives\" does what Nintendon't.",
    "link": "https://arstechnica.com/gaming/2026/02/the-virtual-console-is-sort-of-back-on-the-switch-2/"
  },
  {
    "text": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-shifts-explanation-dni-gabbard-fbi-georgia-election/story?id\\\\u003d129890577"
  },
  {
    "text": "NASA Selects Two Earth System Explorers Missions - NASA (.gov)",
    "fullText": "These two missions were selected for continued development as part of NASA’s Earth System Explorers Program, which conducts principal investigator-led Earth",
    "link": "https://www.nasa.gov/news-release/nasa-selects-two-earth-system-explorers-missions/"
  },
  {
    "text": "Tim Cook Teases Plans for Apple's Upcoming 50th Anniversary - MacRumors",
    "fullText": "Apple turns 50 this year, and its CEO Tim Cook has promised to celebrate the milestone. The big day falls on April 1, 2026.   \"I've been...",
    "link": "https://www.macrumors.com/2026/02/05/tim-cook-teases-apple-50th-anniversary/"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "fullText": "The New START deal was the last vestige of arms control between the world’s largest superpowers.",
    "link": "https://www.politico.com/news/2026/02/05/trump-nuclear-arms-treaty-russia-00767497"
  },
  {
    "text": "Samsung killed Galaxy S26 upgrades to avoid a price hike – leaks say it didn’t work - 9to5Google",
    "fullText": "Samsung’s Galaxy S26 series was expected to deliver on a few key upgrades that were long overdue, but that all...",
    "link": "http://9to5google.com/2026/02/05/samsung-galaxy-s26-upgrades-price-hike/"
  },
  {
    "text": "New analysis suggests puzzling fossil may have been an unknown life-form - CNN",
    "fullText": "A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular life, according to a new study.",
    "link": "https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form"
  },
  {
    "text": "WDH reports flu-related death of Fremont County child - County 10",
    "fullText": "A recently reported flu-related death of a Fremont County child is a sad reminder that influenza can be a serious disease and should not be overlooked, according to a Wyoming Department of Health (WDH) official. Dr. Alexia Harrist, State Health Officer with W…",
    "link": "https://county10.com/wdh-reports-flu-related-death-of-fremont-county-child/"
  }
]