[
  {
    "text": "Amid ICE clashes, New Hampshire bishop urges clergy to prepare their wills - NPR",
    "fullText": "The Episcopal bishop of New Hampshire told priests protesting ICE to get their wills and affairs in order. Some praise the bishop, while other priests say they never signed up to be martyrs.",
    "link": "https://www.npr.org/2026/01/18/nx-s1-5678579/ice-clashes-new-hampshire-bishop-urges-clergy-prepare-wills"
  },
  {
    "text": "Somali businesses struggle during the Minneapolis ICE crackdown - ABC News",
    "fullText": "Business owners in a Minneapolis Somali mall are feeling the impact of an immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/somali-businesses-struggle-minneapolis-ice-crackdown-129323397"
  },
  {
    "text": "Biggest winners and losers from Saturday's Divisional Round NFL playoff games - NFL.com",
    "fullText": "Jeffri Chadiha identifies winners and losers from the first two games of the Divisional Round, which saw both No. 1 seeds -- the Denver Broncos and Seattle Seahawks -- advance. Who's up and who's down following Saturday's contests?",
    "link": "https://www.nfl.com/news/biggest-winners-and-losers-from-saturday-s-divisional-round-nfl-playoff-games"
  },
  {
    "text": "Market begins to de-clutter for Steelers as they aim to zero in on top coaching candidates - TribLIVE.com",
    "fullText": "In-person interviews with teams have yet to even begin for the vast majority of the leading NFL coaching candidates, but that didn&rsquo;t mean Saturday didn&rsquo;t bring news &mdash; most of it good &mdash; for the Pittsburgh Steelers. The Steelers were sch…",
    "link": "https://triblive.com/sports/market-begins-to-de-clutter-for-steelers-as-they-aim-to-zero-in-on-top-coaching-candidates/"
  },
  {
    "text": "Pennsylvania woman's final moments captured on home security video. Will it help prove she was murdered? - CBS News",
    "fullText": "Bruno Rocuba claims a freak accident while handling his gun caused the death of his wife, Melissa Rocuba. He was not arrested or charged with any crime. Years later, investigators uncover disturbing new evidence that challenges what really happened that night…",
    "link": "https://www.cbsnews.com/news/melissa-rocuba-bruno-rocuba-pennsylvania-shooting-death-home-security-video-48-hours/"
  },
  {
    "text": "\"Gaza is our show\": U.S. pushes its plan over Netanyahu's objections - Axios",
    "fullText": "\"If he wants us to deal with Gaza, it will have to be our way.\"",
    "link": "https://www.axios.com/2026/01/17/gaza-phase-two-netanyahu-trump-board"
  },
  {
    "text": "Five graphics that show Greenland’s importance to Trump - DW.com",
    "fullText": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
    "link": "https://www.dw.com/en/five-graphics-that-show-greenlands-importance-to-trump/a-75547831"
  },
  {
    "text": "Mo Dioubate's toughness helped Kentucky come back to beat Tennessee - On3",
    "fullText": "Mo Dioubate was starting to look like the odd man out for Kentucky, but his toughness helped the Cats come back to beat Tennessee.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/mo-dioubate-toughness-kentucky-tennessee-comeback/"
  },
  {
    "text": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
    "fullText": "The two men’s eyewitness accounts of the Jan. 3 death of Geraldo Lunas Campos at a Texas detention camp differ from the Department of Homeland Security’s account of the incident.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/17/detainee-death-witnesses-deported-dhsa/"
  },
  {
    "text": "Five takeaways from IU basketball’s loss to Iowa - Inside the Hall",
    "fullText": "IU basketball lost its third straight game, falling 74-57 on Saturday afternoon to Iowa at Simon Skjodt Assembly Hall.",
    "link": "https://www.insidethehall.com/2026/01/17/five-takeaways-from-iu-basketballs-loss-to-iowa/"
  },
  {
    "text": "Starmer brands Trump's plan to apply tariffs over Greenland 'completely wrong' - BBC",
    "fullText": "Finland's Prime Minister Petteri Orpo says the taxes, due to hit eight European countries on 1 February, would \"harm both Europe and the US\".",
    "link": "https://www.bbc.com/news/live/c1j8kw866p3t"
  },
  {
    "text": "What Yoweri Museveni's election victory over Bobi Wine means for Uganda - BBC",
    "fullText": "Yoweri Museveni has won a record seventh term in elections after promising that the fledgling oil sector will boost the economy.",
    "link": "https://www.bbc.com/news/articles/cx20qj1pwrwo"
  },
  {
    "text": "Five die in Austrian avalanches, rescuers say - BBC",
    "fullText": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
    "link": "https://www.bbc.com/news/articles/c3r1v7gqdp8o"
  },
  {
    "text": "RFK-backed infant vaccine study in Africa to proceed despite backlash, U.S. says - The Washington Post",
    "fullText": "U.S. funding for a study on the timing of hepatitis B vaccine doses in infants in Guinea-Bissau has sparked confusion and ethics concerns.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/rfk-vaccine-trump-hepatitis-b-guinea-bissau-infant-trial/"
  },
  {
    "text": "Japan Just Shut Down a Spacecraft That Cheated Death for 10 Years, Here's What It Saw on Venus - The Daily Galaxy",
    "fullText": "It was Japan’s first leap beyond Earth orbit, and it didn’t go as planned.",
    "link": "https://dailygalaxy.com/2026/01/japan-shut-down-spacecraft-what-saw-venus/"
  },
  {
    "text": "Back-to-back winter storms hit the East this weekend with arctic blast behind them next week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/back-back-winter-storms-hit-east-weekend-arctic/story?id\\\\u003d129309541"
  },
  {
    "text": "Trump to POLITICO: ‘It’s time to look for new leadership in Iran’ - Politico",
    "fullText": "Trump, after being read a series of hostile X posts from Iran’s supreme leader, said the ayatollah is guilty of “the complete destruction of his country.”",
    "link": "https://www.politico.com/news/2026/01/17/trump-to-politico-its-time-to-look-for-new-leadership-in-iran-00735528"
  },
  {
    "text": "Bank of America revamps Alphabet stock after Google enters two key partnerships - thestreet.com",
    "fullText": "Here’s what could be next for Alphabet stock.",
    "link": "https://www.thestreet.com/investing/stocks/bank-of-america-revamps-alphabet-stock-after-google-enters-two-key-partnerships"
  }
]