[
  {
    "text": "Andrei Arlovksi bludgeons Ben Rothwell in bloody BKFC heavyweight title fight at Knucklemania 6 - Yahoo Sports",
    "fullText": "Andrei Arlovski made it three in a row against Ben Rothwell, who was left battered, beaten and without a belt.",
    "link": "https://sports.yahoo.com/mma/breaking-news/live/andrei-arlovksi-bludgeons-ben-rothwell-in-bloody-bkfc-heavyweight-title-fight-at-knucklemania-6-063037486.html"
  },
  {
    "text": "Thailand national election 2026: Voters head to the polls in high-stakes election - BBC",
    "fullText": "Thai voters will elect a new parliament and also vote on a referendum about the country's constitution.",
    "link": "https://www.bbc.co.uk/news/live/c4g31zlezp1t"
  },
  {
    "text": "DGA Awards: Paul Thomas Anderson Takes Top Honor for ‘One Battle After Another’ - The Hollywood Reporter",
    "fullText": "Kumail Nanjiani hosted the ceremony honoring the best film and TV directors of the past year, with 'The Studio,' 'The Pitt,' 'Dying for Sex' and 'SNL50' also taking home honors.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/2026-directors-guild-awards-winners-list-1236496494/"
  },
  {
    "text": "Quick hits: Illini win streak snapped in 85-82 overtime loss at No. 10 Michigan State - 247Sports",
    "fullText": "Jeremy Fears Jr outdueled Keaton Wagler in a top10 Big Ten showdown",
    "link": "https://247sports.com/college/illinois/article/illinois-fighting-illini-basketball-michigan-state-quick-hits-recap-273547872/"
  },
  {
    "text": "Did a popular acne medication drive a Texas teen to shoot his friends? - cbsnews.com",
    "fullText": "Connor Hilton, 17, said that after taking Accutane, a prescribed acne medication, he began to have suicidal and homicidal thoughts – thoughts that, his defense argued, led him to shoot two friends in the head at his Friendswood, Texas, home. Prosecutors weren…",
    "link": "https://www.cbsnews.com/news/connor-hilton-friendswood-texas-shooting-acne-medication-48-hours/"
  },
  {
    "text": "Zelensky says Russia is proposing huge economic deals with U.S. - The Washington Post",
    "fullText": "The Ukrainian president said the Trump administration was pushing for a June deadline to end Russia’s war.",
    "link": "https://www.washingtonpost.com/world/2026/02/07/ukraine-russia-us-economic-agreements-war/"
  },
  {
    "text": "M5 MacBook Air will just be a spec bump, but there’s one upgrade I really want to see - 9to5Mac",
    "fullText": "In many of its most recent hardware launches, including iPad Pro and iPhone 17 Pro, Apple has prioritized one thing...",
    "link": "https://9to5mac.com/2026/02/07/m5-macbook-air-one-feature-request-better-thermals/"
  },
  {
    "text": "Amazon MGM Goes on Offense as ‘Melania’ Risks Getting Sacked at Super Bowl Box Office - The Hollywood Reporter",
    "fullText": "The first lady's documentary is falling off steeply in its second weekend, prompting Amazon MGM to go on the offensive and stress that the film is in it for the long game, whether theatrically or streaming.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/amazon-defends-melania-sacked-box-office-1236497985/"
  },
  {
    "text": "Immigrant whose skull was broken in 8 places during ICE arrest says beating was unprovoked - NPR",
    "fullText": null,
    "link": "https://www.npr.org/2026/02/07/g-s1-109219/immigrant-ice-arrest-beating"
  },
  {
    "text": "Person Behind Drew McIntyre’s Brutal SmackDown Mic Drop Identified - Ringside News",
    "fullText": "The fiery Drew McIntyre promo that closed the loop on SmackDown chaos this week wasn’t just raw emotion — it was carefully scripted behind the scenes.",
    "link": "https://www.ringsidenews.com/person-behind-drew-mcintyres-brutal-smackdown-mic-drop-identified/"
  },
  {
    "text": "Boxing: Nick Ball knocked out by Brandon Figueroa to lose world title fight in Liverpool - BBC",
    "fullText": "Nick Ball is beaten for the first time in his professional career in front of hometown fans in Liverpool, relinquishing his world title.",
    "link": "https://www.bbc.com/sport/boxing/articles/cwygyrn2elno"
  },
  {
    "text": "Trump aims to hold the first meeting of his new Board of Peace in Washington this month - Politico",
    "fullText": "The meeting, proposed for Feb. 19, will seek to raise money for the reconstruction of Gaza.",
    "link": "https://www.politico.com/news/2026/02/07/trump-aims-to-hold-the-first-meeting-of-his-new-board-of-peace-in-washington-this-month-00770478"
  },
  {
    "text": "SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now",
    "fullText": null,
    "link": "https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/"
  },
  {
    "text": "Teachers, others shocked to get SFUSD ‘assignments’ for strike day - Mission Local",
    "fullText": "On late Friday, workers were given 'redeployment assignments' to 'Staff Centers' opened because of Monday's school closures. They're confused.",
    "link": "http://missionlocal.org/2026/02/teachers-others-shocked-to-get-sfusd-assignments-for-strike-day/"
  },
  {
    "text": "Toddler hospitalized with respiratory failure was returned to ICE detention and denied prescribed medication, lawsuit says - NBC News",
    "fullText": "A federal lawsuit says an 18-month-old baby became critically ill in a South Texas immigration detention center, was hospitalized with respiratory failure, then sent back to detention without needed medication.",
    "link": "https://www.nbcnews.com/news/us-news/toddler-hospitalized-dilley-ice-detention-rcna257912"
  },
  {
    "text": "Netanyahu to hold urgent meeting with Trump Wednesday amid Iran negotiations - Axios",
    "fullText": "Netanyahu \"believes that any negotiations must include limits on Iran's ballistic missiles,\" the prime minister's office said.",
    "link": "https://www.axios.com/2026/02/07/netanyahu-trump-iran-negotiations"
  },
  {
    "text": "These Game Boy, DS, 3DS, GameCube, Wii, and Wii U games sold exactly 1 copy each in the U.S. in 2025 - Nintendo Everything",
    "fullText": "New data has been released that reveals games that sold exactly one unit in the United States during 2025 on older Nintendo platforms. Wii U is the newest of the bunch, but this stretches all the way back to the Game Boy. The full list is as follows: Game Boy…",
    "link": "https://nintendoeverything.com/these-game-boy-ds-3ds-gamecube-wii-and-wii-u-games-sold-exactly-1-copy-each-in-the-u-s-in-2025/"
  },
  {
    "text": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org",
    "fullText": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…",
    "link": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html"
  },
  {
    "text": "New snowfall map: Weekend storm could bring up to a foot of snow to Mass. - Boston 25 News",
    "fullText": "Ready the shovels! More snow is on the way.",
    "link": "https://www.boston25news.com/news/local/new-snowfall-map-weekend-storm-could-bring-up-foot-snow-mass/FL4LVUNWMBFEDJ7VPMSZ5Q5LVU/"
  },
  {
    "text": "Five off-the-radar Seahawks who could play big role in Super Bowl LX - The Seattle Times",
    "fullText": "Every Super Bowl somebody unexpected steps into the spotlight and plays a major role. Here are five Seahawks who could play that role Sunday.",
    "link": "https://www.seattletimes.com/sports/seahawks/super-bowl-lx-five-off-the-radar-seahawks-who-could-play-big-role/"
  }
]