[
  {
    "text": "Senate reaches deal ahead of shutdown deadline to fund government, continue ICE talks, source says - CBS News",
    "fullText": "The deal comes ahead of the Saturday shutdown deadline, but it will also need the approval of the House, which isn't scheduled to return until Monday — and at least one Republican senator has pushed back.",
    "link": "https://www.cbsnews.com/news/senate-reaches-deal-ahead-of-shutdown-deadline-to-fund-government-continue-ice-talks-source-says/"
  },
  {
    "text": "The meaning of Xi’s military purge - Financial Times",
    "fullText": "Relations between Chinese Communist leaders and the army have always been fraught",
    "link": "https://www.ft.com/content/1e722210-d6c6-4972-a60c-92d460059fa8"
  },
  {
    "text": "Noem says her response to Pretti shooting may have been wrong - Politico",
    "fullText": "The DHS chief dodged questions about her oversight of the agency following the killing of a Minneapolis man by immigration agents.",
    "link": "https://www.politico.com/news/2026/01/29/noem-pretti-shooting-00756830"
  },
  {
    "text": "What to know about the Nipah virus - CNN",
    "fullText": "The World Health Organization reported two cases of a rare virus in an eastern Indian state on Thursday.",
    "link": "https://www.cnn.com/2026/01/29/health/nipah-virus-explainer"
  },
  {
    "text": "WGA Staff Authorizes a Strike, Accuses Guild Leaders of Bargaining in Bad Faith - Variety",
    "fullText": "The WGA West staff voted 82% in favor of authorizing a strike, accusing the union leadership of bargaining in bad faith.",
    "link": "https://variety.com/2026/film/news/wga-staff-strike-authorization-bad-faith-bargaining-1236645029/"
  },
  {
    "text": "2026 Senior Bowl: Daniel Jeremiah's top 10 standouts from week of practice - NFL.com",
    "fullText": "Which 2026 NFL Draft prospects stood out the most during the week of practices at the Senior Bowl? Daniel Jeremiah highlights 10 players who helped themselves heading into Saturday's all-star game.",
    "link": "https://www.nfl.com/news/2026-senior-bowl-daniel-jeremiah-s-top-10-standouts-from-week-of-practice"
  },
  {
    "text": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke - TMZ",
    "fullText": "\"The Blind Side\" star Quinton Aaron's family is revealing what led to his hospitalization ... they tell us he suffered a spinal stroke.",
    "link": "https://www.tmz.com/2026/01/29/quinton-aaron-suffered-spinal-stroke/"
  },
  {
    "text": "Can Silicon Valley make a governor? Matt Mahan is betting yes - Politico",
    "fullText": "For all the region’s financial and cultural heft, the bastion of Big Tech has been a cul-de-sac of political power in California.",
    "link": "https://www.politico.com/news/2026/01/29/can-silicon-valley-make-a-governor-matt-mahan-is-betting-yes-00756444"
  },
  {
    "text": "Your Halo Story | Halo - Official Site (en) - Halo Waypoint",
    "fullText": "<p>I’m obsessed with stories. This comes as a shock to many of you, I know. These days when we hear the term, the immediate association is likely with penwoven narratives underpinning myriad entertainment properties and creative content. Or perhaps some varia…",
    "link": "https://www.halowaypoint.com/news/your-halo-story-chapter-01"
  },
  {
    "text": "Massachusetts on \"razor's edge\" with weekend storm. Maps show best chance for snow, high winds. - CBS News",
    "fullText": "It does not appear that the storm will track close enough to New England to deliver what could have been, a devastating and destructive blow.",
    "link": "https://www.cbsnews.com/boston/news/massachusetts-snow-map-boston-storm-bombogenesis/"
  },
  {
    "text": "Josh Allen on crutches: What we know about the Buffalo Bills QB’s broken foot and surgery - syracuse.com",
    "fullText": "Allen arrived at Joe Brady's press conference on crutches in a walking boot.",
    "link": "https://www.syracuse.com/buffalo-bills/2026/01/josh-allen-on-crutches-what-we-know-about-the-buffalo-bills-qbs-broken-foot-and-surgery.html"
  },
  {
    "text": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "fullText": "\"It is amazing to see that we are gradually moving towards combining these breakthrough observations across multiple frequencies and completing the picture of the jet launching region.\"",
    "link": "https://www.space.com/astronomy/black-holes/astronomers-watch-1st-black-hole-ever-imaged-launch-a-3-000-light-year-long-cosmic-jet-from-its-glowing-shadow"
  },
  {
    "text": "Landmark crypto bill clears Senate hurdle but Democrats withhold support over lack of 'gryfto' rules to prevent Trump family conflicts of interest - Fortune",
    "fullText": "The blockchain industry has raised millions in fresh funding to advance its political agenda in Washington, D.C.",
    "link": "https://fortune.com/2026/01/29/clarity-act-gryfto-crypto-senate-agriculture-committee-booker-trump-banking/"
  },
  {
    "text": "Trump’s wide ambitions for Board of Peace spark new support for the United Nations - AP News",
    "fullText": "President Donald Trump’s latest attempt to sidestep the United Nations through his new Board of Peace appears to have inadvertently backfired. Major world powers have rejected U.S. aspirations for the board to have a larger international mandate beyond the Ga…",
    "link": "https://apnews.com/article/board-peace-trump-un-security-council-china-df62e5087f3e8097f856c637a75cbc51"
  },
  {
    "text": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate - MMA Fighting",
    "fullText": "Watch Khamzat Chimaev get in the face of fiery fighter.",
    "link": "https://www.mmafighting.com/ufc/468742/video-khamzat-chimaev-confronts-fighter-after-near-brawl-with-teammate"
  },
  {
    "text": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "fullText": "Federal officials have a plan that could curb billions of dollars in overpayments to Medicare Advantage plans. But will they follow through on it?",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5691896/medicare-advantage-health-insurance-trump-oz-cms-upcoding"
  },
  {
    "text": "Handling of Pretti investigation has some prosecutors on verge of quitting - The Washington Post",
    "fullText": "Federal prosecutors in Minneapolis, deeply frustrated by the response to the shootings of Renée Good and Alex Pretti, have suggested they could resign en masse.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/29/minneapolis-shootings-prosecutor-resignations/"
  },
  {
    "text": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet - The Daily Galaxy",
    "fullText": "Curiosity switched on its lights during the Martian night, capturing a rare view that is forcing scientists to look at the Red Planet in a new way.",
    "link": "https://dailygalaxy.com/2026/01/curiosity-just-lit-up-mars-never-seen-side/"
  },
  {
    "text": "As quirky Switch 2 life sim Tomodachi Life gets a release date, Nintendo makes good on decade-old same-sex relationship promise - Eurogamer",
    "fullText": "Nintendo has confirmed same-sex relationships in its Tomodachi Life: Living the Dream reveal, alongside an April release date.",
    "link": "https://www.eurogamer.net/tomodachi-life-living-the-dream-big-reveal-nintendo-same-sex-relationship-promise"
  }
]