[
  {
    "text": "Browns' Myles Garrett gets sack No. 23 to set NFL season record - ESPN",
    "fullText": "Browns defensive end Myles Garrett set the NFL's single-season sack record Sunday with a sack of Joe Burrow to give him 23 on the season.",
    "link": "https://www.espn.com/nfl/story/_/id/47503855/browns-myles-garrett-gets-sack-no-23-set-nfl-season-record"
  },
  {
    "text": "Denmark urges 'respect' after Trump aide's wife posts on Greenland - BBC",
    "fullText": "Katie Miller's message showed an altered image of the Danish autonomous territory alongside the word \"SOON\".",
    "link": "https://www.bbc.com/news/articles/c4g0zg974v1o"
  },
  {
    "text": "Hollywood starts 2026 with 'Avatar: Fire and Ash' No. 1, as James Cameron's sci-fi epic crosses $1B - AP News",
    "fullText": "Hollywood kicked off 2026 with “Avatar: Fire and Ash” atop the box office for the third straight week and with hopes for a blockbuster-filled year after a disappointing 2025. In three weeks of release, “Fire and Ash” has cleared $1 billion worldwide. The thir…",
    "link": "https://apnews.com/article/avatar-marty-supreme-zootopia-sydney-sweeney-box-office-f0881c905b0c1c3c23ea79fd1966fe59"
  },
  {
    "text": "Rubio explains how U.S. might 'run' Venezuela after Maduros' ouster - CNBC",
    "fullText": "President Donald Trump on Saturday said the U.S. will \"run\" Venezuela until a new leader is determined.",
    "link": "https://www.cnbc.com/2026/01/04/rubio-explains-how-us-might-run-venezuela-after-maduros-ouster-.html"
  },
  {
    "text": "Belkin’s new HDMI adapter wirelessly connects to screens over 130 feet away - The Verge",
    "fullText": "Connect your laptop, tablet, or smartphone to TVs and projectors without a wire or Wi-Fi network.",
    "link": "https://www.theverge.com/tech/849948/belkin-connectair-wireless-hdmi-display-adapter-usb-c-plug-and-play"
  },
  {
    "text": "Gunmen raid village in northern Nigeria, killing at least 30 people and abducting others - CNN",
    "fullText": "At least 30 villagers have been killed while several others were abducted by gunmen who raided a village in northern Nigeria’s Niger state, police said Sunday, the latest in a cycle of deadly violence in the conflict-hit region.",
    "link": "https://www.cnn.com/2026/01/04/africa/gunmen-raid-village-northern-nigeria-intl"
  },
  {
    "text": "Plaud launches a new AI pin and a desktop meeting notetaker - TechCrunch",
    "fullText": "Plaud is going after the likes of Granola to launch a desktop app that records online meetings",
    "link": "https://techcrunch.com/2026/01/04/plaud-launches-a-new-ai-pin-and-a-desktop-meeting-notetaker/"
  },
  {
    "text": "How the Monroe Doctrine factors into US arrest of Venezuela’s Nicolás Maduro - AP News",
    "fullText": "It was America's fifth president who formulated a foreign policy approach that has shaped American strategy for two centuries. And President Donald Trump is citing it as partial justification for the military operation that led to the capture of Venezuelan le…",
    "link": "https://apnews.com/article/monroe-doctrine-venezuela-trump-western-hemisphere-maduro-e5581d71ea15f2fb02461e74ac6b08ca"
  },
  {
    "text": "Hundreds of iceberg earthquakes are shaking the crumbling end of Antarctica's Doomsday Glacier - Live Science",
    "fullText": "The seismic echoes of capsizing icebergs falling from Thwaites Glacier have been detected for the first time.",
    "link": "https://theconversation.com/hundreds-of-iceberg-earthquakes-detected-at-the-crumbling-end-of-antarcticas-doomsday-glacier-268893"
  },
  {
    "text": "Narwal’s Flow 2 robovac might help you find that earring you lost - The Verge",
    "fullText": "Narwal has announced the Flow 2, an upgraded version of its edge-mopping robovac that comes with a new cleaning mode to help you find lost items.",
    "link": "https://www.theverge.com/news/850787/narwal-flow-2-robovac-ai-object-recognition-ces-2026"
  },
  {
    "text": "Best Palm Springs Film Awards looks, from Kate Hudson to Miley Cyrus - USA Today",
    "fullText": "Hollywood stepped out on the first big red carpet of the new year at the Palm Springs International Film Awards in California on Jan. 3, 2025.",
    "link": "https://www.usatoday.com/picture-gallery/entertainment/movies/2026/01/04/palm-springs-film-awards-red-carpet-looks/88016523007/"
  },
  {
    "text": "Bosses are fighting a new battle in the RTO wars: It's not about where you work, but when you work - Fortune",
    "fullText": "Burnout has moved from a state of place to a state of mind.",
    "link": "https://fortune.com/2026/01/04/bosses-new-battle-remote-work-from-where-to-when-flexible-hybrid/"
  },
  {
    "text": "Jackery’s solar-powered Gazebo is a good DIY idea - The Verge",
    "fullText": "The Jackery Gazebo is fitted with 2,000W of solar panels, integrated lighting, a pull-down projection screen, and weather-resistant AC outlets.",
    "link": "https://www.theverge.com/tech/852600/jackerys-solar-powered-gazebo-is-a-good-diy-idea"
  },
  {
    "text": "Tyson Fury announces return to boxing a year after latest retirement - BBC",
    "fullText": "Former heavyweight world champion Tyson Fury announces he will return to boxing in 2026, bringing an end to his latest spell of retirement.",
    "link": "https://www.bbc.com/sport/boxing/articles/cgjw7q99dydo"
  },
  {
    "text": "If You Sleep In This 1 Position, Doctors Say You Need To Stop Immediately - HuffPost",
    "fullText": "It may feel safe and comfy, but experts warn it could lead to lasting nerve damage.",
    "link": "https://www.huffpost.com/entry/t-rex-sleep-position-arms-goog_l_69405dcbe4b0fa125e7f4dd9"
  },
  {
    "text": "The ‘Stranger Things’ Finale Explained - Rolling Stone",
    "fullText": "A 'Stranger Things' series finale recap and breakdown explaining how the story ended for the Hawkins kids including Eleven, Mike, Max, Henry, and more",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/stranger-things-finale-explained-recap-1235493513/"
  }
]