[
  {
    "text": "Dow surges more than 1,000 points to hit 50,000 for the first time in massive snapback from tech rout: Live updates - CNBC",
    "fullText": "Friday's rebound followed several days of heavy selling in the tech sector.",
    "link": "https://www.cnbc.com/2026/02/05/stock-market-today-live-updates.html"
  },
  {
    "text": "Sonny Jurgensen, one of Washington’s greatest football players, dies at 91 - The Washington Post",
    "fullText": "In a Hall of Fame career, the Redskins quarterback was known as one of the NFL’s best pure passers. He later spent years as a broadcaster.",
    "link": "https://www.washingtonpost.com/obituaries/2026/02/06/sonny-jurgensen-dead-redskins-commanders/"
  },
  {
    "text": "Racist video of Obamas removed from Trump's social account - Axios",
    "fullText": "The post was up on Trump's Truth Social account for about 12 hours.",
    "link": "https://www.axios.com/2026/02/06/trump-racist-video-barack-michelle-obama-truth-social"
  },
  {
    "text": "Heavy police presence near pond where Lil Jon’s son, DJ Young Slade, disappeared in Milton - WSB-TV",
    "fullText": "Milton Police said Friday that a body recovered from a pond by divers is believed to be Nathan Smith, the son of rapper-producer Lil Jon.",
    "link": "https://www.wsbtv.com/news/local/north-fulton-county/body-recovered-pond-believed-be-lil-jons-son-dj-young-slade/DLELTCWEXBBAZBWYIBDL2C3JTY/"
  },
  {
    "text": "Maps show accumulating snow, possibly record-breaking cold in the Boston weather forecast this weekend - cbsnews.com",
    "fullText": "We've got yet another very cold and snowy weekend on tap in Boston. Here's what the weather forecast maps show.",
    "link": "https://www.cbsnews.com/boston/news/boston-snow-saturday-cold/"
  },
  {
    "text": "Shares of Jennifer Garner's Once Upon a Farm pop 20% in public market debut - CNBC",
    "fullText": "The company's IPO comes as shoppers and policymakers alike have pushed back on ultra-processed foods.",
    "link": "https://www.cnbc.com/2026/02/06/once-upon-a-farm-ipo-ofrm-starts-trading-on-the-new-york-stock-exchange.html"
  },
  {
    "text": "Jim Schwartz resigns, with the “expectation” he won’t coach in 2026 - NBC Sports",
    "fullText": "As expected, Browns defensive coordinator Jim Schwartz is moving on.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jim-schwartz-resigns-with-the-expectation-he-wont-coach-in-2026"
  },
  {
    "text": "Sanctions to Combat Illicit Traders of Iranian Oil and the Shadow Fleet - U.S. Department of State (.gov)",
    "fullText": "Today, the Department of State is sanctioning multiple entities, individuals, and vessels to stem the flow of revenue that the regime in Tehran uses to support terrorism abroad and repress its citizens.     As part of this action, the Department of State is i…",
    "link": "https://www.state.gov/releases/office-of-the-spokesperson/2026/02/sanctions-to-combat-illicit-traders-of-iranian-oil-and-the-shadow-fleet"
  },
  {
    "text": "A new study on statins reveals surprise about popular drugs - Yahoo Life UK",
    "fullText": "Only four of 66 undesirable outcomes attributed to statins were significant, according to a new study in the Lancet.",
    "link": "https://www.usatoday.com/story/life/health-wellness/2026/02/06/statins-side-effects-study/88544793007/"
  },
  {
    "text": "Rotten Tomatoes Owner Says ‘Melania’ 99% Audience Score Is Not ‘Bot Manipulation’: ‘Reviews Are Verified… Users Bought a Ticket to the Film’ - Yahoo News Canada",
    "fullText": "'Melania' has a 99% audience score despite horrendous reviews from critics. Rotten Tomatoes says bots are not to blame.",
    "link": "https://variety.com/2026/film/news/melania-rotten-tomatoes-audience-score-bots-1236654401/"
  },
  {
    "text": "Video: Jon Jones gets torched by Dwight Howard at celebrity flag football game - MMA Fighting",
    "fullText": "Jon Jones and Demetrious Johnson appeared in a couple of viral moments on Super Bowl week.",
    "link": "https://www.mmafighting.com/ufc/470444/video-jon-jones-gets-torched-by-dwight-howard-at-celebrity-flag-football-game"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News - Forbes",
    "fullText": "A new Samsung Galaxy S26 Ultra delivery more disappointing battery news for the upcoming flagship.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/02/06/samsung-galaxy-s26-ultra-leak-battery-qi2/"
  },
  {
    "text": "The Best NFL Bets for Super Bowl LX - The Ringer",
    "fullText": "It’s one of the most unlikely Super Bowls ever, according to preseason betting odds. Here’s how to make sense of Seattle Seahawks–New England Patriots.",
    "link": "https://www.theringer.com/2026/02/06/nfl/best-super-bowl-lx-bets-odds-predictions-lines-new-england-patriots-seattle-seahawks"
  },
  {
    "text": "TikTok's 'Addictive Design' Found to Be Illegal in Europe - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46911869"
  },
  {
    "text": "Cellular-level preservation of cutaneous spikes in an Early Cretaceous iguanodontian dinosaur - Nature",
    "fullText": "A juvenile iguanodontian from the Lower Cretaceous of China preserves both spikes and scales in its skin that are different from integumentary structures in either non-avian dinosaurs or extant squamates and may have had a defensive function.",
    "link": "https://www.nature.com/articles/s41559-025-02960-9"
  },
  {
    "text": "Missing records from Bondi and Patel draw scrutiny in Epstein release - Axios",
    "fullText": "The complaint calls it \"deeply troubling\" that no communications from Bondi or Patel appear in the ream of documents.",
    "link": "https://www.axios.com/2026/02/06/epstein-bondi-patel-records-withheld"
  },
  {
    "text": "'The hostility has been relentless': How Wuthering Heights became this year's most divisive film - BBC",
    "fullText": "Ever since it was announced, Emerald Fennell's version of the torrid Brontë classic has been the subject of furious online discourse over everything from its casting to its costumes.",
    "link": "https://www.bbc.com/culture/article/20260205-how-wuthering-heights-became-this-years-most-divisive-film"
  },
  {
    "text": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangs - NPR",
    "fullText": "In the documents, Homeland Security said the raid \"was based on intelligence that there were illegal aliens unlawfully occupying apartments.\" There is no mention of criminal gangs or Tren de Aragua.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5703603/court-records-chicago-immigration-raid-was-about-squatters-not-venezuelan-gangs"
  }
]