[
  {
    "text": "AMC Theatres Will Refuse to Screen AI Short Film After Online Uproar - The Hollywood Reporter",
    "fullText": null,
    "link": "http://www.hollywoodreporter.com/movies/movie-news/ai-short-movie-amc-theaters-1236509143/"
  },
  {
    "text": "Vietnam War veterans sue to block construction of Trump’s triumphal arch - Politico",
    "fullText": "The veterans argued the project would encroach on the nearby Arlington National Cemetery.",
    "link": "https://www.politico.com/news/2026/02/19/trump-arlington-arch-lawsuit-00789763"
  },
  {
    "text": "Inside Warner Bros. Discovery, Mood Among Many Staffers Shifts in Favor of Netflix Sale vs. Paramount Takeover - Variety",
    "fullText": "Most Warner Bros. Discovery staffers are now supportive of Netflix's deal to acquire Warner Bros.'s studios and HBO Max rather than having WBD subsumed in its entirety by David Ellison's Paramount Skydance.",
    "link": "https://variety.com/2026/tv/news/inside-warner-bros-discovery-in-favor-of-netflix-vs-paramount-1236667570/"
  },
  {
    "text": "Bank of America commits $25bn to private credit lending - Financial Times",
    "fullText": "Move follows similar initiatives by other Wall Street institutions but comes as concerns mount about sector’s health",
    "link": "https://www.ft.com/content/faedf9f9-6e73-457c-b073-bcd46ed780c7"
  },
  {
    "text": "Governors group skips White House meeting after Trump refused to invite two Democrats - PBS",
    "fullText": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors, undercutting one of Washington's few remaining bipartisan gatherings.",
    "link": "https://www.pbs.org/newshour/politics/governors-group-skips-white-house-meeting-after-trump-refused-to-invite-two-democrats"
  },
  {
    "text": "Virginia judge blocks vote on Democrats’ redistricting referendum - Democracy Docket",
    "fullText": "A Democratic redraw could give the party as many as four new congressional seats.",
    "link": "https://www.democracydocket.com/news-alerts/virginia-judge-block-democrats-redistricting-amendment-vote/"
  },
  {
    "text": "Host control of persistent Epstein–Barr virus infection - Nature",
    "fullText": "Nature - Host control of persistent Epstein–Barr virus infection",
    "link": "https://www.nature.com/articles/s41586-026-10274-4"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "Emerald Fennell Now Going Moor-To-Moor Trying To Shock People - Defector",
    "fullText": "“My sister Emily loved the moors,” wrote Charlotte Brontë, in the introduction to a selection of Emily’s poems published in 1850. Emily had died in 1848, and had not lived to see the publication of the second edition of Wuthering Heights, carefully revised by…",
    "link": "https://defector.com/emerald-fennell-now-going-moor-to-moor-trying-to-shock-people"
  },
  {
    "text": "VA halts implementation of controversial disability rating rule following backlash - Military Times",
    "fullText": "The VA will continue collecting public comment on the rule but it “will not be enforced at any time in the future,\" VA Secretary Doug Collins said.",
    "link": "https://www.militarytimes.com/veterans/2026/02/19/va-halts-implementation-of-controversial-disability-rating-rule-following-backlash/"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  },
  {
    "text": "Exclusive: DHS admits its website showcasing the ‘worst of the worst’ immigrants was rife with errors - CNN",
    "fullText": "DHS admitted that its website featuring “worst of the worst” arrested immigrants was rife with errors and changed the site this week after receiving questions from CNN about it.",
    "link": "https://www.cnn.com/2026/02/19/politics/homeland-security-worst-immigrants-website"
  },
  {
    "text": "Could insight from cats lead to breast cancer cures? - CTV News",
    "fullText": "Owning a cat offers many health benefits, including reduced stress and emotional support, and new research suggests our feline friends might also offer clues to better treat certain cancers.",
    "link": "https://www.ctvnews.ca/health/article/could-insight-from-cats-lead-to-breast-cancer-cures/"
  },
  {
    "text": "Dinosaur hunters discover staggering 'hell heron' with giant head crest in Sahara Desert - BBC Wildlife Magazine",
    "fullText": "The new species of ‘scimitar-crested’ Spinosaurus is the first of its kind found in more than a century.",
    "link": "https://www.discoverwildlife.com/dinosaurs/spinosaurus-mirabilis"
  },
  {
    "text": "Amazon surpasses Walmart in annual revenue for first time, as both chase AI-fueled growth - CNBC",
    "fullText": "The shuffle underscores the rivalry between the two retailers, particularly as Walmart expands its advertising and third-party marketplace businesses.",
    "link": "https://www.cnbc.com/2026/02/19/amazon-revenue-passes-walmart-earnings-reports.html"
  },
  {
    "text": "Could Seahawks’ new owner move team? What we know about sale | Analysis - The Seattle Times",
    "fullText": "News that the Seahawks are on the market inevitably raises questions such as whether the team could leave Seattle. Here's our attempt at some answers.",
    "link": "https://www.seattletimes.com/sports/seahawks/could-seahawks-new-owner-move-team-what-we-know-about-sale-analysis/"
  },
  {
    "text": "As browser wars heat up, Chrome adds new productivity features - TechCrunch",
    "fullText": "Split View, PDF annotations, and 'Save to Chrome' features come to the Chrome browser.",
    "link": "https://techcrunch.com/2026/02/19/as-browser-wars-heat-up-chrome-adds-new-productivity-features/"
  },
  {
    "text": "Study Confirms: Reentering SpaceX Rockets Are Peppering the Upper Atmosphere With Metal Pollution - Gizmodo",
    "fullText": "For the first time, scientists were able to directly detect upper-atmospheric pollution from space debris.",
    "link": "https://gizmodo.com/study-confirms-reentering-spacex-rockets-are-peppering-the-upper-atmosphere-with-metal-pollution-2000723932"
  },
  {
    "text": "Judge throws out ruling backing Trump mass detention policy - The Hill",
    "fullText": "A federal judge on Wednesday vacated an immigration court ruling giving the Trump administration broad powers to detain migrants, forcing them to give bond hearings and then possibly release thousands in custody. The ruling from U.S. District Court Judge Suns…",
    "link": "https://thehill.com/regulation/court-battles/5745227-migrants-entitled-bond-hearings/"
  }
]