[
  {
    "text": "‘The Muppet Show’ refuses to modernize in its triumphant revival - washingtonpost.com",
    "fullText": "On the 50th anniversary of Jim Henson’s show, the Muppets — with a boost from guest star Sabrina Carpenter — pick up exactly where they left off.",
    "link": "https://www.washingtonpost.com/entertainment/tv/2026/02/04/muppet-show-50th-anniversary-special/"
  },
  {
    "text": "Trump admin to withdraw 700 federal officers from Minnesota: Homan - CNBC",
    "fullText": "The Trump administration will draw down 700 law enforcement officers from Minnesota on Wednesday, border czar Tom Homan said.",
    "link": "https://www.cnbc.com/2026/02/04/trump-homan-minnesota-ice-immigration.html"
  },
  {
    "text": "Giannis Trade Rumors: Wolves, Warriors, Heat, Lakers, Blazers - Hoops Rumors",
    "fullText": "The latest trade rumors on Giannis Antetokounmpo, who spoke on Tuesday about the speculation swirling around him.",
    "link": "https://www.hoopsrumors.com/2026/02/giannis-trade-rumors-wolves-warriors-heat-lakers-blazers.html"
  },
  {
    "text": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "fullText": "Lawyers for the unnamed woman claim she was 'treated like a prostitute' at Jeffrey Epstein's home.",
    "link": "https://www.bbc.com/news/articles/ckgkjj5e28ko"
  },
  {
    "text": "Saif al-Islam Gaddafi, son of ex-Libyan leader, killed: Probe launched by prosecutors - BBC",
    "fullText": "The 53-year-old, once widely seen as the second most powerful person in Libya, was killed by \"our unknown gunmen\".",
    "link": "https://www.bbc.com/news/articles/cp37g4xgkxdo"
  },
  {
    "text": "Yum Brands posts mixed quarter, Taco Bell shines - CNBC",
    "fullText": "Taco Bell's same-store sales spiked 7% in the quarter.",
    "link": "https://www.cnbc.com/2026/02/04/yum-brands-yum-q4-2025-earnings.html"
  },
  {
    "text": "So yeah, I vibe-coded a log colorizer—and I feel good about it - Ars Technica",
    "fullText": "Some semi-unhinged musings on where LLMs fit into my life—and how I'll keep using them.",
    "link": "https://arstechnica.com/features/2026/02/so-yeah-i-vibe-coded-a-log-colorizer-and-i-feel-good-about-it/"
  },
  {
    "text": "Reports: Clippers trade James Harden to Cavaliers for Darius Garland - NBA",
    "fullText": "Los Angeles is reportedly sending the 11-time All-Star guard to Cleveland for Garland and a 2nd-round draft pick.",
    "link": "https://www.nba.com/news/james-harden-darius-garland-trade"
  },
  {
    "text": "Eli Lilly blows past quarterly estimates, posts strong outlook as Zepbound and Mounjaro sales soar - CNBC",
    "fullText": "Eli Lilly's full-year guidance comes in stark contrast to the outlook of Novo Nordisk, which warned it sees sales and profit declining as much as 13% this year.",
    "link": "https://www.cnbc.com/2026/02/04/eli-lilly-lly-earnings-q4-2025.html"
  },
  {
    "text": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/trilateral-us-ukraine-russia-peace-talks-resume-uae/story?id\\\\u003d129840124"
  },
  {
    "text": "Israel strikes Gaza, killing 19 including women and children, after saying Hamas violated deal - AP News",
    "fullText": "Israeli strikes have hit Gaza, killing at least 21 Palestinians, including two infants, according to hospital officials. Israel says it was responding to a militant attack that wounded a soldier. The strikes have continued despite a ceasefire deal that began …",
    "link": "https://apnews.com/article/gaza-rafah-hamas-israel-war-2-4-2026-a3726ab659321430bf3ca73cae50936e"
  },
  {
    "text": "Did Ron DeSantis just become the Rays MVP on the stadium project? - Tampa Bay Times",
    "fullText": "The governor’s support for an idea that could involve more than $1 billion in public funds might have paved the way for local pols.",
    "link": "https://www.tampabay.com/viewpoints/2026/02/03/did-ron-desantis-just-become-rays-mvp-stadium-project/"
  },
  {
    "text": "'Textbooks will need to be updated': Jupiter is smaller and flatter than we thought, Juno spacecraft reveals - Live Science",
    "fullText": "Jupiter is smaller and flatter than scientists previously thought, new measurements of the gas giant reveal.",
    "link": "https://www.livescience.com/space/planets/textbooks-will-need-to-be-updated-jupiter-is-smaller-and-flatter-than-we-thought-juno-spacecraft-reveals"
  },
  {
    "text": "Ryan Routh to be sentenced Wednesday for attempted assassination of Trump in 2024 at Florida golf course - CNN",
    "fullText": "After plotting, stalking and lying in wait for the right moment to shoot and kill then-former President Donald Trump, the man who set up a sniper’s nest on the edge of Trump’s West Palm Beach golf course in Florida and was thwarted by a Secret Service agent, …",
    "link": "https://www.cnn.com/2026/02/04/politics/ryan-routh-trump-assassination-attempt-sentencing"
  },
  {
    "text": "Horoscope for Wednesday, February 04, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/04/horoscopes-today-wednesday-february-04-2026"
  },
  {
    "text": "Judge restricts federal use of tear gas, munitions at Portland ICE protests - OregonLive.com",
    "fullText": "The temporary order lasts 14 days. A hearing is set for March 2 to extend the order.",
    "link": "https://www.oregonlive.com/crime/2026/02/judge-restricts-federal-officers-use-of-force-at-portland-ice-protests.html"
  },
  {
    "text": "'Wuthering Heights' First Reactions Praise Margot Robbie, Jacob Elordi - Variety",
    "fullText": "First reactions are calling 'Wuthering Heights' a 'bodice-ripping crowd-pleaser' that is 'destined to be a massive hit.'",
    "link": "https://variety.com/2026/film/news/wuthering-heights-reactions-margot-robbie-jacob-elrodi-1236644150/"
  }
]