[
  {
    "text": "Olympics opening ceremony live updates as 2026 Winter Games kick off in Milano Cortina - cbsnews.com",
    "fullText": "The 2026 Winter Olympics opening ceremony officially kicks off the Milano-Cortina Games with performances, the Parade of Nations and the lighting of the Olympic cauldron.",
    "link": "https://www.cbsnews.com/live-updates/olympics-opening-ceremony-winter-2026/"
  },
  {
    "text": "Big Tech to Spend $650 Billion This Year as AI Race Intensifies - Bloomberg.com",
    "fullText": "Four of the biggest US technology companies together have forecast capital expenditures that will reach about $650 billion in 2026 — a mind-boggling tide of cash earmarked for new data centers and all the gear housed within them.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-06/how-much-is-big-tech-spending-on-ai-computing-a-staggering-650-billion-in-2026"
  },
  {
    "text": "Opinion | A federal judge schools chaotic Kristi Noem - The Washington Post",
    "fullText": "Blocking a government attempt to end temporary protected status for about 353,000 Haitians in the U.S.",
    "link": "https://www.washingtonpost.com/opinions/2026/02/06/reyes-noem-haitians-trump/"
  },
  {
    "text": "International Runway Model Cristina Pérez Galcenco Dead at 21 - TMZ",
    "fullText": "Cristina Pérez Galcenco -- a global runway model -- has died at 21, according to media reports.",
    "link": "https://www.tmz.com/2026/02/06/runway-model-cristina-perez-galcenco-dead/"
  },
  {
    "text": "Cynthia Frelund 2026 NFL mock draft 1.0: 49ers, Bills among five teams to pick WRs - NFL.com",
    "fullText": "In her first mock of the 2026 NFL Draft, Cynthia Frelund uses her analytical model to project Picks 1-32. Who scoops up Notre Dame RB Jeremiyah Love in the 20s? Which five teams target WRs in Round 1?",
    "link": "https://www.nfl.com/news/cynthia-frelund-2026-nfl-mock-draft-1-0"
  },
  {
    "text": "It Turns Out Waymos Are Being Controlled by Workers in the Philippines - Futurism",
    "fullText": "During a Congressional hearing, Waymo's chief safety officer, Mauricio Peña, was grilled over the company's reliance on overseas workers.",
    "link": "http://futurism.com/advanced-transport/waymos-controlled-workers-philippines"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News - Forbes",
    "fullText": "A new Samsung Galaxy S26 Ultra delivery more disappointing battery news for the upcoming flagship.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/02/06/samsung-galaxy-s26-ultra-leak-battery-qi2/"
  },
  {
    "text": "TOMB RAIDER Set Photos May Reveal Sophie Turner's Actual Lara Croft Costume - ComicBookMovie.com",
    "fullText": "TOMB RAIDER Set Photos May Reveal Sophie Turner's Actual Lara Croft Costume",
    "link": "https://comicbookmovie.com/video-games/tomb-raider/tomb-raider-set-photos-may-reveal-sophie-turners-actual-lara-croft-costume-a226275"
  },
  {
    "text": "Frank Gore says he’s glad Roger Craig got into the Hall of Fame ahead of him - NBC Sports",
    "fullText": "Two former 49ers running backs were finalists for the Pro Football Hall of Fame Class of 2026.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/frank-gore-says-hes-glad-roger-craig-got-into-the-hall-of-fame-ahead-of-him"
  },
  {
    "text": "'The hostility has been relentless': How Wuthering Heights became this year's most divisive film - BBC",
    "fullText": "Ever since it was announced, Emerald Fennell's version of the torrid Brontë classic has been the subject of furious online discourse over everything from its casting to its costumes.",
    "link": "https://www.bbc.com/culture/article/20260205-how-wuthering-heights-became-this-years-most-divisive-film"
  },
  {
    "text": "Court records: Chicago immigration raid was about squatters, not Venezuelan gangs - NPR",
    "fullText": "In the documents, Homeland Security said the raid \"was based on intelligence that there were illegal aliens unlawfully occupying apartments.\" There is no mention of criminal gangs or Tren de Aragua.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5703603/court-records-chicago-immigration-raid-was-about-squatters-not-venezuelan-gangs"
  },
  {
    "text": "The U.S. leads on day one of the figure skating team event. Here's how it works - NPR",
    "fullText": "The three-day event is a chance for the top 10 skating countries to bring home a medal — and for viewers to get acquainted with the sport's different disciplines and biggest names.",
    "link": "https://www.npr.org/2026/02/06/nx-s1-5702747/olympic-figure-skating-team-event"
  },
  {
    "text": "Ronald Hicks to be installed as 11th archbishop of New York - NPR",
    "fullText": "Ronald Hicks, a former Illinois bishop chosen by Pope Leo XIV to replace the retiring Cardinal Timothy Dolan, is set to be installed as New York's 11th archbishop",
    "link": "https://www.npr.org/2026/02/06/g-s1-108954/ronald-hicks-to-be-installed-as-11th-archbishop-of-new-york"
  },
  {
    "text": "Horoscope for Friday, February 06, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/06/horoscopes-today-friday-february-06-2026"
  },
  {
    "text": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "fullText": "New START is the last major guardrail constraining the nuclear arsenals of the two countries that together hold some 85% of the world's warheads.",
    "link": "https://www.axios.com/2026/02/05/new-start-arms-control-us-russia-extend"
  },
  {
    "text": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-shifts-explanation-dni-gabbard-fbi-georgia-election/story?id\\\\u003d129890577"
  },
  {
    "text": "Kauai chickenpox outbreak doubles, expands to more schools - Honolulu Star-Advertiser",
    "fullText": "The Hawaii Department of Health reports the community outbreak of chickenpox on Kauai has expanded, raising concerns the highly contagious disease will continue to spread.",
    "link": "https://www.staradvertiser.com/2026/02/05/breaking-news/kauai-chickenpox-outbreak-doubles-expands-to-more-schools/"
  },
  {
    "text": "Amazon shares tumble as it joins the Big Tech AI spending spree - BBC",
    "fullText": "Technology stocks have fallen this week as investors appeared wary of the sector's big investment plans.",
    "link": "https://www.bbc.com/news/articles/c150e144we3o"
  },
  {
    "text": "Statins don’t cause most of the side effects on package warnings, study finds - statnews.com",
    "fullText": "Many people who should be taking statins avoid them for fear of side effects. A large new study says most of those side effects don't actually show up.",
    "link": "https://www.statnews.com/2026/02/05/statin-side-effects-evidence-lacking-lancet-study-says/"
  }
]