[
  {
    "text": "Thailand releases 18 Cambodian soldiers as ceasefire holds - Al Jazeera",
    "fullText": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
    "link": "https://www.aljazeera.com/news/2025/12/31/thailand-releases-18-cambodian-soldiers-as-ceasefire-holds"
  },
  {
    "text": "Tensions between Saudi Arabia and UAE spike with bombing of port - The Washington Post",
    "fullText": "The Saudi strike in Yemen on an alleged weapons shipment from the UAE marked an unprecedented escalation of friction between the rival Persian Gulf powers.",
    "link": "https://www.washingtonpost.com/world/2025/12/30/saudi-arabia-yemen-strikes-uae-mukalla/"
  },
  {
    "text": "Former US Sen. Ben Nighthorse Campbell, of Colorado, dies at 92 - Politico",
    "fullText": "The motorcycle-riding lawmaker and cattle rancher was considered a maverick even before he abruptly switched to the Republican Party in March 1995.",
    "link": "https://www.politico.com/news/2025/12/30/former-us-sen-ben-nighthorse-campbell-of-colorado-dies-at-92-00708406"
  },
  {
    "text": "Kennedy Center exodus: The 11 acts, creators pulling out amid Trump takeover - Axios",
    "fullText": "A jazz ensemble and a New York dance company this week joined those canceling their events at the Kennedy Center.",
    "link": "https://www.axios.com/2025/12/30/new-years-2026-trump-kennedy-center"
  },
  {
    "text": "Trump vetoes bipartisan bill to provide clean water to rural Southeastern Colorado - Colorado Public Radio",
    "fullText": "The legislation to complete the Arkansas Valley Conduit passed Congress with unanimous support but was branded an ‘expensive and unreliable’ project by the President.",
    "link": "https://www.cpr.org/2025/12/30/trump-vetoes-arkansas-river-valley-conduit-funding-bill/"
  },
  {
    "text": "Trump administration says it's freezing child care funds to Minnesota after series of fraud schemes - AP News",
    "fullText": "The Trump administration has announced that it is freezing child care funds to Minnesota after a series of fraud schemes in recent years. Deputy Secretary of Health and Human Services Jim O’Neill said on the social platform X on Tuesday that the move is in re…",
    "link": "https://apnews.com/article/minnesota-child-care-funds-fraud-b511941de10f02fbb7349eff6738f748"
  },
  {
    "text": "Gold and silver see rollercoaster end to blockbuster year - BBC",
    "fullText": "The price of gold soared by more than 60% this year to hit a record high of more than $4,549.",
    "link": "https://www.bbc.com/news/articles/cp393nz95y5o"
  },
  {
    "text": "Illinois 30-28 Tennessee (Dec 30, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778326"
  },
  {
    "text": "Lucas: FSU Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the ACC opener.",
    "link": "https://goheels.com/news/2025/12/30/mens-basketball-lucas-fsu-rapid-reactions"
  },
  {
    "text": "Guinea elections: Gen Mamady Doumbouya wins controversial election - BBC",
    "fullText": "The victory, which gives the junta leader a seven-year mandate, was widely expected.",
    "link": "https://www.bbc.com/news/articles/cx2520nyp8yo"
  },
  {
    "text": "Body located amid search for missing Texas teen: Sheriff - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/body-located-amid-search-missing-texas-teen-sheriff/story?id\\\\u003d128793412"
  },
  {
    "text": "Train crash near Peru’s Machu Picchu kills driver, injures dozens - Al Jazeera",
    "fullText": "Train conductor killed in collision on rail line serving the famed archaeological site, authorities say.",
    "link": "https://www.aljazeera.com/news/2025/12/31/train-crash-near-perus-machu-picchu-kills-driver-injures-dozens"
  },
  {
    "text": "Asia-Pacific markets open lower in year-end trade - CNBC",
    "fullText": "Asia-Pacific markets were poised for modest gains on the holiday-shortened and final trading day of the year.",
    "link": "https://www.cnbc.com/2025/12/31/asia-pacific-markets-hang-seng-index-nifty-50-csi-300.html"
  },
  {
    "text": "U.S. measles cases reach highest level in over 30 years, CDC reports - Axios",
    "fullText": "The U.S. will likely lose its globally recognized measles \"elimination status\" by Jan. 2026.",
    "link": "https://www.axios.com/2025/12/30/us-texas-measles-cases-cdc-vaccine-rfk-jr"
  },
  {
    "text": "Thieves drill into German bank vault and make off with millions - CNN",
    "fullText": "Thieves used the quiet Christmas period to drill their way into the vault of a German retail bank and make off with at least 10 million euros’ worth of money and valuables from customers’ deposit boxes, police said on Tuesday.",
    "link": "https://www.cnn.com/2025/12/30/europe/thieves-drill-into-german-bank-vault-and-make-off-with-millions-latam-intl"
  },
  {
    "text": "Flu cases are surging and rates will likely get worse, new CDC data shows - NPR",
    "fullText": "Flu season is off to a rough start this year, according to new CDC data. The virus is spreading faster than in previous years and the surge is likely to get worse. Here's what you need to know.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/30/nx-s1-5661508/flu-cdc-health"
  },
  {
    "text": "iPhone 17 Pro issue causing speaker hiss for some users when charging - 9to5Mac",
    "fullText": "Some iPhone 17 Pro and Pro Max have reported encountering a strange speaker hiss when charging their device.",
    "link": "https://9to5mac.com/2025/12/30/iphone-17-pro-issue-causing-speaker-hiss-for-some-users-when-charging/"
  },
  {
    "text": "Superbug hits 27 states: Here’s where the deadly fungus is spreading - Yahoo News Canada",
    "fullText": "Hospitals, nursing homes and other medical facilities are struggling to gain ground on a drug-resistant and deadly fungus that has infected at least 7,000 people in 2025, according to tracking by the Centers for Disease Control and Prevention.",
    "link": "https://thehill.com/homenews/5666816-superbug-hits-27-states-heres-where-the-deadly-fungus-is-spreading/"
  }
]