[
  {
    "text": "Seahawks Sale Process Started by Paul G. Allen's Estate After Winning NFL Super Bowl 60 - Bleacher Report",
    "fullText": "Less than two weeks after their victory in Super Bowl 60, the sale process for the Seattle Seahawks has started.",
    "link": "https://bleacherreport.com/articles/25398181-seahawks-sale-process-started-paul-g-allens-estate-after-winning-nfl-super-bowl-60"
  },
  {
    "text": "Musk Rails Against ‘Woke And Sanctimonious’ AI Rivals—Insists ‘Grok Must Win’ - Forbes",
    "fullText": "Elon Musk argued his company xAI's chatbot Grok is a counter to rivals ChatGPT, Gemini and Claude, whom he labeled as “woke” and “weak sauce” on culture war issues.",
    "link": "https://www.forbes.com/sites/siladityaray/2026/02/18/musk-rails-against-woke-and-sanctimonious-ai-rivals-insists-grok-musk-win/"
  },
  {
    "text": "Trump administration releases remaining Gateway funds — and then some - Politico",
    "fullText": "The stalled rail tunnel project between New York and New Jersey will resume construction next week.",
    "link": "https://www.politico.com/news/2026/02/18/trump-releases-gateway-tunnel-funds-00786335"
  },
  {
    "text": "Air Force One set for makeover paint job with new colours - BBC",
    "fullText": "The presidential jet, along with other aircraft used for high-level officials, is being painted with some of Trump's preferred palette.",
    "link": "https://www.bbc.com/news/articles/cpd8zx4qdz6o"
  },
  {
    "text": "'View' stars shut down guest cohost Savannah Chrisley's false claim about AOC - Entertainment Weekly",
    "fullText": "'The View' cohosts shook their heads and shut down guest cohost Savannah Chrisley's false on-air claim about Alexandria Ocasio-Cortez on the air: 'No, no, no!'",
    "link": "https://ew.com/the-view-cohosts-shut-down-savannah-chrisley-false-claim-aoc-11908671"
  },
  {
    "text": "DOT wants to block transit money to states that aid migrants - Politico",
    "fullText": "The administration hopes to insert the draft language in the upcoming highway bill reauthorization.",
    "link": "https://www.politico.com/news/2026/02/18/dot-wants-to-block-transit-money-to-states-that-aid-migrants-00775657"
  },
  {
    "text": "Trump would like the government he leads to pay him billions - NPR",
    "fullText": "President Trump is asking the federal government for billions of dollars in damages, putting his own Justice Department on the spot and creating an unprecedented ethical morass.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5702503/trump-government-lawsuits-pay-himself-billions"
  },
  {
    "text": "In a golden masterclass, Norway’s Klaebo extends Winter Olympics medal record - Associated Press News",
    "fullText": "Norway’s Johannes Hoesflot Klaebo has won a 10th gold medal in cross country skiing at the Milan Cortina Olympics, setting another Winter Games record. The 29‑year‑old, racing with Einar Hedegart, won the men’s team sprint, for his fifth gold at the 2026 Game…",
    "link": "https://apnews.com/article/johannes-hoesflot-klaebo-cross-country-record-norway-f5a2e5150122de904f0de0e03fa45edf"
  },
  {
    "text": "Russia's hybrid warfare rattles Poland and NATO - NPR",
    "fullText": "Russia is stepping up covert attacks across Europe — rail sabotage, drones, cyberstrikes — testing NATO. Polish officials warn \"disposable agents\" are sowing fear and weakening support for Ukraine.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5702706/russia-hybrid-warfare-poland"
  },
  {
    "text": "Microsoft to keep buying enough renewable energy to match all its electricity needs - Yahoo Finance",
    "fullText": "Microsoft has promised to keep buying enough renewable energy to match all its electricity needs after meeting that ‌goal for the first time last year, as...",
    "link": "https://finance.yahoo.com/news/microsoft-keep-buying-enough-renewable-160258881.html"
  },
  {
    "text": "Vinicius Junior: Benfica claim 'defamation campaign' against Gianluca Prestianni after racism allegation - BBC",
    "fullText": "Benfica claim there is a \"defamation campaign\" against Gianluca Prestianni as Uefa launch an investigation into claims he racially abused Real Madrid's Vinicius Jr.",
    "link": "https://www.bbc.com/sport/football/articles/cx24vnm4dp5o"
  },
  {
    "text": "Google’s Pixel 10a arrives on March 5 for $499 with specs and design of yesteryear - Ars Technica",
    "fullText": "Google's new budget phone is here, but don't expect a big upgrade.",
    "link": "https://arstechnica.com/gadgets/2026/02/googles-pixel-10a-arrives-on-march-5-for-499-with-specs-and-design-of-yesteryear/"
  },
  {
    "text": "Conor McGregor reveals he’s been offered an opponent and date for his comeback: ‘Waiting on my contract’ - MMA Fighting",
    "fullText": "Conor McGregor moves a big step closer to returning to the UFC in the near future.",
    "link": "https://www.mmafighting.com/ufc/472137/conor-mcgregor-reveals-hes-been-offered-an-opponent-and-date-for-his-comeback-waiting-on-my-contract"
  },
  {
    "text": "'Difficult' Russia-Ukraine peace talks end without breakthrough - BBC",
    "fullText": "The second day of negotiations between Ukraine and Russia ended after just two hours.",
    "link": "https://www.bbc.com/news/articles/c0k1xj0d708o"
  },
  {
    "text": "Democratic-led cities move to block ICE, setting up clash with Trump - The Washington Post",
    "fullText": "In New York, Philadelphia and elsewhere, elected Democrats are taking steps to try to limit immigration crackdowns like the one winding down in Minneapolis.",
    "link": "https://www.washingtonpost.com/nation/2026/02/18/philadelphia-new-york-blue-cities-fight-ice/"
  },
  {
    "text": "The Nine Lives of Jason Bateman - The Hollywood Reporter",
    "fullText": "He was nearly driven out of the industry. Then he reinvented himself, from teen idol to leading man to podcast mogul. Now the star of HBO’s upcoming ‘DTF St. Louis’ opens up about his family, his $100 million ’SmartLess’ deal, his viral encounter with Charli …",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/jason-bateman-interview-career-podcast-1236507770/"
  },
  {
    "text": "Low-Cost MacBook Expected on March 4 in These Colors - MacRumors",
    "fullText": "Apple will announce its rumored low-cost MacBook at its event on March 4, with the device coming in a selection of bold color options, according to a...",
    "link": "https://www.macrumors.com/2026/02/18/low-cost-macbook-expected-on-march-4/"
  },
  {
    "text": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors - Associated Press News",
    "fullText": "Gisèle Pelicot has released a memoir that recounts her drugging and mass rape case and sends a powerful message of hope and support to victims of sexual abuse. On Tuesday, her book comes out worldwide in 22 languages. Pelicot says writing it helped her reflec…",
    "link": "https://apnews.com/article/gisele-pelicot-book-france-dominique-rape-4cd6f5bacc7fa9d483d610a3b38551a5"
  },
  {
    "text": "Strip out Windows 11’s bloatware, ads, and other nastiness—for free - PCWorld",
    "fullText": "A new Windows PC can be full of bloat. But this handy app can help you streamline it in minutes!",
    "link": "https://www.pcworld.com/article/3056694/strip-out-windows-11s-bloatware-ads-and-other-nastiness-for-free.html"
  }
]