[
  {
    "text": "Where a nor’easter will bring heavy snow, strong winds and waves this weekend - The Washington Post",
    "fullText": "A potent system will bring the potential for blizzard-like conditions and coastal flooding from parts of the Southeast to New England.",
    "link": "https://www.washingtonpost.com/weather/2026/01/28/another-storm-east-coast-noreaster-forecast/"
  },
  {
    "text": "Tom Morello announces surprise benefit concert at First Avenue - bringmethenews.com",
    "fullText": "Tom Morello, guitarist of Rage Against the Machine, has announced a last-minute benefit concert at First Avenue in Minneapolis.",
    "link": "https://bringmethenews.com/minnesota-lifestyle/tom-morello-announces-surprise-benefit-concert-at-first-avenue"
  },
  {
    "text": "S&P 500 touches 7,000 for first time then retreats as traders await Fed decision: Live updates - CNBC",
    "fullText": "The S&P 500 rose to a milestone level ahead of the Federal Reserve's interest rate decision and earnings reports from major tech companies.",
    "link": "https://www.cnbc.com/2026/01/27/stock-market-today-live-updates.html"
  },
  {
    "text": "Why Antoine Semenyo can't play in City's clash against Galatasaray - GhanaWeb",
    "fullText": "Antoine Semenyo will play no part in Manchester City’s crucial Champions League clash against Galatasaray on Wednesday, January 28, 2026, after being ruled ineligible under UEFA registration rules.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/SportsArchive/Why-Antoine-Semenyo-can-t-play-in-City-s-clash-against-Galatasaray-2019273"
  },
  {
    "text": "A Comprehensive Network for the Discovery and Characterization of Interstellar Objects Like… - Avi Loeb – Medium",
    "fullText": "Inspired by the unresolved anomalies displayed by the latest interstellar visitor 3I/ATLAS (as listed here), I co-authored a new paper with…",
    "link": "https://avi-loeb.medium.com/a-comprehensive-network-for-the-discovery-and-characterization-of-interstellar-objects-like-5c5bc711e852"
  },
  {
    "text": "Live: Trump warns Minneapolis mayor is 'playing with fire' over immigration - BBC",
    "fullText": "The US president hits out at the city's mayor, who said \"Minneapolis does not and will not enforce federal immigration laws\".",
    "link": "https://www.bbc.com/news/live/c78vqp87zqqt"
  },
  {
    "text": "Portland Fire reveals home and away jerseys for 2026 season - oregonlive.com",
    "fullText": "The 2026 Portland Fire jerseys are here.",
    "link": "https://www.oregonlive.com/portland-fire/2026/01/portland-fire-reveals-home-and-away-jerseys-for-2026-season.html"
  },
  {
    "text": "Kanye West Sets March Release Date for ‘Bully’ Album - Rolling Stone",
    "fullText": "Kanye West sets March 20 release date for new album 'Bully,' arriving via the independent music company Gamma. It follows his open letter ad in WSJ.",
    "link": "http://www.rollingstone.com/music/music-news/kanye-west-bully-release-date-signs-with-gamma-1235506094/"
  },
  {
    "text": "Bank of Canada rate decision: No change to the overnight rate, as expected - investingLive",
    "fullText": "Overnight rate unchanged at 2.25% BOC says The outlook for the global and Canadian economies is little changed vs Oct forecast the Bank expects inflation to stay close to the 2% target over the pro...",
    "link": "https://investinglive.com/centralbank/bank-of-canada-rate-decision-no-change-to-the-overnight-rate-as-expected-20260128/"
  },
  {
    "text": "Dutch government is ordered to protect residents on Caribbean island of Bonaire from climate change - AP News",
    "fullText": "A court has ordered the Dutch government to draw up a plan to protect residents of the Caribbean island of Bonaire from the devastating effects of climate change. The ruling on Wednesday was a sweeping victory for the islanders. The Hague District Court ruled…",
    "link": "https://apnews.com/article/climate-bonaire-netherlands-court-greenpeace-caribbean-island-c793ba6d63dd30a6dfb9c5cfa9f8452d"
  },
  {
    "text": "NASA Webb Pushes Boundaries of Observable Universe Closer to Big Bang - NASA Science (.gov)",
    "fullText": "NASA’s James Webb Space Telescope has topped itself once again, delivering on its promise to push the boundaries of the observable universe closer to cosmic",
    "link": "https://science.nasa.gov/missions/webb/nasa-webb-pushes-boundaries-of-observable-universe-closer-to-big-bang/"
  },
  {
    "text": "Greetings from Mumbai, where residents take breathing space where they can find it - NPR",
    "fullText": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
    "link": "https://www.npr.org/2026/01/28/g-s1-107108/mumbai-india-arabian-sea-promenade"
  },
  {
    "text": "Tyson Fury to face Arslanbek Makhmudov in comeback fight - ESPN",
    "fullText": "Tyson Fury's return to the ring has been confirmed with the former heavyweight world champion set to fight Arslanbek Makhmudov on April 11.",
    "link": "https://www.espn.com/boxing/story/_/id/47753624/tyson-fury-arslanbek-makhmudov-comeback-fight-boxing-netflix"
  },
  {
    "text": "Bari Weiss to CBS News Staff: Pivot or Become Irrelevant - Newser",
    "fullText": "Weiss is pushing network to court 'the center,' overhaul broadcast strategy",
    "link": "https://www.newser.com/story/382716/bari-weiss-to-cbs-news-staff-pivot-or-become-irrelevant.html"
  },
  {
    "text": "California Democrats have new plans for confronting ICE: Taxes, lawsuits and location bans - calmatters.org",
    "fullText": "The California Senate passed a bill that would make it easier to sue federal officers over civil rights violations. Recent shootings of civilians by immigration agents in Minnesota lent urgency to the measure, one of several targeting ICE.",
    "link": "https://calmatters.org/politics/2026/01/democrats-immigration-legislation/"
  },
  {
    "text": "Alexander Volkanovski can take huge step towards GOAT status by matching Jose Aldo record at UFC 325 - Bloody Elbow",
    "fullText": "Alexander Volkanovski will rematch Diego Lopes this weekend. #UFC325",
    "link": "https://bloodyelbow.com/2026/01/28/alexander-volkanovski-can-take-huge-step-towards-goat-status-by-matching-jose-aldo-record-at-ufc-325/"
  },
  {
    "text": "BLACKPINK's Rosé Exposes Her Crazy Methods To Avoid \"Dispatch\" Outside Ex-Boyfriend's House - Koreaboo",
    "fullText": "BLACKPINK’s Rosé shares the extreme and hilarious steps she took to stay hidden from getting photographed while visiting her ex-boyfriend.",
    "link": "https://www.koreaboo.com/news/blackpink-rose-exposes-crazy-methods-avoid-dispatch-ex-boyfriends-house/"
  },
  {
    "text": "Windows 11’s ability to resume Android apps on your PC is getting closer - The Verge",
    "fullText": "Microsoft is getting ready to improve its cross-device resume feature in Windows 11. You’ll soon be able to resume Spotify and Office docs from phone to PC.",
    "link": "https://www.theverge.com/news/869161/microsoft-windows-11-android-app-resume-feature-release-preview"
  },
  {
    "text": "Scientists let AI loose on Hubble’s archives - The Verge",
    "fullText": "AI model AnomalyMatch took just 2.5 days to flag rarities like merging galaxies and gravitational lenses from 100 million image cutouts in Hubble’s archives.",
    "link": "https://www.theverge.com/news/869182/astronomers-ai-discover-cosmic-anomalies-hubble-archives"
  }
]