[
  {
    "text": "Brisbane International: Aryna Sabalenka sets up Marta Kostyuk final - BBC",
    "fullText": "World number one Aryna Sabalenka reaches the final of the Brisbane International for the third year in a row with victory over Karolina Muchova.",
    "link": "https://www.bbc.com/sport/tennis/articles/cgrdg2x78d5o"
  },
  {
    "text": "North Korea vows response as it accuses the South of flying drones across the border - abcnews.go.com",
    "fullText": "North Korea has accused South Korea of flying drones across the border between the nations",
    "link": "https://abcnews.go.com/International/wireStory/north-korea-vows-response-accuses-south-flying-drones-129077683"
  },
  {
    "text": "'Out of stock': What went wrong at luxury retailer Saks? - BBC",
    "fullText": "Saks Global, which owns Saks Fifth Avenue and Neiman Marcus, is expected to imminently file for bankruptcy protection, leaving questions about the retailer's future.",
    "link": "https://www.bbc.com/news/articles/czdq1z73pv9o"
  },
  {
    "text": "Judge says Trump administration can’t block child care, other program money for 5 states for now - abcnews.go.com",
    "fullText": "A judge has ruled that President Donald Trump’s administration cannot block child care and other federal social service money from flowing to five states for now",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-trump-administration-block-child-care-program-money-129072240"
  },
  {
    "text": "'Home Alone' Star Daniel Stern Cited for Soliciting Prostitution - TMZ",
    "fullText": "Sounds like Daniel Stern didn't want to be home alone ... because cops issued him a citation for allegedly trying to hire an escort.",
    "link": "https://www.tmz.com/2026/01/09/home-alone-daniel-stern-busted-prostitution/"
  },
  {
    "text": "South Africa's strained ties with US face new test - war games with China, Iran and Russia - BBC",
    "fullText": "The naval exercises could inflame relations with Donald Trump - who is already at loggerheads with Pretoria.",
    "link": "https://www.bbc.com/news/articles/c62wxezynk2o"
  },
  {
    "text": "Trump order targeting defense contractor pay, stock buybacks is ‘full of ambiguity’ - Federal News Network",
    "fullText": "\"It is going to be very interesting to determine how they measure whether a company is performing,\" Stan Soloway said.",
    "link": "https://federalnewsnetwork.com/contracting/2026/01/trump-order-targeting-defense-contractor-pay-stock-buybacks-is-full-of-ambiguity/"
  },
  {
    "text": "Multiple small avalanches release in Juneau after city issues evacuation advisory - KTOO",
    "fullText": "Some residents have chosen to evacuate and others remain at home after city issues avalanche evacuation advisory. Several small avalanches have released in the usual paths across downtown and Thane.",
    "link": "https://www.ktoo.org/2026/01/09/multiple-small-avalanches-release-in-juneau-after-city-issues-evacuation-advisory/"
  },
  {
    "text": "Buffalo Bills at Jacksonville Jaguars | Where to watch, stream and listen | AFC Wild Card Round - BuffaloBills.com",
    "fullText": "TV Channel, Streaming and Radio for Bills at Jaguars",
    "link": "https://www.buffalobills.com/news/buffalo-bills-at-jacksonville-jaguars-where-to-watch-stream-and-listen-afc-wild-card-round"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Kansas City hit by a new ‘super flu’ variant causing a surge of cases - KCUR",
    "fullText": "Approximately 80% of active flu cases are an unexpected strain of Influenza A virus that health officials are calling a super flu. The Kansas City area has seen a dramatic spike in cases in recent weeks.",
    "link": "https://www.kcur.org/health/2026-01-12/kansas-city-super-flu-variant-influenza-illness-sick-respiratory-hospital"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "Leaders’ Declaration of France, the United Kingdom and Germany on the situation in Iran: 9 January 2026 - GOV.UK",
    "fullText": "Leaders’ Declaration of France, the United Kingdom and Germany on the situation in Iran.",
    "link": "https://www.gov.uk/government/news/leaders-declaration-of-france-the-united-kingdom-and-germany-on-the-situation-in-iran-9-january-2026"
  },
  {
    "text": "How to watch, listen and follow: Carolina vs. Los Angeles Rams in the Wild Card round - Panthers.com",
    "fullText": "The Panthers game will air on FOX at 4:30 p.m. ET.",
    "link": "https://www.panthers.com/news/how-to-watch-listen-and-follow-carolina-vs-los-angeles-rams-in-the-wild-card-round-playoffs"
  },
  {
    "text": "Exercise can be nearly as effective as therapy for depression - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46557233"
  },
  {
    "text": "Federal Reserve Board announces the designation of the Chairs and Deputy Chairs of the 12 Federal Reserve Banks for 2026 - Federal Reserve Board (.gov)",
    "fullText": "The Federal Reserve Board on Friday announced the designation of the chairs and deputy chairs of the 12 Federal Reserve Banks for 2026.  Each Reserve Bank has",
    "link": "https://www.federalreserve.gov/newsevents/pressreleases/other20260109a.htm"
  },
  {
    "text": "Jumpstart your year with these games under $30! - Nintendo",
    "fullText": "Find something to play without breaking the bank. Shop now on Nintendo.com or Nintendo eShop on your device.",
    "link": "https://www.nintendo.com/us/whatsnew/jumpstart-your-year-with-these-games-under-usd30-jan-2026/"
  },
  {
    "text": "Secretary Bessent Announces Initiatives to Combat Rampant Fraud in Minnesota - U.S. Department of the Treasury (.gov)",
    "fullText": "Actions Increase Transparency, Seek Accountability for Taxpayer DollarsWASHINGTON— In Minnesota, Secretary of the Treasury Scott Bessent announced several initiatives to combat rampant government benefits fraud in Minnesota, which has wasted billions of taxpa…",
    "link": "https://home.treasury.gov/news/press-releases/sb0354"
  },
  {
    "text": "Separatist group in southern Yemen announces dissolution after its leader flees to the UAE - AP News",
    "fullText": "Yemen's main separatist group, the Southern Transitional Council, is set to dismantle its institutions effective Friday. The announcement follows weeks of unrest in southern Yemen and comes a day after its leader fled to the UAE. The council's secretary-gener…",
    "link": "https://apnews.com/article/yemen-war-saudi-arabia-uae-southern-transitional-council-7303d1d01a49f959bfb9baeeb5ff400d"
  },
  {
    "text": "Why Tech Launches Stopped Feeling Magical - Lifehacker",
    "fullText": "People used to camp out to buy new phones. Wild!",
    "link": "https://lifehacker.com/tech/why-tech-launches-stopped-feeling-magical"
  }
]