[
  {
    "text": "New Hampshire’s GOP Gov. Kelly Ayotte draws her first major challenger - Politico",
    "fullText": "Democrat Cinde Warmington launched another bid for the governor’s office after running unsuccessfully in 2024.",
    "link": "https://www.politico.com/news/2026/02/18/new-hampshire-kelly-ayotte-cinde-warmington-00785878"
  },
  {
    "text": "Stock futures rise ahead of Fed minutes as Nvidia shares gain: Live updates - CNBC",
    "fullText": "The major averages posted slim gains on Tuesday, kicking off a holiday-shortened week.",
    "link": "https://www.cnbc.com/2026/02/17/stock-market-today-live-updates.html"
  },
  {
    "text": "Democratic-led cities move to block ICE, setting up clash with Trump - The Washington Post",
    "fullText": "In New York, Philadelphia and elsewhere, elected Democrats are taking steps to try to limit immigration crackdowns like the one winding down in Minneapolis.",
    "link": "https://www.washingtonpost.com/nation/2026/02/18/philadelphia-new-york-blue-cities-fight-ice/"
  },
  {
    "text": "Winter Olympics 2026: Team GB's curling semi-final hopes alive after sensational win over US - BBC",
    "fullText": "Rebecca Morrison executes a sensational double takeout with her final stone as Team GB steal two in the final end to beat the United States 8-7.",
    "link": "https://www.bbc.com/sport/articles/c0q3nejy1pjo"
  },
  {
    "text": "Epstein files show years of FBI interest in Les Wexner, Epstein’s mysterious benefactor - CNN",
    "fullText": "Les Wexner: Epstein files offer new clues about FBI interest in his billionaire benefactor",
    "link": "https://www.cnn.com/2026/02/18/us/les-wexner-epstein-files-ohio-invs"
  },
  {
    "text": "The Justice Department is not acting like it used to, criminal defense lawyers note - NPR",
    "fullText": "Criminal defense lawyers are tracking when the Justice Department appears to rely on irregular charging practices, including aggressive legal theories and possible political retribution.",
    "link": "https://www.npr.org/2026/02/18/g-s1-110397/justice-department-tracker-abnormal-criminal-charges"
  },
  {
    "text": "This form of mental exercise may cut dementia risk for decades - NPR",
    "fullText": "A study finds that people who did one specific form of brain training in the 1990s were less likely to be diagnosed with dementia over the next 20 years.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5716010/brain-training-exercise-cut-dementia-risk-decades"
  },
  {
    "text": "Surprise 4-legged Olympic competitor wows cross-country fans - NPR",
    "fullText": "Nazgul sprints on the course at a cross-country ski race, crossing the finish line in an unsanctioned quest for glory.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5718025/surprise-four-legged-olympic-competitor-wows-cross-country-fans"
  },
  {
    "text": "Trump moves closer to a major war with Iran - Axios",
    "fullText": "There's little public debate about what could be the most consequential U.S. military action in a decade.",
    "link": "https://www.axios.com/2026/02/18/iran-war-trump-military-strikes-nuclear-talks"
  },
  {
    "text": "Meta CEO Mark Zuckerberg to face jury in landmark social media addiction trial - NPR",
    "fullText": "The case is seen as a test of social media's legal responsibility for platform design features that plaintiffs' lawyers say exacerbated mental health issues in young people.",
    "link": "https://www.npr.org/2026/02/18/nx-s1-5716229/zuckerberg-social-media-addiction-trial"
  },
  {
    "text": "Apple Decouples From Nasdaq as AI ‘Whack-a-Mole’ Grips Market - Bloomberg.com",
    "fullText": "It’s been nearly 20 years since Apple Inc. was this untethered from its tech peers, giving investors an appealing alternative to the artificial intelligence-fueled volatility that has gripped most other corners of the stock market in recent weeks.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-18/apple-decouples-from-nasdaq-as-ai-whack-a-mole-grips-market"
  },
  {
    "text": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors - AP News",
    "fullText": "Gisèle Pelicot has released a memoir that recounts her drugging and mass rape case and sends a powerful message of hope and support to victims of sexual abuse. On Tuesday, her book comes out worldwide in 22 languages. Pelicot says writing it helped her reflec…",
    "link": "https://apnews.com/article/gisele-pelicot-book-france-dominique-rape-4cd6f5bacc7fa9d483d610a3b38551a5"
  },
  {
    "text": "Robert Pattinson says a therapist once asked him if he was on drugs because they 'couldn't understand' him - ew.com",
    "fullText": "Robert Pattinson recalls that a therapist once thought he was on drugs, because they couldn't understand what he was saying.",
    "link": "https://ew.com/robert-pattinson-says-therapist-thought-he-was-on-drugs-11908451"
  },
  {
    "text": "Tom Noonan Dies: ‘Manhunter’ Villain and Sundance-Winning Indie Director Was 74 - Phrasemaker",
    "fullText": "Tom Noonan, the distinctive character actor, playwright and filmmaker best known for his haunting turn in “Manhunter” and his Sundance-winning indie “What Happened Was…,” has died.",
    "link": "https://thephrasemaker.com/2026/02/18/tom-noonan-dies-manhunter-villain-and-sundance-winning-indie-director-was-74/"
  },
  {
    "text": "Microsoft confirms new Windows 11 feature drop coming next month - Windows Central",
    "fullText": "Windows 11's latest Release Preview Channel update has given us our first look at Microsoft's next feature drop for the OS that's expected to begin rolling out imminently.",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-next-windows-11-feature-drop-with-new-taskbar-emoji-and-settings-updates-heres-whats-coming-to-your-pc-very-soon"
  },
  {
    "text": "Too many satellites? Earth’s orbit is on track for a catastrophe – but we can stop it - The Conversation",
    "fullText": "Cultural, spiritual, and most environmental impacts aren’t taken into account when launching thousands of satellites.",
    "link": "https://theconversation.com/too-many-satellites-earths-orbit-is-on-track-for-a-catastrophe-but-we-can-stop-it-275430"
  },
  {
    "text": "Portland could get as much as 2 inches of snow starting Wednesday evening...or not - OregonLive.com",
    "fullText": "National Weather Service reports 45 to 60% chance of one to two inches or more of snowfall along the I-5 corridor, with travel impacts expected somewhere in the region.",
    "link": "https://www.oregonlive.com/weather/2026/02/portland-could-get-as-much-as-2-inches-of-snow-starting-wednesday-eveningor-not.html"
  },
  {
    "text": "Google launches more visible links in AI Overviews and AI Mode - Search Engine Land",
    "fullText": "These links appear as pop ups as you hover your mouse over them.",
    "link": "https://searchengineland.com/google-launches-more-visibile-links-in-ai-overviews-and-ai-mode-469441"
  },
  {
    "text": "Simone Biles reaches out to Ilia Malinin at Winter Olympics 2026: “I went into protection mode” - Milano Cortina 2026",
    "fullText": "The gymnast and figure skater met on Tuesday (17 February) where Biles said she had one goal: validate what Malinin is feeling.",
    "link": "https://www.olympics.com/en/milano-cortina-2026/news/simone-biles-reaches-out-ilia-malinin-winter-olympics-2026-protection-mode"
  }
]