[
  {
    "text": "Atlanta Falcons Head Coach Tracker 2026 - Atlanta Falcons",
    "fullText": "What you need to know about candidates the team is considering for this hire.",
    "link": "https://www.atlantafalcons.com/news/head-coach-tracker-2026"
  },
  {
    "text": "Here are Monday's biggest analyst calls: Nvidia, Apple, Tesla, Palantir, Zoom, Microsoft, Roku, Netflix & more - CNBC",
    "fullText": "Here are Monday's biggest calls on Wall Street.",
    "link": "https://www.cnbc.com/2026/01/12/mondays-biggest-analyst-calls-on-wall-street.html"
  },
  {
    "text": "5 lines from Nikki Glaser that sum up her night as Golden Globes host - Yahoo",
    "fullText": "The Emmy-nominated comedian and actress roasted A-list celebs and the network airing the show.",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/5-lines-from-nikki-glaser-that-sum-up-her-night-as-golden-globes-host-045957049.html"
  },
  {
    "text": "Former Rep. Mary Peltola jumps into Alaska Senate race - Politico",
    "fullText": "The former Alaska congressmember will likely face off against Sen. Dan Sullivan (R-Alaska), and is a recruitment coup for national Democrats.",
    "link": "https://www.politico.com/news/2026/01/12/peltola-alaska-senate-2026-midterms-00721596"
  },
  {
    "text": "Galaxy S26 with Exynos 2600 makes first Geekbench appearance – Global entry confirmed? - Sammy Fans",
    "fullText": "For the first time, Samsung’s upcoming Galaxy S26 has surfaced on Geekbench with the Exynos 2600 processor. The first listing alone revealed the phone’s graphics capabilities, backed by Samsung Xclipse 960 GPU. This listing is important because it’s the first…",
    "link": "https://www.sammyfans.com/2026/01/11/samsung-galaxy-s26-exynos-2600-first-geekbench/"
  },
  {
    "text": "Nurses strike begins in New York City as thousands walk off jobs at major hospitals - CBS News",
    "fullText": "The largest nurses strike ever in New York City is underway as thousands of NYSNA members walk off their jobs at major hospitals.",
    "link": "https://www.cbsnews.com/newyork/news/nurses-strike-new-york-city-hospitals/"
  },
  {
    "text": "Hearings on whether Myanmar committed genocide against the Rohingya opens at top UN court - ABC News",
    "fullText": "Myanmar heard accusations that it is responsible for genocide against the Rohingya ethnic minority at the top court of the United Nations, as long-awaited hearings began on Monday",
    "link": "https://abcnews.go.com/International/wireStory/court-begin-hearings-myanmar-committed-genocide-rohingya-129122831"
  },
  {
    "text": "This Dead Star With a Glowing Shock Wave Shouldn’t Exist - Gizmodo",
    "fullText": "The recent discovery has left astronomers dumbfounded.",
    "link": "https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244"
  },
  {
    "text": "Capital One drops 6%, other banks hit after Trump calls for credit card rate cap - CNBC",
    "fullText": "Posting on Truth Social, Trump said he would \"no longer let the American Public be 'ripped off' by Credit Card Companies.\"",
    "link": "https://www.cnbc.com/2026/01/12/trump-credit-card-limit-banks-jpmorgan-citi.html"
  },
  {
    "text": "Exercise is as effective as medication in treating depression, study finds - NPR",
    "fullText": "New research shows exercise is as effective as medication at reducing symptoms of depression. And you don't need to run a marathon to see benefits. So how much is enough?",
    "link": "https://www.npr.org/2026/01/12/nx-s1-5667599/exercise-is-as-effective-as-medication-in-treating-depression-study-finds"
  },
  {
    "text": "3 inmates dead, 12 hurt after \"major fights\" at Georgia prison, authorities say - CBS News",
    "fullText": "A disturbance at a prison in northern Georgia Sunday afternoon left three inmates dead and 12 more injured along with a guard, authorities say.",
    "link": "https://www.cbsnews.com/news/georgia-prison-disturbance-3-inmates-dead-12-hurt-major-fights/"
  },
  {
    "text": "Wind chiefs warn of global ‘spillover’ from Trump green crackdown - Financial Times",
    "fullText": "US suspension of offshore renewable projects adds to market uncertainty",
    "link": "https://www.ft.com/content/2fbba1aa-5cc1-4a44-a74b-46d206f60000"
  },
  {
    "text": "US figure skater whose parents were killed in plane crash heads to Olympics - BBC",
    "fullText": "His parents were among 67 people killed last January when a commercial plane collided mid-air with a military helicopter.",
    "link": "https://www.bbc.com/news/articles/cly9nzvn71vo"
  },
  {
    "text": "Oklahoma vs Oklahoma State Wrestling Match Notes - FloWrestling",
    "fullText": "Oklahoma State downs Oklahoma, 37-0, in the first Bedlam series shutout since 1992.",
    "link": "https://www.flowrestling.org/articles/15167118-oklahoma-vs-oklahoma-state-wrestling-match-notes"
  },
  {
    "text": "As ‘Landman’ Ends on Violent Cliffhanger, Jacob Lofland Says End of Season “Blew Me Off My Feet” - The Hollywood Reporter",
    "fullText": "The actor who plays the son to Billy Bob Thornton's starring oil fixer peels back the layers of his character on the Taylor Sheridan and Christian Wallace hit Paramount+ series.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/landman-violent-cliffhanger-jacob-lofland-interview-season-2-1236469905/"
  },
  {
    "text": "Iran edges closer to a revolution that would reshape the world - Fortune",
    "fullText": "“This is the biggest moment in Iran since 1979,” said William Usher, a former senior Middle East analyst at the Central Intelligence Agency.",
    "link": "https://fortune.com/2026/01/11/iran-protests-economy-infliation-political-revolution-reza-pahlavi-khamenei/"
  },
  {
    "text": "The struggle of resizing windows on macOS Tahoe - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46579864"
  }
]