[
  {
    "text": "New Year's Eve in NYC's Times Square: Everything to know about the ball drop, how to watch, and more - ABC7 New York",
    "fullText": "Watch \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2026\" Wednesday, Dec. 31, beginning at 8:00 p.m. EST on Channel 7",
    "link": "https://abc7ny.com/post/new-years-eve-nycs-times-square-everything-know-ball-drop-how-watch-more/18330767/"
  },
  {
    "text": "Suicide bomber kills at least one police officer in Syria’s Aleppo - Al Jazeera",
    "fullText": "Officials say a ‘terrorist’ detonated suicide belt as police protecting New Year’s Eve festivities tried to detain him.",
    "link": "https://www.aljazeera.com/news/2025/12/31/suicide-bomber-kills-at-least-one-police-officer-in-syrias-aleppo"
  },
  {
    "text": "Disney cast member recovering after videos show runaway boulder at Indiana Jones show - CBS News",
    "fullText": "A staffer at Walt Disney World in Florida is recovering after being struck and injured by a fake boulder that rolled off stage during a live performance, Disney said.",
    "link": "https://www.cbsnews.com/news/disney-cast-member-recovering-videos-show-runaway-boulder-indiana-jones-show/"
  },
  {
    "text": "Brian Schottenheimer explains Cowboys' decision to waive Trevon Diggs - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "On Wednesday, Cowboys head coach Brian Schottenheimer explained the teams' decision to waive CB Trevon Diggs, which he said was for \"a culmination of multiple factors.\"",
    "link": "https://www.dallascowboys.com/news/brian-schottenheimer-explains-cowboys-decision-to-waive-trevon-diggs"
  },
  {
    "text": "Greene County teen marks state’s first pediatric flu death of the season - Dayton Daily News",
    "fullText": "",
    "link": "https://www.daytondailynews.com/local/greene-county-teen-marks-states-first-pediatric-flu-death-of-the-season/ZAA5ECPTA5HVPCV3NNYVTTA3PE/"
  },
  {
    "text": "House Judiciary Committee releases video and transcript of Jack Smith deposition - CNN",
    "fullText": "The House Judiciary Committee on New Year’s Eve released a transcript and video of its closed-door hearing with Jack Smith, the former special counsel who led the two failed prosecutions of President Donald Trump.",
    "link": "https://www.cnn.com/2025/12/31/politics/jack-smith-house-judiciary-committee-deposition-released"
  },
  {
    "text": "Photos of New Year’s celebrations across the globe - AP News",
    "fullText": "___",
    "link": "https://apnews.com/photo-gallery/new-year-eve-2026-celebration-photos-990cefb87073dc84d362839d810c2919"
  },
  {
    "text": "What to know about Nick Shirley, the YouTuber alleging day care fraud in Minnesota - NPR",
    "fullText": "Shirley is a 23-year-old self-described \"independent YouTube journalist\" who made prank videos in high school before pivoting to politics. He participated in a White House roundtable in October.",
    "link": "https://www.npr.org/2025/12/31/nx-s1-5662600/nick-shirley-minnesota-daycare-fraud"
  },
  {
    "text": "Bucknuts Expert Roundtable: Does Ohio State begin College Football Playoff run with win vs. Miami? - 247Sports",
    "fullText": "Its been three and a half weeks since Ohio State last played a football game The Buckeyes suffered their first defeat of the season in the Big Ten Championship Game at the",
    "link": "https://247sports.com/college/ohio-state/longformarticle/bucknuts-expert-roundtable-does-ohio-state-football-begin-college-football-playoff-run-with-win-vs-miami-hurricanes-268670613/"
  },
  {
    "text": "Patriots DT Christian Barmore faces a domestic assault charge - NBC Sports",
    "fullText": "Patriots defensive tackle Christian Barmore faces a charge of assault and battery on a family/household member.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/patriots-dt-christian-barmore-faces-a-domestic-assault-charge"
  },
  {
    "text": "‘Zootopia 2’ Bests ‘Frozen 2’ To Become Highest Grossing Walt Disney Animation Label Title Of All-Time - Deadline",
    "fullText": "Zootopia 2 at $1.46 billion has become the Walt Disney Animation label's highest grossing movie of all title.",
    "link": "http://deadline.com/2025/12/zootopia-2-box-office-walt-disney-record-1236659242/"
  },
  {
    "text": "Some Warren Buffett wisdom on his last day leading Berkshire Hathaway - AP News",
    "fullText": "The advice that legendary investor Warren Buffett offered on investing and life over the years helped earn him legions of followers who eagerly read his annual letters and filled an arena in Omaha every year to listen to him at Berkshire Hathaway’s annual mee…",
    "link": "https://apnews.com/article/warren-buffett-berkshire-hathaway-retirement-quotes-9463fcacb9fa18a6b504ab8349ffa4b5"
  },
  {
    "text": "Bexar sheriff feels 'strongly' human remains belong to Camila Mendoza Olmos - San Antonio Express-News",
    "fullText": "Camila Mendoza Olmos had been missing from the San Antonio area since Christmas Eve. The sheriff announced a body had been found near her home Dec. 29.",
    "link": "https://www.expressnews.com/news/article/body-found-identification-camila-mendoza-olmos-21269601.php"
  },
  {
    "text": "What will the weather be like on New Year's Eve and New Year's Day? Maps show the latest forecasts. - CBS News",
    "fullText": "Lake effect snow, intense rain and chilly temperatures dominate the forecasts for different parts of the U.S., before and after the new year arrives.",
    "link": "https://www.cbsnews.com/news/weather-forecast-new-years-eve-maps/"
  },
  {
    "text": "EU's top diplomat rejects Russian claims of Ukrainian attack on government sites - BBC",
    "fullText": "It comes as Russia releases video which it claims shows a downed Ukrainian drone launched at one of Putin's residences.",
    "link": "https://www.bbc.com/news/articles/c0q4e4e4ldyo"
  },
  {
    "text": "Photos show the year in politics as Trump brought change to America in 2025 - CBS News",
    "fullText": "In 2025, President Trump returned to power and instituted change in Washington. Here's a roundup of photos of key moments throughout the year.",
    "link": "https://www.cbsnews.com/news/2025-year-politics-photos/"
  },
  {
    "text": "China announces it 'successfully completed' Taiwan military maneuvers - ABC News",
    "fullText": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
    "link": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777"
  },
  {
    "text": "Oil tanker pursued by US now has a Russian flag painted on its side - CNN",
    "fullText": "Crew members aboard the aging, rusted oil tanker that the US has been pursuing at sea for nearly two weeks appear to have painted a crude image of a Russian flag on the ship’s hull, which American officials believe is an attempt at claiming Russian protection…",
    "link": "https://www.cnn.com/2025/12/31/politics/oil-tanker-venezuela-russian-flag"
  }
]