[
  {
    "text": "Opinion | The unjust killing of Alex Pretti marks a turning point in Trump’s second term - The Washington Post",
    "fullText": "Congress can step in to stop the president from overreaching on immigration.",
    "link": "https://www.washingtonpost.com/opinions/2026/01/25/minneapolis-immigration-killing-government-shutdown-ice-alex-pretti/"
  },
  {
    "text": "Riq Woolen’s taunting penalty sets up Puka Nacua’s touchdown - NBC Sports",
    "fullText": "The Rams had their punt team on the field after Riq Woolen broke up a pass intended for Puka Nacua on third-and-12.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/riq-woolens-taunting-penalty-sets-up-puka-nacuas-touchdown"
  },
  {
    "text": "Private jet carrying 8 people crashes at Bangor, Maine, airport, FAA says - CNN",
    "fullText": "A private jet carrying eight people crashed on takeoff from Bangor, Maine, Sunday evening, according to the FAA.",
    "link": "https://www.cnn.com/2026/01/25/us/bangor-maine-plane-crash"
  },
  {
    "text": "'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home - TMZ",
    "fullText": "Quinton Aaron -- the actor who played Michael Oher in \"The Blind Side\" -- has been hospitalized after collapsing at his home .. TMZ has learned.",
    "link": "https://www.tmz.com/2026/01/25/blind-side-actor-quinton-aaron-hospitalized-after-falling-at-home/"
  },
  {
    "text": "CNBC Daily Open: Canada is drawing Trump's ire — and faces a 100% tariff - CNBC",
    "fullText": "Trump threatened Canada with tariffs of 100% if it strikes a deal with China. Trump also withdrew an invitation to the Canada to join his \"Board of Peace.\"",
    "link": "https://www.cnbc.com/2026/01/26/cnbc-daily-open-canada-is-drawing-trumps-ire-and-faces-a-100percent-tariff.html"
  },
  {
    "text": "Minnesota shooting scrambles America’s gun debate - The Washington Post",
    "fullText": "Some gun rights backers cite Alex Pretti’s gun as a justification for his killing in Minneapolis, while gun-control supporters dismiss its relevance.",
    "link": "https://www.washingtonpost.com/politics/2026/01/25/alex-pretti-gun-debate-second-amendment/"
  },
  {
    "text": "Another day another high: Gold surges past $5,000 as investors seek shelter from global risks - CNBC",
    "fullText": "The surge comes as recent flashpoints from Greenland and Venezuela to the Middle East underscore higher geopolitical risk, while fiscal concerns also loom large.",
    "link": "https://www.cnbc.com/2026/01/26/gold-record-surges-past-new-5000-record.html"
  },
  {
    "text": "Ferry carrying more than 350 people sinks in southern Philippines - CNN",
    "fullText": "A ferry with more than 350 people on board sank during the night early Monday near an island in the southern Philippines and rescuers have saved at least 316 passengers and retrieved 15 bodies, officials said.",
    "link": "https://www.cnn.com/2026/01/25/asia/ferry-sinking-philippines-basilan-intl-hnk"
  },
  {
    "text": "'Another unbelievable result' - but what's different about Man Utd now? - BBC",
    "fullText": "MOTD pundit Danny Murphy explains how Manchester United earned their impressive win at Premier League leaders Arsenal, and how he feels the Gunners will react.",
    "link": "https://www.bbc.com/sport/football/articles/c62vk5l68x3o"
  },
  {
    "text": "How much snow has fallen in Maryland? Snowfall totals for Sunday's winter storm. - CBS News",
    "fullText": "A winter storm brought heavy, powdery snow to Maryland on Sunday morning. By mid- to late morning, conditions changed to sleet and freezing rain.",
    "link": "https://www.cbsnews.com/baltimore/news/maryland-snow-totals-how-much-inches-weather/"
  },
  {
    "text": "How much snow has fallen in Pittsburgh? Here's a look at the snow totals so far. - CBS News",
    "fullText": "A historic winter storm is hitting the Pittsburgh area on Sunday, blanketing roads and covering driveways with multiple inches of snow.",
    "link": "https://www.cbsnews.com/pittsburgh/news/pittsburgh-snow-totals-january-25-2026/"
  },
  {
    "text": "Amazon is selling a 2-in-1 laptop and tablet for just $70 - thestreet.com",
    "fullText": "Shoppers say \"the functionality is great.\"",
    "link": "https://www.thestreet.com/deals/aiprotablet-a30-2-in-1-laptop-tablet-amazon-sale-january-2026"
  },
  {
    "text": "5 Free Apps Actually Better Than Premium Alternatives - bgr.com",
    "fullText": "While most professional-grade apps lock premium features behind a paywall, apps like VLC, DaVinci Resolve, Bitwarden, etc., are completely free yet useful.",
    "link": "https://www.bgr.com/2079999/free-apps-better-premium-alternatives/"
  },
  {
    "text": "Jenna Ortega Brings the Garter Out of the Bedroom With Her Nude Mugler Fit - Yahoo",
    "fullText": "At Sundance Film Festival, Jenna Ortega attends the premiere of her forthcoming film, “The Gallerist,” in a nude Mugler look featuring a built-in garter.",
    "link": "https://www.harpersbazaar.com/celebrity/latest/a70130981/jenna-ortega-mugler-spring-summer-2026-sundance-film-festival/"
  },
  {
    "text": "Ukraine says US security guarantees deal '100% ready' - dw.com",
    "fullText": "President Volodymyr Zelenskyy said the US deal on security guarantees for Ukraine is completely ready, and Kyiv is simply waiting for a time and place to sign it.",
    "link": "https://www.dw.com/en/ukraine-says-us-security-guarantees-deal-100-ready/a-75653357"
  },
  {
    "text": "Here's How Much A 2021 Chevy Corvette Has Depreciated In Just 5 Years - Jalopnik",
    "fullText": "The Chevrolet Corvette hasn't depreciated much over the last five years, losing around a quarter of its value in that time.",
    "link": "https://www.jalopnik.com/2080724/2021-chevy-corvette-5-year-depreciation/"
  },
  {
    "text": "Rangers Sign Austin Gomber To Minor League Deal - MLB Trade Rumors",
    "fullText": "The Rangers followed up the MacKenzie Gore trade by adding some much-needed depth to their starting rotation mix today. Read more at MLBTR.",
    "link": "https://www.mlbtraderumors.com/2026/01/rangers-sign-austin-gomber-to-minor-league-deal.html"
  },
  {
    "text": "Winter storm wreaks havoc in north Miss. - mississippitoday.org",
    "fullText": "About 10% of Mississippi customers were without electrical service at midday Sunday, and the hardest-hit areas were in the northern part of the state, according to the tracking site poweroutage.us.",
    "link": "https://mississippitoday.org/2026/01/25/winter-storm-power-loss/"
  },
  {
    "text": "Bessent: Greenland deal is ‘much more fulsome’ for the US - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/bessent-greenland-deal-fullsome-us/story?id\\\\u003d129538024"
  }
]