[
  {
    "text": "5,500-year-old DNA shows syphilis was rooted in the Americas, before Columbus - The Washington Post",
    "fullText": "Analysis of a shin bone found in a rock cave in Colombia suggests the sexually transmitted disease is much older than previously believed.",
    "link": "https://www.washingtonpost.com/health/2026/01/22/std-syphilis-origins-dna-sexual-health/"
  },
  {
    "text": "After ‘good’ Trump meeting, Zelensky pushes Europe hard to do more - The Washington Post",
    "fullText": "Trump and White House envoy Witkoff have said a deal to resolve nearly four years of war between Russia and Ukraine is close.",
    "link": "https://www.washingtonpost.com/world/2026/01/22/trump-zelensky-davos-ukraine-russia/"
  },
  {
    "text": "Trump budget office orders review of funds to Democratic-controlled states - The Washington Post",
    "fullText": "President Donald Trump said his administration would cut off federal resources to “sanctuary cities” on Feb. 1.",
    "link": "https://www.washingtonpost.com/business/2026/01/22/democratic-states-federal-funding-review/"
  },
  {
    "text": "Winter storm updates: Heavy snow, crippling ice and frigid temperatures forecast to hit more than 2 dozen states this weekend - Yahoo",
    "fullText": "Meteorologists say it could be one of the most significant winter events this season.",
    "link": "https://www.yahoo.com/news/weather-news/live/winter-storm-updates-heavy-snow-crippling-ice-and-frigid-temperatures-forecast-to-hit-more-than-2-dozen-states-this-weekend-154833002.html"
  },
  {
    "text": "Scientists discover new clue linking obesity to dementia risk - The Washington Post",
    "fullText": "European researchers trace a path that shows how high blood pressure caused by excess weight could be the link to certain cognitive brain disease.",
    "link": "https://www.washingtonpost.com/health/2026/01/22/dementia-obesity-blood-pressure-science/"
  },
  {
    "text": "ICE memo allows agents to enter homes without judge’s warrant, legal group says - The Washington Post",
    "fullText": "The memo, seen by The Washington Post, was included in a disclosure to U.S. senators by Whistleblower Aid, a legal group representing two government employees.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/22/ice-memo-enter-homes-warrant/"
  },
  {
    "text": "France seizes suspected Russian 'shadow fleet' tanker in the Mediterranean - BBC",
    "fullText": "The vessel, named Grinch, was stopped by the French navy as it travelled through waters between Spain and Morocco.",
    "link": "https://www.bbc.com/news/articles/cdexxr2y907o"
  },
  {
    "text": "Mexican authorities arrest alleged crime figure ‘El Botox’ in killing of lime growers’ leader - AP News",
    "fullText": "Mexican authorities have arrested an alleged organized crime figure in Michoacan linked to the killing of a lime growers' leader. Security Secretary Omar García Harfuch said the man known as “El Botox” was arrested for extorting lime growers and various homic…",
    "link": "https://apnews.com/article/mexico-michoacan-sheinbaum-limes-botox-536262256e71ef85b2841035dede8d31"
  },
  {
    "text": "A vaccine trial is called 'unethical' and a 'unique' opportunity. Is it on or off? - NPR",
    "fullText": "The U.S. is giving $1.6 million to researchers to study how the hepatitis B vaccine affects newborns in Guinea-Bissau. Local officials say the trial is suspended. U.S. officials say that's inaccurate.",
    "link": "https://www.npr.org/2026/01/22/g-s1-106571/vaccine-trial-hepatitis-b-guinea-bissau"
  },
  {
    "text": "FTX Exec Caroline Ellison Is Now a Free Woman - Business Insider",
    "fullText": "Caroline Ellison, the former Alameda Research CEO, was freed this week after spending about 14 months of her two-year sentence in federal custody.",
    "link": "https://www.businessinsider.com/ftx-exec-caroline-ellison-prison-release-2026-1"
  },
  {
    "text": "PFT’s 2025 NFL Conference Championship picks: Florio vs. Simms - NBC Sports",
    "fullText": "And then there were four.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/pfts-2025-nfl-conference-championship-picks-florio-vs-simms"
  },
  {
    "text": "NC ticket wins $209.3 million Powerball jackpot - WRAL",
    "fullText": "A Powerball ticket purchased in Roanoke Rapids won the $209.3 million jackpot drawing Wednesday night.",
    "link": "https://www.wral.com/news/local/nc-ticket-wins-powerball-jackpot-roanoke-rapids-january-2026/"
  },
  {
    "text": "ISS astronaut spots Artemis 2 moon rocket on the launch pad from space (photo) - Space",
    "fullText": "A NASA astronaut on the ISS captured the Space Launch System rocket for Artemis 2, a mission that aims to bring four astronauts around the moon as soon as Feb. 6.",
    "link": "https://www.space.com/space-exploration/human-spaceflight/iss-astronaut-spots-artemis-2-moon-rocket-on-the-launch-pad-from-space-photo"
  },
  {
    "text": "Chicago weather forecast: Extreme Cold Warning Friday for Cook County, IL as dangerous polar plunge nears - abc7chicago.com",
    "fullText": "Metra will operate a reduced schedule on all its lines Friday.",
    "link": "https://abc7chicago.com/post/chicago-weather-forecast-extreme-cold-warning-friday-cook-county-il-dangerous-polar-plunge-nears/18447515/"
  },
  {
    "text": "Dow jumps 400 points as stocks rebound for a second day after Trump calls off Greenland-related tariffs: Live updates - CNBC",
    "fullText": "Major U.S. stock averages immediately jumped after President Donald Trump said he would no longer impose his new Europe tariffs that were set to begin Feb. 1.",
    "link": "https://www.cnbc.com/2026/01/21/stock-market-today-live-updates.html"
  },
  {
    "text": "Newsom shows off knee pads for CEOs 'selling out' to the Trump administration - CNBC",
    "fullText": "The Governor of California showed off knee pads that he suggested were for leaders \"selling out\" to the Trump administration, during an interview at Davos.",
    "link": "https://www.cnbc.com/2026/01/22/newsom-makes-knee-pads-for-ceos-selling-out-to-trump.html"
  },
  {
    "text": "Emma Stone Just Broke Oscar Nominations Records With Her ‘Bugonia’ Nods - hollywoodreporter.com",
    "fullText": "Stone was nominated in the best actress and best picture categories, the latter for her producer role on the film.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/emma-stone-oscar-nominations-records-1236480529/"
  },
  {
    "text": "‘Fake as F-ck’: The Wannabe Rock Star Accused of Scamming Streamers - Rolling Stone",
    "fullText": "Inside the first case of music-streaming fraud in the U.S., where prosecutors say musician Mike Smith used bots to earn millions in fake royalties.",
    "link": "http://www.rollingstone.com/music/music-features/streaming-fraud-fake-streams-mike-smith-1235500686/"
  }
]