[
  {
    "text": "Trump vetoes bipartisan bill to provide clean water to rural Southeastern Colorado - Colorado Public Radio",
    "fullText": "The legislation to complete the Arkansas Valley Conduit passed Congress with unanimous support but was branded an ‘expensive and unreliable’ project by the President.",
    "link": "https://www.cpr.org/2025/12/30/trump-vetoes-arkansas-river-valley-conduit-funding-bill/"
  },
  {
    "text": "Gold and silver see rollercoaster end to blockbuster year - BBC",
    "fullText": "The price of gold soared by more than 60% this year to hit a record high of more than $4,549.",
    "link": "https://www.bbc.com/news/articles/cp393nz95y5o"
  },
  {
    "text": "Illinois 30-28 Tennessee (Dec 30, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/college-football/recap?gameId\\\\u003d401778326"
  },
  {
    "text": "Isiah Whitlock: Veep and The Wire actor dies at 71 - BBC",
    "fullText": "Whitlock was known for his notably elongated, profane catchphrase, which he used on The Wire and in films.",
    "link": "https://www.bbc.com/news/articles/cwyw56687z3o"
  },
  {
    "text": "Body found amid search for missing Texas teen Camila Mendoza Olmos - CBS News",
    "fullText": "The body has not yet been identified, Texas officials said at a Tuesday news conference.",
    "link": "https://www.cbsnews.com/news/body-found-search-missing-texas-teen-camila-mendoza-olmos/"
  },
  {
    "text": "Train crash near Peru’s Machu Picchu kills driver, injures dozens - Al Jazeera",
    "fullText": "Train conductor killed in collision on rail line serving the famed archaeological site, authorities say.",
    "link": "https://www.aljazeera.com/news/2025/12/31/train-crash-near-perus-machu-picchu-kills-driver-injures-dozens"
  },
  {
    "text": "Trump administration says it's freezing child care funds to Minnesota - NPR",
    "fullText": "President Trump's administration announced that it's freezing child care funds to Minnesota after a series of fraud schemes in recent years.",
    "link": "https://www.npr.org/2025/12/30/g-s1-104049/trump-minnesota-child-care-funding-freeze-fraud-schemes"
  },
  {
    "text": "Former U.S. Sen. Ben Nighthorse Campbell dies - The Colorado Sun",
    "fullText": "Campbell was the first Native American to chair the committee and the only Native American to serve in the Senate during his two terms.",
    "link": "http://coloradosun.com/2025/12/30/ben-nighthorse-campbell-dies/"
  },
  {
    "text": "Trump sends ‘wartime prime minister’ Netanyahu back to Israel with a boost - The Washington Post",
    "fullText": "While meetings between the U.S. and Israeli leaders focused on pressing Middle East issues, for Prime Minister Netanyahu, they were also a domestic power play.",
    "link": "https://www.washingtonpost.com/world/2025/12/30/trump-netanyahu-iran-gaza/"
  },
  {
    "text": "Asia-Pacific markets open lower in year-end trade - CNBC",
    "fullText": "Asia-Pacific markets were poised for modest gains on the holiday-shortened and final trading day of the year.",
    "link": "https://www.cnbc.com/2025/12/31/asia-pacific-markets-hang-seng-index-nifty-50-csi-300.html"
  },
  {
    "text": "U.S. measles cases reach highest level in over 30 years, CDC reports - Axios",
    "fullText": "The U.S. will likely lose its globally recognized measles \"elimination status\" by Jan. 2026.",
    "link": "https://www.axios.com/2025/12/30/us-texas-measles-cases-cdc-vaccine-rfk-jr"
  },
  {
    "text": "Thieves drill into German bank vault and make off with millions - CNN",
    "fullText": "Thieves used the quiet Christmas period to drill their way into the vault of a German retail bank and make off with at least 10 million euros’ worth of money and valuables from customers’ deposit boxes, police said on Tuesday.",
    "link": "https://www.cnn.com/2025/12/30/europe/thieves-drill-into-german-bank-vault-and-make-off-with-millions-latam-intl"
  },
  {
    "text": "George Clooney Unloads on CBS Boss for ‘Dismantling’ Network - The Daily Beast",
    "fullText": "“I’m worried about how we inform ourselves and how we’re going to discern reality without a functioning press,” the actor said.",
    "link": "https://www.thedailybeast.com/obsessed/george-clooney-unloads-on-bari-weiss-for-dismantling-cbs-news/"
  },
  {
    "text": "Kennedy Center renaming prompts a new round of cancellations - AP News",
    "fullText": "The Kennedy Center is ending the year with a new round of artists saying they are canceling scheduled performances after President Donald Trump’s name was added to the facility. The institution’s president is accusing the performers of making their decisions …",
    "link": "https://apnews.com/article/kennedy-center-new-years-eve-canceled-db4bc44f0d95cb40f794f2cb737562a3"
  },
  {
    "text": "'It’s A Top Priority’: Unsealed Order Suggests DOJ Retaliated Against Abrego Garcia for Court Victory - Democracy Docket",
    "fullText": "Read more here.",
    "link": "https://www.democracydocket.com/news-alerts/trump-doj-retaliation-kilmar-abrego-garcia-court-order-reveals/"
  },
  {
    "text": "Flu cases are surging and rates will likely get worse, new CDC data shows - NPR",
    "fullText": "Flu season is off to a rough start this year, according to new CDC data. The virus is spreading faster than in previous years and the surge is likely to get worse. Here's what you need to know.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/12/30/nx-s1-5661508/flu-cdc-health"
  },
  {
    "text": "SNAP bans on soda, candy and other foods take effect in five states Jan. 1 - CNN",
    "fullText": "Starting Thursday, Americans in five states who get government help paying for groceries will see new restrictions on soda, candy and other foods they can buy with those benefits.",
    "link": "https://www.cnn.com/2025/12/30/health/snap-restrictions-begin"
  },
  {
    "text": "3 hikers found dead during search and rescue effort on Mount Baldy in California, authorities say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/3-hikers-found-dead-search-rescue-effort-mount/story?id\\\\u003d128787732"
  },
  {
    "text": "Patriots star receiver Stefon Diggs faces strangulation and assault charges - NBC News",
    "fullText": "Star New England Patriots wide receiver Stefon Diggs, who recently welcomed a baby boy with girlfriend Cardi B, was accused of felony strangulation, court records revealed.",
    "link": "https://www.nbcnews.com/sports/nfl/patriots-star-receiver-stefon-diggs-faces-strangulation-assault-charge-rcna251545"
  }
]