[
  {
    "text": "The DJI Romo robovac had security so poor, this man remotely accessed thousands of them - The Verge",
    "fullText": "A man discovered that thousands of DJI Romo robot vacuums had a security issue that could have let strangers look into owners’ homes and remotely control them.",
    "link": "https://www.theverge.com/tech/879088/dji-romo-hack-vulnerability-remote-control-camera-access-mqtt"
  },
  {
    "text": "Clingan and Hansen Both Prominent in NBA All-Star Rising Stars Challenge - Blazer's Edge",
    "fullText": "Two Trail Blazers stood tall at All-Star Weekend.",
    "link": "https://www.blazersedge.com/trail-blazers-news/109203/nba-rising-stars-challenge-2026-donovan-clingan-yang-hansen-stats-portland-trail-blazers-results"
  },
  {
    "text": "Prime Minister Carney and Canada's main opposition leader hold hands during school shooting vigil - AP News",
    "fullText": "Canadian Prime Minister Mark Carney and the country’s opposition leaders paid tribute to the victims of one of the worst mass shootings in the country’s history at a vigil in the devastated northern British Columbia town. Carney and Conservative Opposition le…",
    "link": "https://apnews.com/article/canada-school-shooting-vigil-carney-7d2d2ec8e302befe808f822432ed9a03"
  },
  {
    "text": "Trump tells soldiers to vote GOP in campaign-style rally at Fort Bragg - The Washington Post",
    "fullText": "Army policy prohibits partisan displays, and most service members refrained from cheering.",
    "link": "https://www.washingtonpost.com/politics/2026/02/13/trump-rally-gop-fort-bragg/"
  },
  {
    "text": "Penn State Dominates Ohio State, 36-5, In Battle of Nation’s Top Two Teams - Eleven Warriors",
    "fullText": "No. 1 Penn State dominates No. 2 Ohio State, 36-5, handing the Buckeyes their first loss of the season after a 17-0 start.",
    "link": "https://www.elevenwarriors.com/ohio-state-wrestling/2026/02/161567/penn-state-dominates-ohio-state-36-5-in-battle-of-nation-s-top-two-teams"
  },
  {
    "text": "2026 Daytona Speedweeks pit stall assignments - NASCAR.com",
    "fullText": "See 2026 Daytona Speedweeks pit stall assignments for NASCAR Cup, O'Reilly Auto Parts and Truck Series teams.",
    "link": "https://www.nascar.com/news-media/2026/02/13/2026-daytona-speedweeks-pit-stall-assignments/"
  },
  {
    "text": "WWE SmackDown Spoiler Lineup for February 13, 2026: Full Match Card and Backstage Notes Revealed - Ringside News",
    "fullText": "WWE SmackDown is set to deliver an exciting night of action on February 13, 2026 with a lineup featuring thrilling matches and intense rivalries. Fans can",
    "link": "https://www.ringsidenews.com/wwe-smackdown-spoiler-lineup-february-13-2026-full-match-card-backstage-notes-revealed/"
  },
  {
    "text": "What is the SAVE America Act that mandates voter ID? - BBC",
    "fullText": "Democrats say the legislation disenfranchises voters, while Republicans say it is necessary to stop voter fraud.",
    "link": "https://www.bbc.com/news/articles/crk845r4vlyo"
  },
  {
    "text": "WHO slams US-funded newborn vaccine trial as \"unethical\" - Ars Technica",
    "fullText": "CDC awarded $1.6 million for study birth dose of hepatitis B vaccine in Guinea-Bissau.",
    "link": "https://arstechnica.com/health/2026/02/who-slams-us-funded-newborn-vaccine-trial-as-unethical/"
  },
  {
    "text": "NBA All-Star 2026: Live updates, highlights through the weekend - ESPN",
    "fullText": "All of the live updates, top moments and results from NBA All-Star 2026 weekend in Los Angeles.",
    "link": "https://www.espn.com/nba/story/_/id/47900664/nba-all-star-weekend-2026-live-updates-results-highlights"
  },
  {
    "text": "Ukraine expects final IMF deal approval in coming weeks - Yahoo Finance",
    "fullText": "By Marc Jones and Karin Strohecker LONDON, Feb 13 (Reuters) - Ukraine expects its new $8.2 billion programme with the International Monetary Fund to be...",
    "link": "https://finance.yahoo.com/news/ukraine-expects-final-imf-deal-070236804.html"
  },
  {
    "text": "Mehmet Oz's vaccine call is 'too little, too late' - DW.com",
    "fullText": "Measles is still spreading in the US but calls from government officials for Americans to vaccinate now won’t be enough to keep the country from losing a quarter-century of success eradicating the disease.",
    "link": "https://www.dw.com/en/mehmet-oz-measles-vaccine-recommendation-case-numbers-increase-in-us-down-europe-central-asia/a-75951461"
  },
  {
    "text": "Meta says it won't chop the bottom 5% performers this year - Business Insider",
    "fullText": "Meta, led by CEO Mark Zuckerberg, says it will not conduct new performance-based layoffs, shifting from last year's 5% workforce reduction.",
    "link": "https://www.businessinsider.com/meta-says-no-performance-related-layoffs-planned-2026-2"
  },
  {
    "text": "Kim Kardashian’s Kids Have Reportedly Met Lewis Hamilton: ‘He’s Not Trying to Be Their Dad’ - Yahoo",
    "fullText": "Kim Kardashian’s kids are seemingly supportive of her relationship with Lewis Hamilton, according to a new report. In the Thursday, February 12 edition of Rob Shuter‘s Naughty But Nice substack, sources claimed the Skims founder, 45, has introduced the F1 Dri…",
    "link": "https://starmagazine.com/kim-kardashians-kids-have-reportedly-met-lewis-hamilton-hes-not-trying-to-be-their-dad/"
  },
  {
    "text": "Apple Now Testing Flip-Style Foldable iPhone - MacRumors",
    "fullText": "Apple is testing a different kind of foldable iPhone with a flip-style design, according to a known leaker based in Asia.    Citing supposedly...",
    "link": "https://www.macrumors.com/2026/02/13/apple-testing-flip-foldable-iphone/"
  },
  {
    "text": "‘Wuthering Heights’ Starts Valentine’s Day Weekend Affair With $3M Previews – Box Office - Deadline",
    "fullText": "Emerald Fennell's Wuthering Heights started its box office run with $3 million in Thursday previews.",
    "link": "http://deadline.com/2026/02/box-office-wuthering-heights-crime-101-goat-1236718755/"
  },
  {
    "text": "Rocket Report: Say cheerio to Orbex; China is getting good at booster landings - Ars Technica",
    "fullText": "You absolutely have to have a plan to compete with SpaceX on price.\"",
    "link": "https://arstechnica.com/space/2026/02/rocket-report-say-cheerio-to-orbex-china-is-getting-good-at-booster-landings/"
  },
  {
    "text": "Experts who worry about child vaccination need to look in the mirror - The Hill",
    "fullText": "All of us simply want to understand what is best for our children.",
    "link": "https://thehill.com/opinion/healthcare/5735208-experts-who-worry-about-child-vaccination-need-to-look-in-the-mirror/"
  }
]