[
  {
    "text": "Stock Market Today: Nasdaq Slumps Again as Jobs Data Collides With Tech Selloff — Live Updates - The Wall Street Journal",
    "fullText": "Follow along for live updates on markets and the top finance, economics and business stories. Plus the latest on the Dow, S&P 500 and Nasdaq.",
    "link": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-02-05-2026"
  },
  {
    "text": "France 36-14 Ireland: Les Bleus open Six Nations defence with thumping win in Paris - BBC",
    "fullText": "Ruthless France inflict more pain on Ireland as the Six Nations holders open their title defence with a bonus-point victory at a buoyant Stade de France.",
    "link": "https://www.bbc.com/sport/rugby-union/articles/c78v23v49jqo"
  },
  {
    "text": "DHS’ problems go farther than Minneapolis. Republicans are noticing. - Politico",
    "fullText": "From disaster response to bungled leadership at the nation’s cybersecurity agency, some Republicans are finding a lot more to critique than DHS’ immigration response.",
    "link": "https://www.politico.com/news/2026/02/05/noems-problems-go-beyond-the-ice-shootings-in-minneapolis-00767750"
  },
  {
    "text": "Live updates: Democrats demand ‘dramatic changes’ for ICE - AP News",
    "fullText": "Democrats are threatening to block soon-to-expire funding for DHS unless there is “real accountability” for U.S. Immigration and Customs Enforcement and other law enforcement agencies.",
    "link": "https://apnews.com/live/donald-trump-news-updates-2-5-2026"
  },
  {
    "text": "Adult with measles visited grocery stores, restaurant, animal shelter in Northern Virginia - WTOP",
    "fullText": "An adult from Northern Virginia has contracted measles, marking the commonwealth’s fifth case of the contagious virus this year.",
    "link": "https://wtop.com/virginia/2026/02/adult-with-measles-visited-grocery-stores-restaurant-animal-shelter-in-northern-virginia/"
  },
  {
    "text": "The White House is launching direct-to-consumer drug site Trump Rx. Here's what to know - CNBC",
    "fullText": "It's still unclear if all patients, particularly those with insurance coverage, will see more cost savings from using that site to buy their medicines.",
    "link": "https://www.cnbc.com/2026/02/05/trump-rx-white-house-launches-direct-to-consumer-drug-site.html"
  },
  {
    "text": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "fullText": "The New START deal was the last vestige of arms control between the world’s largest superpowers.",
    "link": "https://www.politico.com/news/2026/02/05/trump-nuclear-arms-treaty-russia-00767497"
  },
  {
    "text": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History - Rolling Stone",
    "fullText": "Melania Trump's new documentary is now the film with the biggest disparity between critic and audience reviews in Rotten Tomatoes history.",
    "link": "http://www.rollingstone.com/politics/politics-news/melania-trump-doc-reviews-rotten-tomatoes-1235511549/"
  },
  {
    "text": "Will Tesla join the fold? Predicting a triple merger with SpaceX and xAI - Teslarati",
    "fullText": "With the news of a merger between SpaceX and xAI being confirmed earlier this week by CEO Elon Musk directly, the first moves of an umbrella company that combines all of the serial tech entrepreneur’s companies have been established. The move aims to combine …",
    "link": "https://www.teslarati.com/will-tesla-join-fold-predicting-triple-merger-spacex-xai/"
  },
  {
    "text": "Measles outbreak in Mexico prompts health alert in World Cup host Jalisco - ABC News",
    "fullText": "The Mexican state of Jalisco has issued a health alert and mandated face masks in schools due to a measles outbreak in the state capital",
    "link": "https://abcnews.go.com/Health/wireStory/measles-outbreak-mexico-prompts-health-alert-world-cup-129892256"
  },
  {
    "text": "Rangers ready to 'move on' following Panarin trade to Kings - NHL.com",
    "fullText": "Host Hurricanes on Thursday in 1st game since dealing star forward",
    "link": "https://www.nhl.com/news/new-york-ready-to-move-on-following-artemi-panarin-deal-to-los-angeles"
  },
  {
    "text": "Google hints at big AirDrop expansion for Android \"very soon\" - Ars Technica",
    "fullText": "AirDrop came to the Pixel 10 last year, and more Android phones will join the party in 2026.",
    "link": "https://arstechnica.com/gadgets/2026/02/google-hints-at-big-airdrop-expansion-for-android-very-soon/"
  },
  {
    "text": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo",
    "fullText": "A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.",
    "link": "https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421"
  },
  {
    "text": "Here's what smart people are saying about recent fears of a software apocalypse - Business Insider",
    "fullText": "Jensen Huang called the sell-off \"the most illogical thing in the world.\" He's not the only one who has qualms with Wall Street's reaction.",
    "link": "https://www.businessinsider.com/software-selloff-reactions-jensen-huang-steven-sinofsky-arm-ceo-2026-2"
  },
  {
    "text": "Snag the budget-friendly Nothing Ear (a) wireless earbuds for their lowest price yet - Mashable",
    "fullText": "Plus, get ChatGPT support for chats right in your ear.",
    "link": "https://mashable.com/article/feb-5-nothing-ear-a-wireless-earbuds-deal"
  },
  {
    "text": "Dark matter, not a black hole, could power Milky Way's heart - Phys.org",
    "fullText": "Our Milky Way galaxy may not have a supermassive black hole at its center but rather an enormous clump of mysterious dark matter exerting the same gravitational influence, astronomers say. They believe this invisible substance—which makes up most of the unive…",
    "link": "https://phys.org/news/2026-02-dark-black-hole-power-milky.html"
  },
  {
    "text": "Health officials warn of possible measles exposure in Collegeville, Pennsylvania - 6abc Philadelphia",
    "fullText": "Health officials are warning the public of a possible measles exposure in Montgomery County.",
    "link": "https://6abc.com/post/health-officials-warn-possible-measles-exposure-collegeville-pennsylvania/18547385/"
  },
  {
    "text": "Some Public Health Service officers quit rather than serve in ICE detention centers - NPR",
    "fullText": "A special corps of health care workers have been called in to work with detained immigrants and many feel deeply conflicted about the assignment, saying they're not able to provide good care.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5698538/public-health-service-ice-detention-centers"
  },
  {
    "text": "Famine is threatening more of war-torn Sudan’s Darfur region as an attack in the south kills 22 - AP News",
    "fullText": "A global hunger monitoring group says that famine is threatening more areas in war-torn Sudan’s western Darfur region, where acute malnutrition has been registered in two more towns there. The group did not confirm a full famine in those towns. The report by …",
    "link": "https://apnews.com/article/sudan-famine-rsf-kordofan-darfur-war-hunger-9b16a0419f8d7cc67c7e95939a8a954d"
  }
]