[
  {
    "text": "Trump threatens Canada with 100% tariff over China trade talks - BBC",
    "fullText": "Trump made the threat in a social media post as tensions rise between the US and its northern neighbour.",
    "link": "https://www.bbc.com/news/articles/cy4qww3w72lo"
  },
  {
    "text": "Browns are using essays, homework, personality tests in coaching search - NBC Sports",
    "fullText": "As a wise man once said, \"The Browns is the Browns.\"",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/browns-are-using-essays-homework-personality-tests-in-coaching-search"
  },
  {
    "text": "Mike McDaniel cancels Bills interview, too - NBC Sports",
    "fullText": "Former Dolphins coach has now passed on two potential head-coaching jobs.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/mike-mcdaniel-cancels-bills-interview-too"
  },
  {
    "text": "Heavy snow and rainfall kill 61, injure 110 over 3 days in Afghanistan, authorities say - ABC News",
    "fullText": "Heavy snow and rainfall over the past three days have killed more than 60 people and injured over 100 across Afghanistan, the country’s disaster management authority says, as authorities in the impoverished country struggle to open roads and gain acces...",
    "link": "https://abcnews.go.com/International/wireStory/heavy-snow-rainfall-kill-61-injure-110-3-129516125"
  },
  {
    "text": "Toyota recalls 162,000 trucks over faulty screens - ABC News",
    "fullText": "Toyota announced Friday it would recall about 162,000 pickup trucks in the United States after it was discovered that the vehicles’ multimedia displays could compromise driver safety",
    "link": "https://abcnews.go.com/Technology/wireStory/toyota-recalls-162000-trucks-faulty-screens-129516502"
  },
  {
    "text": "How Soviet urban planning is helping Russia freeze Ukraine - BBC",
    "fullText": "Thousands of people are affected when heating plants are targeted by Russian forces.",
    "link": "https://www.bbc.com/news/articles/c338jpk8r1vo"
  },
  {
    "text": "Did everyone forget about DeepSeek? What Wall Street is getting wrong about Chinese AI. - MarketWatch",
    "fullText": "Shares of U.S. hyperscalers seem to have put DeepSeek in the rearview mirror. But if you look closely, a different story emerges.",
    "link": "https://www.marketwatch.com/story/did-everyone-forget-about-deepseek-what-wall-street-is-getting-wrong-about-chinese-ai-62cb8bcf"
  },
  {
    "text": "‘Legal system in Pakistan is dead’: Condemnations pour in after Imaan, Hadi sentenced in social media posts case - Dawn",
    "fullText": "“This decision is contrary to the fundamental principles of judicial independence,\" says TTAP.",
    "link": "https://www.dawn.com"
  },
  {
    "text": "Gemini with Personal Intelligence is awfully familiar - The Verge",
    "fullText": "Google’s Gemini chatbot can now access your personal information at will, but it still struggles once you get down to the details.",
    "link": "https://www.theverge.com/tech/866931/gemini-personal-intelligence-ai"
  },
  {
    "text": "From Davos to Minneapolis to D.C., Trump is facing sharper pushback - The Washington Post",
    "fullText": "Foreign leaders, Catholic archbishops and the Federal Reserve chairman are among those challenging Trump after a first year in which the president’s critics often tried to placate him.",
    "link": "https://www.washingtonpost.com/politics/2026/01/24/trump-resistance-davos-minneapolis-greenland/"
  },
  {
    "text": "Elvis Tipan Echeverria: 2-year-old taken into ICE custody with father in Minnesota and flown to Texas, lawyer says - CNN",
    "fullText": "A 2-year-old girl was taken into ICE custody with her father on Thursday in Minneapolis and flown to Texas before she was returned to her mother Friday afternoon, a family lawyer said.",
    "link": "https://www.cnn.com/2026/01/24/us/elvis-tipan-echeverria-toddler-ice-arrest-minnesota"
  },
  {
    "text": "How a fiery Scott Bessent calmed market nerves over Greenland - CNN",
    "fullText": "Scott Bessent was everywhere in Davos.",
    "link": "https://www.cnn.com/2026/01/24/politics/scott-bessent-trump-greenland-davos"
  },
  {
    "text": "He hasn't thrown a pass since 2023. Now a team's Super Bowl hopes hinge on his arm. - NBC News",
    "fullText": "In the recesses of the stadium, a doctor examined the right ankle of Bo Nix, the Broncos’ starting quarterback.",
    "link": "https://www.nbcnews.com/sports/nfl/jarrett-stidham-denver-broncos-afc-championship-rcna255454"
  },
  {
    "text": "Samsung Galaxy S26: The 7 rumored features that could make me switch - Mashable",
    "fullText": "I've been an iPhone user for a long time, but these features could make me defect from Apple-land.",
    "link": "https://mashable.com/article/samsung-galaxy-s26-features-switch-from-iphone"
  },
  {
    "text": "'Sell America' has sparked a FOMO-fueled rush to gold and silver among everyday investors - Business Insider",
    "fullText": "Precious metals markets saw record inflows in 2025, with investors reacting to US economic volatility, tariffs, and \"Sell America\" sentiment.",
    "link": "https://www.businessinsider.com/gold-rush-silver-price-record-rally-sell-america-retail-investors-2026-1"
  },
  {
    "text": "Danish troops who fought alongside US forces feel betrayed, as Trump threatens Greenland and denigrates NATO - CNN",
    "fullText": "“It’s very disrespectful.”",
    "link": "https://www.cnn.com/2026/01/24/europe/greenland-denmark-veterans-trump-disrespect-intl"
  },
  {
    "text": "Adult with measles visited high school in Clark County while contagious, officials say - kptv.com",
    "fullText": "Clark County Public Health says an adult with a confirmed case of measles was at a local high school while they were contagious.",
    "link": "https://www.kptv.com/2026/01/24/adult-with-measles-visited-high-school-clark-county-while-contagious-county-officials-say/"
  },
  {
    "text": "Former TNA Knockouts Champion Confirmed For 2026 Royal Rumble Match - Ringside News",
    "fullText": "WWE showed up in Montreal for their January 23 episode of SmackDown. With the Royal Rumble coming up on January 31, the show included a huge announcement",
    "link": "https://www.ringsidenews.com/former-tna-knockouts-champion-confirmed-2026-royal-rumble-match/"
  },
  {
    "text": "Tragic chapter on the trains sends rail superpower Spain into crisis - BBC",
    "fullText": "Spain's vaunted reputation for its high-speed network has been humbled by disaster on the railways.",
    "link": "https://www.bbc.com/news/articles/c0keelnyrvro"
  }
]