[
  {
    "text": "Raiders relieve Pete Carroll of duties as head coach - Raiders.com",
    "fullText": "",
    "link": "https://www.raiders.com/news/raiders-relieve-pete-carroll-of-duties-as-head-coach"
  },
  {
    "text": "Committee Releases Conferenced CJS, E&W, and Interior Bills - House Committee on Appropriations (.gov)",
    "fullText": "Washington, D.C. – Continuing its work to advance regular order and deliver results for the American people, the House Appropriations Committee today released the Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropria…",
    "link": "http://appropriations.house.gov/news/press-releases/committee-releases-conferenced-cjs-ew-and-interior-bills"
  },
  {
    "text": "Pentagon to cut Sen. Mark Kelly's military retirement pay over 'seditious' video: Hegseth - CNBC",
    "fullText": "Sen. Mark Kelly and other members of Congress on the video reminded members of the U.S. military that they can refuse to follow illegal orders.",
    "link": "https://www.cnbc.com/2026/01/05/pentagon-mark-kelly-video-hegseth.html"
  },
  {
    "text": "Column | You’re probably not eating enough fiber. Here’s what to do about it. - The Washington Post",
    "fullText": "How much fiber do you need, and how can you get more of it into your diet?",
    "link": "https://www.washingtonpost.com/food/2026/01/05/fiber-fibermaxxing-food-supplements/"
  },
  {
    "text": "Amazon revamps Fire TV, launches its own ‘Artline’ televisions with frames at CES - TechCrunch",
    "fullText": "Fire TV's new interface focuses on your content and offers easier, speedier navigation, Amazon says.",
    "link": "https://techcrunch.com/2026/01/05/amazon-revamps-fire-tv-launches-its-own-artline-televisions-with-frames/"
  },
  {
    "text": "Amazon’s AI assistant comes to the web with Alexa.com - TechCrunch",
    "fullText": "Amazon is bringing Alexa+ to the web with a new Alexa.com site, expanding its AI assistant beyond devices and positioning it as a family-focused, agent-style chatbot.",
    "link": "https://techcrunch.com/2026/01/05/alexa-without-an-echo-amazons-ai-chatbot-comes-to-the-web-and-a-revamped-alexa-app/"
  },
  {
    "text": "Browns relieve Kevin Stefanski of duties as head coach - Cleveland Browns",
    "fullText": "Cleveland finished the 2025 season 5-12",
    "link": "https://www.clevelandbrowns.com/news/browns-relieve-kevin-stefanski-of-duties-as-head-coach"
  },
  {
    "text": "How did life begin on Earth? New experiments support 'RNA world' hypothesis - Space",
    "fullText": "A giant impact on the early Earth could have brought the building blocks of RNA to our planet, which new research suggests could have quickly formed in the presence of compounds called borates.",
    "link": "https://www.space.com/space-exploration/search-for-life/how-did-life-begin-on-earth-new-experiments-support-rna-world-hypothesis"
  },
  {
    "text": "Chick-fil-A Kicks Off Year of “Newstalgia” Celebrations with Golden Fan Cup Sweepstakes - Chick-fil-A",
    "fullText": "New collectible Classic Cups are here – and they could score you free Chick-fil-A for a year and Frosted Sodas and Floats join menus permanently.",
    "link": "https://www.chick-fil-a.com/press-room/chick-fil-a-launches-collectible-classic-cups-and-yearlong-celebration"
  },
  {
    "text": "Man arrested for damage at Vice President JD Vance's house, Secret Service says - WCPO 9 Cincinnati",
    "fullText": "Law enforcement agencies, including Cincinnati police and the U.S. Secret Service, are investigating at Vice President JD Vance's Cincinnati home early Monday morning.",
    "link": "https://www.wcpo.com/news/local-news/law-enforcement-investigate-at-vice-president-jd-vances-home-1-in-custody"
  },
  {
    "text": "Wegovy daily pill now available: How to get it, how much it costs - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Wellness/wegovy-daily-pill-now-costs/story?id\\\\u003d128898797"
  },
  {
    "text": "The Oil Sector’s Biggest Winners and Losers From Venezuela Regime Change - Barron's",
    "fullText": "",
    "link": "https://www.barrons.com/articles/oil-stocks-venezuela-maduro-regime-change-winners-losers-a83f73d6"
  },
  {
    "text": "Capitol agenda: Congress confronts Venezuela fallout - Politico",
    "fullText": "Marco Rubio, Pete Hegseth and other administration officials will brief top lawmakers Monday.",
    "link": "https://www.politico.com/live-updates/2026/01/05/congress/venezuela-maduro-rubio-briefing-trump-war-powers-00710422"
  },
  {
    "text": "Caribbean travel disruptions leave local families stranded after Venezuela operation - 6abc Philadelphia",
    "fullText": "Although flight restrictions following the mission in Venezuela have been lifted, travelers say the ripple effects continue to upend plans across the Caribbean.",
    "link": "https://6abc.com/post/caribbean-travel-disruptions-leave-local-families-stranded-venezuela-operation/18354763/"
  },
  {
    "text": "Versant CEO Touts “Scale, Strategy and Leadership to Grow” as Comcast Completes Separation - The Hollywood Reporter",
    "fullText": "The owner of MSNBC and CNBC will start trading on the Nasdaq under the ticker symbol VSNT.",
    "link": "http://www.hollywoodreporter.com/business/business-news/comcast-versant-media-separation-complete-1236464232/"
  },
  {
    "text": "Our annual power ranking of US rocket companies has changes near the top and bottom - Ars Technica",
    "fullText": "There are some fresh faces entering the rankings this year.",
    "link": "https://arstechnica.com/space/2026/01/theres-a-big-shake-up-near-the-top-of-our-annual-us-launch-company-rankings/"
  },
  {
    "text": "Evangeline Lilly says she has brain damage after hitting her head on rock - CNN",
    "fullText": "Evangeline Lilly says she has brain damage, months after fainting and hitting her head on a rock while at the beach.",
    "link": "https://www.cnn.com/2026/01/05/entertainment/evangeline-lilly-brain-damage-intl-scli"
  },
  {
    "text": "Holocaust survivor Eva Schloss, stepsister of Anne Frank, dies at 96 - ABC News",
    "fullText": "Auschwitz survivor Eva Schloss, stepsister of Anne Frank, has died at 96",
    "link": "https://abcnews.go.com/International/wireStory/holocaust-survivor-eva-schloss-stepsister-anne-frank-dies-128904138"
  },
  {
    "text": "Mike Tomlin: This was the vision when we signed Aaron Rodgers - NBC Sports",
    "fullText": "The Steelers defense gave up a pair of long touchdown catches to Ravens wide receiver Zay Flowers in the fourth quarter of Sunday night's game and that meant quarterback Aaron Rodgers had to come up with a pair of answers for the team to have a shot at winnin…",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/mike-tomlin-this-was-the-vision-when-we-signed-aaron-rodgers"
  }
]