[
  {
    "text": "Sources: Packers bringing back Matt LaFleur on multiyear deal - ESPN",
    "fullText": "The Packers are keeping Matt LaFleur as head coach on a multiyear extension that represents a \"real commitment,\" sources told ESPN.",
    "link": "https://www.espn.com/nfl/story/_/id/47644339/sources-packers-bringing-back-matt-lafleur-multiyear-deal"
  },
  {
    "text": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
    "fullText": "The two men’s eyewitness accounts of the Jan. 3 death of Geraldo Lunas Campos at a Texas detention camp differ from the Department of Homeland Security’s account of the incident.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/17/detainee-death-witnesses-deported-dhsa/"
  },
  {
    "text": "Lucas: Cal Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the visit to Cal.",
    "link": "https://goheels.com/news/2026/1/17/mens-basketball-lucas-cal-rapid-reactions"
  },
  {
    "text": "Patriots rooting guide for divisional round: Saturday edition - Pats Pulpit",
    "fullText": "Who Patriots fans should be rooting for in the second round of the NFL playoffs.",
    "link": "https://www.patspulpit.com/new-england-patriots-opinion/119465/rooting-guide-nfl-divisional-round"
  },
  {
    "text": "March led by pardoned Jan. 6 rioter in Minneapolis ends in scuffle - The Washington Post",
    "fullText": "The right-wing provocateur known for incendiary rhetoric and his 10 or so supporters were outnumbered by a large crowd of counterprotesters in Minneapolis.",
    "link": "https://www.washingtonpost.com/nation/2026/01/17/minneapolis-protests-jake-lang-somali/"
  },
  {
    "text": "‘Sentimental Value’ Sweeps European Film Awards - The Hollywood Reporter",
    "fullText": "'Sentimental Value' took best film, Joachim Trier won best director, and Stellan Skarsgard and Renate Reinsve scooped best actor and best actress honors.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/european-film-award-winners-1236477120/"
  },
  {
    "text": "Starmer brands Trump's plan to apply tariffs over Greenland 'completely wrong' - BBC",
    "fullText": "The US president says the UK, Denmark and other European countries will be charged a \"10% tariff on any or all goods\" exported to the US from 1 February.",
    "link": "https://www.bbc.com/news/live/c1j8kw866p3t"
  },
  {
    "text": "Curtis Samuel, Ed Oliver active for Bills vs. Broncos - NBC Sports",
    "fullText": "Bills wide receiver Curtis Samuel and defensive tackle Ed Oliver are good to go today against the Broncos.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/curtis-samuel-ed-oliver-active-for-bills-vs-broncos"
  },
  {
    "text": "‘Heavy’ snow could impact parts of central Georgia, metro Atlanta mostly spared - AJC.com",
    "fullText": "The state’s best chance for snow comes overnight Saturday into Sunday afternoon along a diagonal line from Columbus to Macon to Warrenton, the National Weather Service says.",
    "link": "https://www.ajc.com/news/2026/01/heavy-snow-could-impact-parts-of-central-georgia-metro-atlanta-mostly-spared/"
  },
  {
    "text": "Justice Dept. enters new territory with probe of Minnesota officials - The Washington Post",
    "fullText": "The agency is targeting critics during a moment of crisis in which protesters are clashing with federal agents on icy city streets.",
    "link": "https://www.washingtonpost.com/politics/2026/01/17/trump-walz-frey-investigation-minnesota-justice-department/"
  },
  {
    "text": "Abigail Spanberger becomes Virginia’s 1st female governor in historic inauguration - Politico",
    "fullText": "Her swearing-in marks a new political chapter in the commonwealth, with Democrats pulling the levers of power in state government.",
    "link": "https://www.politico.com/news/2026/01/17/abigail-spanberger-becomes-virginias-1st-female-governor-in-historic-inauguration-00735529"
  },
  {
    "text": "RFK-backed infant vaccine study in Africa to proceed despite backlash, U.S. says - The Washington Post",
    "fullText": "U.S. funding for a study on the timing of hepatitis B vaccine doses in infants in Guinea-Bissau has sparked confusion and ethics concerns.",
    "link": "https://www.washingtonpost.com/world/2026/01/17/rfk-vaccine-trump-hepatitis-b-guinea-bissau-infant-trial/"
  },
  {
    "text": "Cases of 'AI Psychosis' Are Being Reported. How Dangerous Is It? - ScienceAlert",
    "fullText": "Artificial intelligence is increasingly woven into everyday life, from chatbots that offer companionship to algorithms that shape what we see online.",
    "link": "https://www.sciencealert.com/should-we-be-taking-reports-of-ai-psychosis-seriously-an-expert-explains"
  },
  {
    "text": "Soaring Electricity Costs Are Now a Hot Political Issue - The Wall Street Journal",
    "fullText": "Electricity-cost increases are outpacing other kinds of inflation, putting utility bills in the spotlight ahead of the midterms",
    "link": "https://www.wsj.com/business/energy-oil/soaring-electricity-costs-are-now-a-hot-political-issue-d0319a1d"
  },
  {
    "text": "Grookey Community Day: Your Go-To PvE Guide - Pokémon GO Hub",
    "fullText": "Hello Trainers! 2026's first Community Day is up and coming, with the starter Pokémon of Galar region: Chimp Pokémon Grookey being the featured Pokémon. Evolve Thwackey (Grookey's evolution) during the event or up to four hours afterwards to get a Rillaboom t…",
    "link": "https://pokemongohub.net/post/meta/grookey-community-day-your-go-to-pve-guide/"
  },
  {
    "text": "Trump to POLITICO: ‘It’s time to look for new leadership in Iran’ - Politico",
    "fullText": "Trump, after being read a series of hostile X posts from Iran’s Supreme Leader, said the Ayatollah is guilty of “the complete destruction of his country.”",
    "link": "https://www.politico.com/news/2026/01/17/trump-to-politico-its-time-to-look-for-new-leadership-in-iran-00735528"
  },
  {
    "text": "Five graphics that show Greenland’s importance to Trump - DW.com",
    "fullText": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
    "link": "https://www.dw.com/en/five-graphics-that-show-greenlands-importance-to-trump/a-75547831"
  },
  {
    "text": "Top 10 Most Wishlisted Strategy Games On Steam In 2026 - Strategy and Wargaming",
    "fullText": "Explore the 10 most wishlisted strategy games on Steam in 2026, featuring Slay the Spire 2, Total War: Warhammer 40,000, and more.",
    "link": "https://strategyandwargaming.com/2026/01/17/top-10-most-wishlisted-strategy-games-on-steam-in-2026/"
  }
]