[
  {
    "text": "Trump tariffs live updates: EU discusses $108 billion in retaliatory tariffs; Danish PM says Europe 'will not be blackmailed' - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-eu-discusses-108-billion-in-retaliatory-tariffs-danish-pm-says-europe-will-not-be-blackmailed-152657886.html"
  },
  {
    "text": "FBI opened probe on Minneapolis shooting; none exists now, Justice Dept. says - The Washington Post",
    "fullText": "After the death of Renée Good in Minneapolis, FBI agents launched a civil rights probe into the shooting. The Justice Department says no such case now exists.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/18/fbi-minnesota-shooting-civil-rights-investigation/"
  },
  {
    "text": "Rams end the Bears’ magical run and the Patriots ease past the Texans to set up NFL’s final four - CNN",
    "fullText": "The Rams and Patriots are moving on to the conference championship round after victories on Sunday in the NFL playoffs",
    "link": "https://www.cnn.com/sport/live-news/nfl-playoffs-texans-patriots-rams-bears-01-18-26"
  },
  {
    "text": "Patriots favored by 4.5 at Broncos in AFC Championship Game - NBC Sports",
    "fullText": "The Patriots will be road favorites in Denver in next weekend's AFC Championship Game.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/patriots-favored-by-4-5-at-broncos-in-afc-championship-game"
  },
  {
    "text": "Erie County issues a travel advisory as major winter storm approaches - WGRZ",
    "fullText": "Erie County will be under a Travel Advisory starting at 10 tonight as a long-duration winter storm moves into the region.",
    "link": "https://www.wgrz.com/article/weather/weather-impact/erie-county-issues-travel-advisory-winter-storm-approaches/71-90adaba1-894e-46de-a474-f1f7775163dd"
  },
  {
    "text": "Man detained in Minneapolis dies in ICE custody in Texas - MPR News",
    "fullText": "A man arrested by immigration officials in Minneapolis died in federal detention in Texas.",
    "link": "https://www.mprnews.org/story/2026/01/18/man-detained-in-minneapolis-dies-in-ice-custody-in-texas"
  },
  {
    "text": "Why Seahawks defense’s fourth-down stops were critical vs. 49ers | Four Downs - The Seattle Times",
    "fullText": "How big were the Seahawks' fourth-down stops vs. the 49ers? And what advice did Grey Zabel give Leonard Williams before his fourth-down sack?",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-defenses-fourth-down-stops-critical-vs-49ers-four-downs/"
  },
  {
    "text": "Canada’s Tariff Cut Just Made This High-Tech Chinese EV 50% Cheaper - InsideEVs",
    "fullText": "A high-end electric performance SUV that's made in China is about to get dramatically cheaper for Canadians.",
    "link": "https://insideevs.com/news/784754/lotus-eletre-price-cut-canada-tariff-chinese-evs/"
  },
  {
    "text": "EXCLUSIVE: Xbox Cloud Gaming is getting ad-supported access VERY soon - Windows Central",
    "fullText": "Users have been noticing that Xbox Cloud Gaming has begun referencing \"ad support\" while launching games.",
    "link": "https://www.windowscentral.com/gaming/xbox/exclusive-xbox-cloud-gaming-will-get-an-ad-supported-tier-this-year-rumors-coalesce-after-ad-support-notices-appear-prematurely"
  },
  {
    "text": "Center left wins Portugal presidential election first round, setting up showdown with far right - politico.eu",
    "fullText": "António José Seguro will face far-right leader André Ventura in a runoff ballot Feb. 8.",
    "link": "https://www.politico.eu/article/far-right-wins-portugal-presidential-election-first-round-exit-poll-says/"
  },
  {
    "text": "Here’s why Walmart still doesn’t support Apple Pay - 9to5Mac",
    "fullText": "Walmart still doesn’t accept Apple Pay (or any NFC tap-to-pay) in U.S. stores. Here are a few reasons why it doesn't.",
    "link": "https://9to5mac.com/2026/01/18/heres-why-walmart-still-doesnt-support-apple-pay/"
  },
  {
    "text": "7 police officers killed in attacks in Guatemala after prison crackdown on gangs - CBS News",
    "fullText": "The killings occurred a day after gang member inmates took 46 people hostage in three prisons across the country, officials said.",
    "link": "https://www.cbsnews.com/news/police-officers-killed-guatemala-prison-crackdown/"
  },
  {
    "text": "‘Avatar: Fire And Ash’ Hits $1.3B, ‘Housemaid’ Paul Feig’s 2nd Highest Grossing Pic, ’28 Years Later: Bone Temple’ $31M WW Debut – Global Box Office - Deadline",
    "fullText": "The MLK weekend box office might have been sleep in the U.S., but overseas, Disney continued to reign with milestones, Zootopia 2, as we just told you becoming the highest grossing MPA animated movie ever with $1.7 billion, but also James Cameron’s Avatar: Fi…",
    "link": "http://deadline.com/2026/01/box-office-global-avatar-fire-and-ash-28-years-later-bone-temple-1236689254/"
  },
  {
    "text": "Colin Jost Reacts to Wife Scarlett Johansson Losing Top-Grossing Title - Yahoo",
    "fullText": "Colin Jost hilariously reacted to Zoe Saldaña surpassing his wife Scarlett Johansson as the highest-grossing star of all time during the Jan. 17 episode of...",
    "link": "https://www.eonline.com/news/1427471/colin-jost-on-scarlett-johansson-replaced-as-highest-grossing-star?cmpid=sn-syndicate-aolfeed-us-"
  },
  {
    "text": "Microsoft’s first Windows 11 update of 2026 stopped some computers from shutting down - The Verge",
    "fullText": "Microsoft was forced to release an emergency update after the first Windows 11 update of 2026 stopped some computers from shutting down or hibernating.",
    "link": "https://www.theverge.com/news/864032/microsofts-out-of-band-windows-11-update-bug"
  },
  {
    "text": "Why is flu season so bad this year? - Live Science",
    "fullText": "Flu season in the U.S. is particularly bad this year, and a new branch of the flu family tree may be to blame.",
    "link": "https://www.livescience.com/health/flu/why-is-flu-season-so-bad-this-year"
  },
  {
    "text": "Opening & Matches Revealed for January 19 WWE RAW - Ringside News",
    "fullText": "WWE is stacking the deck for this Monday’s RAW, and it’s all going down on Netflix starting at 3 PM ET. Gunther is slated to open the show, as confirmed",
    "link": "https://www.ringsidenews.com/opening-matches-revealed-january-19-wwe-raw/"
  },
  {
    "text": "German Soldiers Leave Greenland After 44 Hours, Bild Reports - Bloomberg.com",
    "fullText": "The German military reconnaissance team that arrived in Greenland on Friday is on its way back after a 44-hour deployment on the Arctic island, Bild newspaper reported on Sunday.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-18/german-soldiers-leave-greenland-after-44-hour-stay-bild-reports"
  }
]