[
  {
    "text": "Report: Vic Fangio considered retiring, is currently expected back with Eagles - NBC Sports",
    "fullText": "The Eagles hired a new offensive coordinator last week and they've also reportedly spent some time considering defensive coordinator options since the end of their season as well.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/report-vic-fangio-considered-retiring-is-currently-expected-back-with-eagles"
  },
  {
    "text": "French tech giant Capgemini to sell US subsidiary working for ICE - BBC",
    "fullText": null,
    "link": "https://www.bbc.com/news/articles/cd9e4xw8vqqo"
  },
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test - Space",
    "fullText": "Sunday, Feb. 1, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-1-2026"
  },
  {
    "text": "Kylie Jenner and Travis Scott Celebrate Stormi and Aire's Birthday Bash - TMZ",
    "fullText": "Travis Scott and Kylie Jenner know how to throw a party ... and their kids' joint birthday celebration was nothing short of epic.",
    "link": "https://www.tmz.com/2026/02/01/travis-scott-kylie-jenner-celebrate-stormi-aire-birthday/"
  },
  {
    "text": "These Are The Best Car Tires Of 2026, According To Consumer Reports - Jalopnik",
    "fullText": "Of the millions of components that make cars go and stop with performance and comfort, tires are the only ones that actually touch the road.",
    "link": "https://www.jalopnik.com/2086618/best-car-tires-2026-consumer-reports/"
  },
  {
    "text": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
    "fullText": "Medical charity Medicine Sans Frontières said it would not share the list as it had not been able to ensure staff would remain safe.",
    "link": "https://www.bbc.com/news/articles/cvg1ymmkpkro"
  },
  {
    "text": "We asked retired astronauts about their favorite space movies, and this is what they shared with us - CNN",
    "fullText": "Ahead of the launch of Artemis II, the first crewed mission to the moon in more than 50 years, astronauts share the movies that capture the danger, teamwork, and wonder of spaceflight. Their picks offer cinematic glimpses into the real challenges and triumphs…",
    "link": "https://www.cnn.com/2026/02/01/entertainment/astronauts-favorite-space-movies"
  },
  {
    "text": "Leftist and liberal gun groups are seeing a rush of new members - CNN",
    "fullText": "Several niche, left-leaning gun advocacy groups said that since Alex Pretti was killed, they can hardly keep up with the surging demand for firearms training: “People join when they’re scared,” said Philip Smith, founder of the National African American Gun A…",
    "link": "https://www.cnn.com/2026/02/01/us/gun-rights-politics-alex-pretti-killing-cec"
  },
  {
    "text": "Eyes to the Skies for February: Rocket launch, winter constellations, eclipse and more - WTOP",
    "fullText": "NASA has scheduled the launch for the Artemis II moon rocket for no earlier than Feb. 8. WTOP will have details on the mission as they become available.",
    "link": "https://wtop.com/the-space-place/2026/02/eyes-to-the-skies-for-february-rocket-launch-winter-constellations-eclipse-and-more/"
  },
  {
    "text": "RFK Jr. is now a wellness guru for Republicans in Washington - Politico",
    "fullText": "Conservatives in the capital are taking up the health secretary’s advice, eating their vegetables and eschewing pharmaceuticals.",
    "link": "https://www.politico.com/news/2026/02/01/rfk-wellness-republicans-maha-washington-dc-00757417"
  },
  {
    "text": "WWE Royal Rumble 2026 Results, Winners, Live Grades, Reaction and Highlights - Bleacher Report",
    "fullText": "Welcome to Bleacher Report's live coverage of the 2026 WWE Royal Rumble in Riyadh, Saudi Arabia.",
    "link": "https://bleacherreport.com/articles/25379215-wwe-royal-rumble-2026-results-winners-live-grades-reaction-and-highlights"
  },
  {
    "text": "'Normal life has disappeared': Russia's energy offensive plunges Ukraine into dark and bitter cold - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/normal-life-disappeared-russias-energy-offensive-plunges-ukraine/story?id\\\\u003d129557876"
  },
  {
    "text": "Chan Zuckerberg Initiative cut 70 jobs to go all in on mission to 'cure or prevent all disease' - Fortune",
    "fullText": "“We want to really double down” on AI-powered biomedical research, Mark Zuckerberg said.",
    "link": "https://fortune.com/2026/02/01/chan-zuckerberg-initiative-layoffs-all-in-on-ai-biomedical-research/"
  },
  {
    "text": "Ukraine peace talks pushed back as Washington juggles Iran crisis - politico.eu",
    "fullText": "Next trilateral meeting will take place on Wednesday and Thursday in Abu Dhabi, Ukrainian President Volodymyr Zelenskyy said.",
    "link": "https://www.politico.eu/article/ukraine-peace-talks-pushed-back-us-juggles-iran-crisis-volodymyr-zelenskyy/"
  },
  {
    "text": "Before Any Strike on Iran, U.S. Needs to Bolster Air Defenses in Mideast - The Wall Street Journal",
    "fullText": "The Pentagon is taking steps to better protect Israel, Arab allies and American forces if Iran retaliates",
    "link": "https://www.wsj.com/world/middle-east/before-any-strike-on-iran-u-s-needs-to-bolster-air-defenses-in-mideast-faca35a9"
  },
  {
    "text": "Minnesota citizens detained by ICE are left rattled, even weeks later - NPR",
    "fullText": "The number of immigration agents in Minnesota may be reduced, but they'll leave leave behind a changed community, including many U.S. citizens questioned and detained in recent weeks.",
    "link": "https://www.npr.org/2026/02/01/nx-s1-5689031/minnesota-citizens-detained-ice"
  },
  {
    "text": "Is it really possible to 'bank' sleep for later? - BBC",
    "fullText": "From helping you to focus more to improving sports performance, some scientists believe 'depositing' sleep for later use can bring a range of benefits.",
    "link": "https://www.bbc.com/future/article/20260130-is-it-really-possible-to-bank-sleep-for-later"
  }
]