[
  {
    "text": "Former Trail Blazer Chris Dudley to run again for governor of Oregon - Politico",
    "fullText": "He came within 2 points when he ran in 2010.",
    "link": "https://www.politico.com/news/2026/01/26/chris-dudley-oregon-governor-00747694"
  },
  {
    "text": "Menopause linked to Alzheimer's-like brain changes - BBC",
    "fullText": "Menopause is linked to a loss of grey matter in regions involved with memory and emotion, study suggests.",
    "link": "https://www.bbc.com/news/articles/c9qpp1g5ylvo"
  },
  {
    "text": "Code Vein II Review - Bloodsucking The Fun Away - Game Informer",
    "fullText": "Remove Code Vein II's inspirations, and what remains is an unremarkable and forgettable experience.",
    "link": "https://gameinformer.com/review/code-vein-ii/bloodsucking-the-fun-away"
  },
  {
    "text": "Dozens of CDC databases are not being updated — most related to vaccines, study finds - NBC News",
    "fullText": "Nearly half of the databases that the CDC used to update — tracking health information like Covid vaccination rates and RSV hospitalizations — have been paused, according to new research.",
    "link": "https://www.nbcnews.com/health/health-news/cdc-databases-not-updated-vaccines-study-rcna255467"
  },
  {
    "text": "Neil Young Trashes Amazon, Gives His Complete Musical Catalog to Greenland for Free - Rolling Stone",
    "fullText": "Neil Young has escalated his way against Amazon due to Jeff Bezos' support of Trump, and is giving his music to the people of Greenland.",
    "link": "http://www.rollingstone.com/music/music-news/neil-young-trashes-amazon-greenland-free-music-1235505119/"
  },
  {
    "text": "SCHOOL CLOSINGS: List of Georgia districts canceling or going virtual Tuesday - wsbtv.com",
    "fullText": "These districts have changed their schedules on Tuesday.",
    "link": "https://www.wsbtv.com/news/local/school-closings-list-georgia-districts-canceling-or-going-virtual-tuesday/2LAT5ELIOBC23BLMLN2CG2XC2M/"
  },
  {
    "text": "This is Android 17’s blur, new screen recorder, & more in leaked screenshots [Gallery] - 9to5Google",
    "fullText": "The Android 17 leaks continue today with a preview at the upcoming blur effect for System UI, as well as functional changes and updates.",
    "link": "http://9to5google.com/2026/01/26/android-17-leak/"
  },
  {
    "text": "French MPs take first step to ban social media for under-15s - BBC",
    "fullText": "If the bill passes the upper house it could take effect by the start of France's new school year in September.",
    "link": "https://www.bbc.com/news/articles/c07x003vx0yo"
  },
  {
    "text": "Former Citigroup executive sues bank over handling of sexual harassment claims - Financial Times",
    "fullText": "Complaint alleges ‘unrelenting and egregious sexual harassment’ by wealth chief Andy Sieg",
    "link": "https://www.ft.com/content/6b539d0f-d469-40ad-a967-5d712221038a"
  },
  {
    "text": "Trump’s own Big Beautiful Bill could add $5.5 trillion to the deficit and help sabotage his plan to ‘grow out’ of the national debt crisis - Yahoo Finance",
    "fullText": "Prior to the passage of the One Big Beautiful Bill, Trump’s “growth” math stood a chance of closing the gap. Now it’s much harder to see it working.",
    "link": "https://finance.yahoo.com/news/trump-own-big-beautiful-bill-204952439.html"
  },
  {
    "text": "Marburg virus disease - Ethiopia - World Health Organization (WHO)",
    "fullText": "On 26 January 2026, the Ministry of Health of Ethiopia declared the end of the Marburg virus disease (MVD) outbreak. This declaration came after two consecutive incubation periods (a total of 42 days) since the last person confirmed with MVD died and was give…",
    "link": "https://www.who.int/emergencies/disease-outbreak-news/item/2026-DON592"
  },
  {
    "text": "Could Massachusetts get hit with a blizzard this weekend? Here's what the forecast says. - CBS News",
    "fullText": "As we tick towards the end of what will be an all-time, record setting, top-ten snowstorm for Boston, it is awfully hard to ignore what may be coming next for Massachusetts.",
    "link": "https://www.cbsnews.com/boston/news/massachusetts-blizzard-possibility/"
  },
  {
    "text": "China's Thermal Battery Breakthrough Might Change Everything - bgr.com",
    "fullText": "Thermal batteries have major advantages in terms of durability, but they also have a serious shortcoming. Fortunately, this breakthrough might offer a solution.",
    "link": "https://www.bgr.com/2081338/china-high-efficiency-cathodes-thermal-batteries/"
  },
  {
    "text": "Nicki Minaj and ‘Marty Supreme’ Actor Kevin O’Leary Set to Join Trump at Launch Event for “Trump Accounts” - hollywoodreporter.com",
    "fullText": "The Treasury Department is hosting the summit in Washington D.C. Wednesday, with Trump, Minaj, O'Leary, Cheryl Hines and Secretary Scott Bessent all slated to participate.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/nicki-minaj-kevin-oleary-trump-accounts-event-1236485271/"
  },
  {
    "text": "These Companies—Palantir, AT&T, Deloitte—Have The Biggest ICE Contracts As DHS Funding Under Fire - Forbes",
    "fullText": "Demonstrations have demanded an end to federal funding for ICE, after two protesters were killed by federal agents in Minneapolis.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/26/these-companies-palantir-att-deloitte-have-the-biggest-ice-contracts-as-dhs-funding-under-fire/"
  },
  {
    "text": "Anthropic launches interactive Claude apps, including Slack and other workplace tools - TechCrunch",
    "fullText": "Claude users will now be able to call up interactive apps inside the chatbot interface, with Cowork integration coming soon.",
    "link": "https://techcrunch.com/2026/01/26/anthropic-launches-interactive-claude-apps-including-slack-and-other-workplace-tools/"
  },
  {
    "text": "31,000 Kaiser Permanente health care workers in California, Hawaii go on strike - abc7.com",
    "fullText": "Tens of thousands of Kaiser Permanente health care workers across California and Hawaii walked off the job Monday in a strike over safe staffing levels, fair compensation and timely care for patients.",
    "link": "https://abc7.com/post/31000-kaiser-permanente-health-care-workers-california-hawaii-go-strike/18478125/"
  },
  {
    "text": "The Detroit News to be acquired by USA TODAY Co., owner of Detroit Free Press - detroitnews.com",
    "fullText": "USA TODAY Co., owner of the Detroit Free Press, will acquire The Detroit News and continue to publish it separately, it announced Monday.",
    "link": "https://www.detroitnews.com/story/business/2026/01/26/the-detroit-news-to-be-acquired-usa-today-co-owner-detroit-free-press/88361407007/"
  },
  {
    "text": "Jessica Williams on Gratitude, Grief, and ‘Shrinking’ - Rolling Stone",
    "fullText": "'Shrinking' star Jessica Williams talks about dealing with the death of a loved one, her friendship with co-star Harrison Ford, and more.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/jessica-williams-shrinking-season-3-interview-1235478469/"
  }
]