[
  {
    "text": "South Korea court sentences ex-president to 5 years in martial law case - Al Jazeera",
    "fullText": "Former President Yoon Suk Yeol found guilty of obstructing justice and other charges related to declaring martial law.",
    "link": "https://www.aljazeera.com/news/2026/1/16/south-korea-court-finds-disgraced-ex-president-guilty-in-martial-law-case"
  },
  {
    "text": "Medical examiner believes death of man in ICE custody was homicide, recording says - The Washington Post",
    "fullText": "A fellow detainee says he witnessed Geraldo Lunas Campos being choked to death by guards at the ICE detention center in Texas on Jan. 3.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/15/ice-detention-death-homicide/"
  },
  {
    "text": "Star Wars Shake-Up: Kathleen Kennedy Steps Down as George Lucas Protégé Dave Filoni, Exec Lynwen Brennan Take Over Lucasfilm - The Hollywood Reporter",
    "fullText": "The change in leadership may mean a new hope for the storied franchise or it could be an attack of the clones by giving fans more of the same.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/star-wars-kathleen-kennedy-steps-down-dave-filoni-1236465012/"
  },
  {
    "text": "Casting is dead. Long live casting! - The Verge",
    "fullText": "Netflix laid the groundwork for casting. Now, it’s pulled the plug on the technology. Is there still life left in second-screen playback control?",
    "link": "https://www.theverge.com/column/861948/casting-netflix-dead"
  },
  {
    "text": "What Red Bull really unveiled at its F1 2026 launch - The Race",
    "fullText": "You may notice the car Red Bull has revealed is very different from the official F1 showcar we've seen before...but that doesn't mean it's the real car",
    "link": "https://www.the-race.com/formula-1/why-what-red-bulls-revealed-isnt-a-real-2026-f1-car/"
  },
  {
    "text": "Indiana begins effort to pass legislation to pay for new Bears stadium - NBC Sports",
    "fullText": "As the Bears prepare to play a significant postseason game in their longtime home of Soldier Field, the process of finding a new home continues.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/indiana-begins-effort-to-pass-legislation-to-pay-for-new-bears-stadium"
  },
  {
    "text": "Kim Kardashian Shares Adorable Snaps With Chicago West On Daughter's 8th Birthday - TMZ",
    "fullText": "Time is flying ... Kim Kardashian and Kanye West's daughter, Chicago West, is 8 years old today ... and Kim is marking the occasion with a super sweet social media post and some cute photos of them together.",
    "link": "https://www.tmz.com/2026/01/15/kim-kardashian-chicago-west-birthday-photos/"
  },
  {
    "text": "FBI: 1 arrested after protesters smash into unmarked federal vehicles allegedly containing federal documents - CBS News",
    "fullText": "The FBI says that a suspect is in custody after protests in north Minneapolis Wednesday evening culminated in vandalism and the apparent compromising of federal documents.",
    "link": "https://www.cbsnews.com/minnesota/news/fbi-1-arrested-after-protesters-smash-into-unmarked-federal-vehicles-allegedly-containing-federal-documents/"
  },
  {
    "text": "Rare earths magnets: How realistic are India's its ambitions? - BBC",
    "fullText": "India has a $800m plan to make rare earth magnets, aiming to reduce dependence on Chinese imports - but can it work?",
    "link": "https://www.bbc.com/news/articles/c9qe1d8p5xgo"
  },
  {
    "text": "Brian Baldinger on Harbaugh's future with Giants: 'I think he will put a good staff together' | 'The Insiders' - NFL.com",
    "fullText": "<p>NFL Network analyst Brian Baldinger breaks down New York Giants now head coach John Harbaugh's future with the Giants.</p>",
    "link": "https://www.nfl.com/videos/brian-baldinger-on-harbaugh-s-future-with-giants-i-think-he-will-put-a-good-staff-together-the-insiders"
  },
  {
    "text": "Hilary Duff drops her spicy new single 'Roommates' - Yahoo",
    "fullText": "This is Duff's second single off her forthcoming album, \"Luck …or something,\" out next month.",
    "link": "https://www.yahoo.com/entertainment/music/article/hilary-duff-drops-her-spicy-new-single-roommates-000259768.html"
  },
  {
    "text": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com",
    "fullText": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction"
  },
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "fullText": "The company said it had stopped Grok from undressing people on the X platform. Grok’s stand-alone app still does it.",
    "link": "https://www.washingtonpost.com/technology/2026/01/15/grok-ai-image-generator-sexualized/"
  },
  {
    "text": "Push for greater ICE training grows on some Republicans - Politico",
    "fullText": "Criticism of ICE has grown among influential voices for the president’s coalition in the wake of the Minneapolis shooting.",
    "link": "https://www.politico.com/news/2026/01/15/ice-training-republicans-shootings-00732583"
  },
  {
    "text": "First child death reported from flu this season in Virginia - WTOP",
    "fullText": "Flu season has taken a grim turn in Virginia, as the state’s health department has reported the first death of a child caused by complications associated with influenza.",
    "link": "https://wtop.com/virginia/2026/01/first-child-death-reported-from-flu-this-season-in-virginia/"
  },
  {
    "text": "Trump Backs Credit Card Swipe Fee Crackdown—Why Rewards Get Cut and Fees Go Up - View from the Wing",
    "fullText": "Trump has now endorsed the Durbin-Marshall swipe fee bill, pitching it as “competition” and consumer relief. In reality it shifts value from cardholders to retailers—cutting rewards, pushing issuers toward higher fees elsewhere, and shrinking credit availabil…",
    "link": "https://viewfromthewing.com/trump-backs-credit-card-swipe-fee-crackdown-why-rewards-get-cut-and-fees-go-up/"
  },
  {
    "text": "Native Americans are being swept up by ICE in Minneapolis, tribes say - The Washington Post",
    "fullText": "Tribal leaders say Indigenous people have been stopped, questioned, harassed and, in some cases, detained solely on the basis of their skin color or names.",
    "link": "https://www.washingtonpost.com/politics/2026/01/15/native-americans-ice-minneapolis/"
  }
]