[
  {
    "text": "Victor Wembanyama MRI shows no ligament damage in left knee - NBA",
    "fullText": "Victor Wembanyama will miss Friday’s game vs. the Indiana Pacers after an MRI showing no ligament damage in his left knee.",
    "link": "https://www.nba.com/news/victor-wembanyamas-mri-shows-no-ligament-damage-in-hyperextended-knee-will-miss-spurs-pacers-game"
  },
  {
    "text": "Hoosiers handle Tide, book rematch with Ducks - ESPN",
    "fullText": "Indiana quarterback Fernando Mendoza and the top-seeded Hoosiers won the Rose Bowl Thursday in convincing fashion, authoring a 38-3 victory over No. 9 Alabama to secure a berth in the College Football Playoff semifinals, where they will meet No. 5 Oregon.",
    "link": "https://www.espn.com/college-football/story/_/id/47476286/indiana-strolls-cfp-semifinals-cruises-alabama"
  },
  {
    "text": "Deaths reported during widening protests in Iran sparked by ailing economy - NPR",
    "fullText": "The protests began due to economic pressures, with Iran's currency rapidly depreciating. Demonstrators have also chanted against the country's theocracy.",
    "link": "https://www.npr.org/2026/01/01/g-s1-104241/iran-protests-deaths-economy"
  },
  {
    "text": "Sunderland 0-0 Man City (Jan 1, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Sunderland vs. Manchester City English Premier League game from January 1, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/740784"
  },
  {
    "text": "Here’s (Almost) Everything Wall Street Expects in 2026 - Bloomberg.com",
    "fullText": "Over 700 key calls on how AI spending and government policies are set to fuel growth, inflation may prove hard to beat, private assets will continue their rise and the dollar will extend its decline.",
    "link": "https://www.bloomberg.com/graphics/2026-investment-outlooks/"
  },
  {
    "text": "Catholic influencer's 5-year-old son dies after contracting flu - NBC News",
    "fullText": "A Catholic influencer said Thursday that his 5-year-old son died from a severe case of the flu",
    "link": "https://www.nbcnews.com/news/us-news/catholic-influencers-5-year-old-son-dies-contracting-flu-rcna251834"
  },
  {
    "text": "Trump says he got a CT scan instead of an MRI - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/trump-ct-mri/story?id\\\\u003d128832409"
  },
  {
    "text": "Bride-to-be Taylor Swift looks like a golden goddess as she rings in 2026 at Este Haim’s wedding — See all the photos - Yahoo",
    "fullText": "Taylor Swift was spotted with Stevie Nicks at her friend Este Haim’s wedding on New Year’s Eve on Wednesday.",
    "link": "https://pagesix.com/2026/01/01/entertainment/taylor-swift-rings-in-2026-with-stevie-nicks-at-este-haims-new-years-eve-wedding/"
  },
  {
    "text": "Congress failed to extend Obamacare subsidies. This Democrat says Trump can save them - NPR",
    "fullText": "Sen. Peter Welch, D-Vt., says he thinks the Senate can pass a \"retroactive\" Affordable Care Act subsidy extension, but \"we need President Trump.\"",
    "link": "https://www.npr.org/2026/01/01/g-s1-104216/obamacare-subsidies-congress-peter-welch"
  },
  {
    "text": "Research roundup: 7 cool science stories we almost missed - Ars Technica",
    "fullText": "Double-detonating \"superkilonova,\" Roman liquid gypsum burials, biomechanics of kangaroo posture, and more.",
    "link": "https://arstechnica.com/science/2026/01/research-roundup-7-cool-science-stories-we-almost-missed-2/"
  },
  {
    "text": "January’s full wolf supermoon and the Quadrantid meteor shower will start off the new year - CNN",
    "fullText": "Catch the wolf supermoon and Quadrantid meteor shower as January’s night sky puts on a celestial double feature.",
    "link": "https://www.cnn.com/2026/01/01/science/january-full-moon-quadrantid-meteor-shower"
  },
  {
    "text": "Federal travel ban update: New Trump-ordered restrictions now in effect - ABC7 Chicago",
    "fullText": "Individuals from seven countries will not be able to travel to the United States starting Thursday, according to updated CBP guidance.",
    "link": "https://abcnews.go.com/US/new-trump-ordered-immigration-restrictions-effect-jan-1/story?id=128812891"
  },
  {
    "text": "2 No-Brainer AI Stocks to Buy Hand Over Fist for 2026 - The Motley Fool",
    "fullText": "These two stocks are great additions to any growth portfolio.",
    "link": "https://www.fool.com/investing/2026/01/01/2-no-brainer-ai-stocks-to-buy-hand-over-fist-2026/"
  },
  {
    "text": "Kelsea Ballerini and Chase Stokes Get Back Together After a 'Messy Year for the Heart' - TODAY.com",
    "fullText": "Kelsea Ballerini and Chase Stokes seemingly got back together. Here's what they said about their relationship and getting back together 3 months after their split.",
    "link": "https://www.today.com/popculture/kelsea-ballerini-chase-stokes-back-together-rcna251715"
  },
  {
    "text": "'Stranger Things' Fans Demand 'The First Shadow' Play on Netflix After Series Finale 'Confusion' - TV Insider",
    "fullText": "The series' final season featured several nods to the prequel stage show.",
    "link": "https://www.tvinsider.com/1236600/stranger-things-fans-want-first-shadow-play-streaming-on-netflix/"
  },
  {
    "text": "15 skywatching events you won't want to miss in 2026 - Space",
    "fullText": "Our 2026 skywatching guide includes a total solar eclipse, a \"blood moon\" and a festive supermoon. Here are the dates you need to know.",
    "link": "https://www.space.com/stargazing/15-skywatching-events-you-wont-want-to-miss-in-2026"
  },
  {
    "text": "An Engineer Says He’s Found a Way to Overcome Earth’s Gravity - Yahoo! Tech",
    "fullText": "This new propulsion system could rewrite the rules of spaceflight—not to mention completely defy conventional physics.",
    "link": "https://www.popularmechanics.com/space/rockets/a69897524/engineer-can-overcome-earths-gravity/"
  },
  {
    "text": "Jan. 6 attack 'does not happen' without Trump, Jack Smith told Congress - PBS",
    "fullText": "In a closed-door interview, Smith characterized the Republican president as the “most culpable and most responsible person” in the criminal conspiracy to overturn the results of the 2020 election.",
    "link": "https://www.pbs.org/newshour/politics/jan-6-attack-does-not-happen-without-trump-jack-smith-told-congress"
  },
  {
    "text": "First Photos Of 2026: Global New Year’s Celebrations Finish With A Bang - Forbes",
    "fullText": "The clock struck midnight for the last place in the world, American Samoa, at 6 a.m. EST Thursday.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2026/01/01/first-photos-of-2026-global-new-years-celebrations-in-full-swing/"
  }
]