[
  {
    "text": "Seven charts that show Indiana’s historic path from doormat to dominance - The Washington Post",
    "fullText": "Few teams in college football history have been so bad before reaching the national title game.",
    "link": "https://www.washingtonpost.com/sports/2026/01/19/indiana-football-turnaround-curt-cignetti/"
  },
  {
    "text": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case - AP News",
    "fullText": "Federal Reserve Chair Jerome Powell will attend the Supreme Court’s oral arguments Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair. The high court is considering whether Presid…",
    "link": "https://apnews.com/article/federal-reserve-jerome-powell-lisa-cook-supreme-court-7f135bd222013d4fe61eb8f03c663676"
  },
  {
    "text": "Why the same cold virus makes some people more miserable than others - The Washington Post",
    "fullText": "A new study shows the intricacies of the cold virus and how it interacts with nasal airway cells, revealing why some people are hit harder than others.",
    "link": "https://www.washingtonpost.com/health/2026/01/19/common-cold-virus-variability/"
  },
  {
    "text": "Woman died after riding Revenge of the Mummy coaster at Universal Orlando, report says - CBS News",
    "fullText": "A Florida agency's latest report on theme park injuries says a woman died after becoming unresponsive on Universal Studios' Revenge of the Mummy roller coaster.",
    "link": "https://www.cbsnews.com/news/woman-died-revenge-of-the-mummy-coaster-universal-orlando/"
  },
  {
    "text": "Reports of ad-supported Xbox game streams show Microsoft’s lack of imagination - Ars Technica",
    "fullText": "Xbox maker needs some fresher ideas for expanding access to cloud gaming.",
    "link": "https://arstechnica.com/gaming/2026/01/reports-of-ad-supported-xbox-game-streams-show-microsofts-lack-of-imagination/"
  },
  {
    "text": "Man killed, 3 bystanders hurt in shooting at iconic New Orleans restaurant - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/man-killed-3-bystanders-hurt-shooting-iconic-new/story?id\\\\u003d129346480"
  },
  {
    "text": "Modder Blasts ‘Corpo Logic’ Over Cyberpunk 2077 VR Takedown - Kotaku",
    "fullText": "Paywalled mods turn Baldur's Gate 3 and every other major game into unofficial VR ports",
    "link": "https://kotaku.com/cyberpunk-2077-vr-mod-baldurs-gate-3-takedown-2000660987"
  },
  {
    "text": "In historic first for Virginia, Adam Spanberger becomes first gentleman - The Washington Post",
    "fullText": "The computer engineer and avid bicyclist said he’s happy working behind the scenes to support his wife and Virginia’s new governor, Abigail Spanberger.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/19/adam-spanberger-virginia-first-gentleman/"
  },
  {
    "text": "Trump is going to Davos — here are the big names who aren't - CNBC",
    "fullText": "A who's who of heads of state, top CEOs and tech pioneers are landing in Davos for the 2026 World Economic Forum meeting. But some big names aren't going.",
    "link": "https://www.cnbc.com/2026/01/19/trump-world-economic-forum-davos-who-isnt-going.html"
  },
  {
    "text": "Your Daily Horoscope For Tuesday, January 20: Mercury Enters Aquarius - YourTango",
    "fullText": "Your zodiac sign's daily horoscope for Tuesday, January 20, 2026, is here as Mercury enters Aquarius.",
    "link": "https://www.yourtango.com/2026393962/daily-horoscope-zodiac-sign-january-20-2026"
  },
  {
    "text": "Americans Are the Ones Paying for Tariffs, Study Finds - The Wall Street Journal",
    "fullText": "Research contradicts President Trump’s claim that foreigners are footing the bill, and could weaken his hand in the dispute over Greenland",
    "link": "https://www.wsj.com/economy/trade/americans-are-the-ones-paying-for-tariffs-study-finds-e254ed2e"
  },
  {
    "text": "Pixel 10a price won’t change after all as latest leak reveals true release date - 9to5Google",
    "fullText": null,
    "link": "http://9to5google.com/2026/01/19/google-pixel-10a-price-release-date-report/"
  },
  {
    "text": "Celebrate a King, Not a Trump - The Bulwark",
    "fullText": "We will never have a DJT day.",
    "link": "https://www.thebulwark.com/p/celebrate-a-king-not-a-trump-mlk-jr-day-norway-denmark-greenland-nobel"
  },
  {
    "text": "‘Landman’ Co-Creator Teases Season 3 Reset, Talks Billy Bob Thornton’s “Nerve-Racking” Finale Move - The Hollywood Reporter",
    "fullText": "Christian Wallace answers The Hollywood Reporter's burning questions after that surprising season two ending.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/landman-finale-season-3-reset-co-creator-interview-1236477449/"
  },
  {
    "text": "UFC 324 roundtable: Is Paramount era kicking off with a dud? - MMA Fighting",
    "fullText": "Previewing UFC 324 and the biggest storylines to start the new Paramount deal.",
    "link": "https://www.mmafighting.com/ufc/466223/ufc-324-roundtable-is-paramount-era-kicking-off-with-a-dud"
  },
  {
    "text": "2026 NFL Mock Draft: Jets pivot to David Bailey at No. 2, Chiefs bolster their offense with Jeremiyah Love - PFF",
    "fullText": "Oregon quarterback Dante Moore is returning to school, forcing the Jets to change directions at the top of this 2026 NFL mock draft.",
    "link": "https://www.pff.com/news/draft-2026-nfl-mock-draft-jets-david-bailey-chiefs-jeremiyah-love"
  },
  {
    "text": "Stellantis stock off 43% as Jeep maker turns five, executes turnaround - CNBC",
    "fullText": "Stellantis shares were largely up – as high as 93% in March 2024 – until reporting troubling financial results that year amid cost-cutting efforts and EVs.",
    "link": "https://www.cnbc.com/2026/01/19/stellantis-stock-stla-five-year-anniversary.html"
  },
  {
    "text": "Maye Day! Rebooted New England Closes In on Surprise Super Bowl Return - The Wall Street Journal",
    "fullText": "A serious test versus top-seeded Denver awaits—but against a suddenly promoted backup quarterback",
    "link": "https://www.wsj.com/sports/football/new-england-patriots-drake-maye-ef2d8121"
  },
  {
    "text": "Snowfall totals from Sunday's storm. Here's a look at the jackpot towns - NBC Boston",
    "fullText": "Unlike most of the storms so far this winter, Sunday's storm hit Massachusetts harder than most of the other New England states.",
    "link": "https://www.nbcboston.com/news/local/massachusetts-snowfall-totals-from-sundays-storm-heres-a-look-at-the-jackpot-towns/3880103/"
  }
]