[
  {
    "text": "Boeing outsold Airbus last year for first time since 2018, deliveries rise to 600 - CNBC",
    "fullText": "Boeing delivered 600 jetliners in 2025 with 63 in December alone, while net orders rose to 1,173 planes.",
    "link": "https://www.cnbc.com/2026/01/13/boeing-orders-deliveries.html"
  },
  {
    "text": "Scott Adams, ‘Dilbert’ creator who poked fun at bad bosses, dies at 68 - The Washington Post",
    "fullText": "His three-panel comic strip was published in more than 2,000 newspapers, only to fade from view after Mr. Adams made racist comments on a YouTube live stream.",
    "link": "https://www.washingtonpost.com/obituaries/2026/01/13/scott-adams-dead-dilbert/"
  },
  {
    "text": "The science behind an herbal remedy that has worked for thousands of years - The Washington Post",
    "fullText": "Ginger, available at almost any grocery store and often used as a spice, has properties that can relieve mild to moderate nausea, experts and studies say.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/13/ginger-nausea-pregnancy-chemotherapy/"
  },
  {
    "text": "JPMorgan Profit Falls on Investment-Banking Miss, Apple Card Charge - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/business/earnings/jpmorgan-chases-fourth-quarter-profit-falls-7-ae1f3e4b"
  },
  {
    "text": "Trump administration ending legal protections for 2,500 Somalis, making them eligible for deportation - CBS News",
    "fullText": "The U.S. government is revoking the legal status of several thousand immigrants from Somalia.",
    "link": "https://www.cbsnews.com/news/somalis-temporary-protected-status-trump-administration-ending/"
  },
  {
    "text": "David Webb, Hong Kong’s Most Vocal Activist Investor, Dies at 60 - Bloomberg.com",
    "fullText": "David Webb, Hong Kong’s most vocal activist investor whose investigations into corporate malfeasance triggered regulatory probes and made him a celebrity in the city’s financial industry, has died. He was 60.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-13/david-webb-hong-kong-s-most-vocal-activist-investor-dies-at-60"
  },
  {
    "text": "Inbox: Those pillars are in place here - Green Bay Packers – packers.com",
    "fullText": "It’s on everyone with a passcode to the building to figure it out",
    "link": "https://www.packers.com/news/inbox-those-pillars-are-in-place-here-jan-13-2026"
  },
  {
    "text": "New Birmingham-Manchester rail link to be proposed - BBC",
    "fullText": "Previous plans for a high-speed rail line between the cities were scrapped by Rishi Sunak's government.",
    "link": "https://www.bbc.com/news/articles/c75xrwlw5n2o"
  },
  {
    "text": "Google Pixel 10a releasing in ‘mid February’ with ‘Berry’ color, leak claims - 9to5Google",
    "fullText": "Google’s Pixel 10a might be releasing much earlier than anyone expected, with a February release date in the works and...",
    "link": "http://9to5google.com/2026/01/13/google-pixel-10a-release-date-berry-leak/"
  },
  {
    "text": "BTS propelled K-pop to global stardom. Nearly four years later, they’re back - CNN",
    "fullText": "BTS is back – and coming to a city near you. As the clock strikes midnight on Wednesday in Seoul, the group will announce the dates and locations of a highly-anticipated world tour, with their new album expected to release in March.",
    "link": "https://www.cnn.com/2026/01/13/style/south-korea-bts-tour-announcement-kpop-intl-hnk-dst"
  },
  {
    "text": "What countries do business with Iran and what could US tariffs mean? - BBC",
    "fullText": "Donald Trump has announced a 25% tariff on countries trading with Iran after its deadly crackdown on anti-government protests.",
    "link": "https://www.bbc.com/news/articles/cwynx4rerpzo"
  },
  {
    "text": "Apple turns to Google to power AI upgrade for Siri - BBC",
    "fullText": "Analysts say the deal is likely to be welcomed by consumers - but reflects Apple's failure to develop its own AI tools.",
    "link": "https://www.bbc.com/news/articles/czdqvp2zqezo"
  },
  {
    "text": "Yoon Suk Yeol: S Korea prosecutors seek death penalty over failed insurrection attempt - BBC",
    "fullText": "Yoon is accused of leading an insurrection when he tried to impose martial law in 2024.",
    "link": "https://www.bbc.com/news/articles/cq6vyqq5r0do"
  },
  {
    "text": "Chargers' Khalil Mack pondering NFL future heading into free agency - NFL.com",
    "fullText": "Khalil Mack continues to search for that elusive playoff victory. Will the pass rusher, who is headed to free agency, continue into his 13 season or ride off into the sunset?",
    "link": "https://www.nfl.com/news/chargers-khalil-mack-pondering-nfl-future-heading-into-free-agency"
  },
  {
    "text": "Signal creator Moxie Marlinspike wants to do for AI what he did for messaging - Ars Technica",
    "fullText": "Introducing Confer, an end-to-end AI assistant that just works.",
    "link": "https://arstechnica.com/security/2026/01/signal-creator-moxie-marlinspike-wants-to-do-for-ai-what-he-did-for-messaging/"
  },
  {
    "text": "US State Department threatens UK over probe into Elon Musk’s X - politico.eu",
    "fullText": "Official Sarah B. Rogers said “nothing is off the table” if X is banned in the U.K.",
    "link": "https://www.politico.eu/article/us-state-department-threaten-uk-probe-elon-musk-x-grok/"
  },
  {
    "text": "Alex Bregman wanted to ensure he would stay in Boston. The Red Sox weren’t willing to make it happen. - The Boston Globe",
    "fullText": "Bregman was prepared to accept five years and $165 million until the team balked at the no-trade clause.",
    "link": "https://www.bostonglobe.com/2026/01/13/sports/red-sox-alex-bregman/"
  },
  {
    "text": "Trump heads to Detroit to give a speech refocusing on the American economy - NPR",
    "fullText": "The speech at the Detroit Economic Club comes after major foreign policy moves have overshadowed domestic policy.",
    "link": "https://www.npr.org/2026/01/13/nx-s1-5675293/trump-heads-to-detroit-to-give-a-speech-refocusing-on-the-american-economy"
  },
  {
    "text": "There's a weird fish in Washington with a huge hole in its head. Scientists think they've figured out why - BBC Wildlife Magazine",
    "fullText": "Researchers studying rockhead poachers from Deadman Bay think they may have solved the mystery of the fish's odd bowl-shaped head.",
    "link": "https://www.discoverwildlife.com/animal-facts/marine-animals/rockhead-poacher"
  }
]