[
  {
    "text": "At least 3 dead, 7 injured after car crashes into 99 Ranch Market in Westwood - ABC7 Los Angeles",
    "fullText": "At least three people were killed and six others were injured after a car crashed into a 99 Ranch Market in Westwood Thursday afternoon.",
    "link": "https://abc7.com/post/2-dead-5-injured-car-crashes-westwood-grocery-store/18548729/"
  },
  {
    "text": "Latest on Seahawks rookie Nick Emmanwori’s injury - The Seattle Times",
    "fullText": "Seahawks coach Mike Macdonald said that rookie safety Nick Emmanwori is expected to play in the Super Bowl despite suffering a low ankle sprain in practice.",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-say-nick-emmanwori-expected-to-play-in-super-bowl/"
  },
  {
    "text": "Dow tumbles nearly 600 points, S&P 500 goes negative for 2026 in tech sector rout: Live updates - CNBC",
    "fullText": "Wall Street is coming off a major sell-off in software stocks that drove the S&P 500 to a second straight day of losses.",
    "link": "https://www.cnbc.com/2026/02/04/stock-market-today-live-updates.html"
  },
  {
    "text": "Clintons keep pushing for public hearings as Comer digs in his heels - Politico",
    "fullText": "There is currently an agreement for Bill and Hillary Clinton to testify on Capitol Hill behind closed doors.",
    "link": "https://www.politico.com/live-updates/2026/02/05/congress/comer-vs-clintons-00767251"
  },
  {
    "text": "What a crowded congressional primary in N.J. says about the state of Democrats - NPR",
    "fullText": "The contest is one of the first congressional primaries of the year where we will find out what issues are currently resonating with some Democratic voters. Here are some key things to know.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5701337/nj-primary-election-democrats-sherrill"
  },
  {
    "text": "What to know about the rare condition Catherine O’Hara had - The Washington Post",
    "fullText": "Late actor and comedian Catherine O’Hara was born with situs inversus, a condition that causes the internal organs to be mirrored. Here’s what you need to know.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/05/situs-inversus-catherine-ohara/"
  },
  {
    "text": "Anthropic's newest AI model uncovered 500 zero-day software flaws in testing - Axios",
    "fullText": "The AI company sees the model's advancements as a major win for cyber defenders in the race against adversarial AI.",
    "link": "https://www.axios.com/2026/02/05/anthropic-claude-opus-46-software-hunting"
  },
  {
    "text": "Google hints at big AirDrop expansion for Android \"very soon\" - Ars Technica",
    "fullText": "AirDrop came to the Pixel 10 last year, and more Android phones will join the party in 2026.",
    "link": "https://arstechnica.com/gadgets/2026/02/google-hints-at-big-airdrop-expansion-for-android-very-soon/"
  },
  {
    "text": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo",
    "fullText": "A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.",
    "link": "https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421"
  },
  {
    "text": "Trump rows back his criticism of UK’s Chagos Islands deal - Financial Times",
    "fullText": "But US president says he retains right to ‘militarily secure’ American base on Diego Garcia",
    "link": "https://www.ft.com/content/86e4d2f7-87b5-4f6b-98e6-1f6031527c6d"
  },
  {
    "text": "Snag the budget-friendly Nothing Ear (a) wireless earbuds for their lowest price yet - Mashable",
    "fullText": "Plus, get ChatGPT support for chats right in your ear.",
    "link": "https://mashable.com/article/feb-5-nothing-ear-a-wireless-earbuds-deal"
  },
  {
    "text": "The Secret to Mike Vrabel’s Success - Sports Illustrated",
    "fullText": "There are plenty of football elements that explain New England’s stunning turnaround, but relationships carefully built by the head coach are at the heart of it.",
    "link": "https://www.si.com/nfl/secret-to-mike-vrabel-success-patriots-coach-super-bowl"
  },
  {
    "text": "Health officials warn of possible measles exposure in Collegeville, Pennsylvania - 6abc Philadelphia",
    "fullText": "Health officials are warning the public of a possible measles exposure in Montgomery County.",
    "link": "https://6abc.com/post/health-officials-warn-possible-measles-exposure-collegeville-pennsylvania/18547385/"
  },
  {
    "text": "Some Public Health Service officers quit rather than serve in ICE detention centers - NPR",
    "fullText": "A special corps of health care workers have been called in to work with detained immigrants and many feel deeply conflicted about the assignment, saying they're not able to provide good care.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5698538/public-health-service-ice-detention-centers"
  },
  {
    "text": "Famine is threatening more of war-torn Sudan’s Darfur region as an attack in the south kills 22 - AP News",
    "fullText": "A global hunger monitoring group says that famine is threatening more areas in war-torn Sudan’s western Darfur region, where acute malnutrition has been registered in two more towns there. The group did not confirm a full famine in those towns. The report by …",
    "link": "https://apnews.com/article/sudan-famine-rsf-kordofan-darfur-war-hunger-9b16a0419f8d7cc67c7e95939a8a954d"
  },
  {
    "text": "GloRilla Shares Thankful Texts From Her Mom As Sister Claims She's Leaving Them Poor - HotNewHipHop",
    "fullText": "GloRilla's sister, Victoria Woods, has been putting her on blast on social media for allegedly abandoning their family.",
    "link": "https://www.hotnewhiphop.com/975601-glorilla-allegedly-leaving-family-poor"
  },
  {
    "text": "NASA will finally allow astronauts to bring their iPhones to space - Ars Technica",
    "fullText": "We are giving our crews the tools to capture special moments.\"",
    "link": "https://arstechnica.com/space/2026/02/nasa-will-finally-allow-astronauts-to-bring-their-iphones-to-space/"
  },
  {
    "text": "What Eikon’s modest IPO says about the future of big-money, big-name biotech - Endpoints News",
    "fullText": "Eikon Therapeutics IPOs at $971M valuation, down nearly 75% from peak, raising $381M despite Nobel Prize science backing and leadership by ex-Merck exec Roger Perlmutter.",
    "link": "https://endpoints.news/eikon-ipo-analysis-big-biotech-names-big-valuation-cut/"
  },
  {
    "text": "UPDATE! An X8.1 (Strong) flare from Region 4366 - Space Weather Prediction Center (.gov)",
    "fullText": null,
    "link": "https://www.swpc.noaa.gov/news/update-x81-strong-flare-region-4366"
  }
]