[
  {
    "text": "Government considers removing Andrew from royal line of succession - BBC",
    "fullText": "The former Duke of York is eighth in line to the throne meaning he remains eligible to be King.",
    "link": "https://www.bbc.com/news/articles/c1kgv837wvdo"
  },
  {
    "text": "'RHOC's Meghan King Accuses Jim Edmonds of Leaking Her Number to Sex Workers - TMZ",
    "fullText": "'Real Housewives of Orange County' alum Meghan King accused her ex-husband Jim Edmonds of leaking her cell phone to sex workers to harass her years ago ... something she mentioned to cops while reporting recent harassing phone threats from an unknown person -…",
    "link": "https://www.tmz.com/2026/02/21/meghan-king-claims-jim-edmonds-gave-her-number-to-sex-workers/"
  },
  {
    "text": "Lakers hold on to beat Clippers - Silver Screen and Roll",
    "fullText": null,
    "link": "https://www.silverscreenandroll.com/lakers-scores-results/108603/lakers-vs-clippers-recap-box-score-stats-final-lebron-james-austin-reaves-luka-doncic"
  },
  {
    "text": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates - 6abc Philadelphia",
    "fullText": "A Winter Storm Watch will go into effect on Sunday for a system that could bring snow to our area well into Monday.",
    "link": "https://6abc.com/live-updates/winter-storm-set-bring-foot-snow-parts-philadelphia-region-live-updates/18625971/"
  },
  {
    "text": "Forget Greenland: This Arctic NATO Island Already Has a Russian Presence - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/world/forget-greenland-this-arctic-nato-island-already-has-a-russian-presence-bbb19d13"
  },
  {
    "text": "Anna Murdoch-Mann, writer and former News Corp director, dies aged 81 - BBC",
    "fullText": "The author, journalist and philanthropist died at home in Florida, according to Rupert Murdoch's news outlets.",
    "link": "https://www.bbc.com/news/articles/cp8150xj36wo"
  },
  {
    "text": "NYC, NJ forecasts now warn up to 10 inches of snow expected for Sunday storm - Gothamist",
    "fullText": "Punxsutawney Phil: You're not welcome here.",
    "link": "https://gothamist.com/news/more-snow-3-to-5-inches-are-possible-in-nyc-area-this-weekend-forecast-shows"
  },
  {
    "text": "Why There's Simply No Need For A Password Manager Anymore - bgr.com",
    "fullText": "With OS-level password managers, passkeys, and biometric authentication technology, there's no longer much need for third-party password managers.",
    "link": "https://www.bgr.com/2102887/why-no-one-needs-password-managers-anymore/"
  },
  {
    "text": "US military says it attacked vessel in Pacific Ocean, killing three people - Al Jazeera",
    "fullText": "US military’s Southern Command (SOUTHCOM) claimed the vessel was involved in drug trafficking, without providing proof.",
    "link": "https://www.aljazeera.com/news/2026/2/21/us-military-says-it-attacked-vessel-in-pacific-ocean-killing-three-people"
  },
  {
    "text": "North Carolina vs East Carolina - East Carolina University Athletics",
    "fullText": "East Carolina University Athletics",
    "link": "https://ecupirates.com/sports/baseball/stats/2026/north-carolina/boxscore/14046"
  },
  {
    "text": "‘Face/Off’ Sequel Loses Director Adam Wingard - The Hollywood Reporter",
    "fullText": null,
    "link": "http://www.hollywoodreporter.com/movies/movie-news/face-off-2-sequel-director-adam-wingard-exits-cage-travolta-1236511178/"
  },
  {
    "text": "A Galaxy Composed Almost Entirely of Dark Matter Has Been Confirmed - WIRED",
    "fullText": "What scientists thought were four separate star clusters are actually part of one nearly invisible system.",
    "link": "https://www.wired.com/story/a-galaxy-composed-almost-entirely-of-dark-matter-has-been-confirmed/"
  },
  {
    "text": "MAHA moms threaten to turn this car around as RFK Jr. flips on pesticide - Ars Technica",
    "fullText": "MAHA members call movement a \"sham\" after Kennedy supports glyphosate order.",
    "link": "https://arstechnica.com/health/2026/02/maha-moms-threaten-to-turn-this-car-around-as-rfk-jr-flips-on-pesticide/"
  },
  {
    "text": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show - CBS News",
    "fullText": "A major nor'easter could bring blizzard conditions to Boston at the end of the weekend, the latest weather forecast shows.",
    "link": "https://www.cbsnews.com/boston/news/boston-weather-snow-blizzard-maps/"
  },
  {
    "text": "Trump adminstration rolls back mercury rules for coal-fired power plants - The Allegheny Front",
    "fullText": "The rule for mercury emissions from coal-fired power plants will be rolled back to a 2012 standard. Mercury is a neurotoxin.",
    "link": "https://www.alleghenyfront.org/trump-mercury-standard-coal-fired-power-plants-rollback/"
  },
  {
    "text": "Nuggets play Trail Blazers on back-to-back - NBA",
    "fullText": "Denver wraps up its 12th back-to-back of the season. They're 7-4 on the second night of a back-to-back, winning three of their last four \"no rest\" games.",
    "link": "https://nuggets.com/news/nuggets-play-trail-blazers-on-back-to-back"
  },
  {
    "text": "Scientists May Have Found The Key Cellular Process Behind Aging in Animals - ScienceAlert",
    "fullText": "A study on worms led by researchers from Vanderbilt University School of Medicine in the US has uncovered a previously unknown adaptation to aging that actively remodels one of the largest and most complex structures in our cells.",
    "link": "https://www.sciencealert.com/scientists-may-have-found-the-key-cellular-process-behind-aging-in-animals"
  },
  {
    "text": "Multiple people at state wrestling tournament diagnosed with measles as it spreads in Utah - KSL News",
    "fullText": "Utah health officials say cases of measles are spreading to new areas in Utah, particularly in schools and at extracurricular events like a recent state wrestling tournament.",
    "link": "https://www.ksl.com/article/51451348/multiple-people-at-state-wrestling-tournament-diagnosed-with-measles-as-it-spreads-in-utah"
  },
  {
    "text": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "fullText": "In a new video of Punch, the baby monkey is dragged around in circles by an adult monkey, upsetting animal lovers around the globe. The zoo explains.",
    "link": "https://www.usatoday.com/story/news/world/2026/02/20/punch-baby-monkey-update-attacked-video-japan-zoo/88776501007/"
  }
]