[
  {
    "text": "Benfica 4-2 Real Madrid (Jan 28, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Benfica vs. Real Madrid Uefa Champions League game from January 28, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/757785"
  },
  {
    "text": "Elon Musk says Tesla ending Models S and X production, converting Fremont factory lines to make Optimus robots - CNBC",
    "fullText": "On Tesla's fourth-quarter earnings call, CEO Elon Musk said the company is ending production of its Model S and X vehicles.",
    "link": "https://www.cnbc.com/2026/01/28/tesla-ending-model-s-x-production.html"
  },
  {
    "text": "Case of measles confirmed in Arizona ICE facility - CNN",
    "fullText": "The US Department of Homeland Security says a person in detention at an Arizona Immigration and Customs Enforcement facility has measles, a highly contagious virus that can cause high fevers and a distinctive rash.",
    "link": "https://www.cnn.com/2026/01/28/health/ice-facility-measles-arizona"
  },
  {
    "text": "Stock Market Today: Federal Reserve Holds Rates Steady; Nasdaq Edges Higher - The Wall Street Journal",
    "fullText": "In the first interest-rate decision of 2026, the Federal Reserve kept rates steady as politcal pressure grows from Trump. Fed Chair Jerome Powell is set to at 2:30 p.m. ET., as a DOJ investigation looms. Follow along for the latest news, updates and analysis.",
    "link": "https://www.wsj.com/livecoverage/fed-interest-rate-decision-01-28-2026"
  },
  {
    "text": "FBI leading investigation after man charges Rep. Ilhan Omar during town hall, police say - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/man-charges-rep-ilhan-omar-town-hall/story?id\\\\u003d129618409"
  },
  {
    "text": "Satena: Colombia launches search for missing plane carrying 15 people - BBC",
    "fullText": "State ariline Satena says its aircraft carrying 13 passengers and two crew \"suffered a fatal accident\".",
    "link": "https://www.bbc.com/news/articles/cvgnq54v79xo"
  },
  {
    "text": "Minnesota prosecutors face uphill battle if they charge feds in fatal shootings - Politico",
    "fullText": "Virginia attempted to prosecute federal officers who killed a man in 2017. It didn’t work.",
    "link": "https://www.politico.com/news/2026/01/28/minnesota-ice-shootings-deaths-prosecution-00753301"
  },
  {
    "text": "A Seat on Trump’s “Board of Peace” Costs $1 Billion. Guess Who Gets the Money. - Slate",
    "fullText": "The leaders of China, India, and Russia are among those who haven’t yet responded.",
    "link": "https://slate.com/news-and-politics/2026/01/trump-peace-board-gaza-one-billion-dollars.html"
  },
  {
    "text": "Home Depot to cut 800 corporate jobs, require workers back to office full time - ajc.com",
    "fullText": "Home Depot says it is eliminating about 800 corporate jobs tied to its Vinings headquarters.",
    "link": "https://www.ajc.com/business/2026/01/home-depot-to-cut-800-corporate-jobs-require-workers-back-to-office-full-time/"
  },
  {
    "text": "Where a nor’easter will bring heavy snow, strong winds and waves this weekend - The Washington Post",
    "fullText": "A potent system will bring the potential for blizzard-like conditions and coastal flooding from parts of the Southeast to New England.",
    "link": "https://www.washingtonpost.com/weather/2026/01/28/another-storm-east-coast-noreaster-forecast/"
  },
  {
    "text": "Trump's National Guard deployments could cost over $1 billion this year, CBO projects - NPR",
    "fullText": "The operation in Washington, D.C. alone is projected to cost upwards of $660 million if it runs through the end of this year as expected, according to new data released by the nonpartisan Congressional Budget Office.",
    "link": "https://www.npr.org/2026/01/28/nx-s1-5690394/national-guard-deployments-cost-cbo"
  },
  {
    "text": "Alexander Volkanovski welcomes fight with top UFC lightweight contender - MMA Fighting",
    "fullText": "Alexander Volkanovski happy to fight Arman Tsarukyan someday.",
    "link": "https://www.mmafighting.com/ufc/468566/alexander-volkanovski-responds-to-arman-tsarukyan-featherweight-challenge"
  },
  {
    "text": "Google confirms ‘Take a Message’ microphone bug, disabling on old Pixel phones - 9to5Google",
    "fullText": "For a small number of users, the Pixel Phone app’s “Take a Message” feature inadvertently sent audio to the caller...",
    "link": "http://9to5google.com/2026/01/28/pixel-take-a-message-bug/"
  },
  {
    "text": "Tom Morello announces surprise benefit concert at First Avenue - bringmethenews.com",
    "fullText": "Tom Morello, guitarist of Rage Against the Machine, has announced a last-minute benefit concert at First Avenue in Minneapolis.",
    "link": "https://bringmethenews.com/minnesota-lifestyle/tom-morello-announces-surprise-benefit-concert-at-first-avenue"
  },
  {
    "text": "What it’s like each day in Minneapolis - CNN",
    "fullText": "Residents of the Twin Cities region share their personal accounts of what it’s like to live in the midst of an ICE surge.",
    "link": "https://www.cnn.com/2026/01/28/us/residents-minneapolis-ice-daily-life-cec"
  },
  {
    "text": "NASA Has a New Estimate for Europa’s Ice Shell, and Whoa Is It Ever Thick - Gizmodo",
    "fullText": "Jupiter's fourth-largest moon is a main character in our search for other life-friendly places in our solar system.",
    "link": "https://gizmodo.com/nasa-has-a-new-estimate-for-europas-ice-shell-and-whoa-is-it-ever-thick-2000715015"
  },
  {
    "text": "‘Bluey’ Defeats ‘Stranger Things,’ Everything Else to Retain Title as Most Streamed Show in 2025 - hollywoodreporter.com",
    "fullText": "Nielsen also crowns ‘Family Guy’ creator Seth MacFarlane as a “streaming icon” in its year-end tallies.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/bluey-stranger-things-2025-year-end-streaming-charts-1236487118/"
  },
  {
    "text": "A Comprehensive Network for the Discovery and Characterization of Interstellar Objects Like… - Avi Loeb – Medium",
    "fullText": "Inspired by the unresolved anomalies displayed by the latest interstellar visitor 3I/ATLAS (as listed here), I co-authored a new paper with…",
    "link": "https://avi-loeb.medium.com/a-comprehensive-network-for-the-discovery-and-characterization-of-interstellar-objects-like-5c5bc711e852"
  }
]