[
  {
    "text": "Federal officials launch ICE operation in Maine and begin arrests - The Washington Post",
    "fullText": "“Everyone is on high alert,” Portland Mayor Mark Dion said. His city and nearby Lewiston have seen an influx of migrants and asylum seekers in recent years.",
    "link": "https://www.washingtonpost.com/nation/2026/01/21/ice-immigration-operation-maine/"
  },
  {
    "text": "Greenland latest: Trump drops European tariff threat as he touts ‘future’ Greenland deal - Financial Times",
    "fullText": "US president says that ‘productive meeting’ with Nato’s Mark Rutte led to pullback on levies",
    "link": "https://www.ft.com/content/1369a45e-e39b-4aaa-a347-b1800da7fd31"
  },
  {
    "text": "Apple to Revamp Siri as a Built-In iPhone, Mac Chatbot to Fend Off OpenAI - Bloomberg.com",
    "fullText": "Apple Inc. plans to revamp Siri later this year by turning the digital assistant into the company’s first artificial intelligence chatbot, thrusting the iPhone maker into a generative AI race dominated by OpenAI and Google.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-21/ios-27-apple-to-revamp-siri-as-built-in-iphone-mac-chatbot-to-fend-off-openai"
  },
  {
    "text": "Trump Calls Off Tariffs on Europe Over Greenland - The Wall Street Journal",
    "fullText": "President Trump said he won’t impose tariffs on several European nations after he reached the “framework of a future deal” on Greenland and the Arctic region with NATO Secretary-General Mark Rutte.“This solution, if consummated, will be a great one for the Un…",
    "link": "https://www.wsj.com/livecoverage/greenland-trump-tariffs-trade-eu/card/trump-calls-off-tariffs-on-europe-over-greenland-uJ1QWXMi6spyATVCMrEv"
  },
  {
    "text": "UnitedHealth pledges to return Obamacare profits to customers in 2026 - Politico",
    "fullText": "The announcement comes the day before health insurance CEOs testify on affordability at two House hearings.",
    "link": "https://www.politico.com/live-updates/2026/01/21/congress/unitedhealth-return-obamacare-profits-to-customers-00738928"
  },
  {
    "text": "Box Office: Chris Pratt’s ‘Mercy’ Targets $12 Million Debut, Aims to Dethrone ‘Avatar: Fire and Ash’ in Sixth Weekend - Variety",
    "fullText": "Will Chris Pratt's \"Mercy\" dethrone\" Avatar: Fire and Ash\" at the weekend box office?",
    "link": "https://variety.com/2026/film/box-office/mercy-box-office-projections-chris-pratt-avatar-fire-and-ash-1236635972/"
  },
  {
    "text": "Jamie Dimon hesitates to criticize Trump… except for one plan he says will create ‘an economic disaster’ - CNN",
    "fullText": "JPMorgan Chase CEO Jamie Dimon limited his criticism of President Donald Trump in a question-and-answer session at Davos on Wednesday – with one notable exception.",
    "link": "https://www.cnn.com/2026/01/21/business/dimon-davos-trump-credit-card"
  },
  {
    "text": "Everything you need to know about the 2026 Sundance Film Festival - AP News",
    "fullText": "The 42nd Sundance Film Festival kicks off this week in Park City, Utah. It marks the last edition in its longtime home and the first without founder Robert Redford, who died in September. Despite the changes, the festival remains vibrant with 90 features prem…",
    "link": "https://apnews.com/article/sundance-things-to-know-2026-7ac5fce635383dce045d879eb521b5d0"
  },
  {
    "text": "3rd child with measles in Virginia visited health care facilities in Woodbridge, Falls Church - wtop.com",
    "fullText": "A young child who lives in Northern Virginia has tested positive for measles, marking the third case in the state this month, according to health officials.",
    "link": "https://wtop.com/virginia/2026/01/3rd-child-with-measles-in-virginia-visited-health-care-facilities-in-woodbridge-falls-church/"
  },
  {
    "text": "Alix Earle To Star In Netflix Reality Series - Deadline",
    "fullText": "The series comes from Fulwell Entertainment, the company behind Hulu’s The Kardashians.",
    "link": "http://deadline.com/2026/01/alix-earle-netflix-reality-series-1236691247/"
  },
  {
    "text": "Judge denies lawmaker request for ‘independent monitor’ to oversee Epstein files release - Politico",
    "fullText": "But the judge noted that his order didn’t foreclose the lawmakers’ right to sue.",
    "link": "https://www.politico.com/live-updates/2026/01/21/congress/epstein-files-release-request-00738707"
  },
  {
    "text": "Nvidia Stock (NVDA) Rallies on Reports of Increased GPU Prices - TipRanks",
    "fullText": "Nvidia stock gained on reports that the company has increased the price of its GPUs.",
    "link": "https://www.tipranks.com/news/nvidia-stock-nvda-rallies-on-reports-of-increased-gpu-prices"
  },
  {
    "text": "Scoop: House Democratic Leader Hakeem Jeffries opposes bill funding DHS and ICE - Axios",
    "fullText": "Democrats are lining up against the bill.",
    "link": "https://www.axios.com/2026/01/21/hakeem-jeffries-dhs-ice-funding-democrats"
  },
  {
    "text": "Manchester City: Squad to refund ticket costs for fans after Champions League loss - BBC",
    "fullText": "The Manchester City squad will refund the ticket costs for 374 supporters who travelled to Norway to witness their side's shock 3-1 Champions League defeat at Bodo/Glimt on Tuesday.",
    "link": "https://www.bbc.com/sport/football/articles/c4gwp79rdz7o"
  },
  {
    "text": "ICE targeted off-duty police officers in Twin Cities, local police say - The Washington Post",
    "fullText": "The police chief of one Minneapolis suburb said all of the officers who had been stopped there by Immigration and Customs Enforcement were people of color.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/21/minnesota-minneapolis-off-duty-police-targeted-ice/"
  },
  {
    "text": "2026 NCAA Tournament Predictions: Bubble watch sees big stock up, stock down movers - On3",
    "fullText": "See which teams currently sit on the bubble of the 2025 NCAA Tournament, as conference play continues across college basketball.",
    "link": "https://www.on3.com/news/2026-ncaa-tournament-predictions-bubble-watch-sees-big-stock-up-stock-down-movers/"
  },
  {
    "text": "Matthew Stafford, Rams prepare to play Seahawks for 3rd time: 'As good a defense as we faced all year' - NFL.com",
    "fullText": "Matthew Stafford knows he has his work cut out for him against Mike Macdonald’s defense Sunday in Seattle. The Rams QB addressed earlier this week facing the Seahawks for the third time this season.",
    "link": "https://www.nfl.com/news/matthew-stafford-rams-prepare-to-play-seahawks-third-time-as-good-a-defense"
  },
  {
    "text": "EU lawmakers vote to hold up Mercosur trade agreement over legal concerns - AP News",
    "fullText": "European Union lawmakers have voted to hold up a major free trade agreement with the Mercosur group of South American countries over concerns about the legality of the deal. In a vote in Strasbourg, France, the lawmakers narrowly approved sending the EU-Merco…",
    "link": "https://apnews.com/article/mercosur-eu-deal-vote-court-36db5285a4b22c61da15c5bee02ef43e"
  }
]