[
  {
    "text": "Eritrea accuses Ethiopia of fabricating report its troops had crossed the border - BBC",
    "fullText": "Ethiopia had alleged that Eritrean soldiers were on its territory and supporting rebels in the north.",
    "link": "https://www.bbc.com/news/articles/cn87lzrj1l7o"
  },
  {
    "text": "Israeli security cabinet approves rules to increase control over West Bank - Al Jazeera",
    "fullText": "The Palestinian presidency calls the decision a ‘dangerous’ Israeli ‘attempt to legalize settlement expansion’.",
    "link": "https://www.aljazeera.com/news/2026/2/8/israel-security-cabinet-approves-rules-to-increase-control-over-west-bank"
  },
  {
    "text": "Warsh Call for Fed-Treasury Accord Stirs Debate in $30 Trillion Bond Market - Bloomberg.com",
    "fullText": "Kevin Warsh floated plenty of ideas for how he would run the Federal Reserve during his campaign for the job as chair. For Wall Street, few are as cryptic — or potentially consequential — as his call for a new accord with the Treasury Department.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-08/warsh-call-for-fed-treasury-accord-stirs-debate-bond-market"
  },
  {
    "text": "Hong Kong court jails pro-democracy media tycoon Jimmy Lai for 20 years - BBC",
    "fullText": "Lai was sentenced for offences under the city's controversial national security law.",
    "link": "https://www.bbc.com/news/live/cq5yv581e9yt"
  },
  {
    "text": "Israel’s president mourns antisemitic massacre in Australia, where fury over Gaza still divides - Yahoo",
    "fullText": "Israeli President Isaac Herzog received two very different receptions in Australia on Monday – a warm welcome by a government determined to show solidarity...",
    "link": "https://www.cnn.com/2026/02/07/australia/australia-israel-herzog-visit-intl-hnk"
  },
  {
    "text": "Jason Myers becomes first player in NFL history to score 200 points in a season+postseason - NBC Sports",
    "fullText": "Seahawks kicker Jason Myers has completed a season unlike any other in NFL history.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jason-myers-becomes-first-player-in-nfl-history-to-score-200-points-in-a-season-postseason"
  },
  {
    "text": "The most memorable 2026 Super Bowl commercials feature Ben Affleck, the cast of 'Jurassic Park,' Benson Boone backflips and more - Yahoo",
    "fullText": "This year's commercials feature stars like Kylie Kelce and Brian Baumgartner.",
    "link": "https://www.yahoo.com/entertainment/tv/article/the-most-memorable-2026-super-bowl-commercials-feature-ben-affleck-the-cast-of-jurassic-park-benson-boone-backflips-and-more-235030253.html"
  },
  {
    "text": "Japan election: Japanese stocks surge as PM Sanae Takaichi wins landslide election victory - BBC",
    "fullText": "Sanae Takaichi's ruling Liberal Democratic Party and coalition partner Japan Innovation Party have swept the majority of seats in Japan's lower house.",
    "link": "https://www.bbc.com/news/live/c2d76el7354t"
  },
  {
    "text": "Iran sentences Nobel laureate Narges Mohammadi to 7 more years in prison - AP News",
    "fullText": "Iran has sentenced Nobel Peace Prize laureate Narges Mohammadi to over seven more years in prison. Supporters say she began a hunger strike on February 2. Her lawyer confirmed the sentence, which includes charges of \"gathering and collusion\" and propaganda. M…",
    "link": "https://apnews.com/article/iran-us-nuclear-talks-protests-araghchi-389531836ccaa4c126b5ee06c1d5b1f8"
  },
  {
    "text": "Kim Kardashian & Lewis Hamilton Confirm Relationship at Super Bowl - TMZ",
    "fullText": "It's official ... Kim Kardashian and Lewis Hamilton are an item!",
    "link": "https://www.tmz.com/2026/02/08/kim-kardashian-lewis-hamilton-dating-super-bowl/"
  },
  {
    "text": "Green Day pulls its political punches in Super Bowl performance - cnn.com",
    "fullText": "The 1994 version of Billie Joe Armstrong would never.",
    "link": "https://www.cnn.com/2026/02/08/sport/green-day-super-bowl-performance"
  },
  {
    "text": "A day of highs and lows for Team USA - Axios",
    "fullText": "A Sunday that began with Lindsey Vonn's screams of pain after crashing in the downhill ended with cheers of jubilation.",
    "link": "https://www.axios.com/2026/02/09/milan-olympics-lindsey-vonn-ilia-malinin"
  },
  {
    "text": "NFL Mock Draft 2026: Post-Super Bowl Edition - The Draft Network",
    "fullText": "Let's see how the first round of the 2026 NFL Draft could play out in our latest NFL mock draft.",
    "link": "https://www.thedraftnetwork.com/2026/02/08/nfl-mock-draft-2026-super-bowl"
  },
  {
    "text": "Stock futures tick higher as Wall Street awaits closely watched jobs, inflation reports: Live updates - CNBC",
    "fullText": "The moves come after the major averages bounced back Friday from sizable losses suffered earlier in the week.",
    "link": "https://www.cnbc.com/2026/02/08/stock-market-today-live-updates.html"
  },
  {
    "text": "Stephen Miller: The aide driving Donald Trump's most controversial policies - BBC",
    "fullText": "The high-velocity start to 2026 by the Trump administration has cemented Stephen Miller's position as one of its most powerful figures.",
    "link": "https://www.bbc.com/news/articles/ce8rl71n4r3o"
  },
  {
    "text": "March for Life attendees may have been exposed to measles, DC Health warns - NPR",
    "fullText": "D.C. health officials are contacting people possibly exposed to measles at the March for Life in January, as confirmed cases rise nationwide.",
    "link": "https://www.npr.org/2026/02/08/nx-s1-5705972/measles-march-for-life-dc-reagan-national-union-station-metro"
  },
  {
    "text": "Fulton County argues FBI seizure of 2020 ballots shows ‘callous disregard’ for constitutional rights - Politico",
    "fullText": "A Trump-appointed judge set a Tuesday deadline to disclose justification for the raid.",
    "link": "https://www.politico.com/news/2026/02/08/fulton-county-fbi-seizure-2020-ballots-constitution-00770938"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date Latest: What To Expect And When - Forbes",
    "fullText": "Samsung will launch the Galaxy S26 Ultra, Galaxy S26+ and Galaxy S26 later this month. When can you expect the launch, the pre0-orders, reviews and retail sales to start?",
    "link": "https://www.forbes.com/sites/ewanspence/2026/02/08/samsung-galaxy-s26-ultra-launch-date-release-date-galaxy-unpacked-new-galaxy-s26/"
  },
  {
    "text": "The Arctic's first inhabitants shaped thousands of years of ecological development - Phys.org",
    "fullText": "Archaeologists have uncovered evidence for repeated prehistoric occupation in the remote island cluster of Kitsissut, north of Greenland, indicating the first people in the High Arctic were skilled seafarers who had a profound impact on early Arctic environme…",
    "link": "https://phys.org/news/2026-02-arctic-inhabitants-thousands-years-ecological.html"
  }
]