[
  {
    "text": "Kiefer Sutherland arrested and accused of assaulting ride-share driver, L.A. police say - NBC News",
    "fullText": "Actor Kiefer Sutherland, a film and television star since the 1980s, was arrested Monday after he was alleged to have physically assaulted and threatened a ride-share driver, police said.",
    "link": "https://www.nbcnews.com/news/us-news/kiefer-sutherland-arrested-allegedly-assaulting-ride-share-driver-l-po-rcna253933"
  },
  {
    "text": "Trump administration indefinitely pauses immigrant visa processing for 75 nations - The Washington Post",
    "fullText": "Authorities said the pause on processing immigrant visas aims to crack down on immigrants the Trump administration believes are likely to become reliant on public benefits.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/14/trump-immigration-visa-processing-pause/"
  },
  {
    "text": "Candidates have legal standing to challenge election laws, the Supreme Court rules - NPR",
    "fullText": "In a case related to Illinois state law about the return of mail ballots, the U.S. Supreme Court says political candidates have the legal standing to challenge election policies.",
    "link": "https://www.npr.org/2026/01/14/nx-s1-5677318/supreme-court-bost-decision-candidate-standing"
  },
  {
    "text": "Source: LHP Suarez, BoSox agree to 5-year deal - ESPN",
    "fullText": "The Boston Red Sox have agreed to a five-year, $130 million deal with left-hander Ranger Suarez, a source told ESPN, confirming multiple reports.",
    "link": "https://www.espn.com/mlb/story/_/id/47611209/source-ranger-suarez-agrees-5-year-130m-deal-red-sox"
  },
  {
    "text": "Widespread Verizon outage prompts emergency alerts in Washington, New York City - NBC News",
    "fullText": "Verizon said on Wednesday that its wireless service was suffering an outage impacting cellular data and voice services",
    "link": "https://www.nbcnews.com/business/consumer/verizon-outage-new-york-washington-rcna254050"
  },
  {
    "text": "S&P 500 falls 1%, under pressure by tech; Bank of America, Wells Fargo slip after earnings: Live updates - CNBC",
    "fullText": "Traders digested a fresh batch of earnings and monitored geopolitical developments.",
    "link": "https://www.cnbc.com/2026/01/13/stock-market-today-live-updates.html"
  },
  {
    "text": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "fullText": "Opting out of childhood vaccines is becoming more common across most of the United States, leaving larger shares of the population vulnerable to preventable diseases like measles, which is continuing its record-breaking spread across the country.",
    "link": "https://www.cnn.com/2026/01/14/health/vaccine-exemptions-county-risk-measles-vis"
  },
  {
    "text": "Grammy-nominated musician John Forté found dead at 50 in Massachusetts home - NBC News",
    "fullText": "NEW YORK — John Forté, the Grammy-nominated musician known for his work with the Fugees and the Refugee Camp All-Stars among others, has died at age 50.",
    "link": "https://www.nbcnews.com/news/us-news/grammy-nominated-musician-john-forte-found-dead-50-massachusetts-home-rcna254032"
  },
  {
    "text": "Meet Bilt Card 2.0: The Richest Rewards on Rent, Mortgage, and Everything Else - Bilt Rewards",
    "fullText": "Bilt Newsroom is the source for news about Bilt. Read press releases and get updates on the latest at Bilt.",
    "link": "https://newsroom.biltrewards.com/meetbiltcard2.0"
  },
  {
    "text": "Scientists sequence a woolly rhino genome from a 14,400-year-old wolf’s stomach - Ars Technica",
    "fullText": "Fortunately for paleogeneticists, wolf puppies don't chew their food thoroughly.",
    "link": "https://arstechnica.com/science/2026/01/scientists-sequence-a-woolly-rhino-genome-from-a-14400-year-old-wolfs-stomach/"
  },
  {
    "text": "Leaker details iPhone 18 lineup screen sizes, Dynamic Island plans - 9to5Mac",
    "fullText": "We’re eight months away from the iPhone 18 being unveiled, and a reputable Weibo leaker has detailed screen sizes and more for the lineup.",
    "link": "https://9to5mac.com/2026/01/14/leaker-details-iphone-18-lineup-screen-sizes-dynamic-island-plans/"
  },
  {
    "text": "The Opener: Tucker, Cardinals, Yankees, Marlins - MLB Trade Rumors",
    "fullText": "Today's baseball news includes the Kyle Tucker market heating up and the Nolan Arenado era ending in St. Louis. Read more at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/the-opener-tucker-cardinals-yankees-marlins.html"
  },
  {
    "text": "US reducing personnel at Qatar air base, official tells CBS - BBC",
    "fullText": "Officials say it is a \"precautionary measure\" and comes as Donald Trump weighs up whether to take action against Iran.",
    "link": "https://www.bbc.com/news/articles/c701xywwxw8o"
  },
  {
    "text": "ISS astronaut medical evacuation latest news: Crew-11 astronauts to undock from station - Space",
    "fullText": "Wednesday, Jan. 14, 2026: Updates on NASA's astronaut medical evacuation from the International Space Station.",
    "link": "https://www.space.com/news/live/astronaut-medical-evacuation-on-iss-jan-14-2026"
  },
  {
    "text": "Tim McGraw to headline entertainment for 2026 NHL Stadium Series in Tampa - NHL.com",
    "fullText": "Country music superstar will perform during 1st intermission of Lightning-Bruins game at Raymond James Stadium",
    "link": "https://www.nhl.com/news/tim-mcgraw-to-headline-entertainment-for-2026-nhl-stadium-series-in-tampa"
  },
  {
    "text": "The 5 Deadliest Heart Conditions in America Today — and Their Biggest Risk Factors - Money Talks News",
    "fullText": "A new report reveals that progress against heart disease has stalled while key risk factors continue to climb.",
    "link": "https://www.moneytalksnews.com/the-most-deadly-heart-conditions-in-america-today-and-their-biggest-warning-signs/"
  },
  {
    "text": "Apple may have hinted at a high-end MacBook Pro launch on January 28 - 9to5Mac",
    "fullText": "The first M5-powered MacBook Pro launched in October of last year. Apple described the chip as offering “the next big...",
    "link": "https://9to5mac.com/2026/01/14/apple-may-have-hinted-at-a-high-end-macbook-pro-launch-on-january-28/"
  },
  {
    "text": "Bank of America Reports Fourth Quarter 2025 Financial Results - Bank of America",
    "fullText": "Bank of America reported its fourth quarter 2025 financial results today. The news release, supplemental filing and investor presentation can be accessed at Bank of America’s Investor Relations website at https://investor.bankofamerica.com/quarterly-earnings.",
    "link": "https://newsroom.bankofamerica.com/content/newsroom/press-releases/2026/01/bank-of-america-reports-fourth-quarter-2025-financial-results.html"
  }
]