[
  {
    "text": "Who’s who in Zohran Mamdani’s administration? - City & State New York",
    "fullText": "Meet the folks who are running New York City.",
    "link": "https://www.cityandstateny.com/politics/2026/01/whos-who-zohran-mamdanis-administration/409701/"
  },
  {
    "text": "US retreats from Trump’s pasta tariffs, Italy says - Financial Times",
    "fullText": "Proposed levies of up to 92% slashed on imported Italian premium brands",
    "link": "https://www.ft.com/content/670b11be-83a6-4d1e-83b7-91e65afea514"
  },
  {
    "text": "Despite rain, 137th Rose Parade to make its way down Colorado Boulevard in Pasadena - ABC7 Los Angeles",
    "fullText": "For the first time in 20 years, rain is expected to be falling when the 137th edition of the Rose Parade makes it way down Colorado Boulevard in Pasadena, but the inclement weather was not expected to dampen the spirit of spectators.",
    "link": "https://abc7.com/post/despite-rain-137th-rose-parade-make-down-colorado-boulevard-pasadena/18338547/"
  },
  {
    "text": "Stellantis resurrects $100,000 Ram TRX V-8 pickup truck amid industry deregulation - CNBC",
    "fullText": "The 2027 Ram 1500 SRT TRX will be available late next year after a roughly three-year hiatus for around $100,000.",
    "link": "https://www.cnbc.com/2026/01/01/ram-trx-v8-pickup-truck.html"
  },
  {
    "text": "Announcing the New Year Warhammer Preview Live! 2026 – your first reveal show of the year - Warhammer Community",
    "fullText": "The first preview of 2026 is coming soon.",
    "link": "https://www.warhammer-community.com/articles/uzoe2wdo/announcing-the-new-year-warhammer-preview-live-2026-your-first-reveal-show-of-the-year"
  },
  {
    "text": "In Mamdani’s New York, Muslims become a political and demographic force - The Washington Post",
    "fullText": "Muslim New Yorkers formed the backbone of Zohran Mamdani’s mayoral election victory, ushering in a new era for New York and the city’s changing demographics.",
    "link": "https://www.washingtonpost.com/nation/2026/01/01/muslims-new-york-mamdani-politics/"
  },
  {
    "text": "The Most Anticipated Movies of 2026 - The Hollywood Reporter",
    "fullText": "Along with a new ‘Dune’ and ‘Spider-Man’, 2026 will have nostalgia plays like ‘Devil Wears Prada’ and ‘Practical Magic’ sequels as well as films from Alejandro G. Iñárritu, Christopher Nolan and Greta Gerwig.",
    "link": "http://www.hollywoodreporter.com/lists/2026-new-movie-releases/"
  },
  {
    "text": "Oregon vs Texas Tech Prediction, Picks & Odds for Today's Orange Bowl CFP Quarterfinal Game - Covers.com",
    "fullText": "Our Oregon vs. Texas Tech predictions like the Red Raiders to pull off the CFP Quarterfinal upset on Thursday, January 1, 2026. Free college football picks and best bets for today's Orange Bowl.",
    "link": "https://www.covers.com/ncaaf/oregon-vs-texas-tech-prediction-picks-odds-best-bets-today-january-1-2026"
  },
  {
    "text": "PFF Grades: Miami's ten best players in the Cotton Bowl win over Ohio State - 247Sports",
    "fullText": "The Miami Hurricanes controlled the game against Ohio State from start to finish",
    "link": "https://247sports.com/college/miami/article/pro-football-focus-grades-miamis-ten-best-players-in-the-cotton-bowl-win-over-ohio-state-268790578/"
  },
  {
    "text": "Iran security force member killed during protests, officials say - BBC",
    "fullText": "A currency collapse has led to protests breaking out across the country, with unrest reported in several cities.",
    "link": "https://www.bbc.com/news/articles/c2d7g8krj2po"
  },
  {
    "text": "Flu cases are rising with a new strain that makes older people sicker - The Washington Post",
    "fullText": "Flu season is ramping up in the U.S., marked by a new strain that could make vaccines less effective. Covid cases remain down.",
    "link": "https://www.washingtonpost.com/health/2026/01/01/flu-season-new-strain/"
  },
  {
    "text": "Tesla Sales Outlook Darkens Despite Musk’s Self-Driving Euphoria - Bloomberg.com",
    "fullText": "Tesla Inc. ended last year on a roll, with investors increasingly buying into Elon Musk’s ebullience about autonomous vehicles. Winning over actual car buyers was another story.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-01/tesla-sales-outlook-darkens-despite-musk-s-self-driving-euphoria"
  },
  {
    "text": "What to expect from the planets in 2026 — key dates and sky events - Space",
    "fullText": "Your complete guide to the brightest planetary moments of 2026.",
    "link": "https://www.space.com/stargazing/what-to-expect-from-the-planets-in-2026-key-dates-and-sky-events"
  },
  {
    "text": "US military says five killed in strike on alleged drug boats - BBC",
    "fullText": "The latest strike comes as the US Coast Guard searches for survivors of another that happened a day earlier.",
    "link": "https://www.bbc.com/news/articles/czdq1ple2l4o"
  },
  {
    "text": "How to watch the 2026 Rose Bowl: No. 1 Indiana faces No. 9 Alabama in College Football Playoffs - NBC News",
    "fullText": "Learn more on how to watch the Rose Bowl, what time it starts and what to expect as the Indiana Hoosiers and Alabama Crimson Tide meet in the College Football Playoffs.",
    "link": "https://www.nbcnews.com/sports/college-football/rose-bowl-2026-where-watch-channel-time-indiana-alabama-when-start-rcna251577"
  },
  {
    "text": "Bulgaria is joining the euro. Here's what it means for consumers and businesses - Yahoo Finance",
    "fullText": "On New Year's Day, Bulgaria will achieve its decades-old goal of joining the euro currency union and deepening ties with the more prosperous countries of...",
    "link": "https://finance.yahoo.com/news/bulgaria-joining-euro-heres-means-100135878.html"
  },
  {
    "text": "Crypto soared in 2025 — and then crashed. Now what? - NPR",
    "fullText": "For most of 2025, cryptocurrencies such as bitcoin surged as President Trump vowed to make the U.S. a crypto leader. But now, a severe sell-off has shaken the sector.",
    "link": "https://www.npr.org/2026/01/01/nx-s1-5642654/trump-crypto-winter-bitcoin"
  }
]