[
  {
    "text": "A month before their 5-year anniversary, an Ohio couple was killed in the home where they exchanged vows. Here’s what we know - CNN",
    "fullText": "Just one month before their fifth wedding anniversary, the same setting where an Ohio couple began their life together became the site of unspeakable tragedy.",
    "link": "https://www.cnn.com/2026/01/03/us/spencer-monique-tepe-columbus-ohio-homicide"
  },
  {
    "text": "Raiders will play everybody, in game that earns them first overall pick if they lose - NBC Sports",
    "fullText": "The Raiders will clinch the first overall pick in the 2026 NFL draft with a loss on Sunday.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/raiders-will-play-everybody-in-game-that-earns-them-first-overall-pick-if-they-lose"
  },
  {
    "text": "Scientists tested intermittent fasting without eating less and found no metabolic benefit - ScienceDaily",
    "fullText": "Time-restricted eating has been widely promoted as a simple way to boost metabolic health, but new research paints a more complicated picture. When calorie intake stayed the same, an eight-hour eating window did not improve insulin sensitivity or cardiovascul…",
    "link": "https://www.sciencedaily.com/releases/2025/12/251228020018.htm"
  },
  {
    "text": "Trump orders Chinese-controlled firm to unwind chip asset deal, citing national security risks - CNBC",
    "fullText": "A Chinese-controlled company must divest semiconductor assets it bought from Emcore after the White House said the deal could threaten U.S. national security.",
    "link": "https://www.cnbc.com/2026/01/03/trump-orders-unwind-chinese-chip-acquisition-emcore-hiefo-emcore-velocity-one-navgiation-gyro.html"
  },
  {
    "text": "Tesla sales hit lowest point since 2022 after Musk backlash and end of tax credit - Axios",
    "fullText": "Vehicle sales are critical to funding CEO Elon Musk's AI ambitions.",
    "link": "https://www.axios.com/2026/01/02/tesla-sales-ev-elon-musk"
  },
  {
    "text": "What to know about the Ukrainian general picked by Zelenskyy to be his new chief of staff - ABC News",
    "fullText": "Ukrainian President Volodymyr Zelenskyy has announced Gen. Kyrylo Budanov, the head of the country’s military intelligence service, as his new chief of staff",
    "link": "https://abcnews.go.com/International/wireStory/ukrainian-general-picked-zelenskyy-new-chief-staff-128860283"
  },
  {
    "text": "More than 100 firefighters battle massive blaze in Denver - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/100-firefighters-battle-massive-blaze-denver/story?id\\\\u003d128860097"
  },
  {
    "text": "Rangers beat Panthers 5-1 in first outdoor hockey game in Miami. Mika Zibanejad has hat trick - AP News",
    "fullText": "The New York Rangers have continued their dominance in outdoor games. Mika Zibanejad had a hat trick, Artemi Panarin scored twice and the Rangers beat the Florida Panthers 5-1 on Friday night in the Winter Classic at Miami's loanDepot Park. It was the first o…",
    "link": "https://apnews.com/article/winter-classic-panthers-rangers-score-9817591fb165882491470655533b297c"
  },
  {
    "text": "Victoria Jones, daughter of Tommy Lee Jones, found dead in hotel on New Year's Day - NBC News",
    "fullText": "The daughter of Academy Award-winning actor Tommy Lee Jones has died, her family acknowledged in a statement on Friday night.",
    "link": "https://www.nbcnews.com/pop-culture/celebrity/victoria-jones-daughter-tommy-lee-jones-found-dead-hotel-new-years-day-rcna251896"
  },
  {
    "text": "What weather forecast for 49ers-Seahawks on Saturday has in store for Brock Purdy - San Francisco Chronicle",
    "fullText": "In what figures to be a welcome forecast for the San Francisco 49ers and quarterback Brock Purdy, the weather in Santa Clara on Saturday might not be too messy.",
    "link": "https://www.sfchronicle.com/sports/49ers/article/weather-forecast-49ers-vs-seahawks-brock-purdy-21273692.php"
  },
  {
    "text": "DHS hypes worksite enforcement as fraud allegations rip through Minnesota - Axios",
    "fullText": "Sec. Noem says there's \"more coming\" as ICE focuses on businesses.",
    "link": "https://www.axios.com/2026/01/02/dhs-noem-minnesota-fraud"
  },
  {
    "text": "Availability Report: Kentucky will have a full roster vs. Alabama - On3",
    "fullText": "Kentucky did not have a single player on the initial Availability Report ahead of Saturday's game against Alabama.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/availability-report-kentucky-full-roster-vs-alabama/"
  },
  {
    "text": "Yemen’s separatists announce a constitution for an independent south - AP News",
    "fullText": "Yemen’s separatist movement has announced a constitution for an independent nation in the south and demanded other factions in the war-torn country accept the move. The announcement Friday marked an escalation of a confrontation that has pitted Gulf powerhous…",
    "link": "https://apnews.com/article/yemen-saudi-arabia-uae-aden-hadramout-stc-47430060997b893492a4770841a6eab1"
  },
  {
    "text": "Is Trump taking too much aspirin? Here's what experts say - NPR",
    "fullText": "Trump takes four times the recommended dose of aspirin for cardiac prevention. Even low-dose aspirin is no longer recommended for people over 60 who don't have heart disease.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/02/nx-s1-5665112/trump-aspirin-325-81-mg-low-dose-cardiac-stroke-heart-attack-bleeding"
  },
  {
    "text": "California's open carry gun ban unconstitutional, federal court rules - Axios",
    "fullText": "The court ruled that openly carrying guns is \"part of this Nation's history and tradition.\"",
    "link": "https://www.axios.com/2026/01/02/california-guns-open-carry-ban-unconstitutional"
  },
  {
    "text": "The latest numbers as flu cases continue to climb across Texas - ABC13 Houston",
    "fullText": "ABC13 is continuing to monitor flu cases as they climb nationwide and here in Houston.",
    "link": "https://abc13.com/post/latest-numbers-flu-cases-continue-climb-texas/18343679/"
  },
  {
    "text": "Anthrax nearly kills healthy 18-year-old welder amid puzzling pattern - Ars Technica",
    "fullText": "Welder's Anthrax\" was first coined in 2022, when seven cases had been identified.",
    "link": "https://arstechnica.com/health/2026/01/anthrax-nearly-kills-healthy-18-year-old-welder-amid-puzzling-pattern/"
  },
  {
    "text": "31 Of The Biggest And Coolest 2026 Games We Can't Wait To Play - Kotaku",
    "fullText": "Grand Theft Auto 6, Wolverine, Slay The Spire 2, Resident Evil Requiem, and much, much more are set to arrive this year",
    "link": "https://kotaku.com/2026-game-releases-most-anticipated-batman-gta-6-wolverine-2000656197"
  }
]