[
  {
    "text": "Russia uses its new ballistic missile in a major attack on Ukraine and a warning to West - AP News",
    "fullText": "Russia has launched a massive overnight attack on Ukraine, using hundreds of drones and dozens of missiles. Officials say at least four people have been killed. For only the second time in the nearly 4-year-old war, it used a powerful, new hypersonic missile …",
    "link": "https://apnews.com/article/russia-ukraine-war-drones-missile-kyiv-56655401d55ab4818800c43b7035b2a9"
  },
  {
    "text": "‘Uninvestable’: Trump pitch to oil execs yields no promises - Politico",
    "fullText": "The CEOs heaped praise on the president’s actions in Venezuela but made no firm commitments to put money into restoring the country’s oil production.",
    "link": "https://www.politico.com/news/2026/01/09/venezuela-is-uninvestible-for-now-exxon-ceo-tells-trump-in-white-house-meeting-00720198"
  },
  {
    "text": "Mound of garbage collapses at Philippine landfill, burying and trapping 38 people and killing 1 - abcnews.go.com",
    "fullText": "Officials say an avalanche of garbage and debris buried or trapped workers at a landfill in the Philippines, killing one person, injuring a dozen and leaving 38 others missing",
    "link": "https://abcnews.go.com/International/wireStory/police-1-person-killed-27-missing-landfill-collapse-129038874"
  },
  {
    "text": "Pulte backs away from 50-year mortgage - Politico",
    "fullText": "The Federal Housing director said the president is reviewing between 30 and 50 ideas to bring down housing costs.",
    "link": "https://www.politico.com/news/2026/01/09/pulte-backs-away-from-50-year-mortgage-00720309"
  },
  {
    "text": "Trump: ‘We are going to do something on Greenland whether they like it or not’ - CNBC",
    "fullText": "Trump said that if the U.S. doesn't take action on Greenland, \"Russia or China will take over\" the Danish island territory.",
    "link": "https://www.cnbc.com/2026/01/09/trump-greenland-military-denmark-nato.html"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Google: Don’t make “bite-sized” content for LLMs if you care about search rank - Ars Technica",
    "fullText": "Google says creating for people rather than robots is the best long-term strategy.",
    "link": "https://arstechnica.com/google/2026/01/google-dont-make-bite-sized-content-for-llms-if-you-care-about-search-rank/"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "The 'Age of Fishes' began with mass death, fossil database reveals - Phys.org",
    "fullText": "Some 445 million years ago, life on Earth was forever changed. During the geological blink of an eye, glaciers formed over the supercontinent Gondwana, drying out many of the vast, shallow seas like a sponge and giving an \"icehouse climate\" that, together wit…",
    "link": "https://phys.org/news/2026-01-age-fishes-began-mass-death.html"
  },
  {
    "text": "New Jersey Department of Health confirms first pediatric flu death of the 2025-2026 season - 6abc Philadelphia",
    "fullText": "The child, from North Jersey, was under five years old and had no known health issues.",
    "link": "https://6abc.com/post/new-jersey-department-health-confirms-first-pediatric-flu-death-2025-2026-season/18378358/"
  },
  {
    "text": "Exercise can be nearly as effective as therapy for depression - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46557233"
  },
  {
    "text": "Expert Predictions: Wild Card Picks for Chargers at Patriots - Official website of the New England Patriots",
    "fullText": "Experts share their picks for the Patriots Wild Card matchup against the Los Angeles Chargers.",
    "link": "https://www.patriots.com/news/expert-predictions-wild-card-picks-for-chargers-at-patriots"
  },
  {
    "text": "Secretary Bessent Announces Initiatives to Combat Rampant Fraud in Minnesota - U.S. Department of the Treasury (.gov)",
    "fullText": "Actions Increase Transparency, Seek Accountability for Taxpayer DollarsWASHINGTON— In Minnesota, Secretary of the Treasury Scott Bessent announced several initiatives to combat rampant government benefits fraud in Minnesota, which has wasted billions of taxpa…",
    "link": "https://home.treasury.gov/news/press-releases/sb0354"
  },
  {
    "text": "Chinese, Russian and Iranian warships arrive for drills in South Africa - Al Jazeera",
    "fullText": "Naval exercises come as tensions run high after US military intervention in Venezuela, seizures of several oil tankers.",
    "link": "https://www.aljazeera.com/news/2026/1/9/chinese-russian-and-iranian-warships-arrive-for-drills-in-south-africa"
  },
  {
    "text": "Amazon Pharmacy starts offering Novo Nordisk's Wegovy weight-loss pill - CNBC",
    "fullText": "Eligible customers with insurance can pay as little as $25 for a one-month supply of the drug, while cash-paying options start at $149 a month, Amazon said.",
    "link": "https://www.cnbc.com/2026/01/09/amazon-pharmacy-starts-offering-novo-nordisks-wegovy-weight-loss-pill.html"
  },
  {
    "text": "How Death Redefined David Bowie’s ‘Blackstar’ - The Ringer",
    "fullText": "Looking back on the Thin White Duke’s passing, legacy, and swan song 10 years later",
    "link": "https://www.theringer.com/2026/01/09/music/david-bowie-blackstar-10-years-death-anniversary"
  },
  {
    "text": "IRS.gov resources can help answer questions about the One, Big, Beautiful Bill - IRS (.gov)",
    "fullText": "IR-2026-04, Jan. 9, 2026 — Taxpayers may be able to take advantage of new deductions that could reduce taxable income and increase refunds due to the One, Big, Beautiful Bill, passed by Congress in July 2025.",
    "link": "https://www.irs.gov/newsroom/irsgov-resources-can-help-answer-questions-about-the-one-big-beautiful-bill"
  },
  {
    "text": "Baltimore Ravens’ choice of Lamar Jackson over John Harbaugh sets off NFL domino effect - Andscape",
    "fullText": "In one of the NFL’s worst-kept secrets, the Miami Dolphins are in the mix to hire Super Bowl-winning head coach John Harbaugh. Franchise owner Stephen M. Ross, a University of Michigan alumnus and major university benefactor, became familiar with the perennia…",
    "link": "https://andscape.com/features/baltimore-ravens-choice-of-lamar-jackson-over-john-harbaugh-sets-off-nfl-domino-effect/"
  }
]