[
  {
    "text": "Seahawks rookie safety Nick Emmanwori injures ankle during Super Bowl practice - KOMO",
    "fullText": "Seahawks rookie safety Nick Emmanwori injured an ankle during Wednesday's practice as Seattle prepares to face New England in the Super Bowl.",
    "link": "https://komonews.com/sports/seahawks/seahawks-rookie-safety-nick-emmanwori-injures-ankle-during-super-bowl-60-practice-vs-patriots-left-tackles-banged-up-charles-cross-josh-jones-nfl-championship-game"
  },
  {
    "text": "Review | Bad Bunny conquered the world, but he wants to save Puerto Rico - The Washington Post",
    "fullText": "In “P FKN R,” Vanessa Díaz and Petra R. Rivera-Rideau explore the music and activism of Bad Bunny.",
    "link": "https://www.washingtonpost.com/books/2026/02/05/bad-bunny-book-review/"
  },
  {
    "text": "Some Public Health Service officers quit rather than serve in ICE detention centers - NPR",
    "fullText": "A special corps of health care workers have been called in to work with detained immigrants and many feel deeply conflicted about the assignment, saying they're not able to provide good care.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5698538/public-health-service-ice-detention-centers"
  },
  {
    "text": "This black hole \"burps\" with Death Star energy - Ars Technica",
    "fullText": "Dubbed \"Jetty McJetface,\" the tidal disruption event's energy keeps getting brighter and should peak in 2027.",
    "link": "https://arstechnica.com/science/2026/02/this-black-hole-burps-with-death-star-energy/"
  },
  {
    "text": "Famine is threatening more of war-torn Sudan’s Darfur region as an attack in the south kills 22 - AP News",
    "fullText": "A global hunger monitoring group says that famine is threatening more areas in war-torn Sudan’s western Darfur region, where acute malnutrition has been registered in two more towns there. The group did not confirm a full famine in those towns. The report by …",
    "link": "https://apnews.com/article/sudan-famine-rsf-kordofan-darfur-war-hunger-9b16a0419f8d7cc67c7e95939a8a954d"
  },
  {
    "text": "NASA will finally allow astronauts to bring their iPhones to space - Ars Technica",
    "fullText": "We are giving our crews the tools to capture special moments.\"",
    "link": "https://arstechnica.com/space/2026/02/nasa-will-finally-allow-astronauts-to-bring-their-iphones-to-space/"
  },
  {
    "text": "Trump to launch TrumpRx drug discount site. Here's when - Axios",
    "fullText": "The site will offer discounted drug prices through special agreements with drug companies.",
    "link": "https://www.axios.com/2026/02/05/trump-trumprx-drug-price-discount-site-launch"
  },
  {
    "text": "Google teases AirDrop support for more Android phones, 'exciting' announcements 'very soon' - 9to5Google",
    "fullText": "A Google VP is teasing that Android's Quick Share tool will be adding support for AirDrop on more phones in the not-too-distant future.",
    "link": "http://9to5google.com/2026/02/05/google-teases-airdrop-support-for-more-android-phones-exciting-announcements-very-soon/"
  },
  {
    "text": "Spanberger takes further steps to remove Virginia from ICE operations - The Washington Post",
    "fullText": "Virginia Gov. Abigail Spanberger (D) on Wednesday ordered state law enforcement agencies to dissolve any partnership agreements with federal immigration enforcement.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/02/05/virginia-spanberger-ice-trump-immigration/"
  },
  {
    "text": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "fullText": "New START is the last major guardrail constraining the nuclear arsenals of the two countries that together hold some 85% of the world's warheads.",
    "link": "https://www.axios.com/2026/02/05/new-start-arms-control-us-russia-extend"
  },
  {
    "text": "Scientists Scanned a Black Rock From Mars And Found Something Surprising - ScienceAlert",
    "fullText": "New tools unlock new discoveries in science.",
    "link": "https://www.sciencealert.com/scientists-scanned-a-black-rock-from-mars-and-found-something-surprising"
  },
  {
    "text": "Measles continues to spread in the US, but with some letup - NPR",
    "fullText": "As South Carolina's outbreak grows to 876 confirmed cases, vaccinations in the state surged in January. Cases have also been reported in two ICE detention facilities.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5698522/measles-south-carolina-ice-detention-facilities"
  },
  {
    "text": "ECB's President Lagarde: Growth is mainly driven by services, notably IT and comms - Forex Factory",
    "fullText": "ECB's President Lagarde: Growth is mainly driven by services, notably IT and comms ECB'S LAGARDE: GOVT SPENDING SHOULD CONTRIBUTE TO DOMESTIC DEMAND ... Just in | ECB President Lagarde Warns of Demand Risks Due to Economic Uncertainty. ECB's President Lagarde…",
    "link": "https://www.forexfactory.com/news/1382580-ecbs-president-lagarde-growth-is-mainly-driven-by"
  },
  {
    "text": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks - Axios",
    "fullText": "\"The main feeling among members is a lack of trust in his strength and ability to strike a hard bargain.\"",
    "link": "https://www.axios.com/2026/02/05/democrats-schumer-ice-government-shutdown"
  },
  {
    "text": "Iran, US to negotiate over proxy terror, ballistic missiles - The Jerusalem Post",
    "fullText": "The talks between Iran and US are still set to focus on Iran's nuclear program and capabilities, NYT noted, citing three Iranian officials and one Arab official.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-885729"
  },
  {
    "text": "Peloton shares plunge more than 20% on weak holiday quarter, sluggish demand for splashy new products - CNBC",
    "fullText": "Peloton's product overhaul was designed to bring in new customers and encourage existing members to trade up. Instead, shoppers turned away from higher prices.",
    "link": "https://www.cnbc.com/2026/02/05/peloton-pton-earnings-q2-2026.html"
  },
  {
    "text": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade - Cleveland.com",
    "fullText": "There have been mixed emotions over the last 24 hours. It’s natural when a trade occurs. But the overriding feeling in the Cleveland locker room is enthusiasm.",
    "link": "https://www.cleveland.com/cavs/2026/02/our-ceiling-is-higher-donovan-mitchell-opens-up-about-james-harden-darius-garland-trade.html"
  },
  {
    "text": "Did astronomers see a black hole explode: An 'impossible' particle that hit Earth in 2023 may tell us - Space",
    "fullText": "\"If our hypothesized dark charge is true, then we believe there could be a significant population of primordial black holes, which would be consistent with other astrophysical observations, and account for all the missing dark matter in the universe.\"",
    "link": "https://www.space.com/astronomy/black-holes/did-astronomers-see-a-black-hole-explode-an-impossible-particle-that-hit-earth-in-2023-may-tell-us"
  },
  {
    "text": "Exclusive | Trump Administration to Make It Easier to Fire 50,000 Federal Workers - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/policy/trump-federal-employees-new-category-1051bc29"
  },
  {
    "text": "US man shares clever AirTag trick that Apple never explains when you buy it - supercarblondie.com",
    "fullText": "US tech creator reveals a simple AirTag setup trick Apple doesn’t explain, plus a small habit that makes trackers far more useful day to day",
    "link": "https://supercarblondie.com/tech/apple-airtag-tips-and-tricks/"
  }
]