[
  {
    "text": "Israeli co-creator of Tehran dies during filming in Greece - The Jerusalem Post",
    "fullText": "The production company of 52-year-old Eden stated that the rumors of nationalist or criminal involvement in her death are unfounded.",
    "link": "https://www.jpost.com/israel-news/culture/article-886772"
  },
  {
    "text": "Trump's second year: Whiplash - Politico",
    "fullText": "\"Even proposals that don’t ultimately move forward have consequences.\"",
    "link": "https://www.politico.com/news/2026/02/16/trump-policy-whiplash-grants-canada-credit-cards-00780845"
  },
  {
    "text": "The myth that women are more naturally empathetic than men - BBC",
    "fullText": "Scientific research is up-ending age-old gender stereotypes about empathy – and revealing new ways of thinking about masculinity.",
    "link": "https://www.bbc.com/future/article/20260213-are-women-naturally-more-empathetic-than-men"
  },
  {
    "text": "Can flickering lights and sound slow Alzheimer’s? A researcher seeks that answer - CNN",
    "fullText": "A Georgia Tech researcher is turning flickering light and sound into a new tool in the fight against Alzheimer’s, using rhythmic sensory stimulation to “tune” brain waves, boost memory, and potentially slow the disease’s progression. Her hope is that this non…",
    "link": "https://www.cnn.com/health/flickering-lights-sound-slow-alzheimers-annabelle-singer-spc"
  },
  {
    "text": "Mask, clothing worn by suspect in Nancy Guthrie's disappearance believed to be from Walmart, sheriff says - CBS News",
    "fullText": "Pima County Sheriff Chris Nanos told CBS News the suspect's backpack is one of the most promising leads in the case, as the search continues for Nancy Guthrie.",
    "link": "https://www.cbsnews.com/news/nancy-guthrie-suspect-mask-clothing-walmart/"
  },
  {
    "text": "Fund Beating 99% of Peers Sees Few Software Firms Surviving AI - Yahoo Finance",
    "fullText": "“We think application software faces an existential threat from AI,” said Evans, whose $12 billion global technology fund beat 99% of peers over one year and...",
    "link": "https://finance.yahoo.com/news/fund-beating-99-peers-sees-090000453.html"
  },
  {
    "text": "North Korea opens a housing district for families of its soldiers killed in Russia-Ukraine war - NPR",
    "fullText": "North Korea said Monday it completed a new housing district in Pyongyang for families of North Korean soldiers killed while fighting alongside Russian forces in Ukraine.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5715734/north-korea-housing-district-soldiers-russia-ukraine-war"
  },
  {
    "text": "New Chrome Zero-Day (CVE-2026-2441) Under Active Attack — Patch Released - The Hacker News",
    "fullText": "Google fixes actively exploited Chrome zero-day CVE-2026-2441, a high-severity CSS use-after-free flaw enabling sandboxed remote code execution.",
    "link": "https://thehackernews.com/2026/02/new-chrome-zero-day-cve-2026-2441-under.html"
  },
  {
    "text": "Concerns over autocracy in the U.S. continue to grow - NPR",
    "fullText": "Is America still a democracy? Scholars tell NPR that after the last year under President Trump, the country has slid closer to autocracy or may already be there.",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5705955/us-autocracy-concerns-grow"
  },
  {
    "text": "Measles exposure reported at Philadelphia International Airport - 6abc Philadelphia",
    "fullText": "The Philadelphia Department of Public Health is warning travelers about a measles exposure at Philadelphia International Airport.",
    "link": "https://6abc.com/post/measles-exposure-reported-philadelphia-international-airport/18605914/"
  },
  {
    "text": "Is the stock market open on Presidents Day? - thestreet.com",
    "fullText": "The New York Stock Exchange and the Nasdaq do not adhere to the typical federal holiday calendar.",
    "link": "https://www.thestreet.com/investing/stocks/stock-market-closed-on-presidents-day"
  },
  {
    "text": "Player Grades: Mirkovic stars, Boswell makes big impact in return to lead Illini past Indiana - 247Sports",
    "fullText": "Grading Illinois player performances from the Illinis 7151 home win over Indiana on Sunday",
    "link": "https://247sports.com/college/illinois/longformarticle/illinois-fighting-illini-basketball-player-grades-indiana-david-mirkovic-kylan-boswell-274496854/"
  },
  {
    "text": "2026 Milano Cortina Olympics qualification playoff games preview - NHL.com",
    "fullText": "No. 5 Switzerland against No. 12 Italy, No. 8 Czechia vs. No. 9 Denmark among Tuesday matchups",
    "link": "https://www.nhl.com/news/2026-milano-cortina-olympics-qualification-playoff-games-preview"
  },
  {
    "text": "Isaacman planning to meet with head of Roscosmos - SpaceNews",
    "fullText": "NASA Administrator Jared Isaacman said he is interested in meeting with his Russian counterpart and attending an upcoming Soyuz launch.",
    "link": "http://spacenews.com/isaacman-planning-to-meet-with-head-of-roscosmos/"
  },
  {
    "text": "Rampant AI Demand for Memory Is Fueling a Growing Chip Crisis - Bloomberg.com",
    "fullText": "A growing procession of tech industry leaders including Elon Musk and Tim Cook are warning about a global crisis in the making: A shortage of memory chips is beginning to hammer profits, derail corporate plans and inflate price tags on everything from laptops…",
    "link": "https://www.bloomberg.com/news/articles/2026-02-15/rampant-ai-demand-for-memory-is-fueling-a-growing-chip-crisis"
  },
  {
    "text": "Scottie Scheffler Caps Off Unconscious Final Round At Pebble Beach With Picture-Perfect Eagle - OutKick",
    "fullText": "Nobody makes the game of golf look easier than Mr. Scheffler.",
    "link": "https://www.outkick.com/sports/scottie-scheffler-pebble-beach-eagle-18-video"
  },
  {
    "text": "Bondi criticised after saying all Epstein files have been released - BBC",
    "fullText": "Lawmakers, including those who wrote the law requiring their publication, argue the release is insufficient.",
    "link": "https://www.bbc.com/news/articles/cz7genjx9njo"
  },
  {
    "text": "What is the dart frog toxin allegedly used to kill Alexei Navalny? - BBC",
    "fullText": "The toxin, epibatidine, can be found in frogs in the wild in South America or manufactured in a lab.",
    "link": "https://www.bbc.com/news/articles/cm289we7jzdo"
  }
]