[
  {
    "text": "Jaguars 23-17 Colts (Dec 28, 2025) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nfl/recap?gameId\\\\u003d401772915"
  },
  {
    "text": "9 People, Including 5 Children, Dead After Stabbing Attack - Yahoo News Canada",
    "fullText": "Suriname President Jennifer Geerlings-Simons said the incident involved \"a father who takes the lives of his own children and at the same time kills his...",
    "link": "https://people.com/9-people-including-5-children-dead-after-stabbing-attack-11876739"
  },
  {
    "text": "Rapid Recap: Patriots Pound Jets 42-10, Complete Perfect 8-0 Road Record - New England Patriots",
    "fullText": "The Patriots scored early and often in a Week 16 blowout win over the New York Jets, getting their 13th victory of the 2025 season and completing a perfect 8-0 road record.",
    "link": "https://www.patriots.com/news/rapid-recap-patriots-pound-jets-42-10-complete-perfect-8-0-road-record"
  },
  {
    "text": "Bryce Reeves drops Senate bid in Virginia - Politico",
    "fullText": "Reeves will instead seek reelection to Virginia’s State Senate.",
    "link": "https://www.politico.com/news/2025/12/28/bryce-reeves-drops-out-virginia-senate-00707204"
  },
  {
    "text": "Trump and Zelenskyy meeting in Florida to talk Ukraine peace plan - CBS News",
    "fullText": "President Trump met with Ukrainian President Volodymyr Zelenskyy on Sunday after he said he had a \"good and very productive\" call with Russian President Vladimir Putin.",
    "link": "https://www.cbsnews.com/live-updates/trump-zelenskyy-meeting-florida/"
  },
  {
    "text": "‘Bomb cyclone’ forecasted to bring heavy snow, blizzard conditions and dangerous travel - NPR",
    "fullText": "A 'bomb cyclone' is intensifying severe winter weather for millions of people across the U.S. The system is expected to knock out power and disrupt holiday travel.",
    "link": "https://www.npr.org/2025/12/28/nx-s1-5659746/bomb-cyclone-blizzard-dangerous-travel"
  },
  {
    "text": "Guineans vote in first election since 2021 coup with junta leader likely to win - AP News",
    "fullText": "Guineans were voting to elect a new president in the country’s first election since a 2021 coup. The election on Sunday featured a weakened opposition with a total of nine candidates. Analysts have predicted a likely win for junta leader Gen. Mamadi Doumbouya…",
    "link": "https://apnews.com/article/guinea-election-voting-conakry-9c51dff8b5d244b5c5f2157be6eaf1d2"
  },
  {
    "text": "Rep. Mike Turner defends US strikes against ISIS targets in Nigeria - Politico",
    "fullText": "Turner called the strikes a “continuation” of America's conflict with ISIS.",
    "link": "https://www.politico.com/news/2025/12/28/mike-turner-us-strikes-isis-nigeria-00707090"
  },
  {
    "text": "A weekend of harsh winter weather brings more death and despair to people in Gaza - CNN",
    "fullText": "Fierce rain and bitter cold continued to batter Gaza this weekend, as the number of Palestinians killed by the harsh winter weather continues to rise.",
    "link": "https://www.cnn.com/2025/12/28/middleeast/harsh-winter-weather-flooding-despair-gaza-intl"
  },
  {
    "text": "Foods with healthy-sounding buzzwords could be hiding added sugar in plain sight - NBC News",
    "fullText": "Many consumers feel pride in avoiding the glazed pastries in the supermarket and instead opting for “all natural” granola that comes packed with extra protein.",
    "link": "https://www.nbcnews.com/health/health-news/foods-hiding-added-sugar-rcna251215"
  },
  {
    "text": "New York subway ends its MetroCard era and switches fully to tap-and-go fares - AP News",
    "fullText": "The New York City transit system is retiring the MetroCard after more than 30 years. The gold-and-blue swipeable card was introduced in 1994 to replace the subway token, which had been used for half a century. The last sales and refills on MetroCards will be …",
    "link": "https://apnews.com/article/metrocard-retired-omny-pay-nyc-subway-512112eea4d6e082baab299d41e8171a"
  },
  {
    "text": "Box Office: ‘Avatar 3’ Adds $88 Million Over Christmas Weekend, ‘Marty Supreme’ Scores A24’s Second-Biggest Debut With $27 Million - Variety",
    "fullText": "James Cameron's sci-fi threequel \"Avatar: Fire and Ash\" remained comfortably atop the domestic box office over Christmas.",
    "link": "https://variety.com/2025/film/box-office/avatar-3-box-office-christmas-marty-supreme-a24-opening-weekend-record-1236618660/"
  },
  {
    "text": "Funeral Services Planned for President Jeffrey R. Holland - newsroom.churchofjesuschrist.org",
    "fullText": "Funeral services for President Jeffrey R. Holland of the Quorum of the Twelve Apostles of The Church of Jesus Christ of Latter-day Saints will be held in the Tabernacle on Temple Square on Wednesday, December 31, 2025.",
    "link": "https://newsroom.churchofjesuschrist.org/article/funeral-services-planned-for-president-jeffrey-r-holland"
  },
  {
    "text": "What the Packers Said After Falling to Ravens at Home - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Here’s what the Packers said after getting gashed by Derrick Henry in Saturday’s loss to the Ravens.",
    "link": "https://www.baltimoreravens.com/news/matt-lafleur-malik-willis-evan-williams-javon-bullard-opponent-said-ravens-win"
  },
  {
    "text": "Brigitte Bardot, French femme fatale and cultural phenomenon, dies at 91 - The Washington Post",
    "fullText": "The actress and singer was a symbol of sexual revolution. She later became an animal-welfare campaigner and incendiary right-wing commenter.",
    "link": "https://www.washingtonpost.com/obituaries/2025/12/28/brigitte-bardot-dead/"
  },
  {
    "text": "Nancy Pelosi predicts Dems win House gavel back in ‘26, reflects on career and Jan. 6 attack - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/nancy-pelosi-predicts-dems-win-house-gavel-back/story?id\\\\u003d128684674"
  },
  {
    "text": "Restaurants' hottest menu item in 2025 was 'value.' That won't change next year - CNBC",
    "fullText": "Restaurant chains bet on value in 2025, and they're not likely to ditch the strategy next year.",
    "link": "https://www.cnbc.com/2025/12/28/value-meals-restaurants-mcdonalds-chilis-taco-bell.html"
  }
]