[
  {
    "text": "A Texas teen went missing on Christmas Eve. Authorities believe she could be in imminent danger - CNN",
    "fullText": "Rosario Olmos spent this Christmas without one of her greatest gifts. Her 19-year-old daughter, Camila Mendoza Olmos, had gone missing the day before just outside San Antonio, Texas.",
    "link": "https://www.cnn.com/2025/12/29/us/camila-mendoza-olmos-missing-texas-teen"
  },
  {
    "text": "Two pilots killed after mid-air helicopter collision in New Jersey - BBC",
    "fullText": "Two helicopters collided and crash landed in Hammonton, killing two pilots.",
    "link": "https://www.bbc.com/news/articles/cr5zggg9jl2o"
  },
  {
    "text": "New York state sees highest number of flu cases ever in a single week - Syracuse.com",
    "fullText": "Hospitalizations due to the flu also increased by 63% from the previous week.",
    "link": "https://www.syracuse.com/state/2025/12/new-york-state-sees-highest-number-of-flu-cases-ever-in-a-single-week.html"
  },
  {
    "text": "Mark Madden: Steelers’ loss at Cleveland littered with ineptitude - TribLIVE.com",
    "fullText": null,
    "link": "https://triblive.com/sports/mark-madden-steelers-loss-at-cleveland-littered-with-ineptitude/"
  },
  {
    "text": "Kim and Kanye Reunite for the Holidays, Make Peace for Their Kids - tmz.com",
    "fullText": "Santa seems to have worked a miracle in Kardashian land ... because Kim and Kanye not only hung out together with their kids -- but they also got along!",
    "link": "https://www.tmz.com/2025/12/29/kim-kanye-together-holidays-for-kids/"
  },
  {
    "text": "The weakest labor market since 2011 has BofA asking, ‘Dude, where’s my job?’ - Fortune",
    "fullText": "\"A lack of recovery in the jobs market and a slower U.S. economy are key risks to watch for 2026.\"",
    "link": "https://fortune.com/2025/12/29/dude-wheres-my-job-low-hire-fire-k-shaped-economy-great-recession/"
  },
  {
    "text": "How Vance brokered a truce between Trump and Musk - The Washington Post",
    "fullText": "As Trump’s first year in office comes to a close, both he and his Trump world allies have learned hard lessons about Musk’s unusual influence.",
    "link": "https://www.washingtonpost.com/technology/2025/12/29/musk-trump-vance-maga-alliance/"
  },
  {
    "text": "Top diplomats of China, Cambodia and Thailand meet as Beijing seeks a stronger role in dispute - AP News",
    "fullText": "Foreign ministers from Cambodia and Thailand have convened with their Chinese counterpart to discuss the border dispute between the two Southeast Asian countries. The trilateral meeting Monday was held in a southwestern Chinese province north of the region wh…",
    "link": "https://apnews.com/article/china-thailand-cambodia-meeting-yunnan-border-dispute-730a88992ab3188a2f8effcf25ecb915"
  },
  {
    "text": "Winter storm brings blizzard conditions and dangerous wind chills to US Upper Midwest - AP News",
    "fullText": "A powerful winter storm is moving northeast, bringing snow, ice, rain, and strong winds. The National Weather Service warns of blizzard conditions and treacherous travel. Snow and winds spread across the Upper Midwest with two feet of snow falling in at least…",
    "link": "https://apnews.com/article/winter-weather-blizzard-storm-cb49c60e237aa67d7a296d04da78193b"
  },
  {
    "text": "As an ‘assassin’ at QB, Brock Purdy has pried open the 49ers’ Super Bowl chances - The San Francisco Standard",
    "fullText": "The final pick of the 2022 NFL Draft out-dueled the No. 1 selection of the 2024 NFL Draft, Chicago’s Caleb Williams, in storybook fashion.",
    "link": "https://sfstandard.com/2025/12/29/brock-purdy-49ers-kyle-shanahan-assasin/"
  },
  {
    "text": "Linux will be unstoppable in 2026 - but one open-source legend may not survive - ZDNET",
    "fullText": "Linux and open source are gearing up for a big year, with desktop growth, Rust, and security leading the way.",
    "link": "https://www.zdnet.com/article/linux-and-open-source-2026-predictions/"
  },
  {
    "text": "Trying to improve your health and wellness in 2026? Keep it simple - AP News",
    "fullText": "If you want to improve your health in 2026, experts say keep it simple. Be cautious of health and wellness fads. There are no magic fixes. But that's OK, because there are well established and inexpensive ways to get and stay healthy. Eat whole foods, get goo…",
    "link": "https://apnews.com/article/wellness-influencers-politics-fiber-protein-longevity-9969ef29b9cf29fe5fded67637351c7c"
  },
  {
    "text": "Alleged Jan. 6 pipe bomber said he wasn't targeting Congress' certification of Biden's victory: DOJ - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/alleged-jan-6-pipe-bomber-targeting-congress-certification/story?id\\\\u003d128738143"
  },
  {
    "text": "‘Malcolm in the Middle’ Revival Trailer: Frankie Muniz and Bryan Cranston Reunite After Nearly 20 Years; April Release Date Set - Variety",
    "fullText": "Hulu and Disney+'s 'Malcolm in the Middle' revival revealed its first footage featuring Frankie Muniz, Bryan Cranston as well as a release date.",
    "link": "https://variety.com/2025/tv/news/malcolm-in-the-middle-revival-trailer-april-release-date-1236618966/"
  },
  {
    "text": "GM's record stock performance beats Tesla, Ford and other automakers in 2025 - CNBC",
    "fullText": "General Motors' stock is having its best year since the company's reemergence from bankruptcy in 2009.",
    "link": "https://www.cnbc.com/2025/12/29/gm-stock-tesla-ford.html"
  }
]