[
  {
    "text": "Israeli strikes kill 30 Palestinians, including children, as Gaza ceasefire inches forward - AP News",
    "fullText": "Israeli strikes in Gaza have killed at least 30 Palestinians, marking one of the highest tolls since the October ceasefire. Hospitals in Gaza reported strikes on an apartment building in Gaza City and a tent camp in Khan Younis on Saturday. An airstrike on a …",
    "link": "https://apnews.com/article/mideast-wars-gaza-israel-strikes-88fcbfdbe8ea6265fa3765b7a407a5a7"
  },
  {
    "text": "2nd Amendment advocates issue dire warning over Trump’s Pretti gun remarks - Politico",
    "fullText": "Trump and top officials’ response to the Pretti killing has some gun rights supporters threatening electoral consequences.",
    "link": "https://www.politico.com/news/2026/01/31/2nd-amendment-advocates-issue-dire-warning-over-trumps-pretti-gun-remarks-00758740"
  },
  {
    "text": "What to know about widespread snowfall in north Georgia - WSB-TV",
    "fullText": "Accumulating snow will move into north Georgia and metro Atlanta on Saturday.",
    "link": "https://www.wsbtv.com/news/local/what-know-about-widespread-snowfall-north-georgia/GNEI6YFFDBHYJKEDUZLL7FMTVQ/"
  },
  {
    "text": "The latest Instax printer is a pricey but worthy upgrade - The Verge",
    "fullText": "Fujifilm’s most expensive Instax Mini Link+ printer improves contrast, color, and detail but doesn’t seem to enhance text-heavy illustrations as claimed.",
    "link": "https://www.theverge.com/tech/870603/fujifilm-instax-mini-link-plus-reivew-improved-photos"
  },
  {
    "text": "Unrivaled players rave over record crowd at Philly tour stop - ESPN",
    "fullText": "Unrivaled co-founder Napheesa Collier said it was \"unbelievable\" to see a record 21,490 fans attend the 3-on-3 league's inaugural tour stop in Philadelphia.",
    "link": "https://www.espn.com/wnba/story/_/id/47784462/unrivaled-players-rave-record-crowd-philly-tour-stop"
  },
  {
    "text": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C. - The Washington Post",
    "fullText": "This weekend will offer the most frigid weather of this historically long cold snap, which will only ease slightly next week.",
    "link": "https://www.washingtonpost.com/weather/2026/01/30/dc-severe-cold-winds-bomb-cyclone-noreaster/"
  },
  {
    "text": "DHS keeps making false claims about people. It's part of a broader pattern - NPR",
    "fullText": "Trump administration officials have falsely linked Alex Pretti and Renee Macklin Good to domestic terrorism. It's part of a larger pattern by the Department of Homeland Security.",
    "link": "https://www.npr.org/2026/01/31/nx-s1-5690124/ice-alex-pretti-immigration-unproven-claims-dhs-enforcement-arrests"
  },
  {
    "text": "Software Stocks Are Getting Socked. Is It a Red Flag Or a Buying Opportunity? - The Motley Fool",
    "fullText": "SaaS stocks have plunged on AI fears.",
    "link": "https://www.fool.com/investing/2026/01/31/software-stocks-are-getting-slashed-and-the-ai-bub/"
  },
  {
    "text": "Trump taps career staffer to lead statistics agency whose chief he fired - The Washington Post",
    "fullText": "The agency has been without a permanent leader since August when Trump fired its previous commissioner Erika McEntarfer over a weaker-than-expected jobs report.",
    "link": "https://www.washingtonpost.com/business/2026/01/30/trump-nominates-matsumoto-bls/"
  },
  {
    "text": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "fullText": "Some tense moments unfolded as police declared a dispersal order following the \"ICE Out\" protest in downtown L.A. on Friday.",
    "link": "https://abc7.com/live-updates/live-updates-protesters-clash-officers-during-ice-protest-downtown-la/18511419/"
  },
  {
    "text": "Hawaii health officials investigate chickenpox outbreak at Kauai school - Honolulu Star-Advertiser",
    "fullText": "The Hawaii Department of Health today said it is investigating an outbreak of chickenpox at Kilauea Elementary School on Kauai.",
    "link": "https://www.staradvertiser.com/2026/01/30/breaking-news/hawaii-health-officials-investigate-chickenpox-outbreak-at-kauai-school/"
  },
  {
    "text": "Measles case identified in traveler at Seattle-Tacoma International Airport - KOMO",
    "fullText": "A measles case has been identified in a traveler who passed through Seattle-Tacoma International Airport, health officials said.SEE ALSO |Snohomish County meas",
    "link": "https://komonews.com/news/local/measles-case-identified-in-traveler-at-seattle-tacoma-international-airport-washington-state-measles-outbreak-snohomish-county-measles-king-county-health"
  },
  {
    "text": "Doncic makes history in nation’s capital after dominating performance - New York Post",
    "fullText": "Luka Doncic could do no wrong in the nation’s capital.",
    "link": "https://nypost.com/2026/01/30/sports/lakers-doncic-beat-wizards-142-111-friday-night/"
  },
  {
    "text": "Thousands still without power as brutal temperatures head to the South - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/thousands-power-brutal-temperatures-head-south/story?id\\\\u003d129698690"
  },
  {
    "text": "NASA Selects Axiom Space for Fifth Private Mission to Space Station - NASA (.gov)",
    "fullText": "NASA and Axiom Space have signed an order for the fifth private astronaut mission to the International Space Station, targeted to launch no earlier than",
    "link": "https://www.nasa.gov/news-release/nasa-selects-axiom-space-for-fifth-private-mission-to-space-station/"
  },
  {
    "text": "NASA's Artemis 2 mission to the moon puts Crew-12 SpaceX launch in delicate dance - Space",
    "fullText": "Artemis seems to be NASA's primary focus.",
    "link": "https://www.space.com/space-exploration/human-spaceflight/nasas-artemis-2-mission-to-the-moon-puts-crew-12-spacex-launch-in-delicate-dance"
  },
  {
    "text": "The TV industry finally concedes that the future may not be in 8K - Ars Technica",
    "fullText": "With virtually no content and limited benefits, 8K TVs were doomed.",
    "link": "https://arstechnica.com/gadgets/2026/01/lg-joins-the-rest-of-the-world-accepts-that-people-dont-want-8k-tvs/"
  },
  {
    "text": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/new-snap-work-requirements-set-effect-feb-1/story?id\\\\u003d129698605"
  },
  {
    "text": "Large Hadron Collider reveals 'primordial soup' of the early universe was surprisingly soupy - Space",
    "fullText": "Waiter, there's a quark in my soup!",
    "link": "https://www.space.com/science/particle-physics/large-hadron-collider-reveals-primordial-soup-of-the-early-universe-was-surprisingly-soupy"
  },
  {
    "text": "New triple-drug treatment stops pancreatic cancer in its tracks, a mouse study finds - Live Science",
    "fullText": "By targeting three key growth pathways at once, researchers eliminated pancreatic tumors in multiple mouse models and prevented the cancer from returning, a promising step toward overcoming treatment resistance.",
    "link": "https://www.livescience.com/health/cancer/new-triple-drug-treatment-stops-pancreatic-cancer-in-its-tracks-a-mouse-study-finds"
  }
]