[
  {
    "text": "What worked and what didn't with a cellphone ban at a Kentucky school - NPR",
    "fullText": "Keeping students off their devices is the new norm in many schools. We talked to students and educators at one Kentucky school to see how it's working.",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5675979/school-education-kentucky-cell-phone-ban-consequences"
  },
  {
    "text": "Mike LaFleur: Late start in building Cardinals’ staff may turn out to be a good thing - NBC Sports",
    "fullText": "\"There's so many good coaches out there,\" LaFleur said. \"You lose one but sometimes when you lose one it might be the best thing that ever happened.\"",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/mike-lafleur-late-start-in-building-cardinals-staff-may-turn-out-to-be-a-good-thing"
  },
  {
    "text": "Deportation of Chagos Islanders blocked by judge - BBC",
    "fullText": "A court upholds a challenge about the lawfulness of the orders to remove four men who travelled to the territory.",
    "link": "https://www.bbc.com/news/articles/c1jk5p0ewx0o"
  },
  {
    "text": "Who's laughing now? China’s humanoid robots go from viral stumbles to kung fu flips in one year - CNBC",
    "fullText": "Chinese humanoid robots are having a moment in the spotlight after a standout performance at the country's annual Spring Festival Gala.",
    "link": "https://www.cnbc.com/2026/02/20/china-humanoid-robots-spring-festival-gala-unitree-tesla-ai-race.html"
  },
  {
    "text": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen' - BBC",
    "fullText": "The US is surging forces to the Middle East amid negotiations with the Islamic Republic over its nuclear programme.",
    "link": "https://www.bbc.com/news/articles/c86yjnw4x49o"
  },
  {
    "text": "U.S. fighter jets intercept Russian warplanes off Alaskan coast - CBS News",
    "fullText": "Two Russian Tu-95s bombers, two Su-35s fighter planes and an A-50 spy plane were detected in the Alaskan Air Defense Identification Zone, NORAD said.",
    "link": "https://www.cbsnews.com/news/u-s-fighter-jets-intercept-russian-warplanes-off-alaskan-coast/"
  },
  {
    "text": "Asia stocks fall as rate uncertainty, Iran tensions weigh; S.Korea outperforms - Investing.com",
    "fullText": "Asia stocks fall as rate uncertainty, Iran tensions weigh; S.Korea outperforms",
    "link": "https://www.investing.com/news/stock-market-news/asia-stocks-fall-as-rate-uncertainty-iran-tensions-weigh-skorea-outperforms-4515123"
  },
  {
    "text": "In a historic vote, Tennessee Volkswagen workers get their first union contract - NPR",
    "fullText": "Two years ago, the successful union drive at this plant was expected to spark victories throughout the South. But now, as members vote to make their contract official, momentum has fizzled.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5711458/union-uaw-volkswagen-tennessee-contract-vote"
  },
  {
    "text": "Beverly Hills apologizes to NBA star Jaylen Brown after shutting down brand event over ‘inaccurate information’ - KTLA",
    "fullText": "The city of Beverly Hills issued an apology to NBA star Jaylen Brown after shutting down a private brand event he was hosting, claiming they received “inaccurate information.” On Feb. 14, Brown, who plays for the Boston Celtics, was in Los Angeles as a partic…",
    "link": "https://ktla.com/news/local-news/beverly-hills-apologizes-to-nba-star-jaylen-brown-after-shutting-down-brand-event-over-inaccurate-information/"
  },
  {
    "text": "Nuggets vs Clippers Prediction, Odds, NBA Picks for Thursday, Feb. 19 - Action Network",
    "fullText": "The Denver Nuggets (35-20) and Los Angeles Clippers (26-28) will meet in the NBA on Thursday night. Tipoff from the Intuit Dome in Inglewood, California is set for 10:30",
    "link": "https://www.actionnetwork.com/nba/denver-nuggets-vs-los-angeles-clippers-prediction-pick-odds-thursday-february-19"
  },
  {
    "text": "New Moms in Wisconsin to Get Extension of Vital Benefits After GOP Powerbroker Ends Holdout - ProPublica",
    "fullText": "State Assembly Speaker Robin Vos had repeatedly blocked lawmakers from voting on a bipartisan bill to extend postpartum Medicaid coverage. The legislation now goes to Gov. Tony Evers, who is expected to sign it into law.",
    "link": "https://www.propublica.org/article/wisconsin-postpartum-medicaid-new-mothers-robin-vos"
  },
  {
    "text": "William Foege obituary: epidemiologist in smallpox success - The Times",
    "fullText": "Global health expert who played a key role in the eradication of smallpox using a ‘ring vaccination’ technique, dies aged 89",
    "link": "https://www.thetimes.com/uk/obituaries/article/william-foege-obituary-epidemiologist-in-smallpox-success-ff3j9j2jv"
  },
  {
    "text": "'The Night Agent' Creator Talks S3 Shocking Death, Gives Big S4 Clues - Deadline",
    "fullText": "'The Night Agent's Shawn Ryan talks with Deadline about Season 3's shocking death, gives major S4 clues & reveals the story behind 'FU' to President.",
    "link": "http://deadline.com/2026/02/the-night-agent-shawn-ryan-season-3-death-season-4-clues-1236725307/"
  },
  {
    "text": "Apple and Jon Prosser coordinating deposition in iOS 26 leak case - 9to5Mac",
    "fullText": "In a joint status report to the court, Apple disclosed new details about its efforts to depose Prosser as part of the iOS 26 leak case.",
    "link": "https://9to5mac.com/2026/02/19/apple-and-jon-prosser-coordinating-deposition-in-ios-26-leak-case/"
  },
  {
    "text": "Governors group skips White House meeting after Trump refused to invite two Democrats - PBS",
    "fullText": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors, undercutting one of Washington's few remaining bipartisan gatherings.",
    "link": "https://www.pbs.org/newshour/politics/governors-group-skips-white-house-meeting-after-trump-refused-to-invite-two-democrats"
  },
  {
    "text": "Anonymous donation raises reward for help finding Nancy Guthrie to over $200,000 - Fox News",
    "fullText": "Pima County Sheriff Chris Nanos called for Nancy Guthrie's captors to release her on Wednesday as the search for her nears its 20th day. Authorities have been unable to find a DNA match on evidence around Guthrie's home. The reward for helping find Guthrie no…",
    "link": "https://foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-19-live-updates"
  },
  {
    "text": "VA backs off rule that would have cut benefits amid outrage - CNN",
    "fullText": "The Department of Veterans Affairs is halting enforcement of a new rule for determining disability payments after veterans across the US expressed outrage for what they said would likely reduce benefits for many.",
    "link": "https://www.cnn.com/2026/02/19/politics/va-halts-enforcement-benefits-rule-after-outrage"
  },
  {
    "text": "‘How to Make a Killing’ Review: Glen Powell’s Homicidal Heir - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/arts-culture/film/how-to-make-a-killing-review-glen-powells-homicidal-heir-fca2583e"
  },
  {
    "text": "What we learned from Day 2 of the second Bahrain test - Formula 1",
    "fullText": "F1.com’s Lawrence Barretto examines the key developments from Day 2 of the second 2026 pre-season test in Bahrain.",
    "link": "https://www.formula1.com/en/latest/article/what-we-learned-from-day-2-of-the-second-2026-pre-season-test-in-bahrain.5Fj2kkTW99M5uL35BLatxF"
  }
]