[
  {
    "text": "FAA picks 2 firms to replace 612 outdated radar systems that air traffic controllers rely on - ABC News",
    "fullText": "The federal government has picked two companies to replace 612 radar systems nationwide that date back to the 1980s as part of a multibillion-dollar overhaul of the nation’s air traffic control system",
    "link": "https://abcnews.go.com/US/wireStory/faa-picks-2-firms-replace-612-outdated-radar-128924174"
  },
  {
    "text": "Nvidia unveils 'reasoning' AI technology for self-driving cars - BBC",
    "fullText": "Nvidia is partnering with Mercedes-Benz to launch a driverless car powered by its 'Alpamayo' tech",
    "link": "https://www.bbc.com/news/articles/c0jv1vd571wo"
  },
  {
    "text": "Dell is eating humble pie and bringing back the XPS brand - The Verge",
    "fullText": "Dell is bringing back its XPS laptops after initially killing off the brand at last year’s CES. The new XPS 14 and XPS 16 are Dell’s thinnest models yet, with an even thinner XPS 13 teased.",
    "link": "https://www.theverge.com/news/851047/dell-xps-14-16-13-laptops-brand-return-ces-2026"
  },
  {
    "text": "Lego Smart Bricks Light Up With Jedi Magic In Coming Star Wars Set – and I'm Obsessed - CNET",
    "fullText": "The brand-new, jaw-dropping Lego smart brick tech can recognize other bricks, activate effects and play music. They're debuting in Star Wars Lego sets this spring and we got an early look at CES 2026.",
    "link": "https://www.cnet.com/culture/entertainment/lego-smart-bricks-star-wars-set-ces-2026/"
  },
  {
    "text": "Scientists just got some ancient clues about future sea-level rise — and it’s bad news - The Washington Post",
    "fullText": "Rock samples collected from the Greenland ice sheet’s Prudhoe Dome show it completely melted in the past 10,000 years — and could vanish again amid climate change.",
    "link": "https://www.washingtonpost.com/climate-environment/2026/01/05/greenland-rocks-melting-ice/"
  },
  {
    "text": "Trump’s Venezuela raid plunges Greenland and the Western military alliance into uncertainty - CNN",
    "fullText": "Amid increasing concerns that Greenland, a vast Arctic territory ruled by Denmark, is still being coveted by the Trump administration, the Danish prime minister has delivered a stark warning to the White House.",
    "link": "https://www.cnn.com/2026/01/05/world/analysis-trump-venezuela-greenland-nato-intl-latam"
  },
  {
    "text": "Raiders announce 12 Reserve/Future signings - Raiders.com",
    "fullText": "The Las Vegas Raiders signed 12 players to Reserve/Future contracts Monday.",
    "link": "https://www.raiders.com/news/raiders-announced-12-reserve-future-signings-2026-nfl-transactions"
  },
  {
    "text": "Ousted Venezuelan President Maduro arraigned in U.S. court today; Trump threatens other nations - CBS News",
    "fullText": "Ousted Venezuelan President Nicolás Maduro and his wife were appearing before a judge in New York to face charges related to drug trafficking after the U.S. military attack on Venezuela.",
    "link": "https://www.cbsnews.com/live-updates/venezuela-trump-maduro-charges/"
  },
  {
    "text": "Health officials slash the number of vaccines recommended for all kids - NPR",
    "fullText": "The Centers for Disease Control and Prevention is reducing the number of vaccines recommended for all children. The action follows a presidential memorandum ordering a review of the U.S. schedule.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/05/nx-s1-5667199/cdc-vaccine-schedule-children"
  },
  {
    "text": "Minnesota Gov. Tim Walz ends reelection bid amid child-care fraud scandal - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/minnesota-gov-tim-walz-ends-reelection-bid/story?id\\\\u003d128909243"
  },
  {
    "text": "Golden Globes 2026: The Complete Guide to Parties and Events (Updating) - The Hollywood Reporter",
    "fullText": "Awards season is officially in full swing, with plenty of celebrations leading up to the Globes on Jan. 11.",
    "link": "http://www.hollywoodreporter.com/lifestyle/lifestyle-news/golden-globes-2026-guide-to-parties-and-events-1236462729/"
  },
  {
    "text": "Flu Hospitalizations In Chicago Hit 3-Year High - Block Club Chicago",
    "fullText": "The rise is driven by a new variant called subclade K that's led to outbreaks across the globe. There's still time to get a free vaccination, health officials say.",
    "link": "https://blockclubchicago.org/2026/01/05/flu-hospitalizations-in-chicago-hit-3-year-high/"
  },
  {
    "text": "There’s Compelling Evidence That Someone Connected to the Trump Administration Profited Off the Invasion of Venezuela by Placing Large Bets on Polymarket - Yahoo",
    "fullText": "\"Pete Hegseth making some beer money on the side?\"",
    "link": "https://futurism.com/future-society/evidence-trump-venezuela-polymarket"
  },
  {
    "text": "Mass. reports 3 children have suffered flu-related deaths this season - The Boston Globe",
    "fullText": "The deaths underscore the severity of an influenza outbreak that continues to surge across the state and nation.",
    "link": "https://www.bostonglobe.com/2026/01/05/metro/massachusetts-pediatric-death-influenza/"
  },
  {
    "text": "Cher Thinks Kristen Bell Could Do Better Than Dax Shepard - Vulture",
    "fullText": "Cher thinks her former co-star Kristen Bell could do better than Dax Shepard. ‘You must have something I don’t see,’ she told Shepard while seated next to his wife on his ‘Armchair Expert’ podcast.",
    "link": "http://www.vulture.com/article/cher-dax-shepard-kristen-bell-marriage.html"
  },
  {
    "text": "Holocaust survivor Eva Schloss dies at 96 - DW",
    "fullText": "King Charles III paid tribute to the Auschwitz survivor, saying he was \"privileged and proud\" to have known her. Austrian-born Schloss fled her home country to the Netherlands, where she would later meet Anne Frank.",
    "link": "https://www.dw.com/en/holocaust-survivor-eva-schloss-dies-at-96/a-75386928"
  },
  {
    "text": "Las Vegas Raiders fire Pete Carroll after one season with league-worst record - KSNV",
    "fullText": "The Las Vegas Raiders have fired head coach Pete Carroll following a 3-14 season, the team announced Monday.",
    "link": "https://news3lv.com/news/local/pete-carroll-fired-las-vegas-raiders-head-coach-future-2026-nfl-sports-mark-davis-jon-spytek-tom-brady-sports-football"
  },
  {
    "text": "Ofcom asks X about reports its Grok AI makes sexualised images of children - BBC",
    "fullText": "Elon Musk's social media platform has warned users not to use Grok to generate illegal content.",
    "link": "https://www.bbc.com/news/articles/c5y5w0k99r1o"
  }
]