[
  {
    "text": "Explosions heard over Venezuelan capital Caracas amid US tensions - Al Jazeera",
    "fullText": "President Nicolas Maduro has declared a national state of emergency in Venezuela.",
    "link": "https://www.aljazeera.com/news/2026/1/3/explosions-heard-over-venezuelan-capital-caracas-amid-us-tensions"
  },
  {
    "text": "Victoria Jones, daughter of Tommy Lee Jones, found dead in hotel on New Year's Day - NBC News",
    "fullText": "The daughter of Academy Award-winning actor Tommy Lee Jones has died, her family acknowledged in a statement on Friday night.",
    "link": "https://www.nbcnews.com/pop-culture/celebrity/victoria-jones-daughter-tommy-lee-jones-found-dead-hotel-new-years-day-rcna251896"
  },
  {
    "text": "What weather forecast for 49ers-Seahawks on Saturday has in store for Brock Purdy - San Francisco Chronicle",
    "fullText": "In what figures to be a welcome forecast for the San Francisco 49ers and quarterback Brock Purdy, the weather in Santa Clara on Saturday might not be too messy.",
    "link": "https://www.sfchronicle.com/sports/49ers/article/weather-forecast-49ers-vs-seahawks-brock-purdy-21273692.php"
  },
  {
    "text": "NYT Connections hints and answers for January 3, Tips to solve 'Connections' #937. - Mashable",
    "fullText": "Everything you need to solve 'Connections' #937.",
    "link": "https://mashable.com/article/nyt-connections-hint-answer-today-january-3-2026"
  },
  {
    "text": "When did humanity take its first step? Scientists say they now know. - The Washington Post",
    "fullText": "A new analysis of fossils uncovered in Central Africa offers additional evidence that a human ancestor walked upright 7 million years ago.",
    "link": "https://www.washingtonpost.com/science/2026/01/02/human-ancestor-biped/"
  },
  {
    "text": "SpaceX launches Italian Earth-observing satellite to orbit on the 1st mission of 2026 - Space",
    "fullText": "Liftoff of the COSMO-SkyMed Second Generation mission occurred on schedule at 9:09 p.m. ET tonight (Jan. 2).",
    "link": "https://www.space.com/space-exploration/private-spaceflight/spacex-cosmo-skymed-second-generation-falcon-9-launch"
  },
  {
    "text": "Minnesota must provide documents to US government in child care fraud probe by next week - AP News",
    "fullText": "Minnesota officials are rushing to provide information to the Trump administration about child care providers and parents receiving federal funds. This follows allegations of widespread abuse. According to an email sent to recipients, Minnesota’s Department o…",
    "link": "https://apnews.com/article/minnesota-child-care-funds-fraud-trump-01658dfbab49ca8b00c8d1622f671238"
  },
  {
    "text": "Gretzky swaps stories, reminisces ahead of Winter Classic - NHL.com",
    "fullText": "NHL's all-time points leader attends Discover Face-Off Panel prior to outdoor game in Miami",
    "link": "https://www.nhl.com/news/wayne-gretzky-swaps-stories-reminisces-ahead-of-winter-classic"
  },
  {
    "text": "Apple's 2026 Low-Cost A18 MacBook Pro: What We Know So Far - MacRumors",
    "fullText": "Apple is planning to release a low-cost MacBook in 2026, which will apparently compete with more affordable Chromebooks and Windows PCs. Apple's...",
    "link": "https://www.macrumors.com/2026/01/02/low-cost-macbook-pro-rumors/"
  },
  {
    "text": "Earthquake with 6.5 magnitude rattles southern and central Mexico killing 2 - NBC News",
    "fullText": "MEXICO CITY — A strong earthquake rattled southern and central Mexico on Friday, interrupting President Claudia Sheinbaum ’s first press briefing of the new year as seismic alarms sounded and leaving at least two people dead",
    "link": "https://www.nbcnews.com/world/mexico/earthquake-65-magnitude-rattles-southern-central-mexico-killing-2-rcna252008"
  },
  {
    "text": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Allstate Sugar Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Sugar-recap.aspx"
  },
  {
    "text": "Anthrax nearly kills healthy 18-year-old welder amid puzzling pattern - Ars Technica",
    "fullText": "Welder's Anthrax\" was first coined in 2022, when seven cases had been identified.",
    "link": "https://arstechnica.com/health/2026/01/anthrax-nearly-kills-healthy-18-year-old-welder-amid-puzzling-pattern/"
  },
  {
    "text": "Mamdani defends eliminating executive orders on antisemitism, boycotting Israel - Politico",
    "fullText": "The mayor incurred criticism from local Jewish organizations and the Israeli government over the move.",
    "link": "https://www.politico.com/news/2026/01/02/mamdani-defends-eliminating-executive-orders-on-antisemitism-boycotting-israel-00709472"
  },
  {
    "text": "Ohio police seek suspect after dentist and his wife found shot to death at home - CBS News",
    "fullText": "Officers in Columbus, Ohio, were dispatched to the couple's home on the morning Dec. 30 for a welfare check and found them dead at the scene.",
    "link": "https://www.cbsnews.com/news/columbus-ohio-dentist-shot-killed-spencer-tepe-wife-monique/"
  },
  {
    "text": "Yemen's separatists announce a constitution for an independent south - NPR",
    "fullText": "The move comes as an escalation of a confrontation that has pitted Gulf powerhouses Saudi Arabia and the United Arab Emirates against each other.",
    "link": "https://www.npr.org/2026/01/02/g-s1-104314/yemen-separatists-constitution"
  },
  {
    "text": "Stock Market Today: Dow Up With 'January Barometer' On Watch; Nvidia Stock Climbs (Live Coverage) - Investor's Business Daily",
    "fullText": "Stock Market Today: The Dow Jones index traded mixed Friday. Tesla stock fell after weak fourth-quarter delivery news.",
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-tesla-stock-tsla-deliveries-2/"
  },
  {
    "text": "Tesla sales fall to lowest point since 2022 - Axios",
    "fullText": "Vehicle sales are critical to funding CEO Elon Musk's AI ambitions.",
    "link": "https://www.axios.com/2026/01/02/tesla-sales-ev-elon-musk"
  },
  {
    "text": "New York reports record-breaking number of flu hospitalizations in a single week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-york-reports-record-breaking-number-flu-hospitalizations/story?id\\\\u003d128849108"
  }
]