[
  {
    "text": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown - Axios",
    "fullText": null,
    "link": "https://www.axios.com/2026/01/31/mike-johnson-democrats-shutdown-jeffries-ice-dhs"
  },
  {
    "text": "Highway 99 in Tulare County reopens after 59-vehicle pileup, CHP says - ABC30 Fresno",
    "fullText": "Highway 99 in Tulare County has reopened after a 59-vehicle pile-up forced a total closure Saturday morning near Earlimart.",
    "link": "https://abc30.com/post/150-vehicle-pileup-forces-total-closure-highway-99-tulare-county-officials-say/18516483/"
  },
  {
    "text": "Donald Trump’s unprecedented political war chest got even bigger in 2025 - Politico",
    "fullText": "Campaign finance disclosures filed late Saturday revealed details of the president’s unmatched political fundraising operation.",
    "link": "https://www.politico.com/news/2026/02/01/donald-trump-fundraising-midterms-00759005"
  },
  {
    "text": "Iran’s Gen Z Helped Propel the Protests. They Paid With Their Lives. - The Wall Street Journal",
    "fullText": "A generation who grew up in a more connected world rebelled against a failing economy and strict social rules",
    "link": "https://www.wsj.com/world/middle-east/irans-gen-z-helped-propel-the-protests-they-paid-with-their-lives-80675ef3"
  },
  {
    "text": "Nvidia Investment in OpenAI Round ‘Nothing Like’ $100 Billion - Bloomberg.com",
    "fullText": "Nvidia Corp. Chief Executive Officer Jensen Huang said the company will be participating in OpenAI’s latest funding round, describing it as potentially “the largest investment we’ve ever made.”",
    "link": "https://www.bloomberg.com/news/articles/2026-01-31/nvidia-to-join-openai-s-current-funding-round-huang-says"
  },
  {
    "text": "Updated snow totals for southeastern Virginia: Forecast down - The Virginian-Pilot",
    "fullText": "The weather service says Norfolk, Portsmouth, Suffolk and most of Chesapeake and Virginia Beach is likely to see 3-4 inches of snow. Higher amounts are possible.",
    "link": "https://www.pilotonline.com/2026/01/31/updated-snow-forecast-virginia/"
  },
  {
    "text": "Doug Shows tried to royally screw Kentucky at Arkansas: ‘Worst technical foul I’ve ever seen’ - A Sea Of Blue",
    "fullText": "“Doug Shows should never be allowed to officiate another game after that.“",
    "link": "https://www.aseaofblue.com/kentucky-wildcats-basketball/161810/doug-show-uk-arkansas-worst-technical-foul-ive-ever-seen"
  },
  {
    "text": "‘Spy Sheikh’ Bought Secret Stake in Trump Company - The Wall Street Journal",
    "fullText": null,
    "link": "https://www.wsj.com/politics/policy/spy-sheikh-secret-stake-trump-crypto-tahnoon-ea4d97e8"
  },
  {
    "text": "Thousands march against ICE in downtown Portland; federal officers deployed tear gas on crowds that included children - Oregon Public Broadcasting - OPB",
    "fullText": "Federal officers deployed clouds of tear gas and other crowd control munitions, including flash-bang grenades, on Saturday afternoon outside the U.S. Immigration and Customs Enforcement building in Portland on demonstrators.",
    "link": "https://www.opb.org/article/2026/01/31/labor-against-ice-portland-oregon-immigration-protest/"
  },
  {
    "text": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say - BBC",
    "fullText": "Israel's military confirmed the strikes, which come during a ceasefire that Israel and Hamas accuse each other of breaking.",
    "link": "https://www.bbc.com/news/articles/c701g1g00gdo"
  },
  {
    "text": "Orange County confirms second measles case in traveler who visited Disneyland, California Adventure - CBS News",
    "fullText": "Orange County health officials have confirmed their second measles case of 2026 in an international traveler who arrived in California at Los Angeles International Airport before visiting Disneyland and California Adventure last week.",
    "link": "https://www.cbsnews.com/losangeles/news/orange-county-measles-disneyland-california-adventure-lax-airport/"
  },
  {
    "text": "McKenna has hot day outdoors for Penn State at Beaver Stadium - NHL.com",
    "fullText": "Projected No. 1 pick in 2026 NHL Draft has goal, 2 assists in OT loss against Michigan State",
    "link": "https://www.nhl.com/news/gavin-mckenna-shows-off-skills-in-penn-state-game-at-beaver-stadium"
  },
  {
    "text": "4 Devices Compatible With Your Car's USB Port That You Need To Know About - bgr.com",
    "fullText": "The variety of gadgets that are compatible with your car's USB port is vast, but mini fridges and portable humidifiers should be on everyone's short list.",
    "link": "https://www.bgr.com/2084887/devices-compatible-car-usb-port/"
  },
  {
    "text": "2026 Senior Bowl takeaways: Garrett Nussmeier delivers MVP performance in NFL draft showcase - NFL.com",
    "fullText": "Which QB shined brightest in Saturday's Senior Bowl? Who were the other prospects that stood out in the 2026 NFL Draft showcase? Eric Edholm offers three takeaways from the all-star event.",
    "link": "https://www.nfl.com/news/2026-senior-bowl-game-takeaways-2026-nfl-draft"
  },
  {
    "text": "The reviews are in on the Stadium Series ice, and not all are raves - Tampa Bay Times",
    "fullText": "Jon Cooper is enthralled by the spectacle of a rink under a tent. Nikita Kucherov isn’t thrilled with the playing surface.",
    "link": "https://www.tampabay.com/sports/lightning/2026/01/31/stadium-series-raymond-james-stadium-nikita-kucherov/"
  },
  {
    "text": "Nintendo has cut the price of some upcoming amiibo - Nintendo Everything",
    "fullText": "Upcoming amiibo figures from Nintendo appear to have received an official price cut - here are the new prices.",
    "link": "https://nintendoeverything.com/nintendo-has-cut-the-price-of-some-upcoming-amiibo/"
  },
  {
    "text": "New Samsung Galaxy S26 Ultra Leak Confirms Disappointing News - Forbes",
    "fullText": "The Samsung Galaxy S26 Ultra release date has been confirmed, but some of the new specifications reveal disappointing news.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/01/31/samsung-galaxy-s26-ultra-release-date-leak-battery-spec/"
  },
  {
    "text": "Lifespan may be 50% heritable, study suggests - Live Science",
    "fullText": "A new study suggests that lifespan might be 50% heritable — although for now, it's hard to know if the finding applies across diverse populations.",
    "link": "https://www.livescience.com/health/ageing/lifespan-may-be-50-percent-heritable-study-suggests"
  },
  {
    "text": "Saturday Pre-orders – Chaos Space Marines and Marauders running wild - Warhammer Community",
    "fullText": "Check out today’s latest pre-orders.",
    "link": "https://www.warhammer-community.com/articles/uapels1d/saturday-pre-orders-chaos-space-marines-and-marauders-running-wild"
  }
]