[
  {
    "text": "Our perspective regarding the situation in Venezuela as shared with President Trump - Exxon Mobil Corporation",
    "fullText": "ExxonMobil Chairman and CEO Darren Woods, alongside other industry executives, attended a meeting hosted by President Donald Trump today to discuss the future of the oil and gas industry in Venezuela.",
    "link": "https://corporate.exxonmobil.com/news/news-releases/2026/our-perspective-regarding-the-situation-in-venezuela"
  },
  {
    "text": "Wrexham 3-3 Nottm Forest (Jan 9, 2026) Game Analysis - ESPN",
    "fullText": "Expert recap and game analysis of the Wrexham vs. Nottingham Forest English Fa Cup game from January 9, 2026 on ESPN.",
    "link": "https://www.espn.com/soccer/report/_/gameId/762493"
  },
  {
    "text": "Trump: ‘We are going to do something on Greenland whether they like it or not’ - CNBC",
    "fullText": "Trump said that if the U.S. doesn't take action on Greenland, \"Russia or China will take over\" the Danish island territory.",
    "link": "https://www.cnbc.com/2026/01/09/trump-greenland-military-denmark-nato.html"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Kansas City hit by a new ‘super flu’ variant causing a surge of cases - KCUR",
    "fullText": "Approximately 80% of active flu cases are an unexpected strain of Influenza A virus that health officials are calling a super flu. The Kansas City area has seen a dramatic spike in cases in recent weeks.",
    "link": "https://www.kcur.org/health/2026-01-12/kansas-city-super-flu-variant-influenza-illness-sick-respiratory-hospital"
  },
  {
    "text": "Google: Don’t make “bite-sized” content for LLMs if you care about search rank - Ars Technica",
    "fullText": "Google says creating for people rather than robots is the best long-term strategy.",
    "link": "https://arstechnica.com/google/2026/01/google-dont-make-bite-sized-content-for-llms-if-you-care-about-search-rank/"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "The 'Age of Fishes' began with mass death, fossil database reveals - Phys.org",
    "fullText": "Some 445 million years ago, life on Earth was forever changed. During the geological blink of an eye, glaciers formed over the supercontinent Gondwana, drying out many of the vast, shallow seas like a sponge and giving an \"icehouse climate\" that, together wit…",
    "link": "https://phys.org/news/2026-01-age-fishes-began-mass-death.html"
  },
  {
    "text": "Why some people can’t stay away from alcohol, even when they know it’s hurting them - CNN",
    "fullText": "Health experts caution against drinking too much, but alcohol is everywhere. Experts say the things that make us pour another drink are in our body and environment.",
    "link": "https://www.cnn.com/2026/01/09/health/why-we-drink-alcohol-wellness"
  },
  {
    "text": "Exercise can be nearly as effective as therapy for depression - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46557233"
  },
  {
    "text": "Expert Predictions: Wild Card Picks for Chargers at Patriots - Official website of the New England Patriots",
    "fullText": "Experts share their picks for the Patriots Wild Card matchup against the Los Angeles Chargers.",
    "link": "https://www.patriots.com/news/expert-predictions-wild-card-picks-for-chargers-at-patriots"
  },
  {
    "text": "Latest news on ISS astronaut medical evacuation: NASA weighs return to Earth options - Space",
    "fullText": "Friday, Jan. 9, 2026: Your daily update on NASA's astronaut medical evacuation from the International Space Station.",
    "link": "https://www.space.com/news/live/astronaut-medical-evacuation-on-iss-jan-9-2026"
  },
  {
    "text": "Meghan Trainor and Daryl Sabara respond to Ashley Tisdale's 'toxic' mom group essay: The drama, explained - Yahoo",
    "fullText": "After Hilary Duff's husband, Matthew Koma, shared a scathing response to Tisdale's claims on Tuesday, singer Meghan Trainor and her husband, Daryl Sabara...",
    "link": "https://www.yahoo.com/entertainment/celebrity/article/meghan-trainor-and-daryl-sabara-respond-to-ashley-tisdales-toxic-mom-group-essay-the-drama-explained-201453951.html"
  },
  {
    "text": "Secretary Bessent Announces Initiatives to Combat Rampant Fraud in Minnesota - U.S. Department of the Treasury (.gov)",
    "fullText": "Actions Increase Transparency, Seek Accountability for Taxpayer DollarsWASHINGTON— In Minnesota, Secretary of the Treasury Scott Bessent announced several initiatives to combat rampant government benefits fraud in Minnesota, which has wasted billions of taxpa…",
    "link": "https://home.treasury.gov/news/press-releases/sb0354"
  },
  {
    "text": "Chinese, Russian and Iranian warships arrive for drills in South Africa - Al Jazeera",
    "fullText": "Naval exercises come as tensions run high after US military intervention in Venezuela, seizures of several oil tankers.",
    "link": "https://www.aljazeera.com/news/2026/1/9/chinese-russian-and-iranian-warships-arrive-for-drills-in-south-africa"
  },
  {
    "text": "Separatist group in southern Yemen announces dissolution after its leader flees to the UAE - AP News",
    "fullText": "Yemen's main separatist group, the Southern Transitional Council, is set to dismantle its institutions effective Friday. The announcement follows weeks of unrest in southern Yemen and comes a day after its leader fled to the UAE. The council's secretary-gener…",
    "link": "https://apnews.com/article/yemen-war-saudi-arabia-uae-southern-transitional-council-7303d1d01a49f959bfb9baeeb5ff400d"
  },
  {
    "text": "Winter storm slams UK and France as cold snap spreads across Europe - AP News",
    "fullText": "Thousands of homes and businesses across northern France and southern England are without power and residents faced widespread travel delays after a storm swept in off the Atlantic. The low-pressure system named Storm Goretti brought high winds, rain and snow…",
    "link": "https://apnews.com/article/britain-france-goretti-storm-d9d2d60fcc34a7a3be8033c5d739e843"
  },
  {
    "text": "Another year, another massive turnover in NFL head coaches - NBC Sports",
    "fullText": "\"This is the business we've chosen.\"",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/another-year-another-massive-turnover-in-nfl-head-coaches"
  },
  {
    "text": "GM hit with $6 billion in charges as EV incentives cut and emissions standards fade - abcnews.go.com",
    "fullText": "General Motors will be hit with charges of about $6 billion in its fourth quarter after sales of electric vehicles sputtered when the U.S. cut tax incentives to buy them and also eased auto emissions standards",
    "link": "https://abcnews.go.com/Business/wireStory/gm-hit-6-billion-charges-ev-incentives-cut-129052704"
  }
]