[
  {
    "text": "Trump tries humor, gets some silence, at black-tie dinner with ‘people I hate’ - The Washington Post",
    "fullText": "In a frenetic presidency marked by jarring contrasts, he added another Saturday night: suiting up in black-tie regalia amid mass immigration protests and telling jokes about invading Greenland.",
    "link": "https://www.washingtonpost.com/politics/2026/02/01/trump-alfalfa-club-dinner/"
  },
  {
    "text": "Twelve killed by Russian strike near bus in Ukraine, official says - BBC",
    "fullText": "Seven others were reported injured in the strike near a bus carrying the workers on Sunday.",
    "link": "https://www.bbc.com/news/articles/cdre7g2je63o"
  },
  {
    "text": "French tech giant Capgemini to sell US subsidiary working for ICE - BBC",
    "fullText": "The firm's move comes amid global scrutiny of the methods used by the US immigration enforcement agency.",
    "link": "https://www.bbc.com/news/articles/cd9e4xw8vqqo"
  },
  {
    "text": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test - Space",
    "fullText": "Sunday, Feb. 1, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.",
    "link": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-1-2026"
  },
  {
    "text": "Kylie Jenner and Travis Scott Celebrate Stormi and Aire's Birthday Bash - TMZ",
    "fullText": "Travis Scott and Kylie Jenner know how to throw a party ... and their kids' joint birthday celebration was nothing short of epic.",
    "link": "https://www.tmz.com/2026/02/01/travis-scott-kylie-jenner-celebrate-stormi-aire-birthday/"
  },
  {
    "text": "Central Florida Freeze Warning continues as extreme cold carries into Monday - WFTV",
    "fullText": "Central Florida remains under freeze warnings and extreme cold through Monday morning. Expect upper 20s in Orlando, sub-freezing in Ocala and Palm Coast, wind chills in the teens. Safety tips: check on neighbors, bring pets inside, cover pipes.",
    "link": "https://www.wftv.com/news/local/central-florida-freeze-warning-continues-extreme-cold-carries-into-monday/5FY5D6VUUNBBFOTL6XLHNZT3AI/"
  },
  {
    "text": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
    "fullText": "Medical charity Medicine Sans Frontières said it would not share the list as it had not been able to ensure staff would remain safe.",
    "link": "https://www.bbc.com/news/articles/cvg1ymmkpkro"
  },
  {
    "text": "We asked retired astronauts about their favorite space movies, and this is what they shared with us - CNN",
    "fullText": "Ahead of the launch of Artemis II, the first crewed mission to the moon in more than 50 years, astronauts share the movies that capture the danger, teamwork, and wonder of spaceflight. Their picks offer cinematic glimpses into the real challenges and triumphs…",
    "link": "https://www.cnn.com/2026/02/01/entertainment/astronauts-favorite-space-movies"
  },
  {
    "text": "Leftist and liberal gun groups are seeing a rush of new members - CNN",
    "fullText": "Several niche, left-leaning gun advocacy groups said that since Alex Pretti was killed, they can hardly keep up with the surging demand for firearms training: “People join when they’re scared,” said Philip Smith, founder of the National African American Gun A…",
    "link": "https://www.cnn.com/2026/02/01/us/gun-rights-politics-alex-pretti-killing-cec"
  },
  {
    "text": "Alexander Volkanovski responds to Jean Silva, confused why he’s so ‘upset’ after UFC 325 - MMA Fighting",
    "fullText": "Alexander Volkanovski responded to Jean Silva saying he would train with Ilia Topuria to beat him",
    "link": "https://www.mmafighting.com/ufc/469571/alexander-volkanovski-responds-to-jean-silva-confused-why-hes-so-upset-after-ufc-325"
  },
  {
    "text": "Eyes to the Skies for February: Rocket launch, winter constellations, eclipse and more - WTOP",
    "fullText": "NASA has scheduled the launch for the Artemis II moon rocket for no earlier than Feb. 8. WTOP will have details on the mission as they become available.",
    "link": "https://wtop.com/the-space-place/2026/02/eyes-to-the-skies-for-february-rocket-launch-winter-constellations-eclipse-and-more/"
  },
  {
    "text": "Lenovo Yoga Pro 9i 16 Aura Edition Review: Kick-Ass Laptop for Creators - CNET",
    "fullText": "Editors' Choice: Centered around a gorgeous 16-inch OLED display, this Yoga laptop provides the performance and build that graphics pros demand.",
    "link": "https://www.cnet.com/tech/computing/lenovo-yoga-pro-9i-16-aura-edition-review-kick-ass-laptop-for-creators/"
  },
  {
    "text": "RFK Jr. is now a wellness guru for Republicans in Washington - Politico",
    "fullText": "Conservatives in the capital are taking up the health secretary’s advice, eating their vegetables and eschewing pharmaceuticals.",
    "link": "https://www.politico.com/news/2026/02/01/rfk-wellness-republicans-maha-washington-dc-00757417"
  },
  {
    "text": "How much snow fell in the Charlotte area on Saturday? - WCNC",
    "fullText": "The Charlotte metro saw mind-blowing snowfall totals as heavy snow fell for hours on Saturday.",
    "link": "https://www.wcnc.com/article/weather/weather-impact/how-much-snow-charlotte-north-carolina-winter-storm/275-3631c369-d4a9-4ca0-be19-869f76120faf"
  },
  {
    "text": "'Normal life has disappeared': Russia's energy offensive plunges Ukraine into dark and bitter cold - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/normal-life-disappeared-russias-energy-offensive-plunges-ukraine/story?id\\\\u003d129557876"
  },
  {
    "text": "Chan Zuckerberg Initiative cut 70 jobs to go all in on mission to 'cure or prevent all disease' - Fortune",
    "fullText": "“We want to really double down” on AI-powered biomedical research, Mark Zuckerberg said.",
    "link": "https://fortune.com/2026/02/01/chan-zuckerberg-initiative-layoffs-all-in-on-ai-biomedical-research/"
  },
  {
    "text": "Before Any Strike on Iran, U.S. Needs to Bolster Air Defenses in Mideast - The Wall Street Journal",
    "fullText": "The Pentagon is taking steps to better protect Israel, Arab allies and American forces if Iran retaliates",
    "link": "https://www.wsj.com/world/middle-east/before-any-strike-on-iran-u-s-needs-to-bolster-air-defenses-in-mideast-faca35a9"
  }
]