[
  {
    "text": "Mother and stepfather arrested for alleged child abuse amid search for missing Oklahoma boy - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/mother-stepfather-arrested-alleged-child-abuse-amid-search/story?id\\\\u003d129064524"
  },
  {
    "text": "Strength training is crucial after menopause. How to make the most of your workouts - AP News",
    "fullText": "Medical experts say strength training keeps bones and muscles healthy after menopause when estrogen loss speeds up a reduction in bone density and contributes to the gradual loss of muscle mass. Strength training also helps women maintain a healthy weight and…",
    "link": "https://apnews.com/article/menopause-perimenopause-exercise-strength-training-b379697dd2290786739ed442d4173cd7"
  },
  {
    "text": "Vonn zooms to 2nd downhill victory before Milan - ESPN",
    "fullText": "Lindsey Vonn won her second World Cup downhill in four races this season, raising expectations in this remarkable comeback at age 41 ahead of the Milan Cortina Olympics.",
    "link": "https://www.espn.com/olympics/skiing/story/_/id/47568851/lindsey-vonn-wins-second-world-cup-downhill-olympic-season"
  },
  {
    "text": "ISS astronaut medical evacuation latest news: SpaceX readies Dragon spacecraft for Crew-11 return to Earth - Space",
    "fullText": "Saturday, Jan. 10, 2026: Updates on NASA's astronaut medical evacuation from the International Space Station.",
    "link": "https://www.space.com/live/astronaut-medical-evacuation-on-iss-jan-10-2026"
  },
  {
    "text": "A blinding parasitic eye disease affects mostly contact lens wearers. Here’s how to avoid it - CNN",
    "fullText": "Acanthamoeba keratitis is a rare but blinding parasitic eye disease. Experts share how to avoid it and treat it.",
    "link": "https://www.cnn.com/2026/01/10/health/acanthamoeba-keratitis-symptoms-treatment-wellness"
  },
  {
    "text": "Why tariffs have hit Americans’ jobs harder than their shopping carts - CNN",
    "fullText": "As President Donald Trump piled on new tariffs last year, many economists quickly warned that prices and unemployment would spike. With most of the 2025 economic results in, it’s looking like those forecasters get partial credit.",
    "link": "https://www.cnn.com/2026/01/10/economy/tariffs-economic-impact"
  },
  {
    "text": "Trump, Venezuela and the doctrine that wouldn’t die - Financial Times",
    "fullText": "Long seen as defunct, the Monroe Doctrine is being invoked once again as a blueprint for assertive US foreign policy. Historian Greg Grandin charts the rise, fall and rebirth of an ambiguous creed",
    "link": "https://www.ft.com/content/4e0eab9d-3195-42f0-add1-661187ce4099"
  },
  {
    "text": "North Korea vows response as it accuses the South of flying drones across the border - abcnews.go.com",
    "fullText": "North Korea has accused South Korea of flying drones across the border between the nations",
    "link": "https://abcnews.go.com/International/wireStory/north-korea-vows-response-accuses-south-flying-drones-129077683"
  },
  {
    "text": "'Out of stock': What went wrong at luxury retailer Saks? - BBC",
    "fullText": "Saks Global, which owns Saks Fifth Avenue and Neiman Marcus, is expected to imminently file for bankruptcy protection, leaving questions about the retailer's future.",
    "link": "https://www.bbc.com/news/articles/czdq1z73pv9o"
  },
  {
    "text": "Figure skater Glenn wins 3rd straight U.S. title - ESPN",
    "fullText": "Amber Glenn wins her third consecutive U.S. Figure Skating title with a stunning free skate performance.",
    "link": "https://www.espn.com/olympics/story/_/id/47565368/efimova-mitrofanov-defend-pairs-title-face-citizenship-wait"
  },
  {
    "text": "Multiple small avalanches release in Juneau after city issues evacuation advisory - KTOO",
    "fullText": "Some residents have chosen to evacuate and others remain at home after city issues avalanche evacuation advisory. Several small avalanches have released in the usual paths across downtown and Thane.",
    "link": "https://www.ktoo.org/2026/01/09/multiple-small-avalanches-release-in-juneau-after-city-issues-evacuation-advisory/"
  },
  {
    "text": "Sources: Koepka seeking PGA Tour reinstatement - ESPN",
    "fullText": "Brooks Koepka applied for reinstatement of his PGA Tour membership Friday, sources told ESPN, the first step in the five-time major champion's potential return to the tour.",
    "link": "https://www.espn.com/golf/story/_/id/47563165/sources-brooks-koepka-reapplies-pga-tour-membership"
  },
  {
    "text": "Strange cosmic objects spotted by the James Webb Space Telescope may be baby 'platypus' galaxies — or something entirely new - Space",
    "fullText": "\"These nine objects are special.\"",
    "link": "https://www.space.com/astronomy/galaxies/strange-cosmic-objects-spotted-by-the-james-webb-space-telescope-may-be-baby-platypus-galaxies-or-something-entirely-new"
  },
  {
    "text": "The CDC Just Sidelined These Childhood Vaccines. Here’s What They Prevent : Shots - Health News - NPR",
    "fullText": "The childhood vaccines that the CDC is dropping from the recommended scheduled have successfully beat back illness and death in children from rotavirus, hepatitis and other pathogens.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/09/nx-s1-5671750/cdc-childhood-vaccines-universal-recommendation-rotavirus-hepatitis"
  },
  {
    "text": "Ikea Smartened Up Some of Its Artsy-Fartsy Lights - Gizmodo",
    "fullText": "The Swedish meatball restaurant now sells RGB donut-shaped lamps and bendy dimmable pendant lamps with smart home functionality.",
    "link": "https://gizmodo.com/ikea-smartened-up-some-of-its-artsy-fartsy-lights-2000708087"
  },
  {
    "text": "Leaders’ Declaration of France, the United Kingdom and Germany on the situation in Iran: 9 January 2026 - GOV.UK",
    "fullText": "Leaders’ Declaration of France, the United Kingdom and Germany on the situation in Iran.",
    "link": "https://www.gov.uk/government/news/leaders-declaration-of-france-the-united-kingdom-and-germany-on-the-situation-in-iran-9-january-2026"
  },
  {
    "text": "CDC says flu activity probably has not peaked amid record-breaking season - CNN",
    "fullText": "After a record week of flu activity in the US, hospitalizations and deaths continue to grow.",
    "link": "https://www.cnn.com/2026/01/09/health/flu-illness-2026-peak"
  },
  {
    "text": "‘The Wire,’ ‘Gilmore Girls’ and 9 More Worthy Candidates for the Emmys’ New Legacy Award - The Hollywood Reporter",
    "fullText": "The Television Academy has said it might use the honor to correct past oversights.",
    "link": "http://www.hollywoodreporter.com/lists/the-wire-parks-and-rec-emmy-legacy-award-candidates/"
  },
  {
    "text": "How to watch, listen and follow: Carolina vs. Los Angeles Rams in the Wild Card round - Panthers.com",
    "fullText": "The Panthers game will air on FOX at 4:30 p.m. ET.",
    "link": "https://www.panthers.com/news/how-to-watch-listen-and-follow-carolina-vs-los-angeles-rams-in-the-wild-card-round-playoffs"
  },
  {
    "text": "New Gmail AI features replacing Gemini side panel for some - 9to5Google",
    "fullText": "With the launch of “in-line AI experiences” in Gmail, Google has shared that the Gemini side panel is going away for AI Pro and Ultra...",
    "link": "http://9to5google.com/2026/01/09/gmail-gemini-side-panel-2/"
  }
]