[
  {
    "text": "Over 50 latent tuberculosis cases detected at SF high school amid outbreak - SFGATE",
    "fullText": "The first positive test for tuberculosis at the school was detected in November, and in-person classes will be briefly suspended.",
    "link": "https://www.sfgate.com/bayarea/article/tuberculosis-san-francisco-school-21324492.php"
  },
  {
    "text": "DOJ files federal charges against man accused of attacking Rep. Ilhan Omar - NBC News",
    "fullText": "The Justice Department filed charges Thursday against a man who is accused of trying to spray Rep.",
    "link": "https://www.nbcnews.com/politics/politics-news/doj-files-federal-charges-man-accused-attacking-rep-ilhan-omar-rcna256511"
  },
  {
    "text": "Verizon Earnings Beat; 2026 Profit Outlook Above Views Amid $25 Billion Buy Back - Investor's Business Daily",
    "fullText": "EPS, revenue and wireless subscriber adds beat, while the telecom giant guided up.",
    "link": "https://www.investors.com/news/technology/verizon-stock-verizon-earnings-q42025-new-ceo/"
  },
  {
    "text": "Newsom files a civil rights complaint against Dr. Oz over allegations of hospice fraud - AP News",
    "fullText": "California Governor Gavin Newsom is demanding a civil rights investigation into Dr. Mehmet Oz, saying he discriminated against Armenians in a video about hospice fraud in Los Angeles. Newsom's complaint, filed Thursday, follows Oz's social media video allegin…",
    "link": "https://apnews.com/article/dr-oz-newsom-fraud-medicare-hospice-trump-611ee3156c37f2cff70190fb417a694d"
  },
  {
    "text": "American Express, credit card provider to the wealthy, wants even more high spenders - CNBC",
    "fullText": "AmEx's strategy shift is the latest example of the K-shaped economy, in which wealthy consumers continue to spend freely while others rein in their expenses",
    "link": "https://www.cnbc.com/2026/01/30/american-express-credit-card-high-spenders.html"
  },
  {
    "text": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search - Politico",
    "fullText": "Deputy Attorney General Todd Blanche said the rare domestic foray by the top intel official should be no “surprise.”",
    "link": "https://www.politico.com/news/2026/01/30/georgia-ballots-fbi-raid-tulsi-gabbard-00757856"
  },
  {
    "text": "The Sundance Film Festival’s big moments and breakout movies - AP News",
    "fullText": "The last Sundance Film Festival in Utah is drawing to a close this weekend. The Park City gathering has been a nostalgic farewell, as it moves to Boulder, Colorado in 2027. A Wednesday night screening of “Little Miss Sunshine” was especially emotional, with f…",
    "link": "https://apnews.com/article/sundance-film-festival-2026-breakouts-moments-deals-f630b9ee4a706fc78f421f94a7ee9783"
  },
  {
    "text": "Son of Norway crown princess to stand trial for allegedly raping 4 women - CBS News",
    "fullText": "Marius Borg Hoiby, the 29-year-old son of Crown Princess Mette-Marit, has been charged with a total of 38 counts.",
    "link": "https://www.cbsnews.com/news/norway-crown-princess-son-rape-trial-marius-borg-hoiby/"
  },
  {
    "text": "Former Google Engineer Found Guilty of Economic Espionage and Theft of Confidential AI Technology - Department of Justice (.gov)",
    "fullText": null,
    "link": "https://www.justice.gov/opa/pr/former-google-engineer-found-guilty-economic-espionage-and-theft-confidential-ai-technology"
  },
  {
    "text": "Jeffrey Epstein sent thousands of pounds to Peter Mandelson’s husband, emails show - Financial Times",
    "fullText": "Payments to Reinaldo Avila da Silva raise fresh questions about disgraced financier’s friendship with UK’s former Washington ambassador",
    "link": "https://www.ft.com/content/c950f80a-3946-4986-b7ec-e0c61e628049"
  },
  {
    "text": "Ongoing WWE SmackDown results (spoilers) for January 30th 2026 from Riyadh, Saudi Arabia - NoDQ.com",
    "fullText": "The latest WWE and AEW backstage wrestling news, rumors, opinions, and special features.",
    "link": "https://nodq.com/news/86507/"
  },
  {
    "text": "Three reasons for the record rise in gold prices, and one why they are falling - BBC",
    "fullText": "Gold has fallen from recent highs but there are several reasons investors are still finding refuge in the precious metal.",
    "link": "https://www.bbc.com/news/articles/c87r2700dq8o"
  },
  {
    "text": "The Massive Nucleus of 3I/ATLAS and its Puzzling Methane Outgassing, Based on New Data from the… - Avi Loeb – Medium",
    "fullText": "What a glorious day! Today, new data on the interstellar object 3I/ATLAS was released from the Hubble and Webb space telescopes in two…",
    "link": "https://avi-loeb.medium.com/the-massive-nucleus-of-3i-atlas-and-its-puzzling-methane-outgassing-based-on-new-data-from-the-72e540d8fe46"
  },
  {
    "text": "New Nintendo Direct Rumors Point To An Incoming Flood Of Switch 2 Ports - Kotaku",
    "fullText": "February will reportedly kick off with a new Partner Showcase",
    "link": "https://kotaku.com/february-nintendo-direct-switch-2-3d-mario-2000664537"
  },
  {
    "text": "Russell Wilson ‘made the right decision’: Malcolm Butler on that fateful pick - seattletimes.com",
    "fullText": "Malcolm Butler crushed Seahawks fans in 2015, picking off Russell Wilson at the goal line to win the Super Bowl for the Patriots. We asked him about the play.",
    "link": "https://www.seattletimes.com/sports/seahawks/with-seahawks-patriots-super-bowl-rematch-set-we-called-malcolm-butler/"
  },
  {
    "text": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "fullText": "Israel says it will reopen Gaza’s border crossing with Egypt in both directions over the weekend. The move announced on Friday will allow Palestinians to enter and leave the territory after nearly two years of near-complete closure. The Israeli military body …",
    "link": "https://apnews.com/article/israel-palestinians-gaza-rafah-border-crossing-reopening-823d4b0aef641c3f19d4cc7b527325b1"
  },
  {
    "text": "The 12 NFL Teams That Haven’t Won a Super Bowl and Why - Sports Illustrated",
    "fullText": "Of the dozen ringless squads, four have never graced the field for the big game. Is it due to long-term ineptitude or merely some bad luck?",
    "link": "https://www.si.com/nfl/the-12-nfl-teams-that-havent-won-super-bowl-why"
  },
  {
    "text": "Eric Edholm 2026 NFL mock draft 1.0: Two receivers in top five; Patriots, Seahawks bolster elite defenses - NFL.com",
    "fullText": "In his first mock of the 2026 NFL Draft, Eric Edholm has a pair of wide receivers coming off the board in the top five picks. Plus, the Super Bowl LX teams add more talent to their elite defenses. Check out the full first-round projection, 1-32.",
    "link": "https://www.nfl.com/news/eric-edholm-2026-nfl-mock-draft-1-0-two-receivers-in-top-five-patriots-seahawks-bolster-elite-defenses"
  }
]