[
  {
    "text": "Eileen Gu overcomes an early fall in slopestyle to keep her Olympic dreams in tact - AP News",
    "fullText": "Freeski star Eileen Gu has overcome a poor start by laying down a strong second run to qualify for the women’s slopestyle final at the Winter Olympics. The pressure was on the reigning silver medalist Saturday after she fell coming off the first rail of the o…",
    "link": "https://apnews.com/article/eileen-gu-winter-womens-slopestyle-qualifying-olympics-fcbbef4e3efffd6d0bd73fd0dbb7197e"
  },
  {
    "text": "Trump and Mamdani find unlikely common ground on New York City zoning - Politico",
    "fullText": "The president’s long history in New York City real estate looms large over the ongoing conversation with Mamdani.",
    "link": "https://www.politico.com/news/2026/02/07/trump-mandani-meeting-new-york-zoning-00767521"
  },
  {
    "text": "4 people have died from eating death cap mushrooms as they spread in California after rains - NBC News",
    "fullText": "Four people have died and three others have required liver transplants after eating the aptly named death cap mushroom that is proliferating in California following a rainy winter.",
    "link": "https://www.nbcnews.com/news/us-news/4-people-died-eating-death-cap-mushrooms-california-rcna257899"
  },
  {
    "text": "The enthusiasm — and scorn — surrounding Bad Bunny’s star turn at the Super Bowl - The Washington Post",
    "fullText": "The halftime show will illustrate the nation’s immigration divide whether or not the reggaeton star makes an explicit message about Trump’s deportation drive.",
    "link": "https://www.washingtonpost.com/immigration/2026/02/07/bad-bunny-immigration-super-bowl-trump/"
  },
  {
    "text": "LIVE! PFL Dubai Results: Nurmagomedov vs. Davis - MMA Fighting",
    "fullText": "Get PFL Dubai results for the Nurmagomedov vs. Davis event Saturday morning.",
    "link": "https://www.mmafighting.com/pfl/470516/pfl-dubai-results-nurmagomedov-vs-davis"
  },
  {
    "text": "Pressure mounts on American Airlines CEO as carrier lags rivals - CNBC",
    "fullText": "American Airlines made $111 million last year, while rivals Delta Air Lines and United Airlines, brought in $5 billion and $3.3 billion, respectively.",
    "link": "https://www.cnbc.com/2026/02/07/american-airlines-ceo-robert-isom.html"
  },
  {
    "text": "Automakers largely sit out 2026 Super Bowl advertising amid industry uncertainty - CNBC",
    "fullText": "Automakers are largely sitting on the advertising sidelines during this year's Super Bowl amid broader uncertainty in the U.S. automotive industry.",
    "link": "https://www.cnbc.com/2026/02/07/super-bowl-ads-gm-toyota-volkswagen.html"
  },
  {
    "text": "Woman shares unlikely survival journey after migraines led to glioblastoma diagnosis: \"I am truly an outlier\" - cbsnews.com",
    "fullText": "Becca Valle, then 37, enrolled in a cutting-edge clinical trial after surgery removed an aggressive tumor from her brain.",
    "link": "https://www.cbsnews.com/news/woman-unlikely-survival-journey-migraines-glioblastoma-diagnosis/"
  },
  {
    "text": "Switzerland's Franjo von Allmen wins Olympic men's downhill - ESPN",
    "fullText": "Swiss racer Franjo von Allmen captured the Olympic downhill Saturday to win the first gold medal at the Milan Cortina Games.",
    "link": "https://www.espn.com/olympics/story/_/id/47855809/switzerland-franjo-von-allmen-wins-olympic-men-downhill"
  },
  {
    "text": "Nancy Guthrie disappearance: Vehicle towed from Arizona home, Trump vows 'definitive' answers soon - Fox News",
    "fullText": "A vehicle was removed from the driveway of Nancy Guthrie’s home on Friday evening by investigators. Nancy Guthrie -- the 84-year-old mother of NBC \"Today\" co-host Savannah Guthrie -- was reported missing on Feb. 1, 2026.",
    "link": "https://www.foxnews.com/live-news/nancy-guthrie-disappearance-arizona-feb-7-live-updates"
  },
  {
    "text": "'It's about the loneliness we all feel': The painful scene that really makes Taxi Driver a classic - BBC",
    "fullText": "Martin Scorsese's groundbreaking New York thriller turns 50 this week. It remains a remarkable piece of work – though its truly defining moment is probably not the one you think.",
    "link": "https://www.bbc.com/culture/article/20260206-the-incredible-moment-that-really-makes-taxi-driver-a-classic"
  },
  {
    "text": "A viral outbreak at the Winter Olympics, and Disney names Bob Iger's successor (again): The news quiz - NBC News",
    "fullText": "Lindsey Vonn reveals a major injury, a journalism institution announces sweeping layoffs, and a stuffed toy takes off in China.",
    "link": "https://www.nbcnews.com/news/news-quiz/winter-olympics-disney-ceo-rcna257610"
  },
  {
    "text": "DVDs and public transit: Boycott drives people to ditch Big Tech to protest ICE - NPR",
    "fullText": "A sweeping boycott has begun — targeting tech giants who participants believe are enabling President Trump and his immigration crackdown.",
    "link": "https://www.npr.org/2026/02/07/nx-s1-5704402/boycott-tech-ice-scott-galloway"
  },
  {
    "text": "Trump envoys met directly with Iran foreign minister in Oman - Axios",
    "fullText": "The negotiations were almost called off earlier in the week, but went ahead on Friday.",
    "link": "https://www.axios.com/2026/02/06/iran-us-nuclear-talks-oman"
  },
  {
    "text": "It looks like either Cody Rhodes or Jacob Fatu will miss out on Elimination Chamber - Cageside Seats",
    "fullText": "WWE books a very interesting high stakes match for SmackDown’s move to SyFy.",
    "link": "https://www.cagesideseats.com/wwe/416547/wwe-books-smackdown-syfy-olympics-cody-rhodes-jacob-fatu-elimination-chamber-qualifiers"
  },
  {
    "text": "Apple's redesigned MacBook Pro can't come soon enough - Creative Bloq",
    "fullText": "It's what creatives have been waiting for.",
    "link": "https://www.creativebloq.com/design/product-design/apples-redesigned-macbook-pro-cant-come-soon-enough"
  },
  {
    "text": "Scoop: White House plans Board of Peace meeting in D.C. on Gaza reconstruction - Axios",
    "fullText": "\"It will be the first Board of Peace meeting and a fundraising conference for Gaza reconstruction,\" a U.S. official said.",
    "link": "https://www.axios.com/2026/02/07/gaza-board-peace-meeting-trump-dc"
  },
  {
    "text": "Former President Bill Clinton makes case for public hearing in House Epstein probe - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/former-president-bill-clinton-makes-case-public-hearing/story?id\\\\u003d129933157"
  }
]