[
  {
    "text": "It took 35 years for T. rex to become fully grown - CNN",
    "fullText": "Tyrannosaurus rex lived longer and took more time to reach its maximum size than previously thought, according to a new study.",
    "link": "https://www.cnn.com/2026/01/15/science/tyrannosaurus-rex-growth-rate-study-scli-intl"
  },
  {
    "text": "Trump lays out new framework to address health costs - Axios",
    "fullText": "The framework is an acknowledgement the GOP could face blame for health care affordability in the midterms.",
    "link": "https://www.axios.com/2026/01/15/trump-great-health-care-plan-costs"
  },
  {
    "text": "Trump threatens to invoke the Insurrection Act in response to Minneapolis protests - NBC News",
    "fullText": "WASHINGTON — President Donald Trump on Thursday threatened to invoke the Insurrection Act in response to rising tensions between protesters and federal personnel in Minneapolis.“If the corrupt politicians of Minnesota don’t obey the law and stop the professio…",
    "link": "https://www.nbcnews.com/politics/white-house/trump-threatens-invoke-insurrection-act-response-minneapolis-protests-rcna254187"
  },
  {
    "text": "Pamela Anderson Felt ‘Yucky’ Being Near Seth Rogen at Golden Globes After He Made Series About 'the Worst Time in My Life' - Yahoo News UK",
    "fullText": null,
    "link": "https://people.com/pamela-anderson-felt-yucky-being-near-seth-rogen-at-golden-globes-after-pam-and-tommy-11885946"
  },
  {
    "text": "Large fire breaks out in Dutch city of Utrecht following explosion - BBC",
    "fullText": "At least four people are injured and there are also reports of extensive damage to nearby buildings, he local safety body says.",
    "link": "https://www.bbc.com/news/articles/cm2xv0w07dgo"
  },
  {
    "text": "Wall Street Eliminated 10,600 Jobs Last Year, Most Since 2016 - Bloomberg.com",
    "fullText": "The biggest US banks cut their combined headcount last year by the most in almost a decade as executives sought to keep a lid on costs through what’s typically the biggest expense line item.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/wall-street-eliminated-10-600-jobs-last-year-most-since-2016"
  },
  {
    "text": "Amazon threatens ‘drastic action’ after Saks bankruptcy, says $475M stake is now worthless - CNBC",
    "fullText": "Amazon invested $475 million into Saks' acquisition of Neiman Marcus. It wants a federal judge to reject Saks' bankruptcy plan because it harms creditors.",
    "link": "https://www.cnbc.com/2026/01/15/amazon-says-saks-investment-is-worthless-after-bankruptcy.html"
  },
  {
    "text": "Paddy Pimblett accuses UFC rival of crossing the line - MMA Fighting",
    "fullText": "Paddy Pimblett and Dan Hooker’s rivalry has become deeply personal",
    "link": "https://www.mmafighting.com/ufc/466383/paddy-pimblett-tears-into-dan-hooker-for-referencing-dead-friend-in-verbal-feud"
  },
  {
    "text": "‘Tip of the iceberg’: The FBI search of a reporter’s home has newsrooms bracing for more - CNN",
    "fullText": "Inside The Washington Post, the impact was immediate. Reporters called the search “incredibly disturbing.” Hannah Natanson, whose home was raided, urged her Post colleagues to keep reporting.",
    "link": "https://www.cnn.com/2026/01/15/media/fbi-hannah-natanson-washington-post-doj-search"
  },
  {
    "text": "Heavy Is the Crown: George R.R. Martin on His Triumphs and Torments - The Hollywood Reporter",
    "fullText": "At the height of his reign, the 'Game of Thrones' author gets candid about his efforts to rule his expanding media empire, his buzzy new show 'A Knight of the Seven Kingdoms,' and the long-delayed saga he’s still determined to finish — if he can.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/george-rr-martin-interview-thrones-winds-dragon-knight-1236473519/"
  },
  {
    "text": "‘Tomb Raider’ First Look: Sophie Turner Becomes Lara Croft as Filming Starts on Prime Video’s Reboot Series - Variety",
    "fullText": "Prime Video has unveiled a first look at the 'Tomb Raider' live-action series, showing Sophie Turner as Lara Croft.",
    "link": "https://variety.com/2026/tv/news/tomb-raider-sophie-turner-lara-croft-first-look-1236605699/"
  },
  {
    "text": "DVOA Preview: Bills vs. Broncos - FTN (For The Numbers)",
    "fullText": "The Broncos match up with the Bills very well, but so too do the Bills match up with the Broncos. Who will come out on top?",
    "link": "https://ftnfantasy.com/nfl/dvoa-preview-bills-vs-broncos"
  },
  {
    "text": "A$AP Rocky's Mom Encouraged Him to Date Rihanna - TMZ",
    "fullText": "Rihanna and A$AP Rocky seem like a match made in heaven ... but apparently, they're also a match made by the rapper's mom!",
    "link": "https://www.tmz.com/2026/01/15/asap-rocky-mom-told-him-date-rihanna/"
  },
  {
    "text": "Goldman Sachs sees M&A accelerating, as companies believe the ‘art of the deal’ is now possible - MarketWatch",
    "fullText": "Shares of Goldman Sachs and Morgan Stanley surged into record territory after both banks beat profit expectations amid strong growth in investment banking",
    "link": "https://www.marketwatch.com/story/goldman-sachs-revenue-fell-for-first-time-in-2-years-apple-card-was-the-problem-c19c226d"
  },
  {
    "text": "RSV vaccination push made a huge difference for Utah's kids, Intermountain Health says - KSL.com",
    "fullText": "Doctors at Intermountain Health are seeing a big difference in infant hospitalizations for RSV after pushing for Utahns to get vaccines in the last two years since they were approved in 2023.",
    "link": "https://www.ksl.com/article/51433239/rsv-vaccination-push-made-a-huge-difference-for-utahs-kids-intermountain-health-says"
  },
  {
    "text": "Why your power bill is spiking faster than a nearby data center’s - The Washington Post",
    "fullText": "As electricity prices climb, an unusual disconnect is emeging between what regular people pay -- and what data centers pay.",
    "link": "https://www.washingtonpost.com/climate-environment/2026/01/15/power-electricity-cost-data-centers/"
  },
  {
    "text": "Ugandan election 2026: Yoweri Museveni faces Bobi Wine in presidential poll - BBC",
    "fullText": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years.",
    "link": "https://www.bbc.com/news/articles/cx2xn1yvgr4o"
  },
  {
    "text": "Arab governments believe US-Iran tension ‘de-escalated’ - Financial Times",
    "fullText": "Washington announces new sanctions on Islamic republic as military personnel and aircraft carrier movements keep region on edge",
    "link": "https://www.ft.com/content/df0c0833-59f6-45d6-a74f-008b46756e72"
  }
]