[
  {
    "text": "S&P 500 futures slip after benchmark index hits fresh record: Live updates - CNBC",
    "fullText": "Stock futures were little changed Sunday night after the S&P 500 scaled to fresh record levels, with traders set to wrap up a strong 2025.",
    "link": "https://www.cnbc.com/2025/12/28/stock-market-today-live-updates.html"
  },
  {
    "text": "NEXT Weather: Aftereffects of Sunday snowstorm impacting road conditions Monday - CBS News",
    "fullText": "A major winter storm that blasted Minnesota on Sunday is still impacting travel conditions on Monday. Follow live updates.",
    "link": "https://www.cbsnews.com/minnesota/live-updates/next-weather-major-winter-storm-dec-28-2025/"
  },
  {
    "text": "Wild things we learned about Earth in 2025 - CNN",
    "fullText": "With findings on Earth’s polar extremes and its innermost core, scientists shaped how we look at the planet in 2025 in surprising and fascinating ways.",
    "link": "https://www.cnn.com/2025/12/29/science/earth-wild-things-we-learned-2025"
  },
  {
    "text": "Electric vehicles had a bumpy road in 2025 — and one pleasant surprise - NPR",
    "fullText": "A suite of pro-EV federal policies have been reversed. Well-known vehicles have been discontinued. Sales plummeted. But interest is holding steady.",
    "link": "https://www.npr.org/2025/12/29/nx-s1-5638592/electric-vehicles-2025"
  },
  {
    "text": "Teens are having disturbing interactions with chatbots. Here's how to lower the risks - NPR",
    "fullText": "Teen use of AI chat bots is growing, and psychologists worry it's affecting their social development and mental health. Here's what parents should know to help kids use the technology safely.",
    "link": "https://www.npr.org/2025/12/29/nx-s1-5646633/teens-ai-chatbot-sex-violence-mental-health"
  },
  {
    "text": "Pipe bomb suspect told FBI he targeted U.S. political parties, memo says - NPR",
    "fullText": "The man accused of placing two pipe bombs in Washington on the eve of Jan. 6, 2021 told investigators someone needed to \"speak up\" for people who believed the 2020 election was stolen, prosecutors said Sunday.",
    "link": "https://www.npr.org/2025/12/29/g-s1-103881/pipe-bomb-suspect-targeted-political-parties"
  },
  {
    "text": "Science history: Richard Feynman gives a fun little lecture — and dreams up an entirely new field of physics — Dec. 29, 1959 - Live Science",
    "fullText": "In a short talk at Caltech, physicist Richard Feynman laid out a vision of manipulating and controlling atoms at the tiniest scale. It would precede the field of nanotechnology by decades.",
    "link": "https://www.livescience.com/physics-mathematics/particle-physics/science-history-richard-feynman-gives-a-fun-little-lecture-and-dreams-up-an-entirely-new-field-of-physics-dec-29-1959"
  },
  {
    "text": "\"Bomb cyclone\" winter storm brings ice and snow, snarls thousands of flights. Maps show the latest forecast. - CBS News",
    "fullText": "More than 51 million Americans live in areas under winter storm alerts stretching from northern Minnesota to the Eastern Seaboard.",
    "link": "https://www.cbsnews.com/news/winter-storm-forecast-ice-snow-northeast-great-lakes/"
  },
  {
    "text": "US-Nigeria strikes: Living in fear of Lakurawa - the militant group Trump targeted - BBC",
    "fullText": "\"We cannot live freely. You cannot even play music\" - residents tell the BBC of militants' rule.",
    "link": "https://www.bbc.com/news/articles/cy7vr76l521o"
  },
  {
    "text": "Kosovo's ruling party wins election after months of political deadlock - BBC",
    "fullText": "The decisive victory for the Albanian nationalist Vetevendosje party means a third term for leader Albin Kurti.",
    "link": "https://www.bbc.com/news/articles/ce3z3w4wy0go"
  },
  {
    "text": "Miley Cyrus Admits She Went to the 2025 Oscars to Pitch Original Songs to Filmmakers - The Hollywood Reporter",
    "fullText": "\"Everybody that came up and introduced themselves, I said, 'Well, if you need any music, I'm around,'\" the Grammy winner says.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/miley-cyrus-attended-2025-oscars-pitch-songs-filmmakers-1236460048/"
  },
  {
    "text": "Samsung Plans To Bring Google Photos to Samsung AI TV Lineup, Helping Users Relive Their Favorite Memories on the Big Screen - samsung.com",
    "fullText": "Samsung Electronics today announced that they are working to bring Google Photos to Samsung TVs to give users a seamless way to enjoy the moments that matter most, from trips and hobbies to everyday memories with loved ones — now on an immersive and larger sc…",
    "link": "https://news.samsung.com/global/samsung-plans-to-bring-google-photos-to-samsung-ai-tv-lineup-helping-users-relive-their-favorite-memories-on-the-big-screen"
  },
  {
    "text": "Ewers delivers win for Dolphins in second start - ESPN",
    "fullText": "Dolphins quarterback Quinn Ewers earned his first regular-season win in a 20-17 victory Sunday over the Tampa Bay Buccaneers, with the rookie notching a handful of milestones in the process.",
    "link": "https://www.espn.com/nfl/story/_/id/47438055/quinn-ewers-leads-dolphins-buccaneers-first-nfl-win"
  },
  {
    "text": "Guineans vote in first election since 2021 coup with junta leader likely to win - AP News",
    "fullText": "Guineans were voting to elect a new president in the country’s first election since a 2021 coup. The election on Sunday featured a weakened opposition with a total of nine candidates. Analysts have predicted a likely win for junta leader Gen. Mamadi Doumbouya…",
    "link": "https://apnews.com/article/guinea-election-voting-conakry-9c51dff8b5d244b5c5f2157be6eaf1d2"
  },
  {
    "text": "A weekend of harsh winter weather brings more death and despair to people in Gaza - CNN",
    "fullText": "Fierce rain and bitter cold continued to batter Gaza this weekend, as the number of Palestinians killed by the harsh winter weather continues to rise.",
    "link": "https://www.cnn.com/2025/12/28/middleeast/harsh-winter-weather-flooding-despair-gaza-intl"
  },
  {
    "text": "NASA Found This on Top of Mars’s Biggest Volcano - The Daily Galaxy",
    "fullText": "Its existence challenges what we know about planetary activity in the absence of tectonic plates.",
    "link": "https://dailygalaxy.com/2025/12/mars-biggest-volcano-olympus-mons/"
  },
  {
    "text": "4 Exciting Smart TVs Coming Out In 2026 - bgr.com",
    "fullText": "The 2026 TV lineup features the LG Micro RGB evo, Samsung's expanded Micro RGB series, and the flagship S99H OLED. See the top 4 TVs redefining entertainment.",
    "link": "https://www.bgr.com/2057922/smart-tvs-coming-out-2026/"
  }
]