[
  {
    "text": "Catherine O'Hara Cause of Death Revealed - TMZ",
    "fullText": "Catherine O'Hara passed away from a blood clot in the lungs ... TMZ has learned.",
    "link": "https://www.tmz.com/2026/02/09/catherine-ohara-cause-of-death/"
  },
  {
    "text": "US skater Amber Glenn faces fallout over politics and issues with music copyright after Olympic gold - AP News",
    "fullText": "Amber Glenn won Olympic gold in the team event but now faces backlash over her political and LGBTQ+ comments, in addition to a copyright debate about her choice of music. Canadian artist Seb McKinnon objects to her use of his song \"The Return\" in her free ska…",
    "link": "https://apnews.com/article/milan-cortina-olympics-figure-skating-copyright-0d46df364ff67d430b394e40089926f0"
  },
  {
    "text": "'NYPD Blue' Kim Delaney's Husband Arrested After Multiple Disturbance Calls to Home - TMZ",
    "fullText": "Kim Delaney's husband was arrested after deputies responded to a disturbance at the former \"NYPD Blue\" star's Los Angeles-area apartment ... TMZ has learned.",
    "link": "https://www.tmz.com/2026/02/09/kim-delaney-husband-arrest/"
  },
  {
    "text": "S&P 500 rises, led by tech; Dow climbs to fresh record: Live updates - CNBC",
    "fullText": "The moves come after the major averages bounced back Friday from sizable losses suffered earlier in the week.",
    "link": "https://www.cnbc.com/2026/02/08/stock-market-today-live-updates.html"
  },
  {
    "text": "2026 Winter Olympics live updates: U.S. speed skating stars Bowe and Jackson sprint for women's 1000m gold - NBC Olympics",
    "fullText": "Visit NBCOlympics.com for Winter Olympics live streams, highlights, schedules, results, news, athlete bios and more from Milan Cortina 2026.",
    "link": "https://www.nbcolympics.com/news/live/2026-winter-olympics-live-updates-feb-9-highlights-scores-results"
  },
  {
    "text": "Wright to brief senators on Venezuela energy issues - Politico",
    "fullText": "Members of the Energy and Natural Resources Committee will receive a classified briefing Tuesday.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/wright-to-brief-senators-on-venezuela-energy-issues-00769787"
  },
  {
    "text": "Michael Grimes returns to Morgan Stanley after Trump administration stint - Financial Times",
    "fullText": "Star tech banker rejoins Wall Street group as banks vie for role in upcoming blockbuster IPOs",
    "link": "https://www.ft.com/content/7d960fcc-c80f-4c12-8b8e-1fd41fc7a444"
  },
  {
    "text": "The Seahawks Knew They Were Super Bowl Contenders Before Anyone Else - Sports Illustrated",
    "fullText": "Those inside Seattle saw the potential of Mike Macdonald’s group well before the team was labeled as title contenders.",
    "link": "https://www.si.com/nfl/the-seahawks-knew-they-were-super-bowl-contenders-before-anyone-else"
  },
  {
    "text": "Report: Imminent Apple hardware updates include MacBook Pro, iPads, and iPhone 17e - Ars Technica",
    "fullText": "High-end Macs and less-expensive iPhones and iPads are all on the docket.",
    "link": "https://arstechnica.com/gadgets/2026/02/report-imminent-apple-hardware-updates-include-macbook-pro-ipads-and-iphone-17e/"
  },
  {
    "text": "Migrant boat capsizes off Libya leaving 53 dead, including two babies - BBC",
    "fullText": "The IOM says that almost 500 people have been reported dead or missing off Libya so far this year.",
    "link": "https://www.bbc.com/news/articles/cy9ge3844q0o"
  },
  {
    "text": "Column | Want to lose weight? Here’s why exercise probably won’t help. - The Washington Post",
    "fullText": "The benefits of exercise are numerous, but losing weight isn’t one of them. Here are some better motivations to add regular exercise to your routine.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/09/exercise-weight-loss/"
  },
  {
    "text": "NBC camera operator nails perfect shot of Charlie Puth during national anthem - Awful Announcing",
    "fullText": "An NBC camera operator nailed a perfect shot of Charlie Puth during the national anthem as fighter jets conducted a flyover at Levi's Stadium.",
    "link": "https://awfulannouncing.com/nbc/camera-operator-nails-perfect-shot-charlie-puth-national-anthem.html"
  },
  {
    "text": "Bonobos are capable of pretend play, just like human children - cnn.com",
    "fullText": "Children love to play pretend, holding imaginary tea parties, educating classrooms of teddies or running their own grocery stores.  Now, a new study suggests that such make-believe play is not a uniquely human talent, but a skill that great apes also possess.",
    "link": "https://www.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli"
  },
  {
    "text": "Japan’s Takaichi to pursue conservative agenda after election landslide - NPR",
    "fullText": "Japan's first female Prime Minister, Sanae Takaichi, brought the ruling Liberal Democratic Party its biggest-ever electoral victory, fueling her ambitions to pursue to a political agenda which she says could \"split public opinion.\"",
    "link": "https://www.npr.org/2026/02/09/nx-s1-5706602/japan-takaichi-conservative-agenda-election-landslide"
  },
  {
    "text": "Capitol agenda: Republicans prepare DHS punt - Politico",
    "fullText": "It's highly unlikely all sides can agree to a full-year Department of Homeland Security revamp by Friday at midnight.",
    "link": "https://www.politico.com/live-updates/2026/02/09/congress/dhs-shutdown-funding-bill-continuing-resolution-00771028"
  },
  {
    "text": "America’s Top 25 Philanthropists — And Why Musk, Page And Ellison Aren’t On The List - Forbes",
    "fullText": "MacKenzie Scott was the nation’s top philanthropist in 2025 and ranks third behind Warren Buffett and Bill Gates and Melinda French Gates in terms of lifetime giving.",
    "link": "https://www.forbes.com/sites/forbeswealthteam/2026/02/09/americas-top-25-philanthropists---and-why-musk-page-and-ellison-arent-on-the-list/"
  },
  {
    "text": "Starmer’s UK Premiership Teeters on Brink as Key Aides Quit - Yahoo Finance",
    "fullText": "Morgan McSweeney quit as chief of staff on Sunday, saying he took “full responsibility” for his advice to hire the Labour veteran as US envoy, despite...",
    "link": "https://finance.yahoo.com/news/starmer-uk-premiership-teeters-brink-213839311.html"
  },
  {
    "text": "New York GOP’s midterm problem: No money, no bench — and Trump - Politico",
    "fullText": "The hard-knock life of a blue-state Republican looks even worse this midterm.",
    "link": "https://www.politico.com/news/2026/02/09/new-york-gop-midterm-problem-00769887"
  }
]