[
  {
    "text": "Patriots activate WR Mack Hollins from IR for AFC title game - ESPN",
    "fullText": "The Patriots activated WR Mack Hollins from injured reserve Saturday, giving their offense a boost heading into the AFC Championship Game.",
    "link": "https://www.espn.com/nfl/story/_/id/47717403/patriots-activate-wr-mack-hollins-ir-afc-title-game"
  },
  {
    "text": "Trump threatens Canada with a 100% tariff over its China trade deal and escalates feud with Carney - AP News",
    "fullText": "President Donald Trump is threatening to impose a 100% tariff on goods imported from Canada if America’s northern neighbor goes ahead with its trade deal with China. Trump is intensifying a feud with Prime Minister Mark Carney, who's become a rising voice in …",
    "link": "https://apnews.com/article/trump-canada-carney-china-tariffs-5079e910df071b45d2b16949efb8f11a"
  },
  {
    "text": "Trump Responds After U.S. Citizen Killed By Federal Authorities In Minneapolis (Live Updates) - Forbes",
    "fullText": "Video on Saturday showed federal agents wrestling a man to the ground outside a donut shop before shots rang out.",
    "link": "https://www.forbes.com/sites/mikestunson/2026/01/24/trump-blasts-minnesota-democrats-as-inciting-insurrection-after-man-killed-by-border-patrol-live-updates/"
  },
  {
    "text": "UFC 324 loses fight hours before event - MMA Fighting",
    "fullText": "The lightweight bout between Alexander Hernandez and Michael Johnson is off of UFC 324.",
    "link": "https://www.mmafighting.com/ufc/467638/ufc-324-loses-fight-hours-before-event"
  },
  {
    "text": "Updated hour-by-hour look at winter ice storm in Virginia - wtvr.com",
    "fullText": "Winter Storm Warnings are in effect statewide as a major winter weather system moves through Virginia.",
    "link": "https://www.wtvr.com/news/weather-news/winter-ice-storm-virginia-forecast-track-jan-24-2026"
  },
  {
    "text": "Lucas: UVA Rapid Reactions - University of North Carolina Athletics",
    "fullText": "Quick takeaways from the visit to Charlottesville.",
    "link": "https://goheels.com/news/2026/1/24/mens-basketball-lucas-uva-rapid-reactions"
  },
  {
    "text": "Did Edison accidentally make graphene in 1879? - Ars Technica",
    "fullText": "Rice University chemists replicated Thomas Edison's seminal experiment and found a surprising byproduct.",
    "link": "https://arstechnica.com/science/2026/01/did-edison-accidentally-make-graphene-in-1879/"
  },
  {
    "text": "Ben Affleck ‘Hooking Up’ With Model Brooks Nader: ‘Can’t Wipe the Smile Off His Face’ - Globe Magazine",
    "fullText": "There’s a new lady in Ben Affleck’s life. The star of The Rip is “hooking up” with Sports Illustrated swimsuit model Brooks Nader, reported Star. A source told the outlet that 53-year-old Affleck “can’t wipe the smile off his face” after landing the 28-year-o…",
    "link": "https://globemagazine.com/ben-affleck-hooking-up-with-model-brooks-nader-cant-wipe-the-smile-off-his-face/"
  },
  {
    "text": "School closings and delays around Mass. - wcvb.com",
    "fullText": "Check out the latest school closings and delays as the Bay State braces for a major storm on Sunday.",
    "link": "https://www.wcvb.com/article/massachusetts-school-closings-delays-snow/70120032"
  },
  {
    "text": "China’s Xi Places His Top General Under Investigation as Military Purges Heat Up - The Wall Street Journal",
    "fullText": "Gen. Zhang Youxia is most senior active member of military hierarchy to face dismissal since Tiananmen Square fallout",
    "link": "https://www.wsj.com/world/china/chinas-xi-places-his-top-general-under-investigation-as-military-purges-heat-up-d07f9c7d"
  },
  {
    "text": "N.J. weather: Latest snow totals predicted by 11 forecasters for the looming winter storm - nj.com",
    "fullText": "Some snowfall projections have dropped by a few inches, but most forecasters agree the approaching weekend storm has the ingredients to become a big and dangerous winter storm.",
    "link": "https://www.nj.com/weather/2026/01/nj-weather-latest-snow-totals-predicted-by-11-forecasters-for-the-looming-winter-storm.html"
  },
  {
    "text": "Why long-lasting power outages could be a big problem after the storm - The Washington Post",
    "fullText": "As elected officials and energy companies insist they are better prepared than ever for challenges that snow and ice bring, the coming storm will present yet another stiff test.",
    "link": "https://www.washingtonpost.com/weather/2026/01/24/winter-storm-states-power-outage-plans/"
  },
  {
    "text": "If You Use Gmail, You're Going To Want To Turn Off This 1 Automatic Setting ASAP - BuzzFeed",
    "fullText": "Plus: a quick guide to the two-step process for opting out.",
    "link": "https://www.huffpost.com/entry/opt-out-gmail-ai-training-goog_n_69405837e4b0fa125e7f49a7"
  },
  {
    "text": "NBA trade deadline: How Giannis’ injury affects Bucks, Knicks, Warriors, Heat, and more - Yahoo Sports",
    "fullText": "This is how Giannis’ latest injury affects the NBA trade deadline.",
    "link": "https://www.sbnation.com/nba/1101192/nba-trade-deadline-how-giannis-injury-affects-bucks-knicks-warriors-heat-and-more"
  },
  {
    "text": "What Happens to Your Blood Sugar When You Take Omega 3 Supplements Every Day? - Verywell Health",
    "fullText": "Based on extensive research, there is insufficient scientific evidence to support taking an omega-3 supplement daily to improve blood sugar levels.",
    "link": "https://www.verywellhealth.com/omega-3-supplements-and-blood-sugar-11865218"
  },
  {
    "text": "One cookbook author ate chocolate cake daily for 6 years. Now she shares her recipe - CNN",
    "fullText": "Want a dessert that’s delicious, easy to make and allergen-aware? Author Rachel Riggs shares this nutrient-packed chocolate cake recipe from her new cookbook.",
    "link": "https://www.cnn.com/2026/01/24/health/everyday-chocolate-cake-recipe-wellness"
  },
  {
    "text": "Alphabet, IBM and 3 other tech stocks could be big winners this earnings season - MarketWatch",
    "fullText": "Beyond the ‘Magnificent Seven’ names, Wall Street analysts see opportunities in software and specialized semiconductor plays",
    "link": "https://www.marketwatch.com/story/these-5-tech-stocks-could-be-big-winners-this-earnings-season-0556bf47"
  },
  {
    "text": "How Soviet urban planning is helping Russia freeze Ukraine - BBC",
    "fullText": "Thousands of people are affected when heating plants are targeted by Russian forces.",
    "link": "https://www.bbc.com/news/articles/c338jpk8r1vo"
  },
  {
    "text": "Silver Anniversary Content Creator Guide - Halo Waypoint",
    "fullText": "<p>Over the past 25 years, talented creators from all disciplines have helped share and define the world of Halo. Without the streamers, let’s-players, machinima makers, lore masters, and all the other incredible creators in our community, Halo wouldn’t be th…",
    "link": "https://www.halowaypoint.com/news/content-creator-guide"
  }
]