[
  {
    "text": "Critics Choice Awards 2026 Red Carpet Gallery: Quinta Brunson, Odessa A’zion and More - Variety",
    "fullText": "See all of the looks from the 2026 Critics Choice Awards red carpet.",
    "link": "https://variety.com/gallery/critics-choice-awards-2026-red-carpet-fashion/"
  },
  {
    "text": "Denmark tells Trump to stop threatening to seize Greenland - CNBC",
    "fullText": "President Donald Trump has sought to acquire Greenland since his first term.",
    "link": "https://www.cnbc.com/2026/01/04/trump-denmark-greenland-frederiksen-venezuela.html"
  },
  {
    "text": "Venezuela live updates: Maduro to appear in federal court Monday on alleged drug charges - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/live-updates/venezuela-live-updates-trump-give-details-after-us/?id\\\\u003d127792811"
  },
  {
    "text": "Crans-Montana: Mourners gather at mass for Swiss bar fire victims - BBC",
    "fullText": "There are tears and hugs at a special Mass for the victims of the blaze on New Year’s Eve.",
    "link": "https://www.bbc.com/news/articles/cn82l012dw6o"
  },
  {
    "text": "Hollywood starts 2026 with 'Avatar: Fire and Ash' No. 1, as James Cameron's sci-fi epic crosses $1B - NBC News",
    "fullText": "Hollywood kicked off 2026 with \"Avatar: Fire and Ash\" atop the box office for the third straight week and with hopes for a blockbuster-filled year after a disappointing 2025",
    "link": "https://www.nbcnews.com/news/us-news/avatar-box-office-rcna252214"
  },
  {
    "text": "Myles Garrett breaks NFL single-season sack record - Cleveland Browns",
    "fullText": "With his 23rd sack of the 2025 season, Garrett set a new NFL record",
    "link": "https://www.clevelandbrowns.com/news/myles-garrett-breaks-nfl-single-season-sack-record"
  },
  {
    "text": "Aliro arrives – the smart lock standard is set to launch this year - The Verge",
    "fullText": "The Apple, Google, and Samsung-backed protocol will bring Apple Home Key–style digital keys to Android phones",
    "link": "https://www.theverge.com/news/854091/aliro-smart-lock-standard-launches-2026-apple-uwb-nfc"
  },
  {
    "text": "Everything You Need to Know: Ravens vs. Steelers - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "The Ravens can clinch a playoff spot and their third straight AFC North title with a victory over their archrivals in the regular-season finale.",
    "link": "https://www.baltimoreravens.com/news/lamar-jackson-return-derrick-henry-dominant-dk-metcalf-suspended-classic-movie-ravens-steelers-week-18"
  },
  {
    "text": "Berlin power cut: Activist group says it was behind fire that cut electricity supply - BBC",
    "fullText": "The far-left Vulkan Gruppe says in a statement that targeting the fossil fuel economy, not cutting power, was the goal.",
    "link": "https://www.bbc.com/news/articles/c78v984ywgeo"
  },
  {
    "text": "CES 2026 news: Live updates on TVs, smart glasses, phones, and more we've seen so far - ZDNET",
    "fullText": "The world's biggest technology trade show is underway, and we're already seeing several companies make their best pitches for 2026.",
    "link": "https://www.zdnet.com/article/ces-2026-live-updates-1-4-26/"
  },
  {
    "text": "Venezuela's military recognizes Vice President Delcy Rodriguez as acting leader after Maduro's capture - CBS News",
    "fullText": "Delcy Rodriguez, who is next in the presidential line of succession, served as Nicolas Maduro's vice president since 2018.",
    "link": "https://www.cbsnews.com/news/venezuela-military-delcy-rodriguez-acting-leader-nicolas-maduro/"
  },
  {
    "text": "Saudi-backed forces regain control of Yemen’s Hadramout after days of airstrikes - AP News",
    "fullText": "Saudi-backed forces have retaken Yemen's port city of Mukalla from southern separatists. The capital of Hadramout province was reclaimed by Yemen’s internationally recognized government after Saudi airstrikes. Video shows the Saudi-backed National Shield Forc…",
    "link": "https://apnews.com/article/yemen-separatists-mukalla-saudi-forces-85bf58559c19afa2851f777ceb970831"
  },
  {
    "text": "Rubio explains how U.S. might 'run' Venezuela after Maduros' ouster - CNBC",
    "fullText": "President Donald Trump on Saturday said the U.S. will \"run\" Venezuela until a new leader is determined.",
    "link": "https://www.cnbc.com/2026/01/04/rubio-explains-how-us-might-run-venezuela-after-maduros-ouster-.html"
  },
  {
    "text": "SpaceX launches 1st Starlink satellites of 2026 on new Falcon 9 rocket - Space",
    "fullText": "Liftoff occurred at 1:48 a.m. EST on Sunday (Jan. 4).",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-6-88-b1101-ccsfs-jrti"
  },
  {
    "text": "Rubio touts U.S. refineries' ability to process Venezuela's oil - Axios",
    "fullText": "Rubio predicted \"dramatic\" interest from \"non-Russian, non-Chinese\" companies.",
    "link": "https://www.axios.com/2026/01/04/rubio-refineries-venezuelas-oil"
  },
  {
    "text": "Plaud launches a new AI pin and a desktop meeting notetaker - TechCrunch",
    "fullText": "Plaud is going after the likes of Granola to launch a desktop app that records online meetings",
    "link": "https://techcrunch.com/2026/01/04/plaud-launches-a-new-ai-pin-and-a-desktop-meeting-notetaker/"
  },
  {
    "text": "For 100 Years, These Giant Desert Rocks Moved on Their Own… Now We Finally Know Why - The Daily Galaxy",
    "fullText": "Scientists finally catch mysterious desert rocks moving, and the truth is unreal.",
    "link": "https://dailygalaxy.com/2026/01/why-these-rocks-moved-on-their-own-desert/"
  },
  {
    "text": "Hundreds of iceberg earthquakes are shaking the crumbling end of Antarctica's Doomsday Glacier - Live Science",
    "fullText": "The seismic echoes of capsizing icebergs falling from Thwaites Glacier have been detected for the first time.",
    "link": "https://theconversation.com/hundreds-of-iceberg-earthquakes-detected-at-the-crumbling-end-of-antarcticas-doomsday-glacier-268893"
  }
]