[
  {
    "text": "Private jet crashes while taking off during storm in Maine - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/private-jet-carrying-8-passengers-crashes-bangor-maine/story?id\\\\u003d129554258"
  },
  {
    "text": "Israel says it has retrieved remains of final Gaza hostage Ran Gvili - BBC",
    "fullText": "Israeli Prime Minister Benjamin Netanyahu called Ran Gvili’s return \"an extraordinary achievement\".",
    "link": "https://www.bbc.com/news/articles/c5ydvz7nz4mo"
  },
  {
    "text": "Democrats grow louder on calls for Kristi Noem to resign or face impeachment - NBC News",
    "fullText": "WASHINGTON — Eight additional Democrats signed on to an impeachment resolution against Homeland Security Secretary Kristi Noem in the wake of the killing of Alex Pretti, bringing the total number of co-sponsors to 120, according to a spokesperson for the offi…",
    "link": "https://www.nbcnews.com/politics/immigration/democrats-grow-louder-calls-kristi-noem-resign-face-impeachment-rcna255844"
  },
  {
    "text": "Minnesota Republican drops out of governor's race, citing GOP's handling of immigration enforcement - NBC News",
    "fullText": "Republican Chris Madel announced on Monday that he was ending his run for Minnesota governor, pointing to his party's handling of immigration enforcement in his state as his rationale.\"I cannot support the national Republicans' stated retribution on the citiz…",
    "link": "https://www.nbcnews.com/politics/2026-election/minnesota-governor-candidate-chris-madel-gop-immigration-enforcement-rcna255949"
  },
  {
    "text": "Amazon MGM Studios Shakeup: Laura Lancaster, Nick Pepper Leaving: Excl - Deadline",
    "fullText": "Amazon MGM Studios shakeup: Laura Lancaster & Nick Pepper are leaving, Blair Fetter is joining. TV Chief Peter Friedlander sets genre-based structure.",
    "link": "http://deadline.com/2026/01/amazon-laura-lancaster-nick-pepper-leaving-blair-fetter-1236690472/"
  },
  {
    "text": "Judges, inundated with immigration cases, don’t mince words on ICE tactics - Politico",
    "fullText": "Federal judges in Minnesota are overwhelmed with cases stemming from Operation Metro Surge.",
    "link": "https://www.politico.com/news/2026/01/26/minnesota-immigration-cases-ice-00746275"
  },
  {
    "text": "Iconic drummer Sly Dunbar has died - Jamaica Gleaner",
    "fullText": "Lowell Fillmore 'Sly' Dunbar, drummer extraordinaire and co-founder of the revolutionary Taxi Records label, has died. His wife, Thelma, confirmed to The Gleaner that he passed away at home this morning. He was 73. \"About 7 o'clock this morning I...",
    "link": "https://jamaica-gleaner.com/article/entertainment/20260126/iconic-drummer-sly-dunbar-has-died"
  },
  {
    "text": "Grant Udinski withdraws from Browns head coaching search - NBC Sports",
    "fullText": "Grant Udinski will not be the next Browns head coach.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/grant-udinski-withdraws-from-browns-head-coaching-search"
  },
  {
    "text": "NYC digs out, goes remote for schools, probes 6 deaths possibly linked to frigid temps - gothamist.com",
    "fullText": "More than a foot of snow fell in some places. Dangerous travel conditions and temperatures persist across the region.",
    "link": "https://gothamist.com/news/nyc-digs-out-closes-schools-and-probes-6-deaths-possibly-linked-to-the-weekend-storm"
  },
  {
    "text": "149M logins exposed in unsecured database, inc 900k Apple accounts - 9to5Mac",
    "fullText": "A database containing 149 million account logins has been found sitting unsecured on a cloud service. The records include 900,000...",
    "link": "https://9to5mac.com/2026/01/26/149m-logins-exposed-in-unsecured-database-inc-900k-apple-accounts/"
  },
  {
    "text": "South Sudan army threat to 'spare no-one' condemned - BBC",
    "fullText": "The UN mission says it is gravely concerned by \"inflammatory rhetoric calling for violence against civilians\".",
    "link": "https://www.bbc.com/news/articles/c79rjjr481zo"
  },
  {
    "text": "Nigella Lawson to replace Prue Leith on The Great British Bake Off - BBC",
    "fullText": "The TV chef says she's \"bubbling with excitement\" to be joining Paul Hollywood on the Channel 4 show.",
    "link": "https://www.bbc.com/news/articles/cgk80pzxkexo"
  },
  {
    "text": "Political Tension Makes U.S. vs. Canada Hockey Rivalry Even Hotter at Olympics - Sports Illustrated",
    "fullText": "As one of the most enduring rivalries, the feud will be magnified in Milan, amid a frigid political climate and fiery on-ice clashes.",
    "link": "https://www.si.com/winter-olympics/political-tension-makes-us-canada-hockey-rivalry-even-hotter"
  },
  {
    "text": "Sarepta Announces Positive Topline Three-Year EMBARK Results Showing ELEVIDYS Significantly Slows Disease Progression on Key Functional Measures in Ambulatory Duchenne Patients - Sarepta Therapeutics",
    "fullText": "A t a mean age of 9 years old, ELEVIDYS-treated patients achieved mean North Star Ambulatory Assessment (NSAA) scores above baseline three years after treatment (n=52) ELEVIDYS gene therapy demonstrated 70% or greater reduction in the rate of decline relative…",
    "link": "https://investorrelations.sarepta.com/news-releases/news-release-details/sarepta-announces-positive-topline-three-year-embark-results"
  },
  {
    "text": "Samsung, if You Add This to the Galaxy S26 Ultra, I'd Be Eternally Grateful - CNET",
    "fullText": "Commentary: I've tested phones for 14 years, and I've got a few ideas on how Samsung can improve its next phone.",
    "link": "https://www.cnet.com/tech/mobile/samsung-if-you-add-this-to-the-galaxy-s26-ultra-id-be-eternally-grateful/"
  },
  {
    "text": "France debates under-15s social media ban endorsed by Macron - BBC",
    "fullText": "Prime Minister Sébastien Lecornu has said he will use a fast-track procedure to get the legislation on the books by September.",
    "link": "https://www.bbc.com/news/articles/c07x003vx0yo"
  },
  {
    "text": "The market has cooled on tech. These are the trades to make now, says this strategist. - MarketWatch",
    "fullText": "Use options to play Meta, Microsoft and Apple says Evercore ISI",
    "link": "https://www.marketwatch.com/story/caution-ahead-of-big-tech-earnings-means-these-are-the-trades-to-make-1b343472"
  },
  {
    "text": "Scientists just got the clearest picture of the dark universe yet: 'Now the dream has come true' - Space",
    "fullText": "\"These results from the Dark Energy Survey shine new light on our understanding of the universe and its expansion.\"",
    "link": "https://www.space.com/astronomy/dark-universe/scientists-just-got-the-clearest-picture-of-the-dark-universe-yet-now-the-dream-has-come-true"
  },
  {
    "text": "Town-by-town totals: How much snow has fallen in Mass. so far? - boston25news.com",
    "fullText": "A massive, long-duration winter storm continues on Monday, threatening to dump up to two feet of snow in some areas.",
    "link": "https://www.boston25news.com/news/local/town-by-town-totals-how-much-snow-has-fallen-mass-so-far/RT35L262E5HQPMDUW2GOIDXEYI/"
  }
]