[
  {
    "text": "Anthropic’s Move Into Legal Is Sinking Data Services Stocks - Bloomberg",
    "fullText": "Once again, artificial intelligence is dominating investors’ attention in the stock market. These days, however, the focus is turning more and more toward companies that may get disrupted by the new technology rather than those who stand to profit from it.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-03/legal-software-stocks-plunge-as-anthropic-releases-new-ai-tool"
  },
  {
    "text": "Bitcoin breaks below $73,000 to lowest since November 2024 as heavy selling resumes - CNBC",
    "fullText": "Bitcoin fell below $73,000 on Tuesday as investors sold the asset to hedge against heightened geopolitical and economic uncertainties.",
    "link": "https://www.cnbc.com/2026/02/03/bitcoin-price-today.html"
  },
  {
    "text": "French prosecutors request 5-year ban on Marine Le Pen from holding office - AP News",
    "fullText": "French prosecutors have requested a five-year ban on holding elected office against far-right leader Marine Le Pen at a crucial appeal trial in Paris. It's an outcome that may prevent her from running in the 2027 presidential election. Le Pen, 57, is seeking …",
    "link": "https://apnews.com/article/marine-le-pen-appeal-trial-france-presidential-election-726408584ad5126901fd101f6ccf47d9"
  },
  {
    "text": "Dow drops 400 points, S&P 500 sheds 1% as investors rotate out of tech: Live updates - CNBC",
    "fullText": "Shares of Palantir jumped after the defense tech company gave strong fourth-quarter financial results and upbeat guidance, boosting tech.",
    "link": "https://www.cnbc.com/2026/02/02/stock-market-today-live-updates.html"
  },
  {
    "text": "A new generation revives 'The Muppet Show' and it's as delightful as ever - NPR",
    "fullText": "This isn't the first reincarnation of Jim Henson's crew, but it's one of the best in a very long time. Seth Rogen is an executive producer, and Maya Rudolph and Sabrina Carpenter guest star.",
    "link": "https://www.npr.org/2026/02/03/nx-s1-5697369/the-muppet-show-review"
  },
  {
    "text": "Don’t tune into the Super Bowl hoping for a break from politics - AP News",
    "fullText": "The NFL says the federal security presence at the Super Bowl will be consistent with past games and Immigration and Customs Enforcement won't be there. The NFL has faced pressure to take a stance against President Donald Trump's immigration policies ahead of …",
    "link": "https://apnews.com/article/super-bowl-bad-bunny-trump-politics-1447163cfa820cbb0c96973c20ccd976"
  },
  {
    "text": "Did we just see a black hole explode? Physicists think so—and it could explain (almost) everything - Phys.org",
    "fullText": "In 2023, a subatomic particle called a neutrino crashed into Earth with such a high amount of energy that it should have been impossible. In fact, there are no known sources anywhere in the universe capable of producing such energy—100,000 times more than the…",
    "link": "https://phys.org/news/2026-02-black-hole-physicists.html"
  },
  {
    "text": "Iran wants to change venue and format of nuclear talks with U.S. - Axios",
    "fullText": "The demands risk pushing Trump closer to military action.",
    "link": "https://www.axios.com/2026/02/03/iran-us-nuclear-negotiations-format"
  },
  {
    "text": "Ex-No. 1 NFL Pick Explains Why Super Bowl Coaches Were ‘The Smartest in My Career’ - Sports Illustrated",
    "fullText": "Much of how Seattle’s Mike Macdonald and Mike Vrabel operate is in contrast to each other. Plus, a retired Olympic surfer defends Sam Darnold and more in Greg Bishop’s newsletter.",
    "link": "https://www.si.com/nfl/why-super-bowl-coaches-were-smartest-in-my-career-mike-vrabel-mike-macdonald"
  },
  {
    "text": "Opinion | RFK Jr.’s attacks on vaccines just hit a wall of pediatricians - The Washington Post",
    "fullText": "The American Academy of Pediatrics issuing its own vaccine guidance is not just symbolic.",
    "link": "https://www.washingtonpost.com/opinions/2026/02/03/vaccine-guidance-aap-pediatrics-rfk/"
  },
  {
    "text": "X offices raided in France as prosecutors investigate child abuse images and deepfakes - AP News",
    "fullText": "French prosecutors have raided the offices of social media platform X as part of an investigation into allegations of spreading child sexual abuse images and deepfakes. They have also summoned owner Elon Musk for questioning. The investigation, which began in…",
    "link": "https://apnews.com/article/france-x-investigation-seach-elon-musk-1116be84d84201011219086ecfd4e0bc"
  },
  {
    "text": "FX's 'Love Story': JFK Jr and Carolyn Bessette's Sex, Lies and Politics - Variety",
    "fullText": null,
    "link": "https://variety.com/2026/tv/features/love-story-fx-jfk-jr-carolyn-bessette-sex-politics-1236648235/"
  },
  {
    "text": "Nick Diaz plans to continue fighting following Mexico rehab stint: ‘I see myself becoming world champion’ - MMA Fighting",
    "fullText": "Nick Diaz is sober and wants to be a champion again.",
    "link": "https://www.mmafighting.com/ufc/469095/nick-diaz-plans-to-continue-fighting-following-mexico-rehab-stint-i-see-myself-becoming-world-champion"
  },
  {
    "text": "Fitbit founders launch AI platform to help families monitor their health - TechCrunch",
    "fullText": "Luffu uses AI in the background to gather and organize family information, learn day-to-day patterns, and flag notable changes so families can stay aligned and address potential well-being issues.",
    "link": "https://techcrunch.com/2026/02/03/fitbit-founders-launch-ai-platform-to-help-families-monitor-their-health/"
  },
  {
    "text": "Just When Flu Cases Dropped, Doctors Say They Noticed This Concerning Pattern - AOL.com",
    "fullText": "Flu cases are increasing after weeks of decline; infectious disease doctors warn a second peak is likely. What’s behind the rise and how to protect yourself.",
    "link": "https://www.prevention.com/health/a70224732/flu-cases-increasing-second-peak/"
  },
  {
    "text": "Satellite imagery shows where the U.S. military is positioned near Iran - The Washington Post",
    "fullText": "The scale of the buildup seems aimed at readying forces for expansive operations, analysts said.",
    "link": "https://www.washingtonpost.com/national-security/2026/02/03/trump-iran-military-equipment-strikes/"
  },
  {
    "text": "Google Home finally adds support for buttons - The Verge",
    "fullText": "An update allows programmable switches, also known as buttons, to work in Google’s smart home platform.",
    "link": "https://www.theverge.com/tech/872927/google-home-button-support-arrives"
  },
  {
    "text": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year - BBC",
    "fullText": "The attack - which reportedly consisted of more than 70 missiles and 450 drones - comes after a so-called \"energy truce\" expired at the weekend.",
    "link": "https://www.bbc.com/news/articles/cpwng25114ro"
  },
  {
    "text": "LA28 Unveils Seven Venues for the 2028 Olympic Football (Soccer) Tournament Matches - Columbus Crew",
    "fullText": "LOS ANGELES \\[February 3, 2026\\] — The LA28 Olympic and Paralympic Games today announced six additional venues across the United States that will hold matches for the highly anticipated 2028 Olympic Football (Soccer) Tournaments, generating new excitement whi…",
    "link": "https://www.columbuscrew.com/news/la28-unveils-seven-venues-for-the-2028-olympic-football-soccer-tournament-matches"
  }
]