[
  {
    "text": "Antarctica’s Oldest, Largest Iceberg Is Turning an Ominous Blue Color - Gizmodo",
    "fullText": "The iceberg could completely disintegrate within days or weeks, scientists say.",
    "link": "https://gizmodo.com/antarcticas-oldest-largest-iceberg-is-turning-an-ominous-blue-color-2000707527"
  },
  {
    "text": "IRS announces first day of 2026 filing season; online tools and resources help with tax filing - IRS (.gov)",
    "fullText": "IR-2026-02, Jan. 8, 2026 — The Internal Revenue Service announced Monday, January 26, 2026, as the opening of the nation’s 2026 filing season. This year, several new tax law provisions of the One, Big, Beautiful Bill become effective, which could impact feder…",
    "link": "https://www.irs.gov/newsroom/irs-announces-first-day-of-2026-filing-season-online-tools-and-resources-help-with-tax-filing"
  },
  {
    "text": "‘The Pitt’ takes a deep breath and nails its second act - The Washington Post",
    "fullText": "Rather than compete with the high drama of the first season, the Emmy-winning medical series starring Noah Wyle refocuses on everyday crises.",
    "link": "https://www.washingtonpost.com/entertainment/tv/2026/01/08/the-pitt-season-two-review/"
  },
  {
    "text": "Senate votes to block Trump from future military strikes on Venezuela - CNBC",
    "fullText": "The Trump administration used to military to snatch Venezuelan President Nicolas Maduro last week.",
    "link": "https://www.cnbc.com/2026/01/08/venezuela-senate-voting-on-halting-military-action-after-maduro-capture.html"
  },
  {
    "text": "Philippines evacuates 3,000 people after activity increases at Mayon Volcano - abcnews.go.com",
    "fullText": "The Philippines has evacuated nearly 3,000 villagers from a danger zone on the foothills of the Mayon Volcano after officials raised the alert level due to recent activity",
    "link": "https://abcnews.go.com/Technology/wireStory/philippines-evacuates-3000-people-after-activity-increases-mayon-129000629"
  },
  {
    "text": "Harvey Weinstein to appear at critical hearing that could grant him new trial - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/US/harvey-weinstein-critical-hearing-grant-new-trial/story?id\\\\u003d129014006"
  },
  {
    "text": "One or more playoff teams could be lurking for John Harbaugh - NBC Sports",
    "fullText": "Folks in the know are watching Green Bay and Buffalo.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/one-or-more-playoff-teams-could-be-lurking-for-john-harbaugh"
  },
  {
    "text": "Bose is open-sourcing its old smart speakers instead of bricking them - The Verge",
    "fullText": "Bose is ending cloud support for its SoundTouch speakers, but they’ll remain functional now thanks to an open-source API and local controls.",
    "link": "https://www.theverge.com/news/858501/bose-soundtouch-smart-speakers-open-source"
  },
  {
    "text": "Trade deficit in October hits smallest since 2009 after Trump's tariff moves - CNBC",
    "fullText": "The trade shortfall was just $29.4 billion for October, down 39% from the prior month.",
    "link": "https://www.cnbc.com/2026/01/08/trade-deficit-in-october-hits-smallest-since-2009-after-trumps-tariff-moves.html"
  },
  {
    "text": "Eric Schmidt will massively invest in private telescopes, including Hubble replacement - Ars Technica",
    "fullText": "“This is a very significant contribution to the astronomical community.\"",
    "link": "https://arstechnica.com/space/2026/01/eric-schmidt-will-massively-invest-in-private-telescopes-including-hubble-replacement/"
  },
  {
    "text": "Bring Balance to the Pokémon TCG - Pokemon.com",
    "fullText": "Newly discovered Mega Evolution Pokémon make their Pokémon TCG debut in the upcoming expansion, Mega Evolution—Perfect Order.",
    "link": "https://www.pokemon.com/us/pokemon-news/bring-balance-to-the-pokemon-tcg"
  },
  {
    "text": "Emmys: TV Academy Introduces Legacy Award to Celebrate Shows That Have Made a “Profound and Lasting Impact” - The Hollywood Reporter",
    "fullText": "To be eligible for consideration, shows must have accumulated a minimum of 60 episodes across a minimum of five seasons and demonstrated continued or sustained relevance, influence or inspiration.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/emmys-tv-academy-introduces-legacy-award-1236465902/"
  },
  {
    "text": "Saudi-backed forces move to capture key Yemeni city as crisis with UAE deepens - CNN",
    "fullText": "Saudi-backed forces moved to capture a key southern Yemeni city on Thursday after Riyadh accused the UAE of helping a separatist leader flee.",
    "link": "https://www.cnn.com/2026/01/08/middleeast/yemen-saudi-uae-intl"
  },
  {
    "text": "Scientists are closing in on the Universe’s biggest mystery - ScienceDaily",
    "fullText": "Nearly everything in the universe is made of mysterious dark matter and dark energy, yet we can’t see either of them directly. Scientists are developing detectors so sensitive they can spot particle interactions that might occur once in years or even decades.…",
    "link": "https://www.sciencedaily.com/releases/2026/01/260107225530.htm"
  },
  {
    "text": "Bruno Mars announces massive Detroit stadium concert as part of new tour - The Detroit News",
    "fullText": "The show will mark the hitmaker's first area engagement since 2018.",
    "link": "https://www.detroitnews.com/story/entertainment/music/2026/01/08/bruno-mars-announces-massive-detroit-stadium-concert-as-part-of-new-tour/88074967007/"
  },
  {
    "text": "As a measles outbreak burns through South Carolina, not enough people are getting vaccinated - CNN",
    "fullText": "The first measles cases hit the region last fall, and the South Carolina health department declared an outbreak at the start of October. Now, more than 200 cases have been reported over the past few months, and there are no signs of slowing.",
    "link": "https://www.cnn.com/2026/01/08/health/south-carolina-measles-outbreak-challenges"
  },
  {
    "text": "Curt Cignetti Taught Indiana Football How to Dream - The Ringer",
    "fullText": null,
    "link": "https://www.theringer.com/2026/01/08/college-football/curt-cignetti-indiana-hoosiers-college-football-playoff-peach-bowl"
  },
  {
    "text": "McKinsey boss says there are 3 skills AI models can't do that young professionals should focus on - Business Insider",
    "fullText": "Bob Sternfels, global managing partner at McKinsey, identified three human skills that he said the AI models can't do.",
    "link": "https://www.businessinsider.com/mckinsey-boss-shares-human-skills-ai-models-cant-do-2026-1"
  },
  {
    "text": "Patriots Gameplan: 3 Keys to Victory in Sunday Night's Wild Card Playoff Matchup vs. the Chargers - New England Patriots",
    "fullText": "Previewing the Patriots first home playoff game since 2019 against the Chargers on Sunday night.",
    "link": "https://www.patriots.com/news/patriots-gameplan-3-keys-to-victory-in-sunday-night-s-wild-card-playoff-matchup-vs-the-chargers"
  }
]