[
  {
    "text": "Dodgers To Sign Kyle Tucker - MLB Trade Rumors",
    "fullText": "The Dodgers have done it again. Read more about the Kyle Tucker deal at MLB Trade Rumors.",
    "link": "https://www.mlbtraderumors.com/2026/01/dodgers-to-sign-kyle-tucker.html"
  },
  {
    "text": "Indiana begins effort to pass legislation to pay for new Bears stadium - NBC Sports",
    "fullText": "As the Bears prepare to play a significant postseason game in their longtime home of Soldier Field, the process of finding a new home continues.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/indiana-begins-effort-to-pass-legislation-to-pay-for-new-bears-stadium"
  },
  {
    "text": "Why the NFL chose NBC for Rams-Bears divisional-round game - Chicago Sun-Times",
    "fullText": "The home of “Sunday Night Football” has aired divisional playoff games before, but never in the 5:30 p.m. Sunday window.",
    "link": "https://chicago.suntimes.com/bears/2026/01/15/why-nfl-chose-nbc-for-rams-bears-divisional-rick-cordell-kevin-cross-fox-cbs-abc-espn-bills-49ers-seahawks-steelers-texans-aaron-rodgers"
  },
  {
    "text": "Rare earths magnets: How realistic are India's its ambitions? - BBC",
    "fullText": "India has a $800m plan to make rare earth magnets, aiming to reduce dependence on Chinese imports - but can it work?",
    "link": "https://www.bbc.com/news/articles/c9qe1d8p5xgo"
  },
  {
    "text": "Trump announces outlines of health care plan he wants Congress to consider - AP News",
    "fullText": "President Donald Trump has announced the outlines of a health care plan he wants Congress to take up. The plan come as Republicans are under increasing pressure to address rising health costs after lawmakers let subsidies expire. The cornerstone is a proposal…",
    "link": "https://apnews.com/article/trump-health-care-insurance-congress-savings-accounts-b7b4caae9ad14fda4646c42d3858202b"
  },
  {
    "text": "Hilary Duff drops her spicy new single 'Roommates' - Yahoo",
    "fullText": "This is Duff's second single off her forthcoming album, \"Luck …or something,\" out next month.",
    "link": "https://www.yahoo.com/entertainment/music/article/hilary-duff-drops-her-spicy-new-single-roommates-000259768.html"
  },
  {
    "text": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com",
    "fullText": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction"
  },
  {
    "text": "Medical examiner believes death of man in ICE custody was homicide, recording says - The Washington Post",
    "fullText": "A fellow detainee says he witnessed Geraldo Lunas Campos being choked to death by guards at the ICE detention center in Texas on Jan. 3.",
    "link": "https://www.washingtonpost.com/immigration/2026/01/15/ice-detention-death-homicide/"
  },
  {
    "text": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "fullText": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
    "link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o"
  },
  {
    "text": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "fullText": "The company said it had stopped Grok from undressing people on the X platform. Grok’s stand-alone app still does it.",
    "link": "https://www.washingtonpost.com/technology/2026/01/15/grok-ai-image-generator-sexualized/"
  },
  {
    "text": "Star Wars Shake-Up: Kathleen Kennedy Steps Down as George Lucas Protégé Dave Filoni, Exec Lynwen Brennan Take Over Lucasfilm - The Hollywood Reporter",
    "fullText": "The change in leadership may mean a new hope for the storied franchise or it could be an attack of the clones by giving fans more of the same.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/star-wars-kathleen-kennedy-steps-down-dave-filoni-1236465012/"
  },
  {
    "text": "“I am very annoyed”: Pharma execs blast RFK Jr.’s attack on vaccines - Ars Technica",
    "fullText": "Pharma execs had avoided conflict with Trump admin, but now join doctors in rebukes.",
    "link": "https://arstechnica.com/health/2026/01/big-pharma-is-openly-railing-against-rfk-jr-s-anti-vaccine-agenda/"
  },
  {
    "text": "Aggressive tactics used on Minneapolis protesters raise concerns about federal officer training - AP News",
    "fullText": "Federal immigration agents deployed to Minneapolis have used aggressive crowd-control tactics — including pointing rifles at demonstrators and deploying chemical irritants — actions the government says are necessary to protect officers from violent attacks an…",
    "link": "https://apnews.com/article/minneapolis-protests-immigration-agents-crowd-control-policing-ice-dhs-bd9335c2b0b793a3bff5c51287a80819"
  },
  {
    "text": "Conor McGregor responds after UFC boss shoots down potential fight - MMA Fighting",
    "fullText": "Conor McGregor plans to return at the UFC White House card but his opponent is now suddenly a mystery.",
    "link": "https://www.mmafighting.com/ufc/466483/conor-mcgregor-responds-to-dana-white-nixing-fight-against-michael-chandler-at-ufc-white-house"
  },
  {
    "text": "Native Americans are being swept up by ICE in Minneapolis, tribes say - The Washington Post",
    "fullText": "Tribal leaders say Indigenous people have been stopped, questioned, harassed and, in some cases, detained solely on the basis of their skin color or names.",
    "link": "https://www.washingtonpost.com/politics/2026/01/15/native-americans-ice-minneapolis/"
  },
  {
    "text": "Secret Lair: Rad Superdrop - Magic: The Gathering",
    "fullText": "Equip yourself with a Geiger counter and embrace that neon glow! Secret Lair's Rad Superdrop is bringing retro realness on January 26, 2026.",
    "link": "https://magic.wizards.com/en/news/announcements/secret-lair-rad-superdrop"
  },
  {
    "text": "Finally, Some Good News in the Fight Against Cancer - Gizmodo",
    "fullText": "The American Cancer Society’s annual report found that 70% of patients now survive at least five years after diagnosis.",
    "link": "https://gizmodo.com/finally-some-good-news-in-the-fight-against-cancer-2000710820"
  },
  {
    "text": "Drug ring's \"monkey\" technique used young swimmers to stash cocaine on ships at sea, Spanish police say - CBS News",
    "fullText": "Police said they had busted a network that saw smugglers swim on the high seas to help stash Colombian cocaine on container ships and hijack vessels.",
    "link": "https://www.cbsnews.com/news/drug-ring-monkey-technique-swimmers-stash-cocaine-ships-spain-police/"
  }
]