[
  {
    "text": "Microsoft Q2 earnings beat on top and bottom lines as cloud revenue tops $50 billion, but stock falls - Yahoo Finance",
    "fullText": "Microsoft reported its second quarter earnings after the bell Wednesday.",
    "link": "https://finance.yahoo.com/news/microsoft-q2-earnings-beat-on-top-and-bottom-lines-as-cloud-revenue-tops-50-billion-but-stock-falls-154618021.html"
  },
  {
    "text": "DHS raids are the stuff of Rand Paul’s nightmares. What will he do about it? - Politico",
    "fullText": "As Homeland Security chair, the Kentucky Republican has significant power to shape Congress’ response to the deaths of Alex Pretti and Renee Good.",
    "link": "https://www.politico.com/news/2026/01/29/rand-paul-dhs-alex-pretti-00754259"
  },
  {
    "text": "China and the UK are attempting to reset their relationship — here's how - CNBC",
    "fullText": "U.K. Prime Minister Sir Keir Starmer said he hopes to build \"more sophisticated\" ties with China as the two nations look to revive their bilateral relationship.",
    "link": "https://www.cnbc.com/2026/01/29/china-uk-starmer-xi-relations-visit-businesses-.html"
  },
  {
    "text": "Trump warns Iran 'time is running out' for nuclear deal as US military builds up in Gulf - BBC",
    "fullText": "Tehran says its armed forces are ready \"with their fingers on the trigger\" to respond to any aggression.",
    "link": "https://www.bbc.com/news/articles/cly5pd459gko"
  },
  {
    "text": "A shadow network in Minneapolis defies ICE and protects immigrants - AP News",
    "fullText": "If there’s been a soundtrack to life in Minneapolis in recent weeks, it’s the shrieking whistles and honking horns of thousands of people following immigration agents across the city. They are the ever-moving shadow of Operation Metro Surge. They are teachers…",
    "link": "https://apnews.com/article/protests-activists-minnesota-immigration-enforcement-ice-f86ce49f26230a1e5ad1592dcac0a5a9"
  },
  {
    "text": "U.S. life expectancy hits a new high, as deaths from overdoses and COVID fall - NPR",
    "fullText": "An American born in 2024 can expect to live to be 79, on average. But people in other wealthy countries can expect to live longer.",
    "link": "https://www.npr.org/2026/01/29/nx-s1-5689902/us-life-expectancy-rises"
  },
  {
    "text": "Rachel Dratch, Stephanie Hsu, Michaela Jaé Rodriguez, Juliette Lewis & More Join THE ROCKY HORROR SHOW- Full Cast Announced - BroadwayWorld.com",
    "fullText": "xIt's time to meet Broadway's new creatures of the night! Roundabout Theatre Company has just announced the complete cast for Richard O’Brien’s The Rocky Horror Show, with direction by Tony Award winner  Sam Pinkleton (Oh, Mary!).",
    "link": "https://www.broadwayworld.com/article/Rachel-Dratch-Stephanie-Hsu-Michaela-Ja-Rodriguez-Juliette-Lewis-More-Join-THE-ROCKY-HORROR-SHOW--Full-Cast-Announced-20260129"
  },
  {
    "text": "FBI executes search warrant seeking ballots from Fulton County’s 2020 election - The Washington Post",
    "fullText": "The FBI executed a search warrant in Fulton County, Georgia, for 2020 election ballots, as President Donald Trump seeks to find already debunked voter fraud.",
    "link": "https://www.washingtonpost.com/national-security/2026/01/28/fbi-fulton-2020-election-fraud/"
  },
  {
    "text": "2026 Senior Bowl Day 2 standouts: NFL draft sleepers emerge at QB, WR - NFL.com",
    "fullText": "Which 2026 NFL Draft prospects emerged on Day 2 of Senior Bowl practice? Lance Zierlein and Eric Edholm highlight five stars from Wednesday and provide more takeaways from the event.",
    "link": "https://www.nfl.com/news/2026-senior-bowl-day-2-standouts-2026-nfl-draft"
  },
  {
    "text": "What the ‘mother of all deals’ between India and the EU means for global trade - The Conversation",
    "fullText": "The new agreement will affect the lives of 2 billion people across economies representing about a quarter of global GDP.",
    "link": "https://theconversation.com/what-the-mother-of-all-deals-between-india-and-the-eu-means-for-global-trade-274515"
  },
  {
    "text": "Officials warn of 'moderate' risk after TB outbreak in SF high school - SFGATE",
    "fullText": "Three active cases have been reported at Archbishop Riordan High School since last November.",
    "link": "https://www.sfgate.com/bayarea/article/san-francisco-tuberculosis-school-21320252.php"
  },
  {
    "text": "Amanda Anisimova messages Jessica Pegula on Instagram after losing to her at the Australian Open - The Tennis Gazette",
    "fullText": "Classy 🤝",
    "link": "https://www.thetennisgazette.com/news/amanda-anisimova-messages-jessica-pegula-on-instagram-after-losing-to-her-at-the-australian-open/"
  },
  {
    "text": "House Republicans fume at Kristi Noem as impeachment push looms - Axios",
    "fullText": "For vulnerable Republicans, the prospect of an impeachment vote tied to enforcement efforts would be particularly painful.",
    "link": "https://www.axios.com/2026/01/28/republicans-congress-noem-impeachment"
  },
  {
    "text": "NASA and SpaceX move up launch of Crew-12 astronauts to Feb. 11 as relief crew after ISS medical evacuation - Space",
    "fullText": "That's four days earlier than originally planned.",
    "link": "https://www.space.com/space-exploration/human-spaceflight/nasa-and-spacex-move-up-launch-of-crew-12-astronauts-to-feb-11-as-relief-crew-after-iss-medical-evacuation"
  },
  {
    "text": "'ICE is not a law unto itself,' Minnesota judge says after immigrant released following contempt threat - CNBC",
    "fullText": "Minneapolis has become a focal point of immigration enforcement actions by the Trump administration, whose agents have killed two U.S. citizens there.",
    "link": "https://www.cnbc.com/2026/01/28/ice-immigrant-minnesota-contempt-released.html"
  },
  {
    "text": "Teenage girl who lived in Italy 12,000 years ago had a rare form of dwarfism, DNA study shows - Live Science",
    "fullText": "In 1963, researchers unearthed two Stone Age skeletons that were buried in an embraced position in a cave in Italy. Now, DNA testing has revealed that one of them had a rare genetic condition.",
    "link": "https://www.livescience.com/archaeology/teenage-girl-who-lived-in-italy-12-000-years-ago-had-a-rare-form-of-dwarfism-dna-study-shows"
  },
  {
    "text": "Kid Rock to Congress: For Fans and Artists, the Live Nation-Ticketmaster “Experiment Has Failed Miserably” - hollywoodreporter.com",
    "fullText": "The country-rock artists returned to Capitol Hill to discuss the astronomical cost of tickets and how to combat speculative ticketing and ticket-scooping bots.",
    "link": "http://www.hollywoodreporter.com/music/music-news/kid-rock-congress-ticketing-live-nation-ticketmaster-1236487577/"
  },
  {
    "text": "First pediatric flu death in Washington state highlights rising cases across the state - komonews.com",
    "fullText": "A school-age teenager has died after becoming ill from influenza last week, marking the first pediatric influenza death in the state this season.",
    "link": "https://komonews.com/news/local/snohomish-county-teen-flu-season-death-health-department-vaccine-washington-state-department-of-health-covid-rsv-hospital-flu-cases-across-western-washington"
  }
]