[
  {
    "text": "Starmer about to face Badenoch at Prime Minister's Questions - BBC",
    "fullText": "Starmer says Trump's apparent change of heart on the UK's Chagos Islands deal is an attempt to pressure him on Greenland, which Trump wants to take over.",
    "link": "https://www.bbc.com/news/live/cp374nly4v3t"
  },
  {
    "text": "Why ‘aspirational clutter’ is some of the hardest to part with - The Washington Post",
    "fullText": "The idea of who we are doesn’t always align with reality — and that’s often reflected in our unused stuff.",
    "link": "https://www.washingtonpost.com/home/2026/01/21/what-is-aspirational-clutter/"
  },
  {
    "text": "Trump tariffs live updates: Bessent brushes off Danish Treasury sales as ‘irrelevant’; Trump arrives in Davos as Greenland threats roil world, markets - Yahoo Finance",
    "fullText": "President Trump has said the acquisition of Greenland is crucial for the US but European allies, including Denmark and Greenland, remain staunchly opposed to...",
    "link": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-bessent-brushes-off-danish-treasury-sales-as-irrelevant-trump-arrives-in-davos-152657055.html"
  },
  {
    "text": "6 daily habits to slow aging, from a Harvard brain expert - The Washington Post",
    "fullText": "Harvard scientist Rudolph Tanzi shares his plan for brain health and aging well, including habits for sleep, stress and social interaction.",
    "link": "https://www.washingtonpost.com/health/2026/01/21/brain-aging-tips-harvard/"
  },
  {
    "text": "How the word 'cravat' came from the battlefields of 17th century Europe - NPR",
    "fullText": "In this installment of NPR's \"Word of the Week\" series we trace the origins of the \"cravat\" (borrowed from the French \"cravate\") back to the battlefields of 17th century Europe.",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5682323/cravat-word-of-the-week"
  },
  {
    "text": "Spain train crash: Driver killed in derailment near Barcelona - BBC",
    "fullText": "At least 37 people have been injured, five seriously, in a second crash, after Sunday's two-train collision in Andalusia.",
    "link": "https://www.bbc.com/news/articles/c1m78xl0gmpo"
  },
  {
    "text": "UK inflation rises to 3.4% in December, above forecasts - CNBC",
    "fullText": "The U.K. inflation rate rose to 3.4% in December, above forecasts of 3.3% from economists polled by Reuters.",
    "link": "https://www.cnbc.com/2026/01/21/uk-inflation-december-2025-uk-prices.html"
  },
  {
    "text": "Horoscope for Wednesday, January 21, 2026 - chicago.suntimes.com",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/21/horoscopes-today-wednesday-january-21-2026"
  },
  {
    "text": "Man who killed Japan's ex-PM Shinzo Abe gets life in prison - BBC",
    "fullText": "Abe's assassination stunned the country where there is virtually no gun crime.",
    "link": "https://www.bbc.com/news/articles/c86v5lj39zpo"
  },
  {
    "text": "The Minute After: Michigan - Inside the Hall",
    "fullText": "Thoughts on an 86-72 loss to the Wolverines:",
    "link": "https://www.insidethehall.com/2026/01/20/the-minute-after-michigan-24/"
  },
  {
    "text": "Suns find sloppy path to victory in Jalen Green’s return vs. 76ers - Arizona Sports",
    "fullText": "It was the Phoenix Suns' sloppiest game in weeks and yet their highs soared enough for a win over the Philadelphia 76ers in Jalen Green's return",
    "link": "https://arizonasports.com/nba/phoenix-suns/jalen-green-return-2/3609217/"
  },
  {
    "text": "Netflix Unveils Stacked Korean Content Slate of 33 Series and Films for 2026 (Full List) - hollywoodreporter.com",
    "fullText": "The lineup includes everything from a rom-com starring Blackpink’s Jisoo ('Boyfriend on Demand') to a superhero drama with Park Eun-bin and Cha Eun-woo ('The Wonderfools'), returning seasons of unscripted hits like 'Singles Inferno' and even some prestige cin…",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/netflix-korean-content-2026-slate-series-films-full-list-1236479688/"
  },
  {
    "text": "Amazon gets approval to build massive retail concept in Orland Park - chicago.suntimes.com",
    "fullText": "The estimated 230,000-square-foot store will offer shoppers general merchandise and grocery items.",
    "link": "https://chicago.suntimes.com/real-estate/2026/01/20/amazon-approval-build-massive-new-retail-concept-orland-park"
  },
  {
    "text": "Both astronauts that flew on Boeing’s troubled Starliner mission are now retired - CNN",
    "fullText": "Veteran NASA astronaut Suni Williams announced her retirement Tuesday. Her extended mission to orbit due to the troubled Boeing Starliner test flight was her final foray.",
    "link": "https://www.cnn.com/2026/01/20/science/nasa-suni-williams-retires-starliner-astronaut"
  },
  {
    "text": "Minnesota is the eye of the Trump storm - Politico",
    "fullText": "The state is a microcosm for the civic and legal battles defining Trump’s second term.",
    "link": "https://www.politico.com/news/2026/01/20/trump-minnesota-ice-protests-00738381"
  },
  {
    "text": "Half of UK's grassroot music venues make no profit - BBC",
    "fullText": "Thirty venues closed last year, and 6,000 staff were laid off as small venues saw their costs soar.",
    "link": "https://www.bbc.com/news/articles/c20d1lxlx3go"
  },
  {
    "text": "Galaxy S26 Ultra color lineup looks pretty boring, and didn’t even copy iPhone orange - 9to5Google",
    "fullText": "New leaks have revealed the likely lineup for Samsung’s Galaxy S26 Ultra colors, and it sounds pretty tame. Leaker Evan...",
    "link": "http://9to5google.com/2026/01/20/galaxy-s26-ultra-color-lineup-looks-pretty-boring-and-didnt-even-copy-iphone-orange/"
  },
  {
    "text": "Webb reveals a planetary nebula with phenomenal clarity, and it is spectacular - Ars Technica",
    "fullText": "The colors show the star’s final breath transforming into the raw ingredients for new worlds.",
    "link": "https://arstechnica.com/space/2026/01/webb-has-given-us-with-a-stunning-new-view-of-a-well-known-planetary-nebula/"
  },
  {
    "text": "OnePlus phones are reportedly no more as Oppo pulls the plug on the company - XDA",
    "fullText": "Things are looking dire.",
    "link": "https://www.xda-developers.com/oneplus-phones-are-reportedly-no-more-as-oppo-pulls-the-plug-on-the-company/"
  }
]