[
  {
    "text": "Live: Trump warns Minneapolis mayor is 'playing with fire' over immigration - BBC",
    "fullText": "The US president hits out at the city's mayor, who said \"Minneapolis does not and will not enforce federal immigration laws\".",
    "link": "https://www.bbc.com/news/live/c78vqp87zqqt"
  },
  {
    "text": "Kanye West Sets March Release Date for ‘Bully’ Album - Rolling Stone",
    "fullText": "Kanye West sets March 20 release date for new album 'Bully,' arriving via the independent music company Gamma. It follows his open letter ad in WSJ.",
    "link": "http://www.rollingstone.com/music/music-news/kanye-west-bully-release-date-signs-with-gamma-1235506094/"
  },
  {
    "text": "Amazon layoffs: What we know so far from internal messages - Business Insider",
    "fullText": "Amazon is laying off 16,000 corporate employees. Internal messages show that many of the affected employees had software engineering roles.",
    "link": "https://www.businessinsider.com/internal-messages-teams-jobs-affected-amazon-layoffs-2026-1"
  },
  {
    "text": "Where a nor’easter will bring heavy snow, strong winds and waves this weekend - The Washington Post",
    "fullText": "A potent system will bring the potential for blizzard-like conditions and coastal flooding from parts of the Southeast to New England.",
    "link": "https://www.washingtonpost.com/weather/2026/01/28/another-storm-east-coast-noreaster-forecast/"
  },
  {
    "text": "Tyson Fury to face Arslanbek Makhmudov in comeback fight - ESPN",
    "fullText": "Tyson Fury's return to the ring has been confirmed with the former heavyweight world champion set to fight Arslanbek Makhmudov on April 11.",
    "link": "https://www.espn.com/boxing/story/_/id/47753624/tyson-fury-arslanbek-makhmudov-comeback-fight-boxing-netflix"
  },
  {
    "text": "‘Send Help’ review: Rachel McAdams elevates Sam Raimi’s horror comedy - The Seattle Times",
    "fullText": "You’ve never seen Rachel McAdams, who carries this delightfully over-the-top adventure, quite like this, writes Moira Macdonald.",
    "link": "https://www.seattletimes.com/entertainment/movies/send-help-review-rachel-mcadams-elevates-sam-raimis-horror-comedy/"
  },
  {
    "text": "Harry Styles fans slam ticket prices for the singer's Together, Together tour: 'I'm so over this' - Yahoo",
    "fullText": "Included among Styles' 50-date extravaganza are six nights at Wembley Stadium in London and a 30-show residency at Madison Square Garden in New York City.",
    "link": "https://www.yahoo.com/entertainment/music/article/harry-styles-fans-slam-ticket-prices-for-the-singers-together-together-tour-im-so-over-this-212508909.html"
  },
  {
    "text": "Alexander Volkanovski can take huge step towards GOAT status by matching Jose Aldo record at UFC 325 - Bloody Elbow",
    "fullText": "Alexander Volkanovski will rematch Diego Lopes this weekend. #UFC325",
    "link": "https://bloodyelbow.com/2026/01/28/alexander-volkanovski-can-take-huge-step-towards-goat-status-by-matching-jose-aldo-record-at-ufc-325/"
  },
  {
    "text": "Fed Meeting Today: S&P 500, Nasdaq Futures Gain Ahead of Interest-Rate Decision — Live Updates - The Wall Street Journal",
    "fullText": "Live updates on markets and interest rates as the FOMC meets. Investors await Chair Jerome Powell's comments this afternoon. Follow along for the latest.",
    "link": "https://www.wsj.com/livecoverage/fed-interest-rate-decision-01-28-2026"
  },
  {
    "text": "Japan lost a 5-ton navigation satellite when it fell off a rocket during launch - Ars Technica",
    "fullText": "Imagine: You lost your car's cargo rack, but didn't notice until you reached your destination.",
    "link": "https://arstechnica.com/science/2026/01/heres-the-story-of-how-japans-h3-rocket-lost-its-cargo-and-just-kept-going/"
  },
  {
    "text": "Starbucks stock jumps as coffee chain's traffic grows for the first time in two years - CNBC",
    "fullText": "Shares of Starbucks have fallen more than 3% over the last year.",
    "link": "https://www.cnbc.com/2026/01/28/starbucks-is-about-to-report-earnings-heres-what-to-expect.html"
  },
  {
    "text": "Lessons From My Me Too - The Cut",
    "fullText": "In 2017, at the height of the Me Too movement, I accused the ‘Today’ show’s longest-serving anchor of sexual misconduct, writes Brooke Nevils: “I was nobody’s ideal victim.”",
    "link": "http://www.thecut.com/article/me-too-nbc-today-show-brooke-nevils-excerpt.html"
  },
  {
    "text": "Exclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26 - SamMobile",
    "fullText": "It was reported earlier that Samsung plans to introduce a major upgrade to wireless charging speeds with its future smartphones. The Galaxy S26 series supports up to 25W fast wireless charging. We are now bringing you an exclusive first look at Samsung’s 25W …",
    "link": "https://www.sammobile.com/news/exclusive-samsung-25w-wireless-charger-galaxy-s26-photos/"
  },
  {
    "text": "Scientists let AI loose on Hubble’s archives - The Verge",
    "fullText": "AI model AnomalyMatch took just 2.5 days to flag rarities like merging galaxies and gravitational lenses from 100 million image cutouts in Hubble’s archives.",
    "link": "https://www.theverge.com/news/869182/astronomers-ai-discover-cosmic-anomalies-hubble-archives"
  },
  {
    "text": "Diagnostic dilemma: Liquid-nitrogen-infused cocktail popped a man's stomach like a balloon - Live Science",
    "fullText": "Liquid nitrogen can be used safely in food preparation — but one man's stomach burst after he threw back a cocktail that had been cooled with the substance.",
    "link": "https://www.livescience.com/health/food-diet/diagnostic-dilemma-liquid-nitrogen-infused-cocktail-popped-a-mans-stomach-like-a-balloon"
  },
  {
    "text": "The Trump administration has secretly rewritten nuclear safety rules - NPR",
    "fullText": "The rewrite was done to speed up the construction of a new generation of nuclear reactors. Critics warn it could compromise safety and public trust.",
    "link": "https://www.npr.org/2026/01/28/nx-s1-5677187/nuclear-safety-rules-rewritten-trump"
  },
  {
    "text": "What really causes migraines? - BBC",
    "fullText": "Our understanding of migraine is starting to shift, overturning ideas of what's a symptom and what's a trigger, and which part of the brain is key for developing effective treatments.",
    "link": "https://www.bbc.com/future/article/20260127-what-really-causes-migraines"
  }
]