[
  {
    "text": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks - NASCAR.com",
    "fullText": "Bookmark this page and return often as links, results and more for 2026 Daytona Speedweeks are added for all three series.",
    "link": "https://www.nascar.com/news-media/2026/02/14/nascar-at-daytona-key-information-links-results-for-2026-speedweeks/"
  },
  {
    "text": "3 takeaways from No. 22 BYU’s narrow win over Colorado - Deseret News",
    "fullText": "",
    "link": "https://www.deseret.com/sports/2026/02/14/byu-basketball-beats-colorado-richie-saunders/"
  },
  {
    "text": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted - NPR",
    "fullText": "Unlike in Europe, officials in the U.S. with ties to Epstein have largely held their positions of power.",
    "link": "https://www.npr.org/2026/02/14/nx-s1-5714609/epstein-europe-fallout"
  },
  {
    "text": "Samsung Galaxy S26 Ultra Release Date Latest: New Prices And Deals - Forbes",
    "fullText": "This Samsung Galaxy S26 Ultra release date will see a new price strategy with a change to the pre-order deal.",
    "link": "https://www.forbes.com/sites/jaymcgregor/2026/02/14/samsung-galaxy-s26-ultra-price-pre-order-deal-trade-in/"
  },
  {
    "text": "States reliant on Colorado River fail to meet the latest deadline to find consensus - AP News",
    "fullText": "The seven Western states that depend on the Colorado River have missed a deadline for the second time to agree on a plan addressing record drought and water shortages. Arizona Gov. Katie Hobbs, California Gov. Gavin Newsom and Nevada Gov. Joe Lombardo release…",
    "link": "https://apnews.com/article/colorado-river-arizona-california-nevada-water-45daf816feba9004c389dc4a09ef01c8"
  },
  {
    "text": "Sen. Mark Kelly's lawyer urges DOJ officials not to seek indictment for a second time over video - NBC News",
    "fullText": "An attorney for Sen. Mark Kelly is urging DOJ officials not to pursue an indictment for a second time against a group of lawmakers who participated in a video encouraging members of the military to ignore “illegal orders.”",
    "link": "https://www.nbcnews.com/politics/congress/sen-mark-kellys-lawyer-urges-doj-officials-not-seek-indictment-second-rcna259093"
  },
  {
    "text": "Jennifer Aniston, Jason Bateman, Will Arnett, Bradley Cooper and Gigi Hadid Visit Sean Hayes' Off-Broadway Play - Yahoo News UK",
    "fullText": "The stars were all out to see 'The Unknown' at Studio Seaview in New York City on Friday, Feb. 13",
    "link": "https://people.com/jennifer-aniston-jason-bateman-will-arnett-bradley-cooper-and-gigi-hadid-visit-sean-hayes-off-broadway-play-11906976"
  },
  {
    "text": "NASA has a new problem to fix before the next Artemis II countdown test - Ars Technica",
    "fullText": "We observed materially lower leak rates compared to prior observations during WDR-1.\"",
    "link": "https://arstechnica.com/space/2026/02/nasa-chief-vows-to-solve-sls-rocket-fueling-issues-before-artemis-iii/"
  },
  {
    "text": "How global cybercrime syndicates are stealing hearts — and billions - Politico",
    "fullText": "Scammers are using artificial intelligence to create more realistic online identities to lure in lonely hearts.",
    "link": "https://www.politico.com/news/2026/02/14/how-global-cybercrime-syndicates-are-stealing-hearts-and-billions-00780481"
  },
  {
    "text": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "fullText": "Cardiologists share the important advice they give patients that you can also incorporate into your daily routine.",
    "link": "https://www.prevention.com/health/a70316209/cardiologist-heart-health-tips/"
  },
  {
    "text": "Winter storm warning issued as Tahoe braces for feet of snow - San Francisco Chronicle",
    "fullText": "A winter storm warning was issued for Yosemite, Tahoe, Shasta and other mountains. Feet of snow was forecast at ski resorts, but highway closures were possible.",
    "link": "https://www.sfchronicle.com/weather/article/tahoe-winter-storm-21352647.php"
  },
  {
    "text": "'Wuthering Heights': Margot Robbie and Jacob Elordi's Transformations - Variety",
    "fullText": "How the ‘Wuthering Heights’ hair and makeup team created Margot Robbie’s ‘Vagina Braids’ and transformed Jacob Elordi from 'Jesus' to 'Mr. Darcy'",
    "link": "https://variety.com/2026/artisans/news/wuthering-heights-margot-robbie-jacob-elordi-jesus-darcy-1236662485/"
  },
  {
    "text": "US debt spiral could start soon as interest rate on borrowing tops GDP growth - Fortune",
    "fullText": "CRFB warned the actual fiscal outlook could be far worse than even the latest sobering projections.",
    "link": "https://fortune.com/2026/02/14/us-debt-spiral-interest-rate-treasury-bond-yields-economic-growth-gdp/"
  },
  {
    "text": "Newsom says Trump’s attacks are bringing Europe together - Politico",
    "fullText": "It’s the president’s one contribution to the continent, the California governor said.",
    "link": "https://www.politico.com/news/2026/02/14/newsom-trump-munich-europe-00782440"
  },
  {
    "text": "Canadian Olympic curler says he's no cheat, attacks Sweden - ESPN",
    "fullText": "Canadian curler Marc Kennedy says his team may be the target of a \"premeditated\" attack after a Swedish curler accused Kennedy of illegally \"double-touching\" a rock after releasing it during a match Friday.",
    "link": "https://www.espn.com/olympics/curling/story/_/id/47928863/canadian-olympic-curler-says-no-cheat-attacks-sweden"
  },
  {
    "text": "Officials investigate second measles case in Dane Co. - Channel 3000",
    "fullText": "MADISON, Wis. — Health officials on Saturday confirmed they are investigating the second measles case in Dane County and the fourth in Wisconsin after an out-of-state traveler stayed at a",
    "link": "https://www.channel3000.com/news/officials-investigate-second-measles-case-in-dane-co/article_23ff9b73-143f-4d5d-bdf0-6c3c97dff3e8.html"
  },
  {
    "text": "Why Russia’s attacks on Ukraine’s energy grid aren’t ‘revenge’ for Kyiv’s deep strike campaign - The Kyiv Independent",
    "fullText": "After its largest winter mass attack on Feb. 3, Russia's Defense Ministry said the strikes on Ukrainian energy infrastructure were carried out \"in response to terrorist attacks by Kyiv on civilian objects\" in Russia. Some state media described the attack as \"…",
    "link": "https://kyivindependent.com/no-russias-attacks-on-energy-infrastructure-are-not-retaliation-for-ukraines-strikes-on-oil-refineries/"
  },
  {
    "text": "Planned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO - BBC",
    "fullText": "Giving some newborns in Guinea-Bissau an established hepatitis B treatment but not others is \"unethical\", it says.",
    "link": "https://www.bbc.com/news/articles/c78j5k2gk02o"
  }
]