[
  {
    "text": "U-Haul drives into crowd during anti-Iranian regime rally in Westwood, LAPD says - ABC7 Los Angeles",
    "fullText": "Chaos erupted after a U-Haul drove into a crowd during an anti-Iranian regime rally near the federal building in Westwood on Sunday afternoon.",
    "link": "https://abc7.com/post/haul-drives-crowd-during-anti-iranian-regime-rally-westwood-lapd-says/18388519/"
  },
  {
    "text": "49ers 23-19 Eagles (Jan 11, 2026) Game Recap - ESPN",
    "fullText": null,
    "link": "https://www.espn.com/nfl/recap?gameId\\\\u003d401772980"
  },
  {
    "text": "Rams to face Bears in Divisional Round of playoffs - TheRams.com",
    "fullText": "The Rams are Chicago-bound to face the Bears in the divisional round of the playoffs.",
    "link": "https://www.therams.com/news/rams-to-face-bears-in-divisional-round-of-playoffs-2025"
  },
  {
    "text": "Australia social media ban: Meta blocks 550,000 accounts under new law - BBC",
    "fullText": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
    "link": "https://www.bbc.com/news/articles/cpqye2yygl4o"
  },
  {
    "text": "Person with measles traveled through Maryland, Virginia last week, health officials say - WTOP",
    "fullText": "The Maryland Department of Health said the person traveled on trains from Jan. 7-8.",
    "link": "https://wtop.com/local/2026/01/person-with-measles-traveled-through-maryland-last-week-state-health-officials-say/"
  },
  {
    "text": "Ovechkin scores 20 goals for 21st season, 2nd most in NHL history - NHL.com",
    "fullText": "Capitals forward hits milestone against Predators, trails Howe, who reached mark 22 times",
    "link": "https://www.nhl.com/news/alex-ovechkin-scores-20-goals-for-21st-time-in-nhl-career"
  },
  {
    "text": "Jenna Ortega Shows Off Her G-String at Golden Globes 2026 in Completely Backless Goth Look - Yahoo",
    "fullText": "Jenna Ortega arrived at the Golden Globes 2026 in a backless gown with surprising side cutouts and a whale tail by Dilara Findikoglu. She is up for Best Performance by a Female Actor in a Television Series - Musical or Comedy. See her look, here.",
    "link": "https://www.instyle.com/jenna-ortega-golden-globes-2026-backless-g-string-dress-11876166"
  },
  {
    "text": "Nobel Institute rejects Machado's peace prize offer to Trump - Axios",
    "fullText": "\"Once a Nobel Prize is announced, it cannot be revoked, shared, or transferred to others,\" organizers say.",
    "link": "https://www.axios.com/2026/01/11/nobel-maria-corina-machado-trump-prize-transfer"
  },
  {
    "text": "Niners TE George Kittle suffers torn Achilles in win over Eagles - NFL.com",
    "fullText": "Niners tight end George Kittle suffered a torn Achilles in the second quarter of Sunday's 23-19 wild-card win over the Eagles and will miss the remainder of the playoffs, head coach Kyle Shanahan told reporters postgame.",
    "link": "https://www.nfl.com/news/niners-te-george-kittle-carted-off-field-with-apparent-lower-right-leg-injury-vs-eagles"
  },
  {
    "text": "Bowen Yang, Matt Rogers apologize for discouraging donations to Democrat running in Texas - USA Today",
    "fullText": null,
    "link": "https://www.usatoday.com/story/entertainment/celebrities/2026/01/11/bowen-yang-matt-rogers-jasmine-crockett-backlash/88133561007/"
  },
  {
    "text": "UK can legally stop shadow fleet tankers, ministers believe - BBC",
    "fullText": "Existing law could be used to approve the use of military force to stop sanction-busting ships operated by Russia and Iran.",
    "link": "https://www.bbc.com/news/articles/cy8pn7jgy3no"
  },
  {
    "text": "Thousands of tourists stranded in Lapland as cold grounds flights - BBC",
    "fullText": "All flights out of Kittila airport in northern Finland were cancelled on Sunday with temperatures falling as low as -38C.",
    "link": "https://www.bbc.com/news/articles/c74vnxlvl40o"
  },
  {
    "text": "The struggle of resizing windows on macOS Tahoe - Hacker News",
    "fullText": null,
    "link": "https://news.ycombinator.com/item?id\\\\u003d46579864"
  },
  {
    "text": "RFK Jr.’s theories about vaccines are about to be tested - Politico",
    "fullText": "American kids are no longer routinely being recommended shots against hepatitis A, meningitis, rotavirus and the flu.",
    "link": "https://www.politico.com/news/2026/01/11/the-diseases-rfk-jr-says-children-dont-need-to-be-routinely-vaccinated-for-00720396"
  },
  {
    "text": "Largest nursing strike in New York City history looming as contract negotiations continue - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/largest-nursing-strike-new-york-city-history-looming/story?id\\\\u003d129100789"
  },
  {
    "text": "Details Of Red Sox’ Pursuit Of Alex Bregman - MLB Trade Rumors",
    "fullText": "The Red Sox missed out on Alex Bregman. Visit MLB Trade Rumors for details on their offer to him and next steps now that he's a Cub.",
    "link": "https://www.mlbtraderumors.com/2026/01/details-of-red-sox-pursuit-of-alex-bregman.html"
  },
  {
    "text": "Iran Edges Closer to a Revolution That Would Reshape the World - Bloomberg.com",
    "fullText": "If the uprising succeeds in toppling the Islamic Republic, it would upend global geopolitics and energy markets — with the risk of widespread chaos.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-11/iran-edges-closer-to-a-revolution-that-would-reshape-the-world"
  },
  {
    "text": "SpaceX launches NASA's Pandora exoplanet mission, 3 dozen other satellites (video) - Space",
    "fullText": "Pandora will study the atmospheres of at least 20 exoplanets during its yearlong mission.",
    "link": "https://www.space.com/space-exploration/launches-spacecraft/watch-spacex-launch-nasas-pandora-exoplanet-studying-satellite-on-jan-11"
  },
  {
    "text": "CES 2026: 7 biggest news stories across TVs, laptops, and other weird gadgets you missed - ZDNET",
    "fullText": "It's a wrap for the world's largest technology trade show - here are the top announcements throughout the week-long event.",
    "link": "https://www.zdnet.com/article/ces-2026-recap/"
  }
]