[
  {
    "text": "Commission, packed with Trump allies, approves White House ballroom project - The Washington Post",
    "fullText": "The Commission of Fine Arts voted unanimously to approve the nearly 90,000-square-foot building’s design. A federal judge is weighing whether to halt the project.",
    "link": "https://www.washingtonpost.com/politics/2026/02/19/trump-white-house-ballroom-fine-arts/"
  },
  {
    "text": "Trump gathers members of Board of Peace for first meeting, with some U.S. allies wary - NPR",
    "fullText": "Trump created the group to oversee his ceasefire plan in Gaza, and said member states have pledged $7 billion for Gaza reconstruction. He also said the U.S. will contribute $10 billion to the Board of Peace.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5719053/trump-board-of-peace-meeting"
  },
  {
    "text": "Jacksonville Rapper Lil Poppa Dies at 25 - Pitchfork",
    "fullText": "He released his latest song, “Out of Town Bae,” just last Friday.",
    "link": "https://pitchfork.com/news/lil-poppa-dead-at-25/"
  },
  {
    "text": "A strong nor’easter could soon hit the East Coast. Here’s what could happen. - The Washington Post",
    "fullText": "A swath of the Mid-Atlantic and Northeast, including cities from D.C. to Boston, could face accumulating snow and strong winds.",
    "link": "https://www.washingtonpost.com/weather/2026/02/19/noreaster-storm-east-coast-forecast/"
  },
  {
    "text": "After leaving WHO, Trump officials propose more expensive replacement to duplicate it - The Washington Post",
    "fullText": "HHS proposes spending $2 billion a year to re-create systems the U.S. accessed through the WHO at a fraction of the cost, according to officials briefed on the matter.",
    "link": "https://www.washingtonpost.com/health/2026/02/19/alternative-world-health-organization-proposal/"
  },
  {
    "text": "Trump’s VA Found a New Way to Cut Disability Compensation for Vets - Rolling Stone",
    "fullText": "Donald Trump's Department of Veterans Affairs this week announced it is changing how it hands out disability ratings to veterans.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-va-changes-disability-ratings-rule-veterans-1235519325/"
  },
  {
    "text": "Study Confirms: Reentering SpaceX Rockets Are Peppering the Upper Atmosphere With Metal Pollution - Gizmodo",
    "fullText": "For the first time, scientists were able to directly detect upper-atmospheric pollution from space debris.",
    "link": "https://gizmodo.com/study-confirms-reentering-spacex-rockets-are-peppering-the-upper-atmosphere-with-metal-pollution-2000723932"
  },
  {
    "text": "More than 1,100 geese just turned up dead or sick in N.J. Here’s the disturbing reason why. - NJ.com",
    "fullText": "An alarming number of dead geese have been reported across the state since the weekend, sparking concern among residents.",
    "link": "https://www.nj.com/healthfit/2026/02/more-than-1100-geese-just-turned-up-dead-or-sick-in-nj-heres-the-disturbing-reason-why.html"
  },
  {
    "text": "Stocks slide as traders assess Walmart earnings, potential Iran conflict: Live updates - CNBC",
    "fullText": "The next key event for markets will be Friday's release of the personal consumption expenditures price index.",
    "link": "https://www.cnbc.com/2026/02/18/stock-market-today-live-updates.html"
  },
  {
    "text": "Hilary Duff Is Ready for Her Pop Return - Rolling Stone",
    "fullText": "Hilary Duff takes us inside her incredibly relatable comeback album 'Luck … or Something.'",
    "link": "http://www.rollingstone.com/music/music-features/hilary-duff-interview-new-album-luck-or-something-1235511649/"
  },
  {
    "text": "Over 1,000 Kenyans enlisted to fight in Russia-Ukraine war, report says - BBC",
    "fullText": "Investigators call the recruitment a well-organised trafficking ring involving immigration staff and security agencies.",
    "link": "https://www.bbc.com/news/articles/ce8w266769go"
  },
  {
    "text": "James Van Der Beek Merch Email Reactions Explained - BuzzFeed",
    "fullText": "“Adding emotional pressure to influence people’s decision is beyond inappropriate.”",
    "link": "https://www.buzzfeed.com/stephaniesoteriou/james-van-der-beek-uncomfortable-email-reacts"
  },
  {
    "text": "Wolves 2-2 Arsenal: Gunners collapse late as title lead starts to slip away - NBC Sports",
    "fullText": "Arsenal were 2-0 up and coasting to a seven-point lead in the Premier League title race, before they shipped two goals in the final half-hour and drew last-place Wolves 2-2 at Molineux Stadium on Wednesday.",
    "link": "https://www.nbcsports.com/soccer/news/wolves-2-2-arsenal-video-highlights-analysis-recap"
  },
  {
    "text": "Amid Epstein fallout, Bill Gates becomes point of controversy at India AI summit - CNBC",
    "fullText": "Bill Gates has become a point of controversy at a major Indian AI festival this week, amid the fallout of the latest Epstein file release.",
    "link": "https://www.cnbc.com/2026/02/19/amid-epstein-fallout-bill-gates-becomes-point-of-controversy-at-india-ai-summit-.html"
  },
  {
    "text": "A Record-Breaking Drill Beneath Antarctic Ice Revealed a Big Surprise - ScienceAlert",
    "fullText": "Scientists say they have drilled deeper than ever beneath the West Antarctic Ice Sheet, peering back millions of years to reveal signs it was once, at least in part, open ocean.",
    "link": "https://www.sciencealert.com/a-record-breaking-drill-beneath-antarctic-ice-revealed-a-big-surprise"
  },
  {
    "text": "Tariffs paid by midsized US firms tripled last year, new analysis from JPMorganChase Institute shows - Associated Press News",
    "fullText": "New research shows midsized U.S. companies pay far more in Trump-era tariffs, and the costs land at home. On Thursday, the JPMorganChase Institute said tariff payments for these firms tripled over the past year. The report says these businesses may have to ra…",
    "link": "https://apnews.com/article/trump-tariffs-midsized-companies-costs-consumers-2a25158ff1d06bd7f72d909a8ec64f25"
  },
  {
    "text": "Blood tests show potential for predicting start of Alzheimer’s symptoms - The Washington Post",
    "fullText": "The technique is not yet precise enough to predict a patient’s exact trajectory but could help find long-sought preventive treatment.",
    "link": "https://www.washingtonpost.com/health/2026/02/19/alzheimers-tests-symptom-onset-predictions/"
  },
  {
    "text": "Column | 8 science-backed habits for a healthier heart - The Washington Post",
    "fullText": "People who focus on these things not only have better cardiovascular health, but are also protected against conditions such as diabetes, dementia and cancer.",
    "link": "https://www.washingtonpost.com/wellness/2026/02/19/habits-for-heart-health/"
  },
  {
    "text": "North Shore digs out from more than 3 feet of wind-whipped snow; difficult morning drive in Twin Cities - MPR News",
    "fullText": "Parts of the North Shore are digging out from more than 3 feet of wind-whipped snow Thursday, in the wake of a blizzard that pummeled northeast Minnesota on Wednesday. Some school districts are delaying the start of classes.",
    "link": "https://www.mprnews.org/story/2026/02/18/minnesota-blizzard-north-shore-twin-cities"
  }
]