[
  {
    "text": "Live updates: Trump's EPA revokes scientific finding that underpinned US fight against climate change - AP News",
    "fullText": "The Trump administration revoked a scientific finding at the center of U.S. action to regulate greenhouse gas emissions and fight climate change, a significant rollback of regulations.",
    "link": "https://apnews.com/live/trump-immigration-climate-change-2-12-2026"
  },
  {
    "text": "Trump allows Democratic governors at White House meeting after initial snub - The Washington Post",
    "fullText": "Trump had initially excluded Democrats from the traditionally bipartisan meeting. However, not all Democrats were invited to a separate dinner.",
    "link": "https://www.washingtonpost.com/politics/2026/02/11/trump-democrats-governors-white-house/"
  },
  {
    "text": "Justice Department’s antitrust chief has been fired, sources say - CNN",
    "fullText": "Gail Slater, who ran the antitrust division for the Justice Department for nearly a year, was forced out by the Trump administration this week, two people familiar with the matter told CNN.",
    "link": "https://www.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired"
  },
  {
    "text": "YouTube launches native app for Apple Vision Pro - 9to5Mac",
    "fullText": "YouTube was one of the biggest apps missing from the Vision Pro platform at launch in February 2024. That changes...",
    "link": "https://9to5mac.com/2026/02/12/youtube-launches-native-app-for-apple-vision-pro/"
  },
  {
    "text": "Spirit Airlines sells more planes, calls back 500 flight attendants from furlough ahead of spring break - CNBC",
    "fullText": "Spirit Airlines said it sold another 20 planes and is calling back 500 flight attendants from furlough.",
    "link": "https://www.cnbc.com/2026/02/12/spirit-airlines-sells-planes-flight-attendants.html"
  },
  {
    "text": "Partial government shutdown looms as ICE negotiations stall - The Washington Post",
    "fullText": "Large swaths of the Department of Homeland Security are set to shut down Saturday unless lawmakers and the White House strike a last-minute deal.",
    "link": "https://www.washingtonpost.com/politics/2026/02/12/congress-homeland-security-shutdown/"
  },
  {
    "text": "‘I don’t think he’s funny’: Zion Clark, wrestler born without legs, fires back at UFC heavyweight Valter Walker before fight - MMA Fighting",
    "fullText": "Zion Clark, Valter Walker will compete at Karate Combat on Friday",
    "link": "https://www.mmafighting.com/latest-news/471238/i-dont-think-hes-funny-zion-clark-wrestler-born-without-legs-ready-for-war-against-ufc-heavyweight-valter-walker"
  },
  {
    "text": "CIA releases new video in bid to lure Chinese military officers to spy for US - Financial Times",
    "fullText": "US intelligence agency seeks to tap into frustration over extensive purges at People’s Liberation Army",
    "link": "https://www.ft.com/content/d30d656e-2975-4940-8708-da4dc43cd896"
  },
  {
    "text": "What the Daytona 500 really tells us about the season ahead - NASCAR.com",
    "fullText": "Neil Paine breaks down whether a driver's performance in the Daytona 500 is an indicator of how well he will do for the rest of the season.",
    "link": "https://www.nascar.com/news-media/2026/02/12/what-the-daytona-500-really-tells-us-about-the-season-ahead/"
  },
  {
    "text": "EU leaders meet to counter pressure from Russia, China and Trump - AP News",
    "fullText": "European Union leaders are gathering in Belgium as the bloc argues over how to stand up to pressure from the United States, China and Russia. They are meeting Thursday in a Belgian castle in a session meant to shape another summit in late March. German and It…",
    "link": "https://apnews.com/article/europe-eu-trump-china-russia-rethink-6461ea032aa4e3aa8e133bc5080ab922"
  },
  {
    "text": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina - BBC",
    "fullText": "Voters are hoping for a return to democracy after 15 years of authoritarian rule under Sheikh Hasina.",
    "link": "https://www.bbc.com/news/articles/cy7jdmvn3l0o"
  },
  {
    "text": "\"He Sounds Nervous\": American Airlines CEO Robert Isom Responds To Union Revolt—Here's His Turnaround Plan - View from the Wing",
    "fullText": "After American Airlines flight attendants called for CEO Robert Isom's removal—and pilots demanded accountability for lagging financial results—Isom recorded a video response promising improvements in operations, profitability, and customer experience. But in…",
    "link": "https://viewfromthewing.com/he-sounds-nervous-american-airlines-ceo-robert-isom-responds-to-union-revolt-heres-his-turnaround-plan/"
  },
  {
    "text": "Using GLP-1s to maintain a normal weight? There are benefits and risks - NPR",
    "fullText": "Drugs like Zepbound and Wegovy are intended for people who are overweight. Some patients are using them after bariatric surgery to keep pounds from creeping back. Others may just want to lose a few pounds.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5711686/glp1-obesity-normal-weight-loss-bmi"
  },
  {
    "text": "Team USA decides on starting goalie for 2026 Winter Olympics opener - New York Post",
    "fullText": "Team USA isn’t overthinking its last line of defense.",
    "link": "https://nypost.com/2026/02/12/sports/team-usa-decides-to-start-connor-hellebuyck-for-2026-winter-olympics-opener/"
  },
  {
    "text": "Russia shrugs off Trump’s tariff threats on those who provide oil to Cuba - CNBC",
    "fullText": "The comments came in response to a question about whether Russia was concerned about the Trump administration's tariff threats.",
    "link": "https://www.cnbc.com/2026/02/12/cuba-fuel-shortage-oil-russia-trump-tariffs.html"
  },
  {
    "text": "Free speech lawsuits mount after Charlie Kirk assassination - NPR",
    "fullText": "Months after the killing of Charlie Kirk, a growing number of lawsuits by people claim they were illegally punished, fired and even arrested for making negative comments about Kirk.",
    "link": "https://www.npr.org/2026/02/12/nx-s1-5667213/free-speech-lawsuits-since-kirk-killing"
  },
  {
    "text": "Berlinale Immediately Gets Heated at Jury Presser as President Wim Wenders Asserts “We Have to Stay Out of Politics” - The Hollywood Reporter",
    "fullText": "\"We are the counterweight of politics, the opposite of politics, we have to do the work of people — not the work of politicians,\" said the legendary filmmaker at the first Berlin Film Fest press conference.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/berlinale-2026-gets-heated-wim-wenders-jury-politics-1236503389/"
  },
  {
    "text": "Netflix’s new mystery series is the best TV show I’ve watched in 2026 so far — and it’s the perfect ‘Derry Girls’ follow-up - Tom's Guide",
    "fullText": "‘How to Get to Heaven from Belfast’ mixes memorable characters with an absorbing mystery",
    "link": "https://www.tomsguide.com/entertainment/netflix/netflixs-new-mystery-series-is-the-best-tv-show-ive-watched-in-2026-so-far-and-its-the-perfect-derry-girls-follow-up"
  }
]