[
  {
    "text": "Is Trump taking too much aspirin? Here's what experts say - NPR",
    "fullText": "Trump takes four times the recommended dose of aspirin for cardiac prevention. Even low-dose aspirin is no longer recommended for people over 60 who don't have heart disease.",
    "link": "https://www.npr.org/sections/shots-health-news/2026/01/02/nx-s1-5665112/trump-aspirin-325-81-mg-low-dose-cardiac-stroke-heart-attack-bleeding"
  },
  {
    "text": "2025-26 College Football Playoff schedule, dates, TV channel, sites - NCAA.com",
    "fullText": "Here's the schedule for the College Football Playoff for the 2025-26 season. This is the second year of the 12-team playoff. The bracket was announced on Sunday, Dec. 7.",
    "link": "https://www.ncaa.com/news/football/article/2025-01-02/2025-26-college-football-playoff-schedule-dates-tv-channel-sites"
  },
  {
    "text": "Woman dies in suspected mountain lion attack, Colorado's first deadly encounter since 1999 - NBC News",
    "fullText": "A woman has died in a rare suspected mountain lion attack in Colorado on Thursday, officials said",
    "link": "https://www.nbcnews.com/news/us-news/woman-dies-suspected-mountain-lion-attack-colorados-first-deadly-encou-rcna251881"
  },
  {
    "text": "Anthrax nearly kills healthy 18-year-old welder amid puzzling pattern - Ars Technica",
    "fullText": "Welder's Anthrax\" was first coined in 2022, when seven cases had been identified.",
    "link": "https://arstechnica.com/health/2026/01/anthrax-nearly-kills-healthy-18-year-old-welder-amid-puzzling-pattern/"
  },
  {
    "text": "Nasdaq 100 Futures Rally in Lively Start to 2026: Markets Wrap - Bloomberg.com",
    "fullText": "US stocks edged higher on Friday, as investors started 2026 on cautious footing following a year of strong equity performance while keeping an eye on rising Treasury yields.",
    "link": "https://www.bloomberg.com/news/articles/2026-01-01/stocks-set-to-start-2026-tepidly-after-recent-drop-markets-wrap"
  },
  {
    "text": "Ways to Watch and Listen: Seahawks vs. 49ers | Week 18 - 49ers.com",
    "fullText": "Broadcast and streaming information for the San Francisco 49ers Week 18 matchup against the Seattle Seahawks at Levi's® Stadium.",
    "link": "https://www.49ers.com/news/ways-to-watch-and-listen-seahawks-vs-49ers-week-18"
  },
  {
    "text": "DHS hypes worksite enforcement as fraud allegations rip through Minnesota - Axios",
    "fullText": "Sec. Noem says there's \"more coming\" as ICE focuses on businesses.",
    "link": "https://www.axios.com/2026/01/02/dhs-noem-minnesota-fraud"
  },
  {
    "text": "New York reports record-breaking number of flu hospitalizations in a single week - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Health/new-york-reports-record-breaking-number-flu-hospitalizations/story?id\\\\u003d128849108"
  },
  {
    "text": "Playoff Quarterfinal at the Capital One Orange Bowl Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Capital One Orange Bowl Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/2/QF-Orange-recap.aspx"
  },
  {
    "text": "As Mamdani rises in New York, San Francisco turns away from the left - Politico",
    "fullText": "In San Francisco, progressives are looking east with envy.",
    "link": "https://www.politico.com/news/2026/01/02/as-mamdani-rises-in-new-york-san-francisco-turns-away-from-the-left-00701711"
  },
  {
    "text": "2026 is the year humanity will finally go back to the moon - Space",
    "fullText": "It's happening. We are going.",
    "link": "https://www.space.com/space-exploration/artemis/2026-is-the-year-humanity-will-finally-go-back-to-the-moon"
  },
  {
    "text": "Will Smith sued by former tour member for wrongful termination, sexual harassment - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/GMA/Culture/smith-sued-former-tour-member-wrongful-termination-sexual/story?id\\\\u003d128844691"
  },
  {
    "text": "US hockey picks 4 Nations-heavy roster for the Winter Olympics, adding Keller, Thompson and Jones - AP News",
    "fullText": "The U.S. unveiled its roster for the upcoming Milan Cortina Winter Olympics, with the vast majority of it comprised of players who took part in the 4 Nations Face-Off early last year. The only additions were forwards Tage Thompson and Clayton Keller and defen…",
    "link": "https://apnews.com/article/milan-olympics-us-hockey-roster-25c7f857eee2ecdb509554ece86c1ee6"
  }
]