[
  {
    "text": "Smart: UGA 4th-down faux paw 'on us as coaches' - ESPN",
    "fullText": "After Georgia's 39-34 loss to Ole Miss in Thursday night's Sugar Bowl, Bulldogs coach Kirby Smart took responsibility for a failed a fourth-down play in the second half.",
    "link": "https://www.espn.com/college-football/story/_/id/47479635/kirby-smart-laments-4th-conversion-try-georgia-loss"
  },
  {
    "text": "Horoscope for Friday, January 02, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/01/02/horoscopes-today-friday-january-02-2026"
  },
  {
    "text": "Shares are higher in Asia in an upbeat start to the new year - Yahoo Finance",
    "fullText": "World markets began 2026 with gains, with benchmarks in Britain and South Korea hitting records as optimism over the future of artificial intelligence...",
    "link": "https://finance.yahoo.com/news/shares-higher-asia-upbeat-start-043911801.html"
  },
  {
    "text": "Tommy Lee Jones’ daughter found dead at San Francisco hotel, reports say - San Francisco Chronicle",
    "fullText": "Victoria Jones, the daughter of actor Tommy Lee Jones, was found dead at San Francisco’s Fairmont Hotel on New Year’s Day, according to reports.",
    "link": "https://www.sfchronicle.com/sf/article/tommy-lee-jones-daughter-hotel-death-21272105.php"
  },
  {
    "text": "Yemen: Separatists allow Saudi-backed forces in seized areas - DW",
    "fullText": "A UAE-backed group pushing for independence in southern Yemen has agreed to the deployment of Saudi-aligned forces in the oil-rich territory it seized last month.",
    "link": "https://www.dw.com/en/yemen-separatists-to-allow-saudi-backed-forces-into-seized-areas/a-75361630"
  },
  {
    "text": "Maduro says Venezuela open to US talks on drug trafficking - BBC",
    "fullText": "In an interview with state TV, the Venezuelan president also evaded a question about an attack in his country claimed by the US.",
    "link": "https://www.bbc.com/news/articles/clyg23lj057o"
  },
  {
    "text": "Mamdani revokes nine Eric Adams executive orders issued after his corruption indictment - New York Daily News",
    "fullText": "In one of his first acts as mayor, Zohran Mamdani revoked nine executive orders his predecessor, Eric Adams, issued after the date of his federal corruption indictment, on issues from antisemitism …",
    "link": "https://www.nydailynews.com/2026/01/01/mamdani-revokes-nine-eric-adams-executive-orders-corruption-indictment/"
  },
  {
    "text": "5 takeaways from Trump's defiant WSJ interview on his health - Axios",
    "fullText": "Trump told the WSJ he had a CT scan during a recent medical exam and not an MRI scan, as he previously claimed.",
    "link": "https://www.axios.com/2026/01/02/trump-health-interview-wall-street-journal"
  },
  {
    "text": "Inside the ‘Stranger Things’ Series Finale as the Duffer Brothers Answer That Biggest Burning Question - The Hollywood Reporter",
    "fullText": "How should the audience interpret Eleven's fate? Is a door open to explore more of Hawkins down the line? Creators Matt and Ross Duffer answer that and more in their spoiler chat with The Hollywood Reporter.",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/stranger-things-series-finale-eleven-fate-duffers-interview-1236462569/"
  },
  {
    "text": "McGuire: TTU not using layoff as excuse for loss - ESPN",
    "fullText": "Texas Tech's Joey McGuire didn't use the team's layoff ahead of Thursday's game as an excuse, instead pointing to inefficient early-down execution and costly turnovers as the primary reasons for a loss to \"the best defense we've faced\" in Oregon.",
    "link": "https://www.espn.com/college-football/story/_/id/47476762/mcguire-texas-tech-cfp-woes-vs-oregon-not-rooted-bye"
  },
  {
    "text": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap - College Football Playoff",
    "fullText": "Playoff Quarterfinal at the Goodyear Cotton Bowl Classic Recap",
    "link": "https://collegefootballplayoff.com/sports/2026/1/1/QF-Cotton-recap.aspx"
  },
  {
    "text": "Tipster reveals 10 spectacular upgrades for the Galaxy S26 Ultra - PhoneArena",
    "fullText": "The top-of-the-line Samsung Galaxy S26 Ultra will be much improved over last year's model.",
    "link": "https://www.phonearena.com/news/tipster-lists-10-upgrades-for-the-galaxy-s26-ultra_id176988"
  },
  {
    "text": "Brazil's former president Bolsonaro leaves hospital and returns to jail - NBC News",
    "fullText": "Former Brazilian President Jair Bolsonaro left a hospital in capital Brasilia on Thursday, a week after he underwent a double hernia surgery.",
    "link": "https://www.nbcnews.com/world/brazil/brazils-former-president-bolsonaro-leaves-hospital-returns-jail-rcna251863"
  },
  {
    "text": "Health subsidies expire, launching millions of Americans into 2026 with steep insurance hikes - ABC7 Chicago",
    "fullText": "Enhanced tax credits that have helped Americans offset the cost of Affordable Care Act health insurance for the last four years expired overnight.",
    "link": "https://abc7chicago.com/post/health-subsidies-expire-launching-millions-americans-2026-steep-insurance-hikes/18339659/"
  },
  {
    "text": "Deaths reported during widening protests in Iran sparked by ailing economy - NPR",
    "fullText": "The protests began due to economic pressures, with Iran's currency rapidly depreciating. Demonstrators have also chanted against the country's theocracy.",
    "link": "https://www.npr.org/2026/01/01/g-s1-104241/iran-protests-deaths-economy"
  },
  {
    "text": "Astronomers Measure The Mass of a Planet With No Star For The First Time - ScienceAlert",
    "fullText": "Not all planets are lucky enough to live in a neighborhood like our Solar System – some are doomed to roam the cosmos alone.",
    "link": "https://www.sciencealert.com/astronomers-measure-the-mass-of-a-planet-with-no-star-for-the-first-time"
  }
]