[
  {
    "text": "Trump looks left on cost of living concerns - Politico",
    "fullText": "The White House is trying to embrace populist economic ideas that Republicans aren’t crazy about.",
    "link": "https://www.politico.com/news/2026/01/23/trump-democrats-warren-schumer-00742515"
  },
  {
    "text": "Column | Trump dominated Davos. But Canada’s Carney was the star. - The Washington Post",
    "fullText": "Carney delivered an address that squarely confronted the world wrought by Trump’s presidency. Davos’s attendees — including Trump — took notice.",
    "link": "https://www.washingtonpost.com/world/2026/01/23/mark-carney-davos-trump-wef-speech/"
  },
  {
    "text": "Ukraine is battling to keep the lights on - this nuclear is vital in their fight - BBC",
    "fullText": "The BBC gains rare access to the Khmelnytsky plant as Russian pummels Ukraine's energy grid.",
    "link": "https://www.bbc.com/news/articles/cp3zzqzgn28o"
  },
  {
    "text": "'Wonder Man' Review: Ben Kingsley in Marvel Disney+ Dramedy - hollywoodreporter.com",
    "fullText": "Kingsley reprises his role as Trevor Slattery, now just an actor looking for his next big role, in the eight-part dramedy co-created by 'Shang-Chi' director Destin Daniel Cretton.",
    "link": "http://www.hollywoodreporter.com/tv/tv-reviews/wonder-man-review-disney-ben-kingsley-yahya-abdul-mateen-1236481754/"
  },
  {
    "text": "Minnesota prisons chief accuses Homeland Security of peddling ‘misinformation’ on ICE surge - Star Tribune",
    "fullText": "Corrections Commissioner Paul Schnell offered video evidence to refute DHS claims, suggesting it’s spreading “pure propaganda.”",
    "link": "https://www.startribune.com/paul-schnell-prisons-head-disputes-ice-claims/601568598"
  },
  {
    "text": "Putin meets Trump’s envoys as Kremlin says Ukraine settlement hinges on territory - AP News",
    "fullText": "Russian President Vladimir Putin discussed the settlement in Ukraine with U.S. President Donald Trump’s envoys during marathon overnight talks, and the Kremlin insisted that the territorial issue needs to be resolved to make peace. The Kremlin meeting, which …",
    "link": "https://apnews.com/article/russia-ukraine-trump-putin-witkoff-kushner-zelenskyy-e985cdc189a479c7618ba4523a50463a"
  },
  {
    "text": "Video Shows Comedian Corey Holcomb Punch Female Comic in the Face - TMZ",
    "fullText": "There's nothing funny about what comedian Corey Holcomb appears to do in this video ... socking a woman right in the face, igniting a Hollywood street brawl.",
    "link": "https://www.tmz.com/2026/01/22/comedian-corey-holcomb-video-punch-face-cristina-payne/"
  },
  {
    "text": "Pool Report from Tonight’s Houston Rockets at Philadelphia 76ers Game - official NBA",
    "fullText": "The Pool Report interview was conducted by Gina Mizell, Philadelphia Inquirer with Crew Chief John Goble following tonight’s Rockets at 76ers game.     QUESTION: Why was the Tyrese Maxey attempt at the end of regulation not reviewed for goaltending? GOBLE: By…",
    "link": "https://official.nba.com/pool-report-from-tonights-houston-rockets-at-philadelphia-76ers-game/"
  },
  {
    "text": "Contractor indicted over alleged leaks to Washington Post - Politico",
    "fullText": "Auelio Perez-Lugones faces six felony charges related to unauthorized disclosure and possession of classified information.",
    "link": "https://www.politico.com/news/2026/01/22/washington-post-classified-docs-00743280"
  },
  {
    "text": "EU leaders seek to preserve ties with US - dw.com",
    "fullText": "EU wants to revive trade ties with the US, but warned the bloc will stand up for its interests. It also announced after an emergency summit that it will double its investment in Greenland.",
    "link": "https://www.dw.com/en/eu-leaders-seek-to-preserve-ties-with-us/a-75612236"
  },
  {
    "text": "Winter storm could lift Conference Championship ratings - NBC Sports",
    "fullText": "A major winter storm is coming this weekend, and that could be good news for the NFL.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/winter-storm-could-lift-conference-championship-ratings"
  },
  {
    "text": "Trump sues JPMorgan, Jamie Dimon over cutting off banking access - The Washington Post",
    "fullText": "President Donald Trump filed suit against JPMorgan Chase and its CEO, Jamie Dimon, saying the bank abruptly closed his accounts.",
    "link": "https://www.washingtonpost.com/business/2026/01/22/trump-lawsuit-jpmorganchase-dimon/"
  },
  {
    "text": "Trump Reverses Course on Plan Allowing Homebuyers to Tap 401(k)s - Bloomberg.com",
    "fullText": "President Donald Trump threw cold water on a policy his administration was developing to allow savers in 401(k) retirement plans to use some of that money for down payments on homes — a proposal that had been a key part of his efforts to address voters’ affor…",
    "link": "https://www.bloomberg.com/news/articles/2026-01-22/trump-reverses-course-on-plan-allowing-homebuyers-to-tap-401-k-s"
  },
  {
    "text": "Weather update: Friday classes canceled - news.wisc.edu",
    "fullText": "In response to the extreme cold, UW–Madison is canceling classes on Friday, January 23.",
    "link": "https://news.wisc.edu/weather-update-friday-classes-canceled/"
  },
  {
    "text": "US, China once had rare-earth aces in the hole but the US folded - Asia Times",
    "fullText": "“The Middle East has oil,\" Deng Xiaoping is reported to have remarked. \"China has rare earths.\" Deng was visiting one of China's biggest rare earths",
    "link": "https://asiatimes.com/2026/01/us-china-once-had-rare-earths-aces-in-the-hole-but-the-us-folded/"
  },
  {
    "text": "Hubble uncovers the secret of blue straggler stars that defy aging - Phys.org",
    "fullText": "Some stars appear to defy time itself. Nestled within ancient star clusters, they shine bluer and brighter than their neighbors, looking far younger than their true age. Known as blue straggler stars, these stellar oddities have puzzled astronomers for more t…",
    "link": "https://phys.org/news/2026-01-hubble-uncovers-secret-blue-straggler.html"
  },
  {
    "text": "Elon Musk’s Fortune Hits Record $788 Billion As Tesla Spikes 4% - Forbes",
    "fullText": "Musk is closing in on the $800 billion mark as his net worth sets a new record.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/22/elon-musks-net-worth-hits-788-billion-in-record-setting-surge/"
  },
  {
    "text": "20+ inches of snow could fall in Boston area this weekend. Maps show the latest storm forecast. - CBS News",
    "fullText": "How much snow will Boston get from a monster winter storm this weekend? Here's the latest weather forecast.",
    "link": "https://www.cbsnews.com/boston/news/boston-snow-weather-forecast-weekend-storm/"
  },
  {
    "text": "Heart disease deaths declined. And here's how to reduce your risk of the #1 killer - NPR",
    "fullText": "An annual report from the American Heart Association shows deaths from heart disease and stroke are down, encouraging news after the rate went up in the early years of the pandemic.",
    "link": "https://www.npr.org/2026/01/22/nx-s1-5685136/heart-disease-deaths-prevention-american-heart-association"
  }
]