[
  {
    "text": "Franjo von Allmen of Switzerland wins men's downhill, first gold medal of Milan Cortina Games - AP News",
    "fullText": "Swiss racer Franjo von Allmen captured the Olympic downhill Saturday to win the first gold medal at the Milan Cortina Games. On a picture-perfect day in Bormio, von Allmen powered through the challenging course in 1 minute, 51.61 seconds. His time was good en…",
    "link": "https://apnews.com/article/mens-downhill-olympics-milan-cortina-a79a02e7ae04cd543854455edfaf595f"
  },
  {
    "text": "Tom Brady tells Robert Kraft, \"Get that 7th ring so we can match\" - NBC Sports",
    "fullText": "Brady may be reconsidering his stance that he has no dog in the fight of who wins between the Patriots and Seahawks.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/tom-brady-tells-robert-kraft-get-that-7th-ring-so-we-can-match"
  },
  {
    "text": "Russia launches more than 440 drones, missiles at Ukraine overnight, Zelenskyy says - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/International/russia-launches-440-drones-missiles-ukraine-overnight-zelenskyy/story?id\\\\u003d129944707"
  },
  {
    "text": "Medical Mystery: A baby with high fevers, hair loss and finally, a rare diagnosis - The Washington Post",
    "fullText": "A child's years-long medical mystery was finally solved.",
    "link": "https://www.washingtonpost.com/health/2026/02/07/medical-mystery-solved-genetic-test/"
  },
  {
    "text": "Tottenham confirmed team vs Man United - Van de Ven, Odobert and Sarr start as Frank makes changes - Football London",
    "fullText": "Here's the Tottenham Hotspur team that Thomas Frank has selected to face Manchester United in the Premier League on Saturday afternoon",
    "link": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/tottenham-confirmed-team-vs-man-33381730"
  },
  {
    "text": "Country music star, actor boyfriend split up again and this time it might be for good - Yahoo",
    "fullText": "The couple's on again, off again relationship is apparently off again and for good this time.",
    "link": "https://www.pennlive.com/entertainment/2026/02/country-music-star-actor-boyfriend-split-up-again-and-this-time-it-might-be-for-good.html"
  },
  {
    "text": "US gave Ukraine and Russia a June deadline to reach agreement to end war, Zelenskyy says - AP News",
    "fullText": "The U.S. has given Ukraine and Russia a June deadline to reach a peace deal, according to President Volodymyr Zelenskyy. He said the U.S. plans to pressure both sides to meet this timeline. Zelenskyy spoke to reporters on Friday, with comments released on Sat…",
    "link": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001"
  },
  {
    "text": "State Department will delete X posts from before Trump returned to office - NPR",
    "fullText": "The policy change orders the removal of any post made by official State Department accounts on X before President Trump returned to office in 2025.",
    "link": "https://www.npr.org/2026/02/07/nx-s1-5704785/state-department-trump-posts-x"
  },
  {
    "text": "DVDs and public transit: Boycott drives people to ditch Big Tech to protest ICE - NPR",
    "fullText": "A sweeping boycott has begun — targeting tech giants who participants believe are enabling President Trump and his immigration crackdown.",
    "link": "https://www.npr.org/2026/02/07/nx-s1-5704402/boycott-tech-ice-scott-galloway"
  },
  {
    "text": "It looks like either Cody Rhodes or Jacob Fatu will miss out on Elimination Chamber - Cageside Seats",
    "fullText": "WWE books a very interesting high stakes match for SmackDown’s move to SyFy.",
    "link": "https://www.cagesideseats.com/wwe/416547/wwe-books-smackdown-syfy-olympics-cody-rhodes-jacob-fatu-elimination-chamber-qualifiers"
  },
  {
    "text": "St. John’s rolls past No. 3 UConn for statement Big East win - New York Post",
    "fullText": "All of a sudden, the Big East is up for grabs.",
    "link": "https://nypost.com/2026/02/06/sports/st-johns-rolls-past-no-3-uconn-for-statement-big-east-win/"
  },
  {
    "text": "Apple's redesigned MacBook Pro can't come soon enough - Creative Bloq",
    "fullText": "It's what creatives have been waiting for.",
    "link": "https://www.creativebloq.com/design/product-design/apples-redesigned-macbook-pro-cant-come-soon-enough"
  },
  {
    "text": "Horoscope for Saturday, February 07, 2026 - Chicago Sun-Times",
    "fullText": null,
    "link": "https://chicago.suntimes.com/horoscopes/2026/02/07/horoscopes-today-saturday-february-07-2026"
  },
  {
    "text": "Scoop: White House plans Board of Peace meeting in D.C. on Gaza reconstruction - Axios",
    "fullText": "\"It will be the first Board of Peace meeting and a fundraising conference for Gaza reconstruction,\" a U.S. official said.",
    "link": "https://www.axios.com/2026/02/07/gaza-board-peace-meeting-trump-dc"
  },
  {
    "text": "4 people have died from eating death cap mushrooms as they spread in California after rains - AP News",
    "fullText": "Four people have died and three others have required a liver transplants after eating the death cap mushroom that is proliferating in California following a rainy winter. The California Department of Public Health is urging people to avoid mushroom foraging a…",
    "link": "https://apnews.com/article/mushrooms-poison-death-253d84c16a559f70eea90120fe86aecc"
  },
  {
    "text": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images - Live Science",
    "fullText": "A team of researchers using the James Webb Space Telescope has produced the most detailed map of dark matter to date.",
    "link": "https://www.livescience.com/physics-mathematics/dark-matter/invisible-scaffolding-of-the-universe-revealed-in-ambitious-new-james-webb-telescope-images"
  },
  {
    "text": "Can Disney’s Josh and Dana Honeymoon Last? - Puck",
    "fullText": "After a year-plus contest for the C.E.O. gig ended with a D’Amaro victory and a pretty good consolation prize for Walden, the highly choreographed vibes have been only positive. But conflicting styles and potentially existential challenges in Walden’s expande…",
    "link": "https://puck.news/can-disneys-josh-damaro-dana-walden-coexist/"
  },
  {
    "text": "Learning neuroimaging models from health system-scale data - Nature",
    "fullText": "Prima is an AI foundation model for neuroimaging based on clinical magnetic resonance imaging that offers accurate and explainable diagnostics, worklist priority for radiologists and clinical referral recommendations with equitable performance on diverse grou…",
    "link": "https://www.nature.com/articles/s41551-025-01608-0"
  }
]