[
  {
    "text": "Venezuela's future in balance after Trump officials brief lawmakers; Maduro held in NYC jail - CBS News",
    "fullText": "Ex-Venezuelan President Nicolás Maduro spent the night in jail after he pleaded not guilty to drug trafficking charges — as questions linger about President Trump's plans for Venezuela.",
    "link": "https://www.cbsnews.com/live-updates/venezuela-maduro-jail-trump-future/"
  },
  {
    "text": "US to run high-tech ceasefire monitoring under draft Ukraine plan - Financial Times",
    "fullText": "Military would use sensors, drones and satellites to ensure compliance in support of a European-led ‘reassurance force’",
    "link": "https://www.ft.com/content/13b7cb47-3ec5-4542-a3c1-74badfb2b2b4"
  },
  {
    "text": "Dread Pap smears? Federal guidelines now allow for a self-swab HPV test - NBC News",
    "fullText": "Federal guidelines are expanding the options for cervical cancer screenings beyond the often-disliked Pap smear",
    "link": "https://www.nbcnews.com/health/health-news/hpv-self-swab-test-pap-smears-federal-guidelines-rcna251757"
  },
  {
    "text": "Lego unveils tech-filled Smart Bricks - to play experts' dismay - BBC",
    "fullText": "Lego says its new tech-enabled products are its \"most revolutionary innovation\" since it launched its mini-figurines in 1978.",
    "link": "https://www.bbc.com/news/articles/crmlnmnwzk2o"
  },
  {
    "text": "Why Elon Musk And Tesla Aren't 'Losing Sleep' Over Nvidia's Self-Driving Announcement - Investor's Business Daily",
    "fullText": "Tesla CEO Elon Musk appeared unconcerned with Nvidia's self-driving efforts.",
    "link": "https://www.investors.com/news/tesla-elon-musk-not-losing-sleep-over-nvidia-self-driving-announcement/"
  },
  {
    "text": "Trump administration halting $10 billion in social service funding to 5 Democratic states - CBS News",
    "fullText": "The Trump administration plans to halt billions of dollars in federal funding for social services programs in five states led by Democrats following allegations of fraud.",
    "link": "https://www.cbsnews.com/news/trump-pauses-10-billion-public-assistance-funding-democratic-states/"
  },
  {
    "text": "CBS edits out Tony Dokoupil blasting 'big problems' amid flub on first live“ Evening News” show - Yahoo",
    "fullText": "Dokoupil's live show saw the journalist address an apparent technical flub on the air, though the segment appeared to be reshot for streaming on CBS' website...",
    "link": "https://ew.com/cbs-edits-out-tony-dokoupil-cbs-evening-news-big-problems-live-broadcast-11879762"
  },
  {
    "text": "Flu surge in Michigan: State reaches worst tier on CDC scale - MLive.com",
    "fullText": "Flu-like illness was responsible for 11.3% of outpatient visits, surpassing the national average and indicating an increasing viral spread throughout the state.",
    "link": "https://www.mlive.com/news/2026/01/flu-surge-in-michigan-state-reaches-worst-tier-on-cdc-scale.html"
  },
  {
    "text": "Late for Work: ESPN's Ben Solak Says Ravens Have Roster Construction Problem - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "Zay Flowers did something no wide receiver has done in nearly 50 years. The Chargers sign Ben Cleveland to their practice squad.",
    "link": "https://www.baltimoreravens.com/news/ravens-roster-construction-problem-espn-zay-flowers-receiver-ben-celeveland-chargers-practice-squad"
  },
  {
    "text": "Cowboys part ways with coordinator Matt Eberflus - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "fullText": "Following a tumultuous season for the Cowboys, particularly defensively, the team has made the final decision to move on from defensive coordinator Matt Eberflus after just one season.",
    "link": "https://www.dallascowboys.com/news/cowboys-part-ways-with-coordinator-matt-eberflus"
  },
  {
    "text": "PFT’s final 2025 NFL power rankings: Seahawks are the kings - NBC Sports",
    "fullText": "The NFC's No. 1 seed is the NFL's No. 1 team.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/pfts-final-2025-nfl-power-rankings-seahawks-are-the-kings"
  },
  {
    "text": "Government demands Musk's X deals with 'appalling' Grok AI - BBC",
    "fullText": "Grok is being used to digitally remove women's clothing - something victims describe as \"dehumanising\".",
    "link": "https://www.bbc.com/news/articles/crrn054nxe7o"
  },
  {
    "text": "Trump, RFK dramatically overhaul child vaccine schedule - Axios",
    "fullText": "The move is a public health gamble that assumes children's health won't be endangered.",
    "link": "https://www.axios.com/2026/01/05/trump-rfk-kennedy-vaccine-schedule-children"
  },
  {
    "text": "Pope Leo XIV closes 2025 Holy Year with critique of consumerism and xenophobia - NBC News",
    "fullText": "Pope Leo XIV on Tuesday closed out the Vatican’s 2025 Holy Year by denouncing today’s consumerist and anti-foreigner sentiment, capping a Jubilee that saw some 33 million pilgrims flock to Rome and a historic transition to the first American pontiff",
    "link": "https://www.nbcnews.com/world/pope-leo-xiv/pope-leo-xiv-closes-2025-holy-year-critique-consumerism-xenophobia-rcna252520"
  },
  {
    "text": "Ashley Tisdale says she quit her 'toxic mom group' - BBC",
    "fullText": "The High School Musical actress says she left the group of new mothers after being \"brought to tears\".",
    "link": "https://www.bbc.com/news/articles/c4g09l286e2o"
  },
  {
    "text": "Can China and South Korea reset complex ties after Xi-Lee summit? - Al Jazeera",
    "fullText": "Analysts say both countries increasingly rely on each other for economic and security reasons amid geopolitical churn.",
    "link": "https://www.aljazeera.com/news/2026/1/6/can-china-and-south-korea-reset-complex-ties-after-xi-lee-summit"
  }
]