[
  {
    "text": "Addison Rae, Olivia Dean and other rising stars take up space on Grammys red carpet - WRAL",
    "fullText": "Rising music stars ushered in a fresh new era of red carpet dressing at the Grammys on Sunday as they embodied their music personas and let their style take center stage.",
    "link": "https://www.wral.com/news/ap/197c0-addison-rae-olivia-dean-and-other-rising-stars-take-up-space-on-grammys-red-carpet/"
  },
  {
    "text": "'Today' show host Savannah Guthrie’s mother reported missing in Arizona: Sheriff - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/US/today-show-host-savannah-guthries-mother-reported-missing/story?id\\\\u003d129770864"
  },
  {
    "text": "Billie Eilish Says ‘F— Ice’ During Grammy Win: ‘No One Is Illegal on Stolen Land’ - Variety",
    "fullText": "Billie Eilish had choice words for ICE during her acceptance speech for song of the year.",
    "link": "https://variety.com/2026/music/news/billie-eilish-slams-ice-grammys-win-1236649159/"
  },
  {
    "text": "Trump family crypto firm sold major stake to UAE investment firm - The Washington Post",
    "fullText": "The investment, worth a reported $500 million, gave Emirati-backed investors a 49 percent stake in World Liberty Financial, a Trump crypto company.",
    "link": "https://www.washingtonpost.com/politics/2026/02/01/trump-uae-crypto-world-liberty-financial/"
  },
  {
    "text": "Justin Bieber Wears Only Gym Shorts and Socks in Sultry Grammys Performance of ‘Yukon,’ as Emotional Hailey Bieber Watches From Crowd - Variety",
    "fullText": "Justin Bieber performed “Yukon” from his hit album “Swag” at the 2026 Grammy Awards.",
    "link": "https://variety.com/2026/music/news/justin-bieber-shirtless-grammy-performance-yukon-1236646398/"
  },
  {
    "text": "Lightning players wear full-padded Bucs uniforms, get Baker Mayfield escort before Stadium Series in Tampa - Fox News",
    "fullText": "The Tampa Bay Lightning wore throwback Buccaneers uniforms arriving at Raymond James Stadium for the NHL's Stadium Series outdoor game against the Boston Bruins.",
    "link": "https://www.foxnews.com/sports/lightning-players-wear-full-padded-bucs-uniforms-get-baker-mayfield-escort-before-stadium-series-tampa"
  },
  {
    "text": "Warsh’s Return Revives Tensions Over the Fed’s $6.6 Trillion QE Hangover - Bloomberg",
    "fullText": "For much of the time that President Donald Trump was mulling his potential choice for the next chair of the Federal Reserve, the debate in markets swirled around whether his pick would lower interest rates as aggressively as he preferred.",
    "link": "https://www.bloomberg.com/news/articles/2026-02-01/warsh-s-return-revives-tensions-over-the-fed-s-6-6-trillion-qe-hangover"
  },
  {
    "text": "Mark Pope on Kentucky's technical fouls: 'I wouldn't trade the heart of it for anything' - On3",
    "fullText": "The three technical fouls in 38 seconds on Kentucky in the second half could have swung the game, but the Cats rallied instead, making Mark Pope very proud.",
    "link": "https://www.on3.com/teams/kentucky-wildcats/news/mark-pope-kentucky-technical-fouls-arkansas-doug-shows/"
  },
  {
    "text": "Russian Offensive Campaign Assessment, February 1, 2026 - Institute for the Study of War",
    "fullText": null,
    "link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNNXdoYURqWmUwdk0yV1M4QnRQQUJrQ09vdXQtNUU0aHhWNlNWdjhMWXV3STdRbk5MVktjU0hmQ3huTThMMWVPSDU4ZXk3ZFpZWE1kZUdIdVJkdWlDOG11dnduTWF0VjAwblRlM2ZiV1FQZGxBWWRMdWFTcG9oOTJRM1RJaVd6RkJQS0x6TFdpZG1abmtUcDJZR1A4MmZqUUxHQjNlYlRObDV3eWs?oc=5"
  },
  {
    "text": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "fullText": "The nor’easter, which became a bomb cyclone offshore of North Carolina late Saturday, will go down as the biggest snowstorm in decades for parts of the state.",
    "link": "https://www.washingtonpost.com/weather/2026/02/01/winter-storm-north-carolina-florida-snow-impacts/"
  },
  {
    "text": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters - AP News",
    "fullText": "The mayor of Portland, Oregon, has demanded that U.S. Immigration and Customs Enforcement leave his city after federal agents launched tear gas at demonstrators — including young children — outside an ICE facility during a weekend protest. Mayor Keith Wilson …",
    "link": "https://apnews.com/article/portland-protest-tear-gas-mayor-keith-wilson-1f21fc3d3d4b7a2874239a29ece52c06"
  },
  {
    "text": "Lakers vs Knicks Prediction, Odds, NBA Picks for Sunday, Feb. 1 - Action Network",
    "fullText": "Find Los Angeles Lakers vs New York Knicks predictions, odds, and NBA picks for Sunday, February 1.",
    "link": "https://www.actionnetwork.com/nba/los-angeles-lakers-vs-new-york-knicks-prediction-pick-odds-sunday-february-1"
  },
  {
    "text": "AI layoffs or ‘AI-washing’? - TechCrunch",
    "fullText": "How many of the companies with recent layoffs are just using AI as an excuse?",
    "link": "https://techcrunch.com/2026/02/01/ai-layoffs-or-ai-washing/"
  },
  {
    "text": "Two CBP Agents Identified in Alex Pretti Shooting - ProPublica",
    "fullText": "The two federal immigration agents who fired on Minneapolis protester Alex Pretti are identified in government records as Border Patrol agent Jesus Ochoa and Customs and Border Protection officer Raymundo Gutierrez.",
    "link": "http://www.propublica.org/article/alex-pretti-shooting-cbp-agents-identified-jesus-ochoa-raymundo-gutierrez"
  },
  {
    "text": "Police officer killed, another critically wounded in shooting at Georgia hotel - ABC News",
    "fullText": "Gunfire broke out after two officers were dispatched on a call reporting fraud.",
    "link": "https://abcnews.go.com/US/wireStory/police-officer-killed-critically-wounded-shooting-georgia-hotel-129755947"
  },
  {
    "text": "“Meanwhile in U Street – Broken Water Main, cars are frozen in the water that is rapidly freezing.” Good Lord This is not Good - PoPville",
    "fullText": "Update from AlertDC: \"DC Water reports a water outage on Wallach Place, NW, between 13th and 14th Streets due to utility repairs. The estimated restoration is 8-10 hours. Affected customers can contact DC Water at 202-612-3400.\" Update from PuckBuddys: \"Walla…",
    "link": "https://www.popville.com/2026/02/u-street-broken-watermain-freeze/"
  },
  {
    "text": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says - Politico",
    "fullText": "“It doesn't matter if you happen to be a former CNN journalist,\" he argued.",
    "link": "https://www.politico.com/news/2026/02/01/don-lemon-todd-blanche-press-religion-00759255"
  },
  {
    "text": "IOC prez: ICE, Epstein files 'sad' distractions from Games - ESPN",
    "fullText": "With the opening ceremony of the Milan Cortina Winter Games set for Friday, IOC president Kirsty Coventry said American storylines of ICE and the Epstein files have been \"sad\" distractions.",
    "link": "https://www.espn.com/olympics/story/_/id/47798757/ioc-prez-ice-epstein-files-sad-distractions-games"
  },
  {
    "text": "Bright Light Streaks Across New Zealand Skyline: What Could It Be? - The Daily Galaxy",
    "fullText": "A mysterious streak of light appeared over Wellington, New Zealand, on January 30, 2026.",
    "link": "https://dailygalaxy.com/2026/02/bright-light-streaks-across-new-zealand/"
  }
]