[
  {
    "text": "Denmark urges 'respect' after Trump aide's wife posts on Greenland - BBC",
    "fullText": "Katie Miller's message showed an altered image of the Danish autonomous territory alongside the word \"SOON\".",
    "link": "https://www.bbc.com/news/articles/c4g0zg974v1o"
  },
  {
    "text": "How to Watch, Listen, Live Stream Ravens vs. Steelers ‘Sunday Night Football’ - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "fullText": "The Ravens and Steelers will conclude the regular season with the AFC North championship on the line.",
    "link": "https://www.baltimoreravens.com/news/ravens-steelers-watch-listen-live-stream-nbc-sunday-night-football-afc-north-title-peacock-channel-next-game-schedule-week-18"
  },
  {
    "text": "Sen. Tom Cotton says new Venezuelan government cannot \"continue Nicolás Maduro's ways\" - CBS News",
    "fullText": "President Trump \"wants to give them a chance to turn the page in Venezuela and to help America achieve our policy goals there,\" Sen. Tom Cotton said on \"Face the Nation with Margaret Brennan.\"",
    "link": "https://www.cbsnews.com/news/tom-cotton-venezuela-maduro-face-the-nation/"
  },
  {
    "text": "Belkin’s new 3-in-1 charging dock isn’t limited to the Apple Watch - The Verge",
    "fullText": "﻿The dock can also charge smartwatches from Samsung and Google, but you’ll need to bring your own charging puck.",
    "link": "https://www.theverge.com/tech/849759/belkin-ultracharge-modular-charging-dock-pro-power-bank-10-magnetic-ring-smartwatch"
  },
  {
    "text": "Plaud launches a new AI pin and a desktop meeting notetaker - TechCrunch",
    "fullText": "Plaud is going after the likes of Granola to launch a desktop app that records online meetings",
    "link": "https://techcrunch.com/2026/01/04/plaud-launches-a-new-ai-pin-and-a-desktop-meeting-notetaker/"
  },
  {
    "text": "Trump wants the US oil industry to thrive in Venezuela again. That won’t be easy - CNN",
    "fullText": "President Donald Trump said he’s counting on American companies to rebuild Venezuela’s battered oil industry.",
    "link": "https://www.cnn.com/2026/01/04/business/oil-us-companies-venezuela"
  },
  {
    "text": "'It's a violation of the law': Schumer criticizes Trump's decision to strike Venezuela - ABC News",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/violation-law-schumer-criticizes-trumps-decision-strike-venezuela/story?id\\\\u003d128885148"
  },
  {
    "text": "Jennifer Aniston Supports Boyfriend Jim Curtis At His Book Event - TMZ",
    "fullText": "Jennifer Aniston proved she’s all in on her new romance with boyfriend Jim Curtis.",
    "link": "https://www.tmz.com/2026/01/04/jennifer-aniston-supports-jim-curtis-book-event/"
  },
  {
    "text": "Greece: Thousands stranded across Europe as air space disrupted - BBC",
    "fullText": "A fault with radio communications caused air traffic controllers to temporarily suspend arrivals and departures.",
    "link": "https://www.bbc.com/news/articles/cgezjlzwz1do"
  },
  {
    "text": "Transcript: Secretary of State Marco Rubio on \"Face the Nation with Margaret Brennan,\" Jan. 4, 2026 - CBS News",
    "fullText": "The following is the transcript of the interview with Secretary of State Marco Rubio that aired on \"Face the Nation with Margaret Brennan\" on Jan. 4, 2026.",
    "link": "https://www.cbsnews.com/news/marco-rubio-secretary-of-state-face-the-nation-transcript-01-04-2026/"
  },
  {
    "text": "Last year’s odd economy in five charts, and what to watch for in 2026 - AP News",
    "fullText": "The economy in 2025 was filled with contradictions, as growth was healthy while hiring slowed, inflation stayed elevated and unemployment rose. Last year’s odd outcomes raise a host of questions for the upcoming year: Will a growing economy eventually boost t…",
    "link": "https://apnews.com/article/inflation-economy-trump-jobs-71f3d52f0fd63b34f4a8c59c60ffbe20"
  },
  {
    "text": "CES 2026: Govee Announces New Matter-Connected Ceiling and Floor Lights - MacRumors",
    "fullText": "Govee today introduced three new HomeKit-compatible lighting products, including the Govee Floor Lamp 3, the Govee Ceiling Light Ultra, and the Govee...",
    "link": "https://www.macrumors.com/2026/01/04/govee-matter-lights-ces-2026/"
  },
  {
    "text": "Tyson Fury announces return to boxing a year after latest retirement - BBC",
    "fullText": "Former heavyweight world champion Tyson Fury announces he will return to boxing in 2026, bringing an end to his latest spell of retirement.",
    "link": "https://www.bbc.com/sport/boxing/articles/cgjw7q99dydo"
  },
  {
    "text": "If You Sleep In This 1 Position, Doctors Say You Need To Stop Immediately - HuffPost",
    "fullText": "It may feel safe and comfy, but experts warn it could lead to lasting nerve damage.",
    "link": "https://www.huffpost.com/entry/t-rex-sleep-position-arms-goog_l_69405dcbe4b0fa125e7f4dd9"
  },
  {
    "text": "NFL Week 18 playoff seed scenarios: Every possible seed for the final day of the season - NBC Sports",
    "fullText": "It's the final day of the regular season, and the playoff field is almost set, as 12 teams have clinched playoff berths and the Seahawks have clinched the top seed in the NFC.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/nfl-week-18-playoff-seed-scenarios-every-possible-seed-for-the-final-day-of-the-season"
  },
  {
    "text": "Nick Emmanwori Shines In Dominant Defensive Performance As Seahawks Top 49ers - Seattle Seahawks",
    "fullText": "After barely playing in Seattle’s Week 1 game against the 49ers, rookie safety Nick Emmanwori played a bit role in the Seahawks’ Week 18 win.",
    "link": "https://www.seahawks.com/news/nick-emmanwori-shines-in-dominant-defensive-performance-as-seahawks-top-49ers"
  },
  {
    "text": "In Photos: See 2026’s First Full Supermoon Rise Around The World - Forbes",
    "fullText": "The first full moon of 2026 — the wolf supermoon — rose after sunset on Saturday, Jan. 3, lighting up the night sky across the world. Here are the best photos.",
    "link": "https://www.forbes.com/sites/jamiecartereurope/2026/01/04/in-photos-see-2026s-first-full-supermoon-rise-around-the-world/"
  }
]