[
  {
    "text": "Buccaneers Make Changes to 2026 Coaching Staff - Tampa Bay Buccaneers",
    "fullText": "On Thursday, the Bucs parted ways with five assistant coaches, including Offensive Coordinator Josh Grizzard and Special Teams Coordinator Thomas McGaughey, while Tom Moore and Nick Rapone elected to retire",
    "link": "https://www.buccaneers.com/news/buccaneers-make-changes-2026-coaching-staff"
  },
  {
    "text": "French farmers force their way through Paris with tractors to protest free trade deal - abcnews.go.com",
    "fullText": "Dozens of angry farmers demonstrated in front of France’s lower house of parliament",
    "link": "https://abcnews.go.com/Business/wireStory/french-farmers-force-paris-tractors-protest-free-trade-129010284"
  },
  {
    "text": "Star Tribune identifies ICE agent who fatally shot woman in Minneapolis - Star Tribune",
    "fullText": "Jonathan Ross was dragged in a separate incident last year by a fleeing driver, according to court records.",
    "link": "https://www.startribune.com/ice-agent-who-fatally-shot-woman-in-minneapolis-is-identified/601560214"
  },
  {
    "text": "‘Cloud-9’ celestial object could solve dark matter mystery - CNN",
    "fullText": "A newly discovered celestial object may be a starless cloud that could change how astronomers understand dark matter.",
    "link": "https://www.cnn.com/2026/01/08/science/cloud-9-new-celestial-object"
  },
  {
    "text": "Stock Market Today: Dow Gains Steam; Defense Stocks Rally; Alphabet Tops Apple In Market Cap (Live Coverage) - Investor's Business Daily",
    "fullText": null,
    "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-jobless-claims-apple-appl-tesla-tsla/"
  },
  {
    "text": "DGA Awards Movie Nominees: Anderson, Coogler, Del Toro, Safdie And Zhao - Deadline",
    "fullText": "The Directors Guild of America revealed its feature film nominees Thursday for the 78th DGA Awards, honoring 2025's most outstanding helmers.",
    "link": "http://deadline.com/2026/01/directors-guild-awards-2026-movie-nominees-1236676457/"
  },
  {
    "text": "Gov. Wes Moore bill would let Maryland bypass federal vaccine schedule - The Washington Post",
    "fullText": "Maryland Gov. Wes Moore is proposing legislation that would decouple vaccine recommendations from federal guidance days after the Trump administration overhauled the childhood vaccine schedule.",
    "link": "https://www.washingtonpost.com/dc-md-va/2026/01/08/maryland-vaccine-bill-wes-moore/"
  },
  {
    "text": "Former Democratic House Majority Leader Steny Hoyer announces retirement after more than 40 years in Congress - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/former-democratic-house-majority-leader-steny-hoyer-announce/story?id\\\\u003d129006345"
  },
  {
    "text": "Bam Margera in Talks to Return for New 'Jackass' Movie - TMZ",
    "fullText": "So you're telling me there's a chance! Bam Margera is currently in negotiations to appear with the \"Jackass\" crew again for their just-announced upcoming movie, TMZ has learned.",
    "link": "https://www.tmz.com/2026/01/08/bam-margera-in-talks-return-new-jackass-movie/"
  },
  {
    "text": "Antarctica’s Oldest, Largest Iceberg Is Turning an Ominous Blue Color - Gizmodo",
    "fullText": "The iceberg could completely disintegrate within days or weeks, scientists say.",
    "link": "https://gizmodo.com/antarcticas-oldest-largest-iceberg-is-turning-an-ominous-blue-color-2000707527"
  },
  {
    "text": "Senate advances war powers resolution to rein in Trump on Venezuela - abcnews.go.com",
    "fullText": null,
    "link": "https://abcnews.go.com/Politics/senate-advances-war-powers-resolution-rein-trump-venezuela/story?id\\\\u003d129018473"
  },
  {
    "text": "Former GLP-1 users regain lost weight after about 18 months, study says - The Washington Post",
    "fullText": "Those quitting Ozempic, Wegovy and other drugs regained weight four times faster than those using just diet and exercise, still key components in weight maintenance.",
    "link": "https://www.washingtonpost.com/wellness/2026/01/08/ozempic-wegovy-weight-regain-glp1/"
  },
  {
    "text": "Switch 2 Sales Reportedly Struggled Over The Christmas Period - Nintendo Life",
    "fullText": "Nintendo hits its first hurdle",
    "link": "https://www.nintendolife.com/news/2026/01/switch-2-sales-reportedly-struggled-over-the-christmas-period"
  },
  {
    "text": "IRS announces first day of 2026 filing season; online tools and resources help with tax filing - IRS (.gov)",
    "fullText": "IR-2026-02, Jan. 8, 2026 — The Internal Revenue Service announced Monday, January 26, 2026, as the opening of the nation’s 2026 filing season. This year, several new tax law provisions of the One, Big, Beautiful Bill become effective, which could impact feder…",
    "link": "https://www.irs.gov/newsroom/irs-announces-first-day-of-2026-filing-season-online-tools-and-resources-help-with-tax-filing"
  },
  {
    "text": "‘The Pitt’ takes a deep breath and nails its second act - The Washington Post",
    "fullText": "Rather than compete with the high drama of the first season, the Emmy-winning medical series starring Noah Wyle refocuses on everyday crises.",
    "link": "https://www.washingtonpost.com/entertainment/tv/2026/01/08/the-pitt-season-two-review/"
  },
  {
    "text": "Why Trump is going after institutional homebuyers: They dominate markets like Atlanta, Jacksonville - CNBC",
    "fullText": "Trump's message may be aimed at places like Atlanta and Jacksonville, metropolitan areas  where investor ownership is more visible than elsewhere.",
    "link": "https://www.cnbc.com/2026/01/08/trump-goes-after-institutional-home-buyers-who-dominate-some-sun-belt-markets.html"
  },
  {
    "text": "Lebanon: Army says has taken over security in Hezbollah-dominated south - BBC",
    "fullText": "The army says it has met its goal of clearing the area of non-state weapons but Israel calls the move \"insufficient\".",
    "link": "https://www.bbc.com/news/articles/cj4ln977w0jo"
  },
  {
    "text": "Packers-Bears is NFL’s most storied rivalry, but why? - Green Bay Packers – packers.com",
    "fullText": "Turn back the clock six decades to grasp it",
    "link": "https://www.packers.com/news/packers-bears-is-nfl-s-most-storied-rivalry-but-why-jan-8-2026"
  },
  {
    "text": "Eric Schmidt will massively invest in private telescopes, including Hubble replacement - Ars Technica",
    "fullText": "“This is a very significant contribution to the astronomical community.\"",
    "link": "https://arstechnica.com/space/2026/01/eric-schmidt-will-massively-invest-in-private-telescopes-including-hubble-replacement/"
  }
]